{
  "article": {
    "id": 11457524666387,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/11457524666387.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/11457524666387.html",
    "author_id": 368027116814,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 2,
    "vote_count": 2,
    "section_id": 20418417028115,
    "created_at": "2022-11-21T22:06:56Z",
    "updated_at": "2025-03-11T18:00:57Z",
    "name": "Create a Clone Phishing Test",
    "title": "Create a Clone Phishing Test",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T18:00:57Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot",
      "clone phishing",
      "phishflip use case",
      "phisflip",
      "answerbot_phisher"
    ],
    "body": "<p>Clone phishing is a type of phishing attack where cybercriminals send a follow-up email to a legitimate email from a trusted sender. In the follow-up email, the cybercriminals claim that the sender forgot to include a link or attachment in the original email. However, the follow-up email isn’t from the original sender but is actually from a cybercriminal, and the link or attachment is malicious.</p>\n<p>To help your users learn about this type of attack, you can create a clone phishing test. You can use your PhishER platform and KSAT console together to mimic clone phishing attacks.</p>\n<h2 id='h_01HSBNN54XHT19F632XFQJJP31'>Create a Phishing Template with PhishER</h2>\n<p>We recommend creating a clone phishing template by using a real email that your users have reported. Using a real reported email can make the follow-up email seem more legitimate and can help your users understand how cybercriminals might use this type of attack.</p>\n<p>To create a phishing template with PhishER, follow the steps below:</p>\n<ol role='list'>\n<li>In your PhishER platform, navigate to the <strong>Inbox </strong>page.</li>\n<li>Select the check box next to the message you want to use to create your clone phishing template.\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> If you find an email that is in your email inbox but not in your PhishER Inbox, report the email using the Phish Alert Button (PAB) or send the EML file to one of your PhishER reporting addresses. The email will be sent to PhishER, where you will be able to use PhishFlip to create a phishing template.</div>\n</div>\n</li>\n<li>Click the <strong>Run</strong> drop-down menu at the top-left corner of the page.</li>\n<li>Select the <strong>Create KSAT Template</strong> option. This option will remove all the malicious links and attachments from the original template. Then, this template will be added to the <strong>PhishFlip</strong> category under the <strong>My Templates</strong> section in your KSAT console.\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>You can also create a KSAT template on the <strong>Message Details</strong> page or the <strong>Actions</strong> tab. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500005846941#PHISHER' target='_self'>How to Use PhishFlip</a> article.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/clonephishing/CreateKMSATTemplate.png'><img src='https://helpimg.s3.amazonaws.com/clonephishing/CreateKMSATTemplate.png' alt=' '></a></p>\n</li>\n</ol>\n<h2 id='h_01HSBNN54ZFAAGPXBJFDJ9JKWM'>Create a Clone Phishing Template with KSAT</h2>\n<p>Once you’ve created your PhishFlip template with PhishER, you will need to edit the template to include the follow-up message.</p>\n<p>To convert the template into a clone phishing template, follow the steps below:</p>\n<ol role='list'>\n<li>From your KSAT console, navigate to <strong>Phishing</strong> &gt; <strong>Email Templates</strong>.</li>\n<li>From <strong>My Templates</strong>, select the <strong>PhishFlip</strong> category.</li>\n<li>Click the name of the template you would like to convert into a clone phishing template.</li>\n<li>\n<p>In the text box, enter additional text above the original email to make the template look like a follow-up email. For example, you can include the name of the sender who originally replied, the time and date stamp, and a subject line to make it seem like you replied to the original email.</p>\n<strong>Original Email</strong> <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/clonephishing/OriginalEmail.png'><img src='https://helpimg.s3.amazonaws.com/clonephishing/OriginalEmail.png' alt=' '></a> <strong>Modified Email</strong><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/clonephishing/CloneEmail.png'><img src='https://helpimg.s3.amazonaws.com/clonephishing/CloneEmail.png' alt=' '></a>\n</li>\n<li>Add a link or an attachment to the template. This step will help you track whether your users would fall for this type of attack.</li>\n<li>We recommend adding <a href='https://support.knowbe4.com/hc/en-us/articles/115001904547#why' target='_self'>Social Engineering Indicators (SEIs)</a> to ensure your users understand what signs indicate a clone phishing attack. For more information on adding SEIs, see the <a href='https://support.knowbe4.com/hc/en-us/articles/115001904547#templateeditor' target='_self'>How Do I Add Red Flags to Templates?</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/115001904547' target='_self'>Social Engineering Indicators (SEIs) </a>article. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/clonephishing/AddRedFlag.gif'><img src='https://helpimg.s3.amazonaws.com/clonephishing/AddRedFlag.gif' alt=' '></a>\n</li>\n<li>Once you are satisfied with your template, click <strong>Save</strong>.</li>\n</ol>\n<p>For more information about editing a phishing template, see the <a href='https://support.knowbe4.com/hc/en-us/articles/204240768#CREATING_TEMPLATES' target='_self'>Creating and Editing Phishing Email Templates</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/204240768' target='_self'>How to Create and Edit Email Templates and Landing Pages</a> article.</p>\n<h2 id='h_01HSBNN54ZHY6WWF2WPMFTQ8FM'>Create a Clone Phishing Campaign with KSAT</h2>\n<p>Once you’ve created your clone phishing template, you’re ready to create a campaign to test your users.</p>\n<p>To create a clone phishing campaign, follow the steps below:</p>\n<ol role='list'>\n<li>From your KSAT console, navigate to the <strong>Phishing</strong> tab.</li>\n<li>Click <strong>+ Create Phishing Campaign</strong>.</li>\n<li>Enter a name for your campaign, such as “Clone Phishing Campaign”.</li>\n<li>Select the group of users you want to test or if you want to test all your users. We recommend sending this campaign to the users who received the original email.</li>\n<li>For <strong>Frequency</strong>, select <strong>One-time</strong>.</li>\n<li>Set the <strong>Start Time</strong> and <strong>Sending Period</strong> you would like to use.</li>\n<li>Under <strong>Template Categories</strong>, click the first drop-down menu and select the <strong>PhishFlip</strong> category. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/clonephishing/SelectTemplate.gif'><img src='https://helpimg.s3.amazonaws.com/clonephishing/SelectTemplate.gif' alt=' '></a>\n</li>\n<li>From the second drop-down menu, select the template you edited in the <a href='#h_01HSBNN54ZFAAGPXBJFDJ9JKWM'>section above</a>.</li>\n<li>Fill out the rest of the fields to customize your campaign.</li>\n<li>Click <strong>Create Campaign</strong>.</li>\n</ol>\n<p>Your users will receive a simulated clone phishing test once the campaign starts. You can then monitor the campaign results to see how vulnerable your users are to clone phishing attacks.</p>\n<p>For more information about creating a phishing campaign, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204239938' target='_self'>Creating and Managing Phishing Campaigns</a> article. For information on monitoring a phishing campaign, see our <a href='https://support.knowbe4.com/hc/en-us/articles/217841868' target='_self'>How to Monitor and Review Phishing Campaigns</a> article.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/11457524666387-Create-a-Clone-Phishing-Test"
  }
}