{
  "article": {
    "id": 115011714968,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115011714968.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115011714968.html",
    "author_id": 21027160967,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 4,
    "vote_sum": 3,
    "vote_count": 3,
    "section_id": 26428384978451,
    "created_at": "2017-08-14T15:20:23Z",
    "updated_at": "2025-06-10T15:19:03Z",
    "name": "Phishing Template Topic Glossary",
    "title": "Phishing Template Topic Glossary",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-06-10T15:19:03Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "phishing templates",
      "phishing template category glossary",
      "what category",
      "categories",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>We’ve added advanced features to phishing templates! All accounts will be opted in to phishing template advanced features in 2025. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955'>Phishing Templates Advanced Features Guide</a>.</div>\n</div>\n<p>Some phishing templates are available in multiple languages for better localization support. For more information on phishing template languages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513-Localization-Guide'>Localization Guide</a>.</p>\n<p>The glossary below will provide a description of what types of emails are in each phishing template topic.</p>\n<p class=''>JUMP TO:<a href='#h_01HVPPSKP68Z55VD3VCKXG5E8J'>A</a> - <a href='#h_01HVPPSQHYG6XZ2BXHPDVAP03N'>B</a> - <a href='#h_01HVPPSW29VJXV4309NVCF0YPW'>C</a> - <a href='#h_01HVPPT4GCGWEVH2P21R5434NS'>D</a> - <a href='#h_01HVPPT8CC5WABBYJG0DKG84T3'>E</a> - <a href='#h_01HVPPTBYHYJ573KHCSG9SQC1M'>F</a> - <a href='#h_01HVPPTFMPBTJ001RV6CQGZGSB'>G</a> - <a href='#h_01HVPPTKYT20Y0FF04QN5BTNDY'>H</a> - <a href='#h_01HVPPTZ6AQWNS30J895KZSQNZ'>I </a>- <a href='#h_01HVPPVCV9PYYA4W9SP64BYTS2'>L</a> - <a href='#h_01HVPPVHSE0F8GT3F26KT14MK4'>M</a> - <a href='#h_01HVPPVT52CW968BJNT704TXPD'>O</a> - <a href='#h_01HVPPVXV4DPMJ01YKA7X749JV'>P</a> - <a href='#h_01HVPPW28GS173ZM863MB8C1SV'>Q</a> - <a href='#h_01HVPPW5XZN53A5FDE28Q2XZKA'>R</a> - <a href='#h_01HVPPWAW3BD8GR2WV2M8EHPCC'>S</a> - <a href='#h_01HVPPWMN3JHCW8FJTN8EXXH9F'>T</a> - <a href='#h_01JXD6FMB7V1HGR2Q10TRKS65X'>W</a></p>\n<h3 id='h_01HVPPSKP68Z55VD3VCKXG5E8J' class=''><span class='wysiwyg-font-size-large'><strong>A</strong></span></h3>\n<p><strong>Account Notifications</strong></p>\n<p>This topic contains templates that claim to contain account notifications from various service providers. Many of the sender email domains for these templates spoof well-known organizations.</p>\n<p><strong>Attachments with Macros</strong></p>\n<p>Contains templates that have attachments with embedded macros. These often masquerade as invoices, resumes, or important business documents requiring immediate attention.</p>\n<h3 id='h_01HVPPSQHYG6XZ2BXHPDVAP03N' class=''><span class='wysiwyg-font-size-large'><strong>B</strong></span></h3>\n<p><strong>Banking</strong></p>\n<p>This topic contains templates impersonating popular banks and financial institutions. This topic also contains generic banking templates, such as transaction and confirmation activities. Many of the sender email domains for these templates spoof well-known organizations.</p>\n<p><strong>Baseline Templates</strong></p>\n<p>This topic is dedicated to revealing an accurate Phish-Prone Percentage of your organization when performing a <a href='https://support.knowbe4.com/hc/en-us/articles/115010347968-Best-Practices-Guide-Set-Up-a-Baseline-Test'>baseline Phishing Security Test</a>. These templates contain generic and organization-specific emails that could fool almost anyone. Subjects include anything from Internal IT emails spoofing your own domain to social media activity notifications.</p>\n<p><strong>Brand Knock-Offs</strong></p>\n<p>This topic contains phishing templates impersonating major brands, social media platforms, and retailers. The brand names are frequently misspelled, a major phishing red flag.</p>\n<p><strong>Business Communication</strong></p>\n<p>This is our largest phishing template topic category. This topic includes typical communications that employees might receive. Subjects of these emails include theoretical invoices, purchase orders, requests for information, shared files, and more. These templates typically don’t spoof companies and will come from a wide assortment of sender email domains.</p>\n<p><strong>Business Finance</strong></p>\n<p>This topic contains communications employees might receive regarding payments, payment information, bills, bank accounts, and invoices. These templates frequently try to trick users into thinking a bill is overdue or that they owe payment.</p>\n<h3 id='h_01HVPPSW29VJXV4309NVCF0YPW' class=''><span class='wysiwyg-font-size-large'><strong>C</strong></span></h3>\n<p><strong>CEO Fraud</strong></p>\n<p>This topic contains communications that appear to come from your organization’s CEO. The CEO may ask for a favor, payment, or a meeting. These emails spoof your own domain.</p>\n<p><strong>Compliance</strong></p>\n<p>This topic contains phishing templates that ask the user to perform a task to comply with organizational policies or rules. This topic can encompass signing work documents, finishing training, complying with IT updates, and more.</p>\n<p><strong>Controversial</strong></p>\n<p>This topic contains controversial content that might be considered offensive or inappropriate to some organizations, but others may find these templates appropriate and helpful to use in an aggressive simulated phishing campaign.</p>\n<p><strong>Current Event of the Month</strong></p>\n<p>This topic will contain a single Current Event or Holiday template, hand-selected by the Content team each month to ensure that you're getting a high-quality, timely, and relevant template. Review the Current Events and Holiday template topic descriptions to understand the types of templates that may be selected for this topic.</p>\n<p>For more information about this topic, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360022903314-Current-Event-of-the-Week-or-Month-Template-Topics-Overview'>Current Event of the Week or Month Template Topics Overview</a> article.</p>\n<p><strong>Current Event of the Week</strong></p>\n<p>This topic will contain a single Current Event or Holiday template, hand-selected by the Content team each week to ensure that you're getting a high-quality, timely, and relevant template. See the Current Events and Holiday template topic descriptions to understand the types of templates that may be selected for this topic.</p>\n<p>For more information about this topic, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360022903314-Current-Event-of-the-Week-or-Month-Template-Topics-Overview'>Current Event of the Week or Month Template Topics Overview</a> article.</p>\n<p><strong>Current Events</strong></p>\n<p>This topic contains a variety of templates appropriate for current events, news, matters, and occasions. Templates include anything from national headline alerts, both real and fake, spoofing major news channels, popular app downloads, or shopping discounts and coupons.</p>\n<p><strong>Current Holiday</strong></p>\n<p>This topic contains emails that impersonate retailers with holiday sales and deals. They frequently contain links to shopping discounts and coupons.</p>\n<p><strong>Cybersecurity Awareness Month</strong></p>\n<p>We create four phishing templates for each Cybersecurity Awareness Month in October. Each phishing template is an example of a common cybersecurity threat, such as social engineering and malicious URLs. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4405521758355-Engage-Users-During-Cybersecurity-Awareness-Month'>Engage Users During Cybersecurity Awareness Month</a> article.</p>\n<h3 id='h_01HVPPT4GCGWEVH2P21R5434NS' class=''><span class='wysiwyg-font-size-large'><strong>D</strong></span></h3>\n<p><strong>Data Breach</strong></p>\n<p>This topic allows you to spear-phish users who have been part of specific data breaches. Each template spoofs a unique organization that has had a large-scale data breach incident.</p>\n<p>Each template includes a corresponding data entry landing page. So, you can test your users' susceptibility to clicking a link and their proneness to entering sensitive information.</p>\n<p>This topic is intended to be used with <a href='https://support.knowbe4.com/hc/en-us/articles/210465178-Email-Exposure-Check-Pro-EEC-Pro-Product-Manual'>Email Exposure Check Pro (EEC Pro)</a>, but it can be used in any type of phishing campaign.</p>\n<p>For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360001445487-Data-Breach-Topic-Guide'>Data Breach Topic Guide</a>.</p>\n<p><strong>Data Privacy</strong></p>\n<p>This topic includes templates that impersonate major technology platforms, alerting users of privacy issues in their accounts. Some examples include alerting users that they’ve shared personal information, their security settings have changed, or that there’s suspicious activity in their accounts.</p>\n<h3 id='h_01HVPPT8CC5WABBYJG0DKG84T3' class=''><span><span class='wysiwyg-font-size-large'><strong>E</strong></span></span></h3>\n<p><strong>Education</strong></p>\n<p>This topic includes education-related templates involving college and graduate matters, high school news alerts, teacher incentives, pay raises, and student loan information. The majority of these templates apply to anyone working or involved in the education industry.</p>\n<p><strong>Email Security</strong></p>\n<p>This topic includes templates that alert users that their email account settings have been compromised or changed.</p>\n<p><strong>Entertainment</strong></p>\n<p>This topic includes templates that alert users about entertainment-related events, celebrities, places, and platforms.</p>\n<p><strong>Events</strong></p>\n<p>This topic includes templates that alert users about events that can be work- and entertainment-related.</p>\n<h3 id='h_01HVPPTBYHYJ573KHCSG9SQC1M' class=''>\n<span></span><span class='wysiwyg-font-size-large'><strong>F</strong></span>\n</h3>\n<p><strong>Financial Services</strong></p>\n<p>This topic includes templates concerning the status of finances. Examples include bank account notifications, cryptocurrency notifications, and emails spoofing well-known financial institutions.</p>\n<h3 id='h_01HVPPTFMPBTJ001RV6CQGZGSB' class=''><span class='wysiwyg-font-size-large'><strong>G</strong></span></h3>\n<p><strong>Government</strong></p>\n<p>This topic contains templates spoofing state, local, and federal governments, regarding issues such as speeding tickets, court summons, jury duty, and criminal activity notifications. The sender email addresses in these templates spoof government domains.</p>\n<h3 id='h_01HVPPTKYT20Y0FF04QN5BTNDY' class=''><span class='wysiwyg-font-size-large'><strong>H</strong></span></h3>\n<p><strong>Healthcare</strong></p>\n<p>This topic includes healthcare-related templates involving insurance and coverage matters, medical files, medical bills, and appointment reminders. The majority of these templates apply to anyone with health insurance.</p>\n<p><strong>Holidays &amp; Celebrations</strong></p>\n<p>This topic contains templates relevant to any upcoming holidays. Examples include coupons for Christmas shopping, sales for President’s Day, and real or fake news stories in relation to specific holidays.</p>\n<p><strong>Human Resources</strong></p>\n<p>This topic consists of categories typically handled by Human Resources departments.</p>\n<h3 id='h_01HVPPTZ6AQWNS30J895KZSQNZ' class=''><span class='wysiwyg-font-size-large'><strong>I</strong></span></h3>\n<p><strong>IT</strong></p>\n<p>This topic contains various Information Technology-themed subjects, including email account matters, antivirus notifications, and security matters. Many of the sender email addresses for these templates spoof well-known IT organizations, and there are some sender email addresses that spoof your own domain.</p>\n<p><strong>Information &amp; Reading</strong></p>\n<p>This topic contains various information-related subjects, such as documents that the user must read and review.</p>\n<p><strong>Internet Use</strong></p>\n<p>This topic contains a variety of phishing emails related to well-known websites, including those related to retail, entertainment, and business organizations.</p>\n<h3 id='h_01HVPPVCV9PYYA4W9SP64BYTS2' class=''><span class='wysiwyg-font-size-large'><strong>L</strong></span></h3>\n<p><strong>Legal</strong></p>\n<p>This topic was created for those in the law or legal industry, and many of the available templates contain legal language.</p>\n<h3 id='h_01HVPPVHSE0F8GT3F26KT14MK4' class=''><span class='wysiwyg-font-size-large'><strong>M</strong></span></h3>\n<p><strong>Mail Notifications/Server Messages</strong></p>\n<p>This topic contains automated messages that users would normally receive from their mail client. The template content typically references mailbox storage, bounced or pending email alerts, and required system updates.</p>\n<p><strong>Mobile Apps</strong></p>\n<p>This topic includes phishing emails related to mobile apps. Examples include app updates, policy updates, and invitations to join apps.</p>\n<p><strong>Mobile Devices</strong></p>\n<p>This topic includes phishing emails related to mobile devices and several mobile apps. Examples include upgrades to mobile devices, software updates, and app updates. There’s some overlap with the <strong>Mobile Apps</strong> topic.</p>\n<h3 id='h_01HVPPVT52CW968BJNT704TXPD' class=''><span class='wysiwyg-font-size-large'><strong>O</strong></span></h3>\n<p><strong>Online Services</strong></p>\n<p>This topic contains emails from various well-known online services, including shopping, entertainment, apps, financial, and security services. The majority of the sender email addresses in these templates include spoofed domains of very popular websites and applications that your users will recognize.</p>\n<p><strong>Outdoor/Sporting Goods</strong></p>\n<p>This topic includes templates replicating emails from well-known outdoor/sporting goods distributors. The emails in this topic contain announcements of store sales and coupons from popular manufacturers.</p>\n<h3 id='h_01HVPPVXV4DPMJ01YKA7X749JV' class=''><span class='wysiwyg-font-size-large'><strong>P</strong></span></h3>\n<p><strong>Passwords &amp; Authentication</strong></p>\n<p>This topic includes templates impersonating brands that request authentication or resetting passwords and login information. The emails attempt to get the user to click on a link to view account information, log in to a service, or reset their login information.</p>\n<p><strong>Phish Alert Button Test</strong></p>\n<p>This topic includes one email asking users to test the <strong>Phish Alert Button’s (PAB)</strong> functionality. For more information regarding this email and its purpose, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/21931353962131-Phish-Alert-Button-PAB-Test-Email-Overview'>Phish Alert Button (PAB) Test Email Overview</a> article.</p>\n<p><strong>Phishing for Sensitive Information</strong></p>\n<p>Templates in this topic have Phishing for Sensitive Information landing pages assigned to them. If users click on any links in these Phishing Security Test emails, they will be redirected to a landing page with a form asking them to enter sensitive data. If the user does enter data, a failure for this action will be recorded in the system.</p>\n<p>For more details on Phishing for Sensitive Information, email templates, and landing pages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204446387-Data-Entry-Landing-Pages-Guide'>Data Entry Landing Pages Guide</a>.</p>\n<p><strong>Phone Services</strong></p>\n<p>This topic includes emails impersonating phone services, both mobile and landline. Example emails include invoices, phone upgrades, voicemails, call services, and more.</p>\n<h3 id='h_01HVPPW28GS173ZM863MB8C1SV' class=''><span class='wysiwyg-font-size-large'><strong>Q</strong></span></h3>\n<p><strong>QR Code</strong></p>\n<p>This topic contains templates with a QR code as the Phishing Security Test attack vector. A QR code redirects users to a website or attachment. For more information about QR code phishing, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5477041619603-QR-Code-Phishing-Security-Tests-PSTs-Guide'>QR Code Phishing Security Tests (PSTs) Guide</a>.</p>\n<h3 id='h_01HVPPW5XZN53A5FDE28Q2XZKA' class=''><span class='wysiwyg-font-size-large'><strong>R</strong></span></h3>\n<p><strong>Real Estate</strong></p>\n<p>This topic contains templates specific to email exchanges found in the real estate industry, such as buyer closing documents and loan information.</p>\n<p><strong>Reply-To</strong></p>\n<p>The emails in this topic of templates don’t contain any links or attachments and will only test the user on whether or not they’ll reply to a phishing email. You can enable the console to track replies to Phishing Security Test emails when you set up your phishing campaign. If you enable this feature and your user replies to any of the Phishing Security Test emails, this will be recorded as a failure in the console.</p>\n<p>For more on reply-to phishing, see our <a href='https://support.knowbe4.com/hc/en-us/articles/234956728-Reply-To-Phishing-Guide'>Reply-To Phishing Guide</a>.</p>\n<p><strong>Reported Phishes of the Week</strong></p>\n<p>This topic consists of the top ten phishing emails reported to us by users of the Phish Alert Button. This topic contains ten new emails every week. The sender domains vary in this topic and include, but are not limited to, those that spoof popular companies and those that spoof your own organization's domain.</p>\n<p>For more information about the Reported Phishes of the Week, see our <a href='https://support.knowbe4.com/hc/en-us/articles/227803307-Reported-Phishes-of-the-Week-Topic-Overview'>Reported Phishes of the Week Topic Overview</a> article.</p>\n<h3 id='h_01HVPPWAW3BD8GR2WV2M8EHPCC' class=''><span class='wysiwyg-font-size-large'><strong>S</strong></span></h3>\n<p><strong>Seasonal</strong></p>\n<p>This template topic includes phishing emails related to deals, days, events, and scenarios that take place at certain times of the year.</p>\n<p><strong>Shipments &amp; Deliveries</strong></p>\n<p>This topic includes templates impersonating retailers and shipping companies that claim the user has incoming deliveries and shipments, has missed deliveries, or has a package that can’t be delivered.</p>\n<p><strong>Shopping &amp; Food</strong></p>\n<p>This topic includes templates related to retailers, encompassing shopping and food services.</p>\n<p><strong>Social Media</strong></p>\n<p>This topic consists of templates for spoofing all types of social media sites and applications. The templates include subjects such as invites to join, confirmation of your account, resetting your password, and notifying you of new messages you’ve received.</p>\n<p><strong>Sports</strong></p>\n<p>This topic includes templates related to sports, exercise, and gaming.</p>\n<h3 id='h_01HVPPWMN3JHCW8FJTN8EXXH9F' class=''><span class='wysiwyg-font-size-large'><strong>T</strong></span></h3>\n<p><strong>Travel &amp; Transportation</strong></p>\n<p>This topic includes templates related to impersonating travel websites, air travel services, rideshare websites, major car brands, major hotel chains, and more.</p>\n<h3 id='h_01JXD6FMB7V1HGR2Q10TRKS65X'>W</h3>\n<p><strong>WiFi</strong></p>\n<p>This topic includes templates related to Wi-Fi services and access.</p>\n<div id='popupover_portal'></div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/115011714968-Phishing-Template-Topic-Glossary"
  }
}