{
  "article": {
    "id": 115009454228,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115009454228.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115009454228.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 5,
    "vote_sum": 278,
    "vote_count": 470,
    "section_id": 27889964583699,
    "created_at": "2017-06-22T20:31:33Z",
    "updated_at": "2025-11-25T18:18:18Z",
    "name": "KnowBe4 Security Awareness Training (KSAT) Change Log",
    "title": "KnowBe4 Security Awareness Training (KSAT) Change Log",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-25T18:18:18Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "release notes",
      "bug fixes",
      "bugs",
      "updates",
      "change",
      "change log",
      "console",
      "changes",
      "update log",
      "changelog",
      "fresh content",
      "new content"
    ],
    "body": "<p>Use this article to stay up-to-date with changes to the KnowBe4 console.</p>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>Changes may include new, updated, deprecated, or removed features. KnowBe4 reserves the right to terminate access to, use of, and support of features that are included as part of the Subscription Services, which is common with SaaS services, as they are constantly changing and improving. This allows us to adapt to the evolving cybersecurity industry so we can provide current, high-quality services.</div>\n</div>\n<p>See the table below for a list of updates, with the latest updates displayed at the top.</p>\n<div class='js-tabs'>\n<div title='2025 Log'>\n<table style='table-layout: auto; height: 4970px;'>\n<thead>\n<tr style='height: 44px;'>\n<th style='height: 44px; width: 89.4688px;'>Release Date</th>\n<th style='height: 44px; width: 603.531px;'>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style='width: 81.4688px;'>November 2025</td>\n<td style='width: 595.531px;'>\n<ul>\n<li>November 25, 2025 - We’ve added an Asana on CloudEagle integration for the KSAT console. Integrating these apps allows you to access detailed information about organizations, view user lists, manage user accounts, and monitor accurate usage of the Asana platform through user login activity. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46832111065491-Integrate-Asana-on-CloudEagle-into-Your-KSAT-Console'>Integrate Asana on CloudEagle into Your KSAT Console</a> article.</li>\n<li>November 24, 2025 - We’re excited to announce the release of our new navigation menu, enhanced login page, and updated KnowBe4 logo! These updates will be rolled out by region, on the following schedule:<br>Nov 24, 2025: DE <br>Nov 25, 2025: UK <br>Nov 26, 2025: CA<br>For additional information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46612807962771-Login-Page-and-Navigation-Menu-Overview'>Login Page and Navigation Menu Overview</a> article.</li>\n<li>November 19, 2025 - We’ve added a Workato integration for the KSAT console. This integration allows you to utilize Workbots for conversational process automation, allowing users to initiate KnowBe4 actions, view statuses, or receive context-aware notifications directly within Slack or Microsoft Teams. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46512157558163-Integrate-Workato-into-Your-KSAT-Console'>Integrate Workato into Your KSAT Console</a> article.</li>\n<li>November 18, 2025 - We’ve added a Make integration for the KSAT console. This integration allows you to design and deploy event-driven, real-time automations that respond instantly to user actions, such as failed phishing tests or course completions. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46507657561875-Integrate-Make-into-Your-KSAT-Console'>Integrate Make into Your KSAT Console</a> article.</li>\n<li>November 18, 2025 - We’ve added a Tray integration for the KSAT console. This integration allows you to create highly customizable and easy-to-build workflows, enabling deep integrations with niche, proprietary, or highly customized internal security tools. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46510752989331-Integrate-Tray-into-Your-KSAT-Console'>Integrate Tray into Your KSAT Console</a> article.</li>\n<li>November 17, 2025 - We’ve added an Anzenna integration to the KSAT console. This integration allows you to send Phishing Security Test (PST) data to Anzenna for additional security recommendations. For more information, see Anzenna’s <a href='https://app.tango.us/app/workflow/Onboarding-Anzenna--Connecting-KnowBe4-6b5d63eeddcc4537af3c02a32a4bdbc5'>Onboarding Anzenna: Connecting KnowBe4</a> article.</li>\n<li>Nov 13, 2025 - We’ve united our creative teams under a single brand: KnowBe4 Studios. Moving forward, you’ll find new ModStore content released under this name. <a href='https://www.knowbe4.com/press/introducing-knowbe4-studios-to-spotlight-industry-leading-training'>Read more about the KnowBe4 Studios launch</a>.</li>\n<li>November 12, 2025 - We’ve removed the <strong>Risk Score</strong> option from the <strong>User Field</strong> drop-down menu in our Smart Groups feature. Smart Groups using this option will be automatically migrated to our new SmartRisk Agent criteria. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/8355402984851-Smart-Groups-Glossary-of-Criteria-Types#01K5HFK33NQ26MT5VBK63FHG04'>SmartRisk Agent™ Criteria</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/8355402984851'>Smart Groups Glossary of Criteria Types</a> article.</li>\n<li>November 12, 2025 - We’ve added a new <strong>Critical Alerts</strong> setting for the KnowBe4 platform! This setting allows you to subscribe to receive critical and time-sensitive notifications for your KnowBe4 platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46417308055443'>KnowBe4 Platform Notifications</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 298px;'>\n<td style='height: 298px; width: 81.4688px;'>October 2025</td>\n<td style='height: 298px; width: 595.531px;'>\n<ul>\n<li>October 30, 2025 - We've added <strong>SmartRisk Agent™</strong> criteria to Smart Groups functionality, so admins can set specific Risk Score values using more operators for Risk Score and select from seven security type categories. Admins can also apply optional time frames for change-based comparisons. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/8355402984851-Smart-Groups-Glossary-of-Criteria-Types'>Smart Groups Glossary of Criteria Types</a>.</li>\n<li>October 10, 2025 - We’ve released a new <strong>Organization Chart</strong> filter for our <strong>Phishing Activity Reports</strong>, <strong>Training Activity Reports</strong>, and our<strong> Manager Risk Score Report</strong>! This filter allows you to view data for selected managers and their direct and indirect reports. For more information, see the articles below:\n<ul>\n<li>\n<p><a href='https://support.knowbe4.com/hc/en-us/articles/4561035154451'>Customize and View Phishing Activity Reports</a></p>\n</li>\n<li>\n<p><a href='https://support.knowbe4.com/hc/en-us/articles/4417261034259'>Customize and View Training Activity Reports</a></p>\n</li>\n<li>\n<p><a href='https://support.knowbe4.com/hc/en-us/articles/30048977242259'>SmartRisk Agent™ and Risk Score Guide</a></p>\n</li>\n</ul>\n</li>\n<li>October 8, 2025 - We now offer two download options for SCORM content that is available in multiple languages. You can download the full SCORM package for each language or a remote-hosted file that contains links to all available language versions on KnowBe4's servers. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115005865228-Download-Files-from-Your-KnowBe4-Account'>Download Files from Your KnowBe4 Account</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 223px;'>\n<td style='height: 223px; width: 81.4688px;'>September 2025</td>\n<td style='height: 223px; width: 595.531px;'>\n<ul>\n<li>September 5, 2025 - We’ve added a Cornerstone OnDemand (CSOD) integration to the KSAT console. This integration allows admins to assign KnowBe4 content to learners, who will interact with it directly through the Cornerstone Learning platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/42095034171923-Cornerstone-Guide'>Cornerstone Guide</a>.</li>\n<li>September 2, 2025 - We’ve added a Sprinto integration to the KSAT console. This integration allows you to automatically update training completion statuses based on real-time campaign data, which reduces manual effort and ensures you have audit-ready evidence. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/44246673017491-Integrate-Sprinto-with-Your-KSAT-Console'>Integrate Sprinto with Your KSAT Console</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 201px;'>\n<td style='height: 201px; width: 81.4688px;'>August 2025</td>\n<td style='height: 201px; width: 595.531px;'>\n<ul>\n<li>August 13, 2025 - We’ve released a new Security Role for the <a href='https://support.knowbe4.com/hc/en-us/articles/37153516648851'>KnowBe4 Academy</a>! Now, users who have the KnowBe4 Academy Security Role can access to the academy. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767'>Security Roles Guide</a>.</li>\n<li>August 13, 2025 - We’ve added a Seemplicity integration to the KSAT console. The Seemplicity platform is a Remediation Operations (RemOps) platform that accelerates risk reduction and streamlines security compliance workflows. Integrating with KSAT allows you to receive findings about training completion status via the Seemplicity platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/43819663383187-Integrate-Seemplicity-with-Your-KSAT-Console'>Integrate Seemplicity with Your KSAT Console</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 738px;'>\n<td style='height: 738px; width: 81.4688px;'>July 2025</td>\n<td style='height: 738px; width: 595.531px;'>\n<ul>\n<li>July 31, 2025 - We’ve added a Cisco Duo integration to the KSAT console. This integration allows you to sync and manage your Cisco Duo users within the KSAT console through SCIM. For more information, see the <a href='https://duo.com/docs/automated-provisioning#configure-automated-provisioning'>Configure Automated Provisioning</a> article from Duo and our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374-SCIM-Configuration-Guide'>SCIM Integration Guide</a>.</li>\n<li>July 29, 2025 - We’ve added key metrics templates in the <strong>Text Block</strong> widget to our executive reports feature! Now, you can include automated templates showcasing your organization’s key performance indicators in your executive reports. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355-Executive-Reports-Overview#h_01HHJ4ZT1PFKMYKAX32DY463JE'>Executive Reports Widgets</a> section on our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355-Executive-Reports-Overview'>Executive Reports Overview</a>.</li>\n<li>July 29, 2025 - We've updated the audit log to include more options for the <strong>Timeframe</strong> field and added a toggle button to include API events only in your filter. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/23542330166163-KnowBe4-Audit-Log-Overview'>Audit Log Overview</a> article.</li>\n<li>July 28, 2025 - We've enhanced the <strong>Managed ModStore</strong> with custom content upload capabilities. You can access the new <strong>Uploaded Content</strong> subtab to add your own materials to use in any of your chosen managed accounts. Once uploaded, you can use custom content the same way that you use any ModStore content. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/42663985576339'>Partner and Multi-Account: Upload Custom Training Content</a> article.</li>\n<li>July 21, 2025—We’ve updated our PasswordIQ client! Now, if LDAP is not available, PasswordIQ uses the third RPC protocol as backup. We’ve also improved the way PasswordIQ reads Active Directory Domain Controller group policies. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4406004172435'>PasswordIQ Product Manual</a>.</li>\n<li>July 10, 2025 - We’ve streamlined user messaging. Creating a message is a single, viewable, and editable form. Templates include current and past custom messages, Scam of the Week (SotW), and Security Hints and Tips (SH&amp;T). Scheduling has been expanded with an updated date picker and granular selection of templates. Users can schedule and plan messages for upcoming events, such as Cybersecurity Awareness Month, and recurring message campaigns. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4416416555155-User-Messaging-Guide'>User Messaging Guide</a>.</li>\n<li>July 9, 2025 - AI translations are now available on the KnowBe4 Community! Now, you can use the Translate drop-down menu to translate posts and replies into your preferred language. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/15480944821395-KnowBe4-Community-Guide#h_01HBGGM2MB2SM6JXC1D6EK98XT'>Interacting with Posts</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/15480944821395-KnowBe4-Community-Guide'>KnowBe4 Community Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 447px;'>\n<td style='height: 447px; width: 81.4688px;'>June 2025</td>\n<td style='height: 447px; width: 595.531px;'>\n<ul>\n<li>June 30, 2025 - We’ve added a new free tool, the KnowBe4 Program Maturity Assessment (PMA)! The PMA gives you quick insight into what level your organization ranks regarding its security culture and risk awareness. This assessment evaluates your organization across 40 maturity indicators in ten critical dimensions of human risk management and gives it a level one through five. Once your results have been calculated, you can download a full PMA report with an action plan customized for your organization. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/42061388521875-Program-Maturity-Assessment-PMA-Overview'>Program Maturity Assessment (PMA) Overview</a> article.</li>\n<li>June 20, 2025 - We’ve added the <strong>Audiocast</strong> option to the <strong>Content Types</strong> drop-down menu in the Learner Experience (LX) <strong>Library</strong> tab. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500002656002'>Optional Learning Guide</a>.</li>\n<li>June 19, 2025 - We have updated the KSAT <strong>Phishing</strong> tab user interface to Svelte! This update changes the appearance of the <strong>Phishing</strong> tab, reducing the amount of space on the sides of users' screens.</li>\n<li>June 13, 2025 - We have changed how our PDF attachments work. We've discontinued using JavaScript beacons in PDF attachments because Microsoft Defender and potentially other security tools were blocking them. Instead, opens are recorded when users click on links embedded within the PDF documents. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115007228048-Phishing-Campaign-Attachments-Overview'>Phishing Campaign Attachments Overview</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 313px;'>\n<td style='height: 313px; width: 81.4688px;'>May 2025</td>\n<td style='height: 313px; width: 595.531px;'>\n<ul>\n<li>May 29, 2025 - We've added a new <strong>Risk Score Activity</strong> report to our <strong>Risk Score v2 Reports</strong>! This report allows you to view your overall Risk Score activity. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/40362167614611-Customize-and-View-Risk-Score-Activity-Report'>Customize and View Your Risk Score Activity Report</a> article.</li>\n<li>May 20, 2025 - We've added an <strong>Enable Standardized CSVs</strong> toggle in the <strong>Reports</strong> section of our <strong>Partner Account Settings</strong>. For more information and for a list of available reports and CSV files, see the <a href='https://support.knowbe4.com/hc/en-us/articles/34738838417555-KnowBe4-Console-Account-Settings-Reports#h_01JH0GH2KJR9KJGKEWBN1DPCAP'>Date Format on CSVs</a> section in our <a href='https://support.knowbe4.com/hc/en-us/articles/34738838417555'>KnowBe4 Console Account Settings: Reports</a> article.</li>\n<li>May 1, 2025 - We've enhanced our Industry Benchmark Data by updating Organization Size and Program Age (formerly called Program Maturity) values. The Large organization size has been updated to 1,000-9,999 users. We've added a Very Large organization size for organizations with 10,000+ users, and added program ages of 2 Years and 3 Years. For more information, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628'>Industry Benchmarking Overview</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 514px;'>\n<td style='height: 514px; width: 81.4688px;'>April 2025</td>\n<td style='height: 514px; width: 595.531px;'>\n<ul>\n<li>April 30, 2025 - We've released the ENGAIZ ComplySec360™ integration to the KSAT console. ComplySec360™ is an information and security compliance platform that helps startups and small and medium enterprises improve their risk posture and helps with continued compliance with SOC 2, ISO 27001, GDPR, HIPAA, and more. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/40807972628755-Integrate-ENGAIZ-ComplySec360-with-Your-KSAT-Console'>Integrate ENGAIZ ComplySec360™ with Your KSAT Console</a> article in our Knowledge Base.</li>\n<li>April 16, 2025 - We've included additional region-specific phishing languages when you create a phishing campaign for better localization support. For more information, please see our <a href='https://support.knowbe4.com/hc/en-us/articles/204239938-Create-and-Manage-Phishing-Campaigns'>Create and Manage Phishing Campaigns</a> article.</li>\n<li>April 7, 2025 - We've launched the KnowBe4 Academy! Now, you can learn how to use and integrate KnowBe4's products successfully. The following modules are now available:\n<ul>\n<li>PhishER 101</li>\n<li>KSAT 101</li>\n<li>Free Tools 101</li>\n<li>KnowBe4 101</li>\n</ul>\n</li>\n<li>For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/37153516648851'>KnowBe4 Academy Guide</a>.</li>\n<li>April 2, 2025 - Scam of the Week messages are now available in 34 languages for better localization support. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226314167-Scam-of-the-Week-Newsletter-Overview'>Scam of the Week Newsletter Overview</a>.</li>\n<li>April 2, 2025 - We've added the ability to set a default Phish Alert Button (PAB) in your account settings. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 895px;'>\n<td style='height: 895px; width: 81.4688px;'>March 2025</td>\n<td style='height: 895px; width: 595.531px;'>\n<ul>\n<li>March 31, 2025 - We've added a new <a href='https://developer.knowbe4.com/graphql/passwordiq/page/Introduction'>PasswordIQ Graph API</a>. Now, you can use GraphQL to call and interact with your PasswordIQ data. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4404258222099'>KnowBe4 Graph API Overview</a>.</li>\n<li>March 31, 2025 - We've added a new <a href='https://developer.knowbe4.com/graphql/securitycoach'>Graph API for SecurityCoach</a>! Now, you can use GraphQL to call and interact with your SecurityCoach data. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4404258222099-KnowBe4-Graph-API-Overview'>KnowBe4 Graph API Overview</a> article.</li>\n<li>March 26, 2025 - We've released a new Organization Chart filter for our executive reports! This filter allows you to view data for selected managers and their direct and indirect reports. With this filter, you can also search by specific job titles. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355'>Executive Reports Overview</a>.</li>\n<li>March 26, 2025 - We've added new phishing topic menus to the <strong>Phishing Templates</strong> subtab! Now, you can quickly view and organize your phishing templates by topic using the <strong>My Topics</strong> and <strong>System Topics</strong> sidebar menus. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955-Phishing-Templates-Advanced-Features-Guide'>Phishing Templates Advanced Features Guide</a>.</li>\n<li>March 24, 2025 - We've added some new features to improve your managed executive reporting, including a new PAB (Phish Alert Button) Activities widget, a new trend line, and the ability to download executive report widgets. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/27325335564563'>Partner and Multi-Account: Executive Reports Overview</a>.</li>\n<li>March 24, 2025 - We've added a new PAB (Phish Alert button) Activities widget to our Executive Reports subtab! Now, you can include detailed information about how your organization uses the PAB in your executive report. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355-Executive-Reports-Overview#h_01HHJ4ZT1PFKMYKAX32DY463JE'>Executive Reports Widgets</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355'>Executive Reports Overview</a> article.</li>\n<li>March 24, 2025 - We've added new features to improve your executive reporting, including a new linear trend line, downloadable executive report widgets, and the ability to search by executive report name. Also, executive reports will now be sorted by newest created with the report owner displayed in the search results. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355'>Executive Reports Overview</a> article.</li>\n<li>March 20, 2025 - We've released Red Vector's Fulcrum integration to the KSAT console. Fulcrum is an intelligence platform designed to enhance insider risk management. Integrating Fulcrum with KSAT can help you identify possible workplace threats earlier by performing risk analysis. This integration also allows you to assign training campaigns to reduce workplace risks. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/39568659128083-Integrate-Red-Vector-s-Fulcrum-with-Your-KSAT-Console'>Integrate Red Vector's Fulcrum with Your KSAT Console</a> article in our Knowledge Base.</li>\n<li>March 12, 2025 - We've updated Second Chance to version 2.0.16! This version supports Second Chance functionality in Microsoft's new Outlook for Windows.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 559px;'>\n<td style='height: 559px; width: 81.4688px;'>February 2025</td>\n<td style='height: 559px; width: 595.531px;'>\n<ul>\n<li>February 28, 2025 - Admins can now download completion certificates in bulk from the Users subtab of a training campaign. This option creates a .zip file containing certificates for selected users in .pdf format. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360053311074-User-Management-in-Training-Campaigns'>User Management in Training Campaigns</a> article.</li>\n<li>February 27, 2025 - We updated the Not Opened outcome to No Action on the <strong>Phishing Test Results</strong> filter in our executive reports. For more information on executive reporting, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355'>Executive Reports Overview</a>.</li>\n<li>February 24, 2025 - Gradient MSP released an integration to the KSAT console. This integration enables partners to synchronize the latest active user counts from their KnowBe4 customer accounts, ensuring accurate billing based on the actual number of active users rather than the originally ordered seat count. For more information, see Gradient's <a href='https://support.meetgradient.com/knowbe4-security-awareness-training-ksat'>Overview and Configuration Guide: Integrating KnowBe4 KSAT with Gradient</a> article.</li>\n<li>February 18, 2025 - We've released a Tidal Cyber integration to the KSAT console. This integration allows you to efficiently assess, organize, and optimize your cyber defenses based on a deep understanding of the threats and adversaries that are most relevant to you. Phishing Security Test (PST) activity can also be integrated into your Tidal Cyber platform. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/38651027541395-Integrate-Tidal-Cyber-into-Your-KSAT-Console'>Integrate Tidal Cyber into Your KSAT Console</a> article in our Knowledge Base.</li>\n<li>February 6, 2025 - We've updated PasswordIQ to version 1.0.24! In this version, we updated the software license agreement and fixed a bug that prevented PIQ from connecting to the domain controller during scans. As a result of improvements, the minimum RAM for installation has increased to 4 GB. For more information, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/4406004172435'>PasswordIQ Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr style='height: 738px;'>\n<td style='height: 738px; width: 81.4688px;'>January 2025</td>\n<td style='height: 738px; width: 595.531px;'>\n<ul>\n<li>January 30, 2025 - Hiding a phishing campaign from your reports now applies to Risk Score v2. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000440548'>Hide a Phishing Campaign from Reports</a> article.</li>\n<li>January 27, 2025 - We've released a CYE Hyver integration to the KSAT console. This integration allows you to create findings based on data from phishing simulation outcomes and compliance gaps discovered during KnowBe4's security awareness training in your organization. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/37610912923923-Integrate-CYE-s-Hyver-with-Your-KSAT-Console'>Integrate CYE's Hyver with Your KSAT Console</a> article in our Knowledge Base.</li>\n<li>January 10, 2025 - We've released a Mirage integration to the KSAT console. This integration allows you to sync Mirage simulation events directly into your KSAT console for reporting, training, and targeting purposes. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/37195269982995-Integrate-Mirage-with-Your-KSAT-Console'>Integrate Mirage with Your KSAT Console</a> article in our Knowledge Base.</li>\n<li>January 7, 2025 - We've added the option to select specific template languages when creating a phishing campaign. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204239938'>Create and Manage Phishing Campaigns</a> article.</li>\n<li>January 7, 2025 - We've added an <strong>Enable Standardized CSVs</strong> toggle in the <strong>Reports</strong> section of our <strong>Account Settings</strong>. For more information and for a list of available reports and CSVs, see our <a href='https://support.knowbe4.com/hc/en-us/articles/34738838417555'>KnowBe4 Console Account Settings: Reports</a> article.</li>\n<li>January 5, 2025 - The CSV file downloads from the phishing campaign <strong>Users</strong> subtab have been updated to show only phishing test data visible on each column header. All phishing test data is available when downloading the CSV file from the <strong>Recipients</strong> column header. For more information about accessing phishing campaign data, please visit the <a href='https://support.knowbe4.com/hc/en-us/articles/360033951614-Security-Awareness-Training-Console-Reporting-Overview#h_01HASWKVVVTYYYCZ0F6HTVV663'>Phishing</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360033951614-Security-Awareness-Training-Console-Reporting-Overview'>Security Awareness Training Console Reporting Overview</a> article.</li>\n<li>January 2, 2025 - We've added new <a href='https://support.knowbe4.com/hc/en-us/articles/360015798533-Edit-Your-CONF-File-for-Active-Directory-Integration-ADI'>Active Directory Integration</a> support and <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374-SCIM-Configuration-Guide'>SCIM provisioning</a> support for user language, out-of-office, and user type fields. Now, you can sync user phishing and training <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513-Localization-Guide'>language fields</a>, sync out-of-office end fields, and Student Edition customers can sync their user type field to set a student user type. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/228373888-Active-Directory-Integration-ADI-Configuration-Guide'>Active Directory Integration (ADI) Guide</a> and our <a href='https://support.knowbe4.com/hc/en-us/articles/360053851814-Configure-SCIM-for-Microsoft-Entra-ID#single'>SCIM Configuration Guide</a>.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2024 Log'>\n<table style='table-layout: auto;'>\n<thead>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>December 2024</td>\n<td>\n<ul>\n<li>December 20, 2024 - We've released our False-Positive Phishing Evasion feature! If you are experiencing false positives, you can enable this feature in your Account Settings, and then you should see a significant decrease in future false positives. Once the feature is enabled, you will be able to see data about these ignored failures on a new Phishing Campaigns page. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/36630765844115-False-Positive-Phishing-Evasion-Settings'>False-Positive Phishing Evasion Settings</a> article in our Knowledge Base.</li>\n<li>December 10, 2025 - We've released our SmartRisk Agent™ and Risk Score v2 Report for partners! With Risk Score v2, you can view more detailed information on your managed accounts' Risk Score, such as security types, risk factors, available range for risk, and risk insights. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/30048977242259'>SmartRisk Agent™ and Risk Score v2 Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 2024</td>\n<td>\n<ul>\n<li>November 26, 2024 - We've updated four of our free tools! We've added a shared library to improve the Microsoft Active Directory functionality for the following free tools:\n<ul>\n<li>Weak Password Test: version 1.10.3.327</li>\n<li>Breached Password Test: version 1.10.1.327</li>\n<li>Password Exposure Test: version 1.10.2.327</li>\n<li>Browser Password Inspector: version 1.10.0.327</li>\n</ul>\n</li>\n<li>We've updated our PasswordIQ client to improve product security.</li>\n<li>We also upgraded our development environment from Microsoft Visual Studio 2019 to 2022.</li>\n<li>November 25, 2024 - We've released an XM Cyber Security Control Monitoring (SCM) integration to the KSAT console. This integration provides you with insights into the configuration and activation of security controls. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/35798030434323-Integrating-XM-Cyber-s-SCM-with-KSAT'>Integrating XM Cyber's SCM with KSAT</a> article in our Knowledge Base.</li>\n<li>November 8, 2024 - Our new phishing templates user experience is now available for managed accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955'>Phishing Templates Guide</a>.</li>\n<li>November 6, 2024 - We've released a Trustero integration. This integration allows you to better collect evidence for more robust reporting. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/35144945856531-Integrating-Trustero-with-KSAT'>Integrating Trustero with KSAT</a> article in our Knowledge Base.</li>\n<li>November 5, 2024 - Anonymized accounts can now group comparisons by <strong>User Groups</strong> in their <strong>Phishing Security Test Reports</strong>. For more information on anonymized accounts, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115009509107'>Anonymous Console Data Overview</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2024</td>\n<td>\n<ul>\n<li>October 23, 2024 - We've released more updates to our new SmartRisk Agent™ and Risk Score v2. Now, Risk Score v2 uses risk data across our entire platform to provide you with a multidimensional Risk Score for your users, groups, and managers and a new Manager Risk Score report to identify team-specific risk areas. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/33963203317395'>Smart Risk Agent™ and Risk Score v2 Guide</a>.</li>\n<li>October 16, 2024 - We've released our KSAT Graph APIs! Our KSAT Graph APIs allow you to utilize complex queries and mutations to perform most functions of the supported KnowBe4 products via API. For more information, see our <a href='https://developer.knowbe4.com/graphql/ksat/page/Introduction'>KSAT Graph API documentation</a>.</li>\n<li>October 3, 2024 - We've released our new SmartRisk Agent™ and Risk Score v2. With Risk Score v2, you can view more detailed information on your Risk Score, such as security types, risk factors, your available range for risk, and risk insights. Risk Score v2 is available on the Reports tab and the Executive Reports subtab. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/30048977242259'>Smart Risk Agent™ and Risk Score v2 Guide</a>.</li>\n<li>October 1, 2024 - We've released a Harmonic Security integration. This integration allows you to link your Harmonic Security platform to your KSAT console, allowing new workflows for security awareness training. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/34725210336787-Integrating-Harmonic-Security-with-KSAT-Using-Tines'>Integrating Harmonic Security with KSAT Using Tines</a> article in our Knowledge Base.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2024</td>\n<td>\n<ul>\n<li>September 30, 2024 - We've released a Comcast Databee integration. This integration allows you to send phishing information from KSAT to Databee to get risk insights within your organization. For more information, see the <a href='https://docs.databee.buzz/docs/knowbe4-integration'>KnowBe4 integration documentation</a> from Databee.</li>\n<li>September 9, 2024 - We added a new [[certificate_list]] placeholder to our Campaign Completion Notifications. This placeholder provides a list of links to certificates for each piece of content completed in the campaign. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/6618204636819-Training-Information-Placeholders-Guide'>Training Information Placeholders Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2024</td>\n<td>\n<ul>\n<li>August 27, 2024 - We have released our Google User Provisioning (GUP) feature! You can now provision users from your Google Workspace environment directly into your KnowBe4 console. User provisioning can be configured to include users and groups, Google OUs, or a combination of both. This feature is being gradually released for all customers over the next few weeks. For further information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/29586165576339-Google-User-Provisioning-GUP-Guide'>Google User Provisioning (GUP) Guide</a>.</li>\n<li>August 23, 2024 - We've added a QR code attack vector to our phishing template features! For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955-Phishing-Templates-Guide#h_01HS1N5KB4BHY2TY86YVVMF9PK'>System Templates</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955'>Phishing Templates Guide</a>.</li>\n<li>August 26, 2024 - We've updated our reporting APIs to allow you to return the store purchase ID for each training enrollment, to exclude the ‘completion_percentage' field from the response to greatly speed up response time, and to return a specific employee number. For more information, see the Training section of our <a href='https://developer.knowbe4.com/rest/reporting'>Reporting API documentation</a>.</li>\n<li>August 12, 2024 - We've added an Onyxia integration to the KnowBe4 console. This integration allows you send training information from KSAT to Onyxia to get strategic cybersecurity program recommendations. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/32668976790419'>Integrate Onyxia with your KnowBe4 Console</a> article.</li>\n<li>August 07, 2024 - We've added a Truto integration to the KnowBe4 console. This integration allows you to set up and perform specific actions between KnowBe4 and other applications using the Truto Unified API. For more information, see the <a href='https://truto.one/integrations/detail/knowbe4'>KnowBe4 API integration</a> and <a href='https://truto.one/integrations/detail/knowbe4scim'>KnowBe4 SCIM API integration</a> articles from Truto.</li>\n<li>August 01, 2024 - We've updated the functionality of our Partner and Multi-Account Executive Reports! Now, these reports will be downloaded in the language of the partner admin who initiated the download. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/27325335564563'>Partner and Multi-Account: Executive Reports Overview</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2024</td>\n<td>\n<ul>\n<li>We've updated our Scam of the Week newsletter design! Our updated template includes improved responsiveness and accessibility, as well as a more modern design. We are also in the process of updating our Security Hints &amp; Tips newsletter with a similar design! For more information, please see our <a href='https://community.knowbe4.com/product-updates/enhanced-scam-of-the-week-and-security-hints-and-tips-messages-2720?tid=2720&amp;fid=None'>KnowBe4 Community Post</a>. Note that you must be logged in to your KnowBe4 console in order to access the link.</li>\n<li>We are retiring some phishing template categories by the end of August. If you are using these categories in a phishing campaign, please update your campaigns:\n<ul>\n<li>Coronavirus Alerts (Branded) (Not PST)</li>\n<li>Coronavirus Alerts (Not PST)</li>\n<li>Coronavirus/COVID-19 Phishing</li>\n<li>Brand Knock-Offs\n<ul>\n<li>Templates within this category can still be accessed through the new Phishing Templates interface.</li>\n</ul>\n</li>\n<li>Attachments with Macros\n<ul>\n<li>Templates within this category can still be accessed through the new Phishing Templates interface.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>We've released our newest free tool, BreachSim! This data exfiltration simulator can help you determine how susceptible your organization is to data theft during a cyber attack. For further information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/29871208001683-BreachSim-Guide'>BreachSim Guide</a> or visit our <a href='https://www.knowbe4.com/free-tools/breach-simulator'>BreachSim sign-up</a> page.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2024</td>\n<td>\n<ul>\n<li>A new security advisory has been posted. View it <a href='https://support.knowbe4.com/hc/en-us/articles/30347104688531-Security-Enhancements-for-Protecting-Against-DLL-Injection-6-14-2024'>here</a>.</li>\n<li>We've released our Quiz Interactions Reports! Now, you can use your users' quiz results and their selected answers to help you identify trends, such as commonly missed questions. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/18926275628691'>Quiz Interactions Reports Overview</a> article.</li>\n<li>We've updated SAML settings for our Partner consoles. Now, partners have the ability to disable password logins and require admins to log in with their SAML application. Partners now also have the ability to control if new partner admin accounts get created during the initial SAML authentication. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013562393'>Partner and Multi-Account: Enable SAML on Your Account Management Console</a> article.</li>\n<li>We've added the <strong>Impersonate User</strong> button! This button is now available in the <strong>User Dashboard</strong> subtab and allows you to see what your users see when they log in to their KnowBe4 console. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974-User-Profile-Guide'>User Profile Guide</a>.</li>\n<li>Our <a href='https://support.knowbe4.com/hc/en-us/articles/204843728-Free-Phishing-Security-Test-PST-Product-Manual'>Free Phishing Security Test (PST)</a> Coronavirus template has been updated to a new Adobe Acrobat Sign template! This template does not use spoofing and is an alternative to the default template choices.</li>\n<li>We've added two quiz interactions reports to the <strong>Reports</strong> tab. <strong>Quiz Interactions by Course</strong> allows you to see quiz results for individual users sorted by content. <strong>Quiz Interactions by Group</strong> allows you to see quiz results by group. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894-Reporting-Guide'>Reporting Guide</a>.</li>\n<li>We've added the <strong>Impersonated</strong> and <strong>Forced Completion</strong> badges under the <strong>Users</strong> subtab of a training campaign. For more information see our <a href='https://support.knowbe4.com/hc/en-us/articles/360053311074-User-Management-in-Training-Campaigns'>User Management in Training Campaigns</a> article.</li>\n<li>We've added a <strong>Training Topic</strong> field when adding details for your uploaded content. For more information, see the <strong>Adding Content Details</strong> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360019644394-Upload-Custom-Training-Content'>Upload Custom Training Content</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2024</td>\n<td>\n<ul>\n<li>The phishing industry benchmarking data has been updated on your Dashboard, in phishing reports, and advanced reports. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628'>Industry Benchmarking Overview</a> article.</li>\n<li>We've added an MobileMind integration to the KnowBe4 console. This integration allows you to send KnowBe4 training data to your MobileMind platform to provide a centralized place for tracking KnowBe4 courses. For more information, see the <a href='https://knowledge.mobilemind.io/knowbe4-integration-setup'>KnowBe4 integration setup</a> from MobileMind.</li>\n<li>We have rebranded our Kevin Mitnick Security Awareness Training (KMSAT) to KnowBe4 Security Awareness Training (KSAT).</li>\n<li>We've removed the <strong>Entire History</strong> option from our Training Activity Reports.</li>\n<li>We've added the option to <strong>Track SCORM Interactions</strong> under the <strong>Training</strong> section under <strong>Account Settings</strong>. This option sends users' responses in interactive SCORM activities to the KnowBe4 learning management system (LMS). For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12734085457555-KnowBe4-Console-Account-Settings-Training'>KnowBe4 Console Account Settings: Training</a> article.</li>\n<li>\n<strong>New: KnowBe4 Student Edition</strong>\n<ul>\n<li>KnowBe4 Student Edition is now available as an add-on for existing KSAT customers, providing resources for students to safely navigate the digital world. <a href='https://www.knowbe4.com/products/knowbe4-student-edition'>Learn More</a>.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2024</td>\n<td>\n<ul>\n<li>We have released some design improvements to the Dashboard tab, including a wider view and a more consistent interface.</li>\n<li>We've added an anecdotes integration to the KnowBe4 console. This integration allows you to send phishing, training, and user data from your KnowBe4 console to your anecdotes platform to automate and manage your compliance program. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/28818573957779'>Integrate anecdotes with Your KnowBe4 Console</a> article.</li>\n<li>We've updated our PasswordIQ client to improve product security.</li>\n<li>We've added an Okta Connectors integration to the KnowBe4 console. This integration allows you to use the KnowBe4 <a href='https://support.knowbe4.com/hc/en-us/articles/115016090908-Reporting-API-Overview'>Reporting API</a> to pull data into Okta. For more information, see Okta's <a href='https://help.okta.com/wf/en-us/content/topics/workflows/connector-reference/knowbe4/knowbe4.htm'>KnowBe4 connector</a> documentation.</li>\n<li>We've updated the behavior of our Security Role permissions for training campaigns scoped to targeted groups. Now, your users with this Security Role will see training campaigns for the groups they have access to. Any users outside of the targeted groups will have their enrollments hidden within the training campaign.</li>\n<li>We've updated our reporting APIs to include a query parameter for returning the campaign ID for training enrollments. For more information, see the Training section of our <a href='https://developer.knowbe4.com/rest/reporting'>KSAT Reporting APIs</a> documentation.</li>\n<li>We've added a Noetic Cyber integration to the KnowBe4 console. This integration allows you to pull your phishing and training data into Noetic Cyber's Security Asset Management platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/28676775042707'>Integrate Noetic Cyber with Your KnowBe4 Console</a> article.</li>\n<li>The standard report emailed to admins at the end of a Phishing Security Test has been updated. The email now lists more specific failure types, such as QR code failures, macros enabled, and data entered.</li>\n<li>We've rolled out design improvements to the <strong>Reports</strong> subtab! Now, report types are displayed as cards that list the specific reports found under that type. You can also filter reports by category and favorite your frequently used reports. For more information, read our <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894'>Reporting Guide</a>.</li>\n<li>We've added numbers for Chile, Argentina, Colombia, Brazil, and France for callback phishing campaigns.</li>\n<li>Starting in January 2025, Second Chance will be a Diamond-level KSAT feature. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115011813867'>Second Chance Installation and Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2024</td>\n<td>\n<ul>\n<li>We've released improvements to user messaging, making it easier to set up your Scam of the Week and Security Hints and Tips messages. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4416416555155'>User Messaging Guide</a>.</li>\n<li>We've improved our phishing templates to include an option to show excluded topics and to allow bulk cloning. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/15363709714963'>Phishing Templates (Beta) Advanced Features Guide</a> article.</li>\n<li>We've added our smart hosting feature to your account settings! Now you can set up a connection directly with KnowBe4's mail server and streamline your whitelisting, all from your KnowBe4 console. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000568187-Smart-Hosting'>Smart Hosting</a> article.</li>\n<li>We've released the Executive Reports feature for partners and multi-account organizations! If you have a Bulk Diamond subscription, you can now create custom reports that include data like your accounts' training activity, phishing activity, and Risk Score metrics. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/27325335564563'>Partner/Multi-Account: Executive Reports Overview</a>.</li>\n<li>We've added a new SAML feature that allows you to view how long your SAML AuthnRequest certificate is valid for and choose when to update the authentication certificate. With this feature, you can also enable email notifications to alert you when your AuthRequest is about to expire and has expired. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/12769050560403#SAML'>SAML</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/12769050560403'>KSAT Account Settings: Account Integrations</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2024</td>\n<td>\n<ul>\n<li>We are gradually releasing some design improvements to the <strong>Users</strong> tab, including a wider view and a more consistent interface.</li>\n<li>We've added a ServiceNow integration to the KnowBe4 console. This integration allows you to get detailed information about your organization's phishing preparedness. For more information, see ServiceNow's <a href='https://store.servicenow.com/sn_appstore_store.do#!/store/application/812ff8dd16e4f110574a0b1574d8de0f/2.0.1?referer=%2Fstore%2Fsearch%3Flistingtype%3Dallintegrations%25253Bancillary_app%25253Bcertified_apps%25253Bcontent%25253Bindustry_solution%25253Boem%25253Butility%25253Btemplate%25253Bgenerative_ai%25253Bsnow_solution%26q%3Dknowbe4&amp;sl=sh' target='_blank' rel='noopener'>KnowBe4 Integration for SecOps</a> article.</li>\n<li>We have released the Environment Survey on the Dashboard! Your survey responses enable us to provide you with updates that could impact your KnowBe4 experience, and will also help us to plan future product integrations. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/26094453437587'>Environment Survey Overview</a>.</li>\n<li>We've updated our messaging for Scam of the Week and Security Hints and Tips. Now you can select the day you want to send your message. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226314167'>What Is the Scam of the Week Newsletter?</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/115010414108'>What Is the Security Hints and Tips Newsletter?</a> articles.</li>\n<li>We are rolling out design improvements to the <strong>Browse</strong> and <strong>Library</strong> subtabs in the ModStore. Improvements include a new layout on the item details page, a toggle to hide content already added to your library, and a language count that displays how many languages an item is available in. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467'>ModStore and Library Guide</a>.</li>\n<li>We've updated our <strong>Account Settings</strong> page. Admins can now require Multi-Factor Authentication (MFA) for users and admins across their organization. For more information, see our updated <a href='https://support.knowbe4.com/hc/en-us/articles/12731036715411-KMSAT-Account-Settings-User-Management'>KSAT Account Settings: User Management</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2024</td>\n<td>\n<ul>\n<li>We have released the individual leaderboard! This new leaderboard is based on simulated phishing tests and encourages users to compete on how well they use the Phish Alert Button (PAB). For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360012723514'>Learner Support: Leaderboard Guide</a>.</li>\n<li>We've updated our reporting APIs to include queries for callback phishing campaigns on our phishing endpoints. For more information, see the Phishing section of our <a href='https://developer.knowbe4.com/rest/reporting'>KSAT Reporting APIs</a> documentation.</li>\n<li>Our free tool <a href='https://support.knowbe4.com/hc/en-us/articles/115006118227/'>Weak Password Test</a> has been updated to include a new password library, language support for Portuguese (Brazil) and Spanish (Latin America), and the ability to import your own custom password text file.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2023 Log'>\n<table style='table-layout: auto;'>\n<thead>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>December 2023</td>\n<td>\n<ul>\n<li>DKIM signatures are enabled by default for all accounts created after December 28, 2023. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500010872521'>How to Enable and Customize DKIM Signatures</a> article.</li>\n<li>On the <strong>Executive Reports</strong> subtab, we've added new filters to the Training Metrics and Phishing Metrics widgets. When creating a table, you can enable the filters to include a total count or weighted average. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355'>KSAT Executive Reports Overview</a> article.</li>\n<li>We've added an audit log for our KSAT console! Now you can view changes in your console and see who made them. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/23542330166163'>Audit Log for KSAT</a> article.</li>\n<li>On the <strong>Download Center</strong> subtab of <strong>Reports</strong>, we've added a <strong>Status</strong> column. Now you can see if a download is generating, completed, retrying, or has failed.</li>\n<li>In the <strong>Executive Reports</strong> subtab, we've updated the Training Metrics widget. Now, you can narrow down these metrics to one or more specific training campaigns. You can also select additional criteria to analyze campaign training, optional learning, and AIDA optional learning. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355#WIDGETS'>KSAT Executive Reports Overview</a> article.</li>\n<li>We've added a Liongard integration to the KSAT console. This integration allows you to monitor phishing tests, security awareness campaigns, and users to keep risks under control. For more information, see Liongard's <a href='https://docs.liongard.com/docs/knowbe4-inspector'>KnowBe4 integration documentation</a>.</li>\n<li>We've added numbers for Sweden, Ireland, Spain, and Australia for callback phishing campaigns.</li>\n<li>We've added a COZYROC SSIS+ integration to the KSAT console. This integration allows you to send campaign and user data from your KSAT console into the COZYROC platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/23984403032851'>Integrating COZYROC SSIS+ with Your KSAT Console</a> article.</li>\n<li>In the KnowBe4 Learner App, you can now request an email with a link to automatically log in to the app. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/7154599334419#LOGINLINK'>Learner Support: KnowBe4 Learner App</a> article.</li>\n<li>When creating a Security Role, you can now grant assigned users access to the enroll users feature. This allows them to enroll individual users in active training campaigns. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767#DESCRIPTIONS'>Permissions Descriptions</a> section of our How to Use Security Roles article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 2023</td>\n<td>\n<ul>\n<li>We've added an A-LIGN integration to the KSAT console. This integration allows you to send training data from your KSAT console to your A-LIGN automated compliance system. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/23030866722707'>How to Integrate A-LIGN with Your KSAT Console</a> article.</li>\n<li>We've added three new resources to introduce the Learner App to your organization. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/9776769113747#ADMINKIT'>KnowBe4 Learner App Admin FAQ </a>article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2023</td>\n<td>\n<ul>\n<li>Admins can now easily invite users to download the KnowBe4 Learner App by using a new feature in the <strong>Account Settings</strong> &gt; <strong>Training</strong> &gt; <strong>Learner Experience </strong>area. This feature sends an email invitation to users with instructions on how to download the app.</li>\n<li>We are gradually releasing some design improvements to the <strong>Training</strong> tab, including a wider view and a more consistent interface.</li>\n<li>On the <strong>Campaigns</strong> subtab, we've added a <strong>Next Test</strong> column. This column will show the start time of your next scheduled Phishing Security Test (PST) for recurring phishing campaigns.</li>\n<li>We've updated one of our KSAT Event Types. Now, our <strong>Audit Log</strong> event is called <strong>Admin Action</strong>. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974#TIMELINE'>User Timeline Subtab</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974'>User Profile Guide</a>.</li>\n<li>We've created a new email template so you can test your PAB button and verify that your users know how to use the PAB. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/21931353962131'>How to Use the PAB Test Email</a> article.</li>\n<li>We've added the new <strong>Enable Direct Links in Training Notifications</strong> account setting! Now the assignment placeholders can populate assignments as clickable links that take users directly to their training content or as plain text. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12734085457555'>KSAT Account Settings: Training</a> article.</li>\n<li>The Smart Group section of the Knowledge Base is new and improved! We've replaced our original Smart Group articles with eight new articles and six new videos to help you get the most out of your Smart Groups. To learn more, see the <a href='https://support.knowbe4.com/hc/en-us/sections/26410689830803-Smart-Groups'>Smart Groups</a> section of our Knowledge Base.</li>\n<li>We've made security improvements for our User Event, Product, and Reporting APIs. Now API tokens will be visible only when they are first created. Afterward, only the last 10 digits of the API tokens will be visible in the KSAT console. For the Reporting API, we've also added support for multiple tokens. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360024863474'>KnowBe4's User Event API</a>, <a href='https://support.knowbe4.com/hc/en-us/articles/10495383627155'>KnowBe4's Product API</a>, and <a href='https://support.knowbe4.com/hc/en-us/articles/115016090908'>KnowBe4's Reporting API</a> articles.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2023</td>\n<td>\n<ul>\n<li>We've created planning resources for phishing and training campaigns! You can use these interactive planning worksheets to outline your settings before creating a campaign in your KSAT console. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/7879267662739'>Phishing and Training Campaign Planning Resources</a> article.</li>\n<li>We've added the ability to download content in the KnowBe4 Learner App! Downloaded content can be accessed in the app at any time, even while offline. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/7154599334419'>Learner Support: KnowBe4 Learner App</a> article.</li>\n<li>We've made improvements to PasswordIQ! Along with general fixes to improve your overall experience, we've added new options to disable the vulnerability checks for <strong>Password Never Expires</strong> and <strong>AES Encryption Not Set</strong>. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4406004172435'>PasswordIQ Product Manual</a>.</li>\n<li>Resellers, managed service providers (MSPs), and multi-account organizations can now search and sort the <strong>Phishing Activity Reports</strong> table data in the account management console! We've also added the <strong>Failed Phishing Tests</strong> column for the <strong>All Phishing Activity Grouped by User</strong> report. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5933605265043'>MSP/Reseller/Multi-Account Org: How to Customize and View Phishing Activity Reports</a> article.</li>\n<li>Resellers, managed service providers (MSPs), and multi-account organizations can now search and sort the <strong>Training Activity Reports</strong> table data in the account management console! We've also added the <strong>Score</strong> column for the <strong>All Training Activity</strong> report. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5367086524051'>MSP/Reseller/Multi-Account Org: How to Customize and View Training Activity Reports</a> article.</li>\n<li>\n<p>We've made improvements to the Weak Password Test free tool! Along with enhancements to the installation wizard, we redefined the types of failures and vulnerabilities and updated the necessary system requirements to run the newest version. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115006118227'>Weak Password Test (WPT) Product Manual</a>.</p>\n</li>\n<li>\n<p>We've added a Cisco Duo integration to the KSAT console. This integration allows you to use Cisco Duo to provide your users with single sign-on (SSO) access to KnowBe4. For more information, see Cisco Duo's <a href='https://duo.com/docs/sso-knowbe4'>KnowBe4 integration documentation</a>.</p>\n</li>\n<li>We've added a Secureframe integration to the KSAT console. This integration allows you to send your KSAT data to Secureframe to help automate the compliance process. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/20620725438995'>How to Integrate Secureframe with Your KSAT Console</a> article.</li>\n<li>We've made improvements to the Password Exposure Test free tool! We've redefined the types of failures and vulnerabilities and updated the necessary system requirements to run the newest version. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013570174'>Password Exposure Test </a>article.</li>\n<li>\n<p>We've made improvements to the Breached Password Test free tool! We've updated the necessary system requirements to run the newest version. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360001508408'>Breached Password Test</a> article.</p>\n</li>\n<li>We've added the new <strong>Removed</strong> option for your webhook training events! Now you can send events to your webhook when users are removed from training campaigns with content, assessments, or policies. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/10103021848723'>Webhooks in Your KSAT Console</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2023</td>\n<td>\n<ul>\n<li>We've added an Egress integration to the KSAT console. This integration allows you to send your KSAT data to Egress to help you prepare for phishing attacks and data breaches. For more information, see Egress's <a href='https://support.egress.com/s/article/Egress-and-KnowBe4-Integration'>KnowBe4 integration documentation</a>.</li>\n<li>We've added the new <strong>Enable Webhook Failure Notifications</strong> check box for webhooks! This option sends recipients an email notification when a webhook receives 50 percent of the allowed failed responses in an hour. A second notification will be sent if the webhook exceeds the allowed number of failed responses in an hour and is deactivated. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/10103021848723'>Webhooks in Your KSAT Console</a> article.</li>\n<li>We've added course durations to users' training certificates! The duration is the estimated time needed to complete the course. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/227567208'>How to Download or Print Your Training Certificate</a> article.</li>\n<li>We've added the ability to preview how your executive reports will look as a PDF file! While previewing a report, you'll have the option to adjust your widgets as needed. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355'>KSAT Executive Reports Overview</a> article.</li>\n<li>For information about the latest ModStore content releases, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/18621704256403'>ModStore Content Releases</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2023</td>\n<td>\n<ul>\n<li>We have added <strong>Italian</strong> as an admin console language. For more information and the full list of available languages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a>.</li>\n<li>We're gradually rolling out the new callback phishing feature to Diamond customers! You can use this feature to test whether your users will call unknown phone numbers in emails and share sensitive information. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/18223402626323'>How to Create and Manage Callback Phishing Campaigns</a> article.</li>\n<li>The new <strong>Content Manager</strong> feature is now available in the ModStore! This feature allows you to set content preferences that create a cohesive user experience for your organization. To learn more about this feature, see our <a href='https://support.knowbe4.com/hc/en-us/articles/8419812847763'>How to Use the Content Manager</a> article.</li>\n<li>We've added the new <strong>Clone Report</strong> option for executive reports! Now you can create a new report by cloning an existing custom report. You can then edit the new report as needed. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355'>KSAT Executive Reports Overview</a> article.</li>\n<li>We've added a new search bar to the <strong>Training Activity Reports</strong>! Now you can search for specific users in the tale by their name or email address. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4417261034259'>How to Customize and View Training Activity Reports</a> article.</li>\n<li>\n<p>We've added a new search bar to the <strong>Phishing Activity Reports</strong>! Now you can search for specific users in the table by their name or email address. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4561035154451'>How to Customize and View Phishing Activity Reports</a> article.</p>\n</li>\n<li>\n<p>We've made improvements to the <strong>Phishing Activity Reports</strong>! Now you can sort the table data in these reports to fit your needs. We've also added the <strong>Failed Phishing Tests</strong> column for the <strong>Phishing Activity Grouped by User</strong> report. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4561035154451'>How to Customize and View Phishing Activity Reports</a> article.</p>\n</li>\n<li>We've made improvements to the <strong>Training Activity Reports</strong>! Now you can sort the table data in these reports to fit your needs. We've also added the <strong>Score </strong>column for the <strong>All Training Activity</strong> report. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4417261034259'>How to Customize and View Training Activity Reports</a> article.</li>\n<li>For information about the latest ModStore content releases, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/18621704256403'>ModStore Content Releases</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2023</td>\n<td>\n<ul>\n<li>Resellers, managed service providers (MSPs), and multi-account organizations can now send localized emails in managed phishing campaigns. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360049400313'>MSP/Reseller/Multi-Account Org: How to Create a Managed Phishing Campaign</a> article.</li>\n<li>We've fixed a bug that was causing some API endpoints to incorrectly return a 200 success with a payload of [] when an invalid ID was used. Now the affected API endpoints will return the correct 404 error, which states that the resource was invalid and could not be found.</li>\n<li>\n<p>We've made improvements to PasswordIQ! You can now scan individual Organizational Units and select a specific domain controller. We've also made changes to the time-out policy and AES vulnerabilities, and we've added various bug fixes. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4406004172435'>PasswordIQ Product Manual</a>.</p>\n</li>\n<li>We've launched the KnowBe4 Community! Now you can connect, share knowledge, and collaborate on new ideas with other admins, partners, and employees. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/15480944821395'>KnowBe4 Community Guide.</a>\n</li>\n<li>The phishing industry benchmarking data has been updated on your Dashboard, in phishing reports, and advanced reports. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628'>What Is Industry Benchmarking?</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Bisk\n<ul>\n<li>15 Compliance Plus training modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>2 Mobile-First modules</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 training module</li>\n<li>4 Compliance Plus posters</li>\n<li>1 Compliance Plus security document</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>1 game</li>\n<li>2 Compliance Plus posters</li>\n<li>2 Compliance Plus training modules</li>\n<li>1 Compliance Plus newsletter</li>\n<li>2 Mobile-First modules</li>\n<li>2 security document</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>1 Compliance Plus training module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>1 Compliance Plus Mobile-First module</li>\n<li>1 Movile-First training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>4 Mobile-First training modules</li>\n<li>1 video module</li>\n<li>1 game</li>\n<li>2 newsletters and documents</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2023</td>\n<td>\n<ul>\n<li>We've updated the <strong>Reporting</strong> subtab for Security Roles! Now you can customize your Security Roles by granting groups access to specific reports. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767'>How to Use Security Roles</a> article.</li>\n<li>We've added QR code phishing to our free tools! You can use this tool to see if your users are vulnerable to QR code phishing attacks. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/15664129041811'>Free QR Phishing</a> article.</li>\n<li>We've added the ability to display custom training content in the Learner Experience library! You can enable this setting on the <strong>Uploaded Content</strong> subtab of the ModStore. When this setting is enabled, users will be able to see the content in their library. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360019644394#AddingContent'>Uploading Custom Training Content</a> article.</li>\n<li>We've added the new <strong>Demo KnowBe4 Learner App</strong> option to your KSAT <strong>Account Settings</strong>! Now you can demo the app without enabling it for all users. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/9776769113747'>KnowBe4 Learner App Admin FAQ</a>.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>exploqii\n<ul>\n<li>1 training module</li>\n<li>2 Compliance Plus training modules</li>\n<li>1 Compliance Plus Mobile-First training module</li>\n<li>1 Compliance Plus security document</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>4 Compliance Plus training modules</li>\n<li>1 training module</li>\n<li>1 video module</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>1 Compliance Plus training module</li>\n<li>1 Compliance Plus Mobile-First training module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 Compliance Plus newsletter</li>\n<li>2 training modules</li>\n<li>1 Compliance Plus Mobile-First training module</li>\n<li>5 security documents</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 Compliance Plus training module</li>\n<li>2 newsletters</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2023</td>\n<td>\n<ul>\n<li>We've added the option to bulk enroll users in training campaigns with a CSV file! Now, KSAT admins can enroll specific users in bulk instead of enrolling them individually. For more information, see our<a href='https://support.knowbe4.com/hc/en-us/articles/204948207'> Creating and Managing Training Campaigns</a> article.</li>\n<li>We've added a C<sub>n</sub>Sight integration to your KSAT console. This integration allows you to send phishing data from your KSAT console to your C<sub>n</sub>Sight platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/15877468654483'>How to Integrate C<sub>n</sub>Sight with Your KSAT Console</a> article.</li>\n<li>We've released the new <strong>Executive Reports</strong> feature on the <strong>Reports</strong> tab! You can use this feature to create custom reports that display your organization's training, phishing, and Risk Score metrics. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14636398798355'>KSAT Executive Reports Overview</a> article.</li>\n<li>We've localized the Learner Experience into two additional languages: Portuguese (Europe) and English (Australia)! For more information and the full list of available languages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a>.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>exploqii\n<ul>\n<li>1 Compliance Plus training module</li>\n<li>3 Compliance Plus security documents</li>\n<li>1 Compliance Plus poster</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>2 Compliance Plus Mobile-First training modules</li>\n<li>1 security document</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>2 Compliance Plus training modules</li>\n<li>2 Compliance Plus Mobile-First modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>4 security documents</li>\n<li>1 poster</li>\n<li>1 game</li>\n<li>1 Mobile-First Compliance Plus training module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 Compliance Plus training modules</li>\n<li>1 security document</li>\n<li>2 posters</li>\n<li>2 newsletters</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2023</td>\n<td>\n<ul>\n<li>We've added <strong>Learner Platform Reports</strong> to the <strong>Reports</strong> tab. You can use this report to view comprehensive data about which platforms your learners are using to complete their training. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894#LEARNERPLATFORM'>Reporting Guide</a>.</li>\n<li>We have released an updated version of the Security Awareness Proficiency Assessment (SAPA). For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360037392654'>What Is the Security Awareness Proficiency Assessment (SAPA)?</a> article.</li>\n<li>We've localized training certificates! When learners download a training certificate, it will be localized into their selected training language automatically. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/227567208'>How to Download or Print Your Training Certificate</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>El Pescador\n<ul>\n<li>3 Compliance Plus Mobile-First modules</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 training module</li>\n<li>1 Compliance Plus training module</li>\n<li>1 Compliance Plus Mobile-First training module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>3 training modules</li>\n<li>2 video modules</li>\n<li>2 Compliance Plus training modules</li>\n<li>4 posters</li>\n<li>6 security documents</li>\n<li>1 Compliance Plus newsletter</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>1 Mobile-First module</li>\n<li>1 Compliance Plus Mobile-First module</li>\n<li>3 video modules</li>\n<li>1 Compliance Plus newsletter</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 training module</li>\n<li>1 video module</li>\n<li>1 Mobile-First module</li>\n<li>1 game</li>\n<li>1 newsletter</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2023</td>\n<td>\n<ul>\n<li>We've added the free SecurityCoach preview to our free tools! During your limited preview, you can set up your security vendor integrations and begin detecting risky activity on your users' devices. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/13828683829907'>Free SecurityCoach Preview</a> article.</li>\n<li>We've released advanced Phishing Template features, which you can opt in to. Opting into the beta will give you access to advanced filter and search filters, the option to exclude templates from campaigns, and the option to manage template topics. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955'>Phishing Templates (Beta) Tab</a>.</li>\n<li>We've added the ability to choose how the display name placeholder populates in your templates! Now, the placeholder can populate the user's first and last name, first name, last name, or last and first name. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12727775060115'>KSAT Account Settings: Account Information</a> article.</li>\n<li>We've updated the assignment placeholders that you can use in training notifications. Now, your users can click on links in their notification emails that lead directly to training assignments. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/6618204636819'>How to Use Training Information Placeholders</a> article.</li>\n<li>We've added the <strong>Learner Platform Data</strong> widget to your dashboard. This widget allows you to see which platforms your learners are using to complete their training. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204218028#PLATFORM'>Dashboard</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>exploqii\n<ul>\n<li>1 Compliance Plus training module</li>\n<li>1 video module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>1 video module</li>\n<li>2 Compliance Plus training modules</li>\n<li>1 Compliance Plus Mobile-First module</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>1 poster</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 Compliance Plus security documents</li>\n<li>1 video module</li>\n<li>1 game</li>\n<li>2 newsletters</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2023</td>\n<td>\n<ul>\n<li>We've added the UK and Germany instances of KSAT! For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354'>KnowBe4's Training Instances</a> article.</li>\n<li>We've released the User Provisioning Notifications feature. You can use this feature to get notifications when you haven't received a user provisioning sync during your selected time frame. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12731036715411'>KSAT Account Settings: User Management</a> article.</li>\n<li>Resellers, managed service providers (MSPs), and multi-account organizations can now impersonate their child partners' account management consoles. With this feature, you can perform admin actions as the impersonated child partner admin. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360038664394'>MSP/Reseller/Multi-Account Org: How to Manage Partners</a> article.</li>\n<li>We've added the ability to use SCIM with Rippling to manage your users and groups in KSAT. For more information on using SCIM, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12908176296979'>How to Configure SCIM for Rippling</a> article.</li>\n<li>We've released the PasswordIQ feature, which allows you to monitor your users' password vulnerabilities. You can enable PasswordIQ from the <strong>Account Integrations</strong> &gt; <strong>PasswordIQ</strong> section of your <strong>Account Settings</strong>. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4406004172435'>PasswordIQ Product Manual</a>.</li>\n<li>We've localized the Learner Experience into two additional languages, Arabic and Hebrew! For more information and the full list of available languages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a>.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>1 Compliance Plus training module</li>\n<li>2 Compliance Plus video modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>2 Compliance Plus Mobile-First modules</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 training module</li>\n<li>8 Compliance Plus training modules</li>\n<li>1 Compliance Plus security document</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 Compliance Plus video module</li>\n<li>1 Compliance Plus security document</li>\n<li>2 newsletters and documents</li>\n<li>1 security document</li>\n<li>2 posters</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2022 Log'>\n<table style='table-layout: auto;'>\n<thead>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>December 2022</td>\n<td>\n<ul>\n<li>We've released a physical QR code phishing campaigns feature. You can use this feature to download and print your own QR code posters to test whether your users will scan unexpected QR codes. To start creating physical QR code phishing campaigns, navigate to <strong>Physical Tests</strong> &gt; <strong>Physical QR Code</strong>. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12357999488147'>How to Use Physical QR Code Phishing Campaigns</a> article.</li>\n<li>We've added the <strong>Physical Tests</strong> tab to your console. You can now find your <a href='https://support.knowbe4.com/hc/en-us/articles/218576747'>USB drive tests</a> under this tab.</li>\n<li>We've added a SeeMetrics integration to your console. This integration allows you to display your KSAT and PhishER data on the SeeMetrics platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12186201780755'>How to Integrate SeeMetrics with Your KSAT Console</a> article.</li>\n<li>We've added a ControlMap integration to your console. This integration allows you to send training campaign data to ControlMap so that you can mark training requirements as complete. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/11753002536467'>How to Integrate ControlMap with Your KSAT Console</a> article.</li>\n<li>We are releasing the new <strong>Select a Team</strong> feature on the <strong>Team Dashboard</strong> in the Learner Experience. This feature allows your managers to select which team to view on the dashboard. In addition to their own team, they can view the dashboard for up to three levels of managers below them in their organization's management hierarchy. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5632850730643'>Team Dashboard Overview for Admins</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/5600413909651'>Learner Support: Team Dashboard Overview for Managers</a> articles.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>exploqii\n<ul>\n<li>1 Compliance Plus training module</li>\n<li>2 Mobile-First training modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>4 security documents</li>\n<li>2 Compliance Plus training modules</li>\n<li>1 Compliance Plus Mobile-First module</li>\n<li>1 Compliance Plus poster</li>\n<li>1 Compliance Plus newsletter</li>\n<li>2 Compliance Plus security documents</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>1 Compliance Plus training module</li>\n<li>1 Compliance Plus security document</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 training modules</li>\n<li>5 security documents</li>\n<li>4 posters</li>\n<li>2 newsletters</li>\n<li>1 Compliance Plus training module</li>\n<li>2 Compliance Plus security documents</li>\n<li>1 Compliance Plus poster</li>\n<li>3 Mobile-First training modules</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>1 game</li>\n<li>1 training module</li>\n<li>3 Compliance Plus Mobile-First modules</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>6 training modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 2022</td>\n<td>\n<ul>\n<li>We've added a webhook API for your phishing and training events. You can use this feature to send real-time data to the other applications you use. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/10103021848723'>How to Create Webhooks in Your KSAT Console</a> article.</li>\n<li>We've added a <strong>Training Content Survey</strong> report to the <strong>Reports</strong> tab. You can use this report to view your users' training survey results. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894#SURVEY'>Training Content Survey</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894'>Reporting Guide</a>.</li>\n<li>We are releasing the new SecurityCoach product. SecurityCoach integrates with your third-party vendors to detect risky activity on your users' devices and then coach your users about the risky activity in real-time. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/6654432814355'>SecurityCoach Product Manual</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>2022 Holiday Resource Kit</li>\n<li>1 training module</li>\n<li>10 Compliance Plus training modules</li>\n<li>2 Mobile-First modules</li>\n<li>1 security document</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>1 Compliance Plus training module</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>2 training modules</li>\n<li>6 Compliance Plus training modules</li>\n<li>2 Mobile-First Compliance Plus training modules</li>\n<li>1 Compliance Plus poster</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>3 posters</li>\n<li>2 newsletters</li>\n<li>1 Compliance Plus training module</li>\n<li>2 Compliance Plus posters</li>\n<li>1 security document</li>\n<li>1 Compliance Plus security document</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>2 Mobile-First modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>6 Compliance Plus video modules</li>\n<li>3 Compliance Plus training modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2022</td>\n<td>\n<ul>\n<li>We've added the option to integrate your console with KCM GRC. This integration allows you to create KCM GRC tasks that will collect your users' training completions as evidence. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/7728644706579'>How to Integrate KnowBe4's KSAT Console with KCM GRC</a> article.</li>\n<li>We've added the ability to manually add your users' PAB reports and update user information in bulk. Admins can now upload a CSV file to both remove phishing campaign failures and add User Timeline events for users who reported messages without using the PAB. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/217841868'>Monitoring and Reviewing Phishing Campaigns</a> article.</li>\n<li>We've added the new <strong>Disable Tour Prompt</strong> option in your <strong>Account Settings</strong>. This option allows you to disable the tour prompt in the Learner Experience for your users. Users can still manually launch the tour at any time. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/226457887#LX'>Learner Experience</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>How to Edit Your Account Settings</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>2 training modules</li>\n<li>3 Compliance Plus training modules</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 newsletters</li>\n<li>1 security document</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 training module</li>\n<li>2 Compliance Plus training modules</li>\n<li>1 security document</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2022</td>\n<td>\n<ul>\n<li>Resellers, managed service providers (MSPs), and multi-account organizations can now create training campaigns for managed accounts through their management console. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4403006428307'>MSP/Reseller/Multi-Account Org: How to Assign Training Content</a> article.</li>\n<li>We've released the Full Access Admin permission for resellers, managed service providers (MSPs), and multi-account organizations. Primary admins can grant this permission to give partner admins full access to the management console and any future permissions that become available. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013722733'>MSP/Reseller/Multi-Account Org: How to Manage Partner Admins</a> article.</li>\n<li>We've released the KnowBe4 Learner App! Now, users can complete security awareness training on the go using their mobile devices. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/7154599334419'>KnowBe4 Learner App</a> article.</li>\n<li>We've also released the <strong>On the Go</strong> badge! The new badge can be enabled in your <strong>Account Settings</strong>. For more information see our <a href='https://support.knowbe4.com/hc/en-us/articles/360011915933'>How to Earn Badges</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634#BADGES'>Learner Experience Guide</a> articles.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>5 training modules</li>\n<li>2 Compliance Plus training modules</li>\n<li>2 security documents</li>\n<li>3 posters</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>1 Compliance Plus training module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>11 video modules</li>\n<li>1 Mobile-First module</li>\n<li>2 security documents</li>\n<li>1 Compliance Plus security document</li>\n<li>2 posters</li>\n<li>2 newsletters</li>\n</ul>\n</li>\n<li>lawpilots\n<ul>\n<li>1 Compliance Plus training module</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>2 training modules</li>\n<li>4 video modules</li>\n<li>1 security document</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>3 training modules</li>\n<li>1 Compliance Plus training module</li>\n<li>4 Mobile-First Compliance Plus modules</li>\n<li>1 poster</li>\n<li>1 Compliance Plus security document</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2022</td>\n<td>\n<ul>\n<li>We've added the new Resource Center feature to your console. From the Resource Center, you can view a full list of product guides and release notes, search our Knowledge Base, and create support tickets. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/6272817218707#RESOURCE_CENTER'>Using the Resource Center</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/6272817218707'>How to Use the Product Guide Feature</a> article.</li>\n<li>We've released the new product guide feature. Product guides walk you through specific features to help you get the most out of your console. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/6272817218707'>How to Use the Product Guide Feature</a> article.</li>\n<li>Resellers, managed service providers (MSPs), and multi-account organizations can now use the Managed ModStore. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/8147337786259'>MSP/Reseller/Multi-Account Org: Managed ModStore and Library Guide</a>.</li>\n<li>We've added a new phish link domain to use in your simulated phishing tests. To view the new domains, go to <strong>Phishing</strong> &gt; <strong>Domains</strong>, then click the <strong>Show Hidden Domains</strong> toggle at the top of the page. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360061705153'>Phishing Domain Management</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>3 training modules</li>\n<li>2 video modules</li>\n<li>1 Compliance Plus training module</li>\n<li>3 Mobile-First modules</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 Compliance Plus training module</li>\n<li>1 Mobile-First training module</li>\n<li>1 Mobile-First Compliance Plus training module</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>6 Compliance Plus video modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 video module</li>\n<li>1 poster</li>\n<li>1 security document</li>\n<li>1 Compliance Plus training module</li>\n<li>1 Mobile-First module</li>\n<li>2 newsletters and documents</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>3 Compliance Plus training modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>8 training modules</li>\n<li>8 security documents</li>\n<li>1 poster</li>\n<li>1 Compliance Plus training module</li>\n<li>1 Compliance Plus security document</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2022</td>\n<td>\n<ul>\n<li>We have added the <strong>Out of Office Until</strong> option to the user profile. You can use this option to pause training notifications for a user while they are out of the office until the selected date. Notifications sent to managers and admins about this user will also be paused. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974'>User Profile Guide</a> article.</li>\n<li>We have added the ability to view your users' recent activity with specific PAB instances. You can now access the <strong>PAB User Activity</strong> page from the <strong>Phish Alert</strong> section in your <strong>Account Settings</strong>. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/208969608#ACTIVITY'>PAB User Activity</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a>.</li>\n<li>We have released an updated version of the Security Awareness Proficiency Assessment (SAPA). For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360037392654'>What Is the Security Awareness Proficiency Assessment (SAPA)?</a> article.</li>\n<li>From your <strong>Account Settings</strong>, you can now configure a DMI connection for Google Workspace. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360054494394'>DMI Configuration Guide</a>.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>4 Compliance Plus training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 training module</li>\n<li>3 security documents</li>\n<li>1 game</li>\n<li>2 Compliance Plus posters</li>\n<li>2 newsletters</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>1 training module</li>\n<li>1 Compliance Plus training module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2022</td>\n<td>\n<ul>\n<li>In the Security Awareness Proficiency Assessment (SAPA) we renamed the Knowledge Area “Security Awareness” to “Human Firewall”. For more information about the SAPA in general, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360037392654#RESULTS'>What Is the Security Awareness Proficiency Assessment (SAPA)?</a> article.</li>\n<li>If you have admins who set passwords when they add new users, you can now require your users to reset their passwords after they log in. The <strong>Require users to reset initial password set by admins</strong> setting can be enabled in your Account Settings. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>How to Edit Your Accounts Settings</a> article.</li>\n<li>Now, for all new accounts, the default phishing language will be set to <strong>English (United States)</strong>. To update the default phishing language for your account, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513#DEFAULTS'>Set the Default Language</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a>.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>exploqii\n<ul>\n<li>1 poster</li>\n<li>1 security document</li>\n<li>8 Compliance Plus training modules</li>\n<li>3 Compliance Plus posters</li>\n<li>2 Compliance Plus security documents</li>\n<li>1 Compliance Plus Mobile-First module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>4 Compliance Plus training modules</li>\n<li>1 Mobile-First training module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>6 Compliance Plus training modules</li>\n<li>3 Compliance Plus posters</li>\n<li>1 Mobile-First training module</li>\n<li>1 Compliance Plus Mobile-First module</li>\n<li>4 training modules</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 Mobile-First module</li>\n<li>1 Compliance Plus training module</li>\n<li>1 Compliance Plus Mobile-First module</li>\n<li>2 training modules</li>\n<li>4 posters</li>\n<li>3 security documents</li>\n<li>2 newsletters and documents</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>12 video modules</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>2 Compliance Plus training modules</li>\n<li>3 Compliance Plus Mobile-First modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2022</td>\n<td>\n<ul>\n<li>Resellers, Managed Service Providers (MSPs), and Multi-Account Organizations can now use our <strong>Phishing Activity Report</strong>. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5933605265043'>MSP/Reseller/Multi-Account Org: How to Customize and View Phishing Activity Reports</a> article.</li>\n<li>Now, QR Phishing failures will be considered in the following criteria options for <a href='https://support.knowbe4.com/hc/en-us/articles/115012819668'>Smart Groups</a>.\n<ul>\n<li>Any Failures</li>\n<li>Any Failures but Clicks</li>\n<li>Failed Phishing Test</li>\n</ul>\n</li>\n<li>We are releasing the new <strong>Team Dashboard</strong> feature in the Learner Experience. This new dashboard allows managers to view their team's training progress and other statistics. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5632850730643'>Team Dashboard Overview for Admins</a> article.</li>\n<li>We have released the <a href='https://training.knowbe4.com/ui/modstore/public'>Public Module Store</a> or Public ModStore. The Public ModStore is a storefront that lets you view the training content we currently offer. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5942711477139'>Public ModStore Guide</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>exploqii\n<ul>\n<li>3 Compliance Plus training modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 Compliance Plus document</li>\n<li>1 training module</li>\n<li>1 Mobile-First module</li>\n<li>2 Compliance Plus training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>6 security documents</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 Mobile-First module</li>\n<li>3 video modules</li>\n<li>1 security document</li>\n<li>2 posters</li>\n<li>2 Compliance Plus training modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 poster</li>\n<li>2 security documents</li>\n<li>1 Compliance Plus Mobile-First module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2022</td>\n<td>\n<ul>\n<li>Under the Phishing tab of your console, you'll find the new <strong>Phishing Templates (Beta)</strong> subtab. This feature allows you to filter templates, search by keywords, and find templates localized in your users' languages. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955'>Phishing Templates Tab (Beta)</a> article.</li>\n<li>We have added a<strong> Phishing Activity Report</strong> to the <strong>Reports</strong> tab. You can use these reports to view comprehensive data about your users' PST results. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4561035154451'>How to Customize and View Phishing Activity Reports</a> article.</li>\n<li>You can now use QR codes in your phishing campaigns. We've added the <strong>QR Code</strong> phishing template category and the option to add QR codes to the phishing email templates that you create. This feature will add an additional column for <strong>QR Code Scanned At</strong> to the phishing CSV reporting data. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5477041619603'>How to Use QR Code Phishing Security Tests</a> article.</li>\n<li>\n<p>We have added three new badges to the Learner Experience! The new badges, Eager Beaver, Eagle Eye, and Linguist, can be enabled in your <strong>Account Settings</strong>. For more information see our <a href='https://support.knowbe4.com/hc/en-us/articles/360011915933'>How Do I Earn Badges?</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634#BADGES'>Learner Experience Guide</a> articles.</p>\n</li>\n<li>Resellers, Managed Service Providers (MSPs), and Multi-Account Organizations can now use our <strong>Training Activity Report</strong>. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5367086524051'>MSP/Reseller/Multi-Account Org: How to Customize and View Training Activity Reports</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>MediaPRO\n<ul>\n<li>1 Mobile-First module</li>\n<li>1 Compliance Plus poster</li>\n<li>5 Compliance Plus documents</li>\n<li>1 Compliance Plus Mobile-First module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>42 Compliance Plus modules</li>\n<li>1 Compliance Plus Mobile-First module</li>\n<li>1 video module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>3 training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>3 security documents</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 poster</li>\n<li>1 video module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2022</td>\n<td>\n<ul>\n<li>We have added the ability to use SCIM with OneLogin to manage your users and groups in KSAT. For more information on using SCIM, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5278551802003'>How to Configure SCIM for OneLogin</a>.</li>\n<li>You now have the option to integrate Cyren Inbox Security (CIS) with your PhishER platform. For more information see our <a href='https://support.knowbe4.com/hc/en-us/articles/4411071693843'>Cyren Inbox Security (CIS) Integration</a> article.</li>\n<li>We have added a<strong> Training Activity Report</strong> to the <strong>Reports</strong> tab. You can use these reports to view comprehensive data about your users' enrollments in training campaigns. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4417261034259-How-to-Customize-and-View-Training-Activity-Reports'>How to Customize and View Training Activity Reports</a> article.</li>\n<li>We have added the ability to use SCIM to manage your users and groups in KSAT. We currently support SCIM through Azure and Okta. For more information on using SCIM, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374-SCIM-Configuration-Guide'>SCIM Configuration Guide</a>.</li>\n<li>We revamped the design of the KSAT login pages. This new look is more dynamic and mobile-friendly.</li>\n<li>We have added a <strong>Notification History</strong> feature that allows you to see which training notifications you have sent to an individual user. You can see when each notification was sent, whether or not the notification was received, and the name of the notification template sent. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360053311074'>User Training Progress</a> article.</li>\n<li>We made a minor text change to User Messaging. The Scheduled Messages page has been renamed to Recurring Messages.</li>\n<li>Starting July 1st, 2022, we will no longer support versions of the Phish Alert Button (PAB) older than version 1.2.30 that use TLS 1.0. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4545964359699'>End of Support for Phish Alert Buttons Using TLS 1.0</a> article.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>We have released Season 4 of <em>The Inside Man</em> from our publisher Twist &amp; Shout! For more information, see <a href='https://blog.knowbe4.com/world-premiere-knowbe4s-new-season-4-of-netflix-style-security-awareness-video-series-the-inside-man'>this blog post</a>.</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 game</li>\n<li>2 posters</li>\n<li>4 newsletters and security documents</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 training module</li>\n<li>3 posters</li>\n<li>3 newsletters and security documents</li>\n<li>1 Mobile-First module</li>\n<li>2 Compliance Plus Mobile-First modules</li>\n<li>1 Compliance Plus module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 Compliance Plus module</li>\n<li>2 Compliance Plus Mobile-First modules</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>5 Mobile-First modules</li>\n<li>3 Compliance Plus Mobile-First modules</li>\n<li>3 Compliance Plus posters</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>3 Compliance Plus posters</li>\n<li>12 training modules</li>\n<li>7 Compliance Plus modules</li>\n<li>2 Mobile-First modules</li>\n<li>1 Compliance Plus newsletter and security document</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2022</td>\n<td>\n<ul>\n<li>When using <strong>AIDA Recommended Optional Learning</strong>, if a user has set their <strong>Training Language</strong>, content available in that language will be shown first in the user's recommendations and search results. For more information see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500002656002'>Optional Learning Guide</a>.</li>\n<li>We have added <strong>English (Great Britain)</strong> as an admin console language. For more information and the full list of available languages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a>.</li>\n<li>The phishing industry benchmarking data has been updated on your Dashboard, in Phishing Reports, and in Advanced Reports. For more information about industry benchmarking, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628'>Industry Benchmarking</a> article.</li>\n<li>We've made several usability updates to the <strong>Account Details</strong> page in the Management console. These updates include page-wide viewing, organized subscription information, details about the enabled features and settings for each account, and more. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013722293'>Viewing Your Accounts</a> article.</li>\n<li>For Smart Groups, we have added the <strong>Failed Phishing Test</strong> option to the <strong>PhishFlip Event</strong> and <strong>After Training</strong> criteria. This option counts the number of Phishing Security Tests a user has failed, instead of the number of failures the user has had. You may also notice that we rearranged the Phish Event drop-down menus. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115012819668'>How to Use Smart Groups</a> article.</li>\n<li>You can now remove user failures from a phishing campaign in bulk with a CSV file. When removing these failures, you can notify all console admins or specific admins of your choice.</li>\n<li>We have released <strong>AIDA Recommended Optional Learning</strong> for all Diamond accounts. This feature uses KnowBe4's Artificial Intelligence Driven Agent (<strong>AIDA</strong>) to automatically recommend content in the <strong>Library</strong> tab of the Learner Experience (LX). Each user will see optional training content that has been selected specifically for them. This feature also allows users to search for content within their Library tab. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500002656002'>Optional Learning Guide</a>.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>We have a new publisher named Kontra. Kontra produces security awareness training specifically for development teams.</li>\n<li>Kontra\n<ul>\n<li>4 training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>4 newsletters and security docs</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 newsletter and security doc</li>\n<li>1 Compliance Plus Mobile-First module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>2 Mobile-First modules</li>\n<li>1 Compliance Plus document</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>4 training modules</li>\n<li>2 Compliance Plus modules</li>\n<li>3 newsletters and security docs</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>1 Mobile-First module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2022</td>\n<td>\n<ul>\n<li>We are releasing a new feature called <strong>User Messaging</strong>. This feature allows you to send messages to users within the KSAT platform. You can send custom messages or our <a href='https://support.knowbe4.com/hc/en-us/articles/226314167'>Scam of the Week</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/115010414108'>Security Hints and Tips</a> newsletters. Users will be able to read their messages under the new <strong>Messages</strong> tab in the Learner Experience. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4416416555155'>User Messaging Guide</a>.</li>\n<li>You can now compare your organization's average <strong>Security Culture Survey (SCS)</strong> score to an average industry-specific SCS score. You can view this information in the corresponding widget on your <strong>Dashboard</strong>. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628#SCS'>Industry Benchmarking</a> article for more information.</li>\n<li>We've added a <strong>Create New User</strong> button to the <strong>Users</strong> tab of the KSAT console. You can now manually create a new user with details such as their first and last name, email, and job title. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204936887'>Users and Groups</a> article.</li>\n<li>For Smart Groups, we have added the <strong>Failed Phishing Test</strong> option to the <strong>Phish Event</strong> criteria. This option counts the number of Phishing Security Tests a user has failed, instead of the number of failures the user has had. You may also notice that we rearranged the Phish Event drop-down menu. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115012819668'>How to Use Smart Groups</a> article.</li>\n<li>For Smart Groups, we have retired the<strong> Vulnerable</strong> Phish Event option. The Vulnerable Plugins scan is a long-retired feature and now past results can no longer be used as criteria in Smart Groups.</li>\n<li>For training campaigns that include the Security Culture Survey (SCS), we have updated the <strong>Results by Dimension</strong> graph shown on the Assessment Results page.</li>\n<li>The Most Recent Phish-prone Percentage and the Your Last Phish-prone Percentage have changed names. They are now the Account Average Phish-prone Percentage and the Last Campaign Phish-prone Percentage respectively.</li>\n<li>We have added a new option for Brandable Content. When creating a branded theme, you can now include links to relevant documents or policies on the final page. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360047284433'>Brandable Content Guide</a> for more information.</li>\n<li>On the Training tab, we have made a minor text change to the Users tab and User Progress page of training campaigns. The “Download CSV” button now reads “Generate CSV”.</li>\n<li>New items added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>The Security Awareness Company\n<ul>\n<li>7 newsletters and security docs</li>\n<li>3 posters</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 Compliance Plus module</li>\n<li>1 poster</li>\n<li>3 newsletters and security docs</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>2 training modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>4 Compliance Plus modules</li>\n<li>2 Compliance Plus Mobile-First module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2021 Log'>\n<table style='table-layout: auto;'>\n<thead>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>December 2021</td>\n<td>\n<ul>\n<li>You can now integrate your KnowBe4 phishing and training data with Tessian to gain a more comprehensive view of your high-risk employees. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4412277821459'>How to Reduce Email Security Risk with Combined Insights from Tessian</a> article.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>2 newsletters and security docs</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 newsletters and security docs</li>\n<li>5 video modules</li>\n<li>2 training modules</li>\n<li>1 Mobile-First module</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>5 Compliance Plus modules</li>\n<li>2 Mobile-First modules</li>\n<li>1 video module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>8 Compliance Plus modules</li>\n<li>1 Compliance Plus newsletter and security doc</li>\n<li>4 Mobile-First modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 2021</td>\n<td>\n<ul>\n<li>We've added a new placeholder feature to the Branding section of your Account Settings. You can use this feature to add a prefix to the subject line of our phishing templates. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/226457887#BRANDING'>Branding</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>How to Edit Your Account Settings</a> article.</li>\n<li>We have added new functionality to our SAML feature in KSAT. You can now disable non-SAML logins for your users and allow admins to bypass their SAML login if they have multi-factor authentication enabled in their account. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887#SAML'>Account Settings</a> article.</li>\n<li>In preparation for the holiday season, we have created two new Security Hints and Tips newsletters, five new phishing templates, and a new holiday-themed landing page! All of these resources have been localized in our top 10 languages. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4408593351827'>Holiday-Themed Cybersecurity Kit</a> article.</li>\n<li>We updated the Dashboard so that you can customize your display by adding, removing, resizing, and rearranging widgets. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4405884798355'>How to Customize Your Widgetized Dashboard</a> article.</li>\n<li>On November 3rd, we made the following updates to our <a href='https://developer.knowbe4.com/rest/reporting'>Reporting API</a>:\n<ul>\n<li>Phishing endpoints:\n<ul>\n<li>Two legacy failures types will be removed from the responses vulnerable_plugin_count and exploited_count.</li>\n</ul>\n</li>\n<li>Training Campaign endpoints:\n<ul>\n<li>The modules array will be removed. Training module data will still be available in the content array.</li>\n</ul>\n</li>\n<li>Users, Groups, and Phishing Recipient endpoints:\n<ul>\n<li>The current adi_guid and active_directory_guid field names will be updated to provisioning_guid. The current adi_manageable field name will be updated to provisioning_managed.</li>\n</ul>\n</li>\n<li>Users and Groups endpoints:\n<ul>\n<li>\n<p>The current group_type value for a provisioning-managed group will be updated from adi_managed_group to provisioning_managed_group.</p>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>We now support multiple DMI instances in Microsoft 365. For more information about DMI, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360054494394-DMI-Configuration-Guide'>DMI Configuration Guide</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>2 training modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 game</li>\n<li>1 Mobile-First module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 newsletters and security docs</li>\n<li>1 Mobile-First module</li>\n<li>1 game</li>\n<li>1 security doc</li>\n</ul>\n</li>\n<li>SAYA University\n<ul>\n<li>1 video module</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>2 Mobile-First modules</li>\n<li>1 video module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>Released the 2022 version of the 45-minute KnowBe4 Security Awareness Training.</li>\n<li>2 Compliance Plus Mobile-First module</li>\n<li>3 Compliance Plus modules</li>\n<li>2 Compliance Plus posters</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2021</td>\n<td>\n<ul>\n<li>On November 3rd, we are making the following updates to our <a href='https://developer.knowbe4.com/rest/reporting'>Reporting API</a>:\n<ul>\n<li>Phishing endpoints:\n<ul>\n<li>Two legacy failures types will be removed from the responses vulnerable_plugin_count and exploited_count.</li>\n</ul>\n</li>\n<li>Training Campaign endpoints:\n<ul>\n<li>The modules array will be removed. Training module data will still be available in the content array.</li>\n</ul>\n</li>\n<li>Users, Groups, and Phishing Recipient endpoints:\n<ul>\n<li>The current adi_guid and active_directory_guid field names will be updated to provisioning_guid. The current adi_manageable field name will be updated to provisioning_managed.</li>\n</ul>\n</li>\n<li>Users and Groups endpoints:\n<ul>\n<li>\n<p>The current group_type value for a provisioning-managed group will be updated from adi_managed_group to provisioning_managed_group.</p>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>In the <strong>ModStore</strong> we made enhancements to our <strong>Phish-Prone Recommendations</strong>. Originally, these recommendations were based on your organization's phishing campaign results over time. Now, our Artificial Intelligence system also considers your organization's industry. For more information see our <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467'>ModStore and Library Guide</a>.</li>\n<li>For admins viewing the console in Japanese or Simplified Chinese, users are now displayed with their last name before their first name.</li>\n<li>We have updated our Reporting API to include new Risk Score History endpoints for Account, Users, and Groups. For more information, see our <a href='https://developer.knowbe4.com/rest/reporting'>API Documentation</a>.</li>\n<li>We have added a new tab under <strong>Phishing</strong>. The <strong>Ignored IPs</strong> tab allows you to block an individual IP address or a range of IP addresses to prevent false-positive phishing test failures. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4405834422291'>How to Use the IP Ignore List</a> article.</li>\n<li>You can now enroll individual users in any training campaign that is in progress. The <strong>Enroll Users</strong> option is great for when you have a user who is not a member of the enrolled groups, but who should take the assigned training within a campaign. For more information see our article titled <a href='https://support.knowbe4.com/hc/en-us/articles/115002986387'>Can I Enroll Users in a Training Campaign That Is in Progress?</a>\n</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>El Pescador\n<ul>\n<li>3 training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 newsletters and security docs</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>2 video modules</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>MediaPRO\n<ul>\n<li>8 Mobile-First modules</li>\n<li>3 Compliance Plus Mobile-First modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>Released the 2022 version of the 15-minute KnowBe4 Security Awareness Training.</li>\n<li>Released the 2022 KnowBe4 Security Awareness Training.</li>\n<li>1 Compliance Plus module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2021</td>\n<td>\n<ul>\n<li>We added a new burst limit to our APIs. The burst limits are 50 requests per minute and will start around five minutes from the first API request. For more information, see our <a href='https://developer.knowbe4.com/rest/reporting#tag/Rate-Limiting'>API Documentation</a>.</li>\n<li>We have improved the way that our API results are returned. The returned results are now listed in sequence with the request's response when the per_page parameters and page numbers are the same. For more information, see our <a href='https://developer.knowbe4.com/rest/reporting'>API Documentation</a>.</li>\n<li>We created a Cybersecurity Awareness Month video series with tips on how to develop and improve your organization's security awareness program. To watch these videos, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4406863822483-How-to-Develop-a-Successful-Security-Awareness-Program'>How to Develop a Successful Security Awareness Program</a> article.</li>\n<li>The <strong>Training Status by Campaign</strong> report received two new columns, <strong>Campaign Started</strong> and <strong>Campaign Complete</strong>.</li>\n<li>Under <strong>Reporting</strong>, the column labeled <strong>Failed %</strong> has been changed to <strong>Clicked %</strong> to better reflect your reporting data. This change will apply to the Reporting interface as well as downloaded PDF and CSV files.</li>\n<li>You can now save reports to be viewed at a later time or send saved reports to other users. You can also choose to schedule reports to be generated and sent at a set frequency. For more information, see our How to <a href='https://support.knowbe4.com/hc/en-us/articles/4406329132691'>Save and Send Reports</a> guide.</li>\n<li>When creating or editing an email template under <strong>My Templates</strong>, you can now indicate what language that template was written in. Custom templates with a language selected can then be used in localized phishing campaigns. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513#CREATE_PHISHING'>Localization Guide</a> for more information.</li>\n<li>We have created the new <strong>ASAP Profile</strong> page, which lists the information used to generate your program. Your ASAP Profile includes organizational information and the responses provided when your ASAP questionnaire was originally completed.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Twist &amp; Shout\n<ul>\n<li>6 videos for the new series \"Clickbait\"</li>\n<li>6 videos for season 2 of \"Restricted Intelligence HIPAA Edition\"</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>8 newsletters and security docs</li>\n<li>2 training modules</li>\n<li>4 posters</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>4 posters</li>\n<li>2 newsletters and security docs</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>5 newsletters and security docs</li>\n<li>5 videos</li>\n<li>3 Mobile-First modules</li>\n<li>2 training modules</li>\n<li>1 game</li>\n<li>3 posters</li>\n</ul>\n</li>\n<li>MediaPro\n<ul>\n<li>5 Compliance Plus Mobile-First modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>7 Compliance Plus modules</li>\n<li>1 Compliance Plus Mobile-First module</li>\n<li>2 Compliance Plus posters</li>\n<li>3 Compliance Plus newsletters and docs</li>\n<li>4 training modules</li>\n<li>2 Mobile-First modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2021</td>\n<td>\n<ul>\n<li>We added a new placeholder for use within the source code of phishing templates, training notifications, and landing pages. The <strong>[[brand_color]] </strong>placeholder populates the hex code of your organization's brand color that was set in <a href='https://support.knowbe4.com/hc/en-us/articles/115004742808-#COLOR'>Account Settings</a>.For more information see our article titled <a href='https://support.knowbe4.com/hc/en-us/articles/360009419893'>How do I Use the Branded Landing Pages, Training Notifications, and Email Templates?</a>\n</li>\n<li>We've added a new Placeholders feature under the Branding section of your Account Settings. This feature can be used to create a custom banner or signature block that you can add to your phishing emails, as well as adding custom colors for phishing templates, training notifications, and landing pages. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>How to Edit Your Account Settings</a> article.</li>\n<li>To better support learners during training, you can now customize the <strong>Need Help?</strong> button and the <strong>Help Desk</strong> link in the Learner Experience. This option can be enabled in the new <strong>Learner Assistance</strong> section of your Account Settings. Once enabled, enter the URL or contact email of your choosing. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634#OVERVIEW'>Learner Experience Guide</a>\n</li>\n<li>We are happy to announce that the admin console has been localized in six more languages! The new available languages are:\n<ul>\n<li>German</li>\n<li>French (Europe)</li>\n<li>French (Canada)</li>\n<li>Chinese (Mandarin) - Simplified</li>\n<li>Spanish (Europe)</li>\n<li>Spanish (Latin America)</li>\n<li>For more information and the full list of available languages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a>.</li>\n</ul>\n</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>The Security Awareness Company\n<ul>\n<li>2 newsletters and security docs</li>\n<li>3 Mobile-First module</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>MediaPro\n<ul>\n<li>1 Compliance Plus module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>1 Mobile-First module</li>\n<li>1 Compliance Plus module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2021</td>\n<td>\n<ul>\n<li>We released our new PhishER APIs to allow you to evaluate all of the suspicious emails that make it through to your users' inboxes. For more information, visit our <a href='https://developer.knowbe4.com/'>KnowBe4 API Reference Guide</a> and our <a href='https://support.knowbe4.com/hc/en-us/articles/4404258222099'>KnowBe4 PhishER API</a> article.</li>\n<li>We have added a drop-down menu to the <strong>Help</strong> button in your KSAT console. From this drop-down menu, you can Contact Support, access the Knowledge Base, see Product Demos, or check our Status Page.</li>\n<li>In ASAP, you can now change the start date of your program by clicking the <strong>Settings</strong> button. The dates for all of your incomplete tasks will automatically be updated based on the new start date. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115010358067'>ASAP article</a>.</li>\n<li>We have removed Switzerland as one of our supported countries for local dialing for our Vishing product.</li>\n<li>We have redesigned our Automated Security Awareness Program (ASAP) to make the process even easier! Now, the questionnaire is only seven questions long, we added auto-fill features for campaign creation, and the entire ASAP tab is available in all of our supported admin console languages. For more information on this update, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115010358067'>ASAP article</a>.</li>\n<li>A new version of RanSim is available. We added two new scenarios, which simulate two variants of ransomware (BlackKingDom and DearCry). See more info in our <a href='https://support.knowbe4.com/hc/en-us/articles/229040167-RanSim'>RanSim product manual</a>.</li>\n<li>Our Advanced Reporting feature has been renamed to Reporting. This change will be reflected across our Knowledge Base.</li>\n<li>You can now search for specific account domains and email addresses on the Accounts Search page in the Management console.</li>\n<li>Our CSV import feature now supports multiple groups and aliases to be added in the same line. For more information on this update, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204873347-How-Do-I-Import-Users-With-a-CSV-File-'>How Do I Import Users With a CSV file</a> article.</li>\n<li>You can now exclude training campaigns that do not have an end date from the leaderboard calculation. You can toggle this option in the Learner Experience section of your Account Settings, under Leaderboard.</li>\n<li>We have improved the functionality of cloning a training campaign that includes retired content. Now, when a campaign is cloned, the retired content will not be included in the new campaign.</li>\n<li>We've started to roll out updates to the Advanced Reporting tab of your KnowBe4 Console. These updates include a new user interface, several new reports, and minor usability changes to provide the best report results. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894-Advanced-Reporting-Guide'>Advanced Reporting Guide</a> for more information.</li>\n<li>We have started to release our new Download Center feature to help track downloadable reports that have been generated on your account. See our <a href='https://support.knowbe4.com/hc/en-us/articles/4403282239891-Download-Center-Guide'>Download Center Guide</a> for more information.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>El Pescador\n<ul>\n<li>4 video modules</li>\n<li>2 posters</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>6 Mobile-First modules</li>\n<li>2 videos</li>\n</ul>\n</li>\n<li>MediaPro\n<ul>\n<li>1 Compliance Plus module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>5 newsletters and security docs</li>\n<li>3 posters</li>\n<li>2 games</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>1 video</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2021</td>\n<td>\n<ul>\n<li>We've added a new phish link domain to use in your simulated phishing tests. To view the new domains, go to <strong>Phishing</strong> &gt; <strong>Domains</strong>, then click the <strong>Show Hidden Domains</strong> toggle at the top of the page. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360061705153'>Phishing Domain Management</a> article.</li>\n<li>We are happy to announce that we have localized 12 of our Security Hints and Tips emails into 34 languages. To share these with your users, follow the <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513-Localization-Guide#CREATE_PHISHING'>Create a Localized Phishing Campaign</a> steps in our Localization Guide.</li>\n<li>You now have the option to include archived users when viewing the Users tab of a training campaign and the User Progress page of a specific training course. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360053311074'>User Training Progress </a>article for details.</li>\n<li>We have updated the Security Culture Index to be more accurate and informative. See our article <a href='https://support.knowbe4.com/hc/en-us/articles/360037393134'>What is the Security Culture Survey (SCS)?</a> for more information.</li>\n<li>Our new Compliance Plus training subscription is now available as an add-on for current KSAT customers! Just as security awareness training creates a strong human firewall, Compliance Plus content gives your users the tools they need to help mitigate risk. See our <a href='https://www.knowbe4.com/compliance-plus'>Compliance Plus</a> product page for more information.</li>\n<li>You can now add an email alias for your users. This alias can be added by editing your user's information directly or by importing a CSV file. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974-User-Profile-Guide#USERINFO'>User Profile Guide</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/204873347'>How Do I Import Users With a CSV File</a> article for more information.</li>\n<li>We've added the ability to add custom subdomains to the KSAT console. Admins can now create custom subdomains and use them as phish link domains for phishing emails. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4402065654675-How-to-Create-Custom-Subdomains'>How to Create Custom Subdomains</a> article.</li>\n<li>We upgraded the appearance of all of our built-in Security Hints &amp; Tips. This change will not affect custom, saved templates. To view this update, navigate to <strong>Phishing</strong> &gt; <strong>Email Templates</strong> &gt; <strong>System Templates</strong> and preview any template in a Security Hints &amp; Tips category.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>El Pescador\n<ul>\n<li>3 video modules</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>4 training modules</li>\n<li>6 newsletters and security docs</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>Saya University\n<ul>\n<li>3 video modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 newsletters and security docs</li>\n<li>3 video modules</li>\n<li>1 training module</li>\n<li>1 Mobile-First module</li>\n<li>7 posters</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>6 video modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 poster</li>\n<li>1 training module</li>\n<li>Compliance Plus conent:\n<ul>\n<li>1 poster</li>\n<li>3 newsletters and security docs</li>\n<li>2 training module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2021</td>\n<td>\n<ul>\n<li>AIDA Selected templates can now be used in localized phishing campaigns! See our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a> for more information.</li>\n<li>Resellers, Managed Service Providers (MSPs), and Multi-Account Organizations can now use AIDA Selected phishing templates in their Managed Phishing Campaigns.</li>\n<li>We have released our new PhishFlip feature! This feature allows you to create KSAT phishing templates from the user-reported emails that were sent to PhishER. See our <a href='https://support.knowbe4.com/hc/en-us/articles/1500005846941-PhishFlip'>PhishFlip</a> article for more information.</li>\n<li>Our new Mobile-First Modules are now available in the ModStore! These types of modules are specifically designed for use on mobile devices. See our <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467#CONTENT'>ModStore</a> article for more information.</li>\n<li>We released Custom DKIM signatures for both phishing and training campaigns. Admins can now use allowed domains as signing domains for KnowBe4 emails. For more information, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/1500010872521'>How to Enable and Customize DKIM Signatures</a> article.</li>\n<li>We released the Hybrid Phish Alert Button (PAB) for Microsoft 365 and the Exchange server automatically detects your users' mail client and backend server to configure the best version of the Phish Alert Button for that environment. For more information, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/1500003848221-Hybrid-Phish-Alert-Button-Product-Manual'>Hybrid Phish Alert Button Product Manual</a>.</li>\n<li>We released the Gmail Add-on Phish Alert Button (PAB) for Google Workspace. For more information, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/360047563854-Gmail-Phish-Alert-Button-Add-on-Product-Manual'>Gmail Phish Alert Button Add-on Product Manual</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Security Awareness Company\n<ul>\n<li>2 video module</li>\n<li>1 training module</li>\n<li>3 Mobile-First modules</li>\n<li>2 newsletters and security docs</li>\n</ul>\n</li>\n<li>Saya University\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>2 Mobile-First modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>2 Mobile-First modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>3 Mobile-First modules</li>\n<li>1 poster</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2021</td>\n<td>\n<ul>\n<li>You can now sign out of all current sessions of your KnowBe4 console from your admin or user profile. Click on your email in the right-hand corner and select <strong>Profile</strong>. Then, click the <strong>Sign Out of All Sessions</strong> button at the bottom of the page.</li>\n<li>We are gradually releasing a change to the maximum session length for all users. This may impact the <strong>User Settings </strong>currently saved in your Account Settings. See the changes listed below.\n<ul>\n<li>\n<p>After 8 hours of inactivity, all admin console and learner experience sessions will time out. When the user returns, they will be asked to sign in again.</p>\n</li>\n<li>\n<p>All admin console and learner experience sessions will be restricted to 12 hours—regardless of activity. A notification will display prompting the user to sign out before the session ends. If they do not sign out, the session will end and the user will be asked to sign in again to continue.</p>\n</li>\n</ul>\n</li>\n<li>Diamond &amp; Phishing Premium customers can now use the new AIDA Selected option in phishing campaigns. This feature uses data from KnowBe4's Artificial Intelligence Driven Agent (AIDA) to select the most relevant and challenging template for each user. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500003848062'>Automated Template Selection</a> article.</li>\n<li>We have added a new option to the SAML section of your <strong>Account Settings</strong>. Enabling the <strong>Sign SP AuthnRequest</strong> option allows you to digitally sign the SAML AuthnRequest sent from the KnowBe4 service provider to your identity provider.</li>\n<li>We are adding a new tile to the Dashboard of your KnowBe4 console. The tile is labeled <strong>Security Awareness Proficiency Assessment (SAPA)</strong> and it shows your organization's average SAPA score by knowledge area. You can also compare your scores to other organizations in your industry. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628'>Industry Benchmarking</a> article for more information.</li>\n<li>We've added a new <strong>Show Remote Images</strong> toggle to all of our System Phishing Templates and our System Training Templates that contain images. Disabling this toggle will hide all of the images that are in the template. By default, this toggle is enabled for our System Phishing and Training Templates. For more information on this new feature, see our <a href='https://support.knowbe4.com/hc/en-us/articles/233412567-Help-The-images-in-my-phishing-template-are-not-showing-up-correctly-'>Frequently Asked Questions</a> article.</li>\n<li>Throughout your KnowBe4 console, the date and time pop-up windows have been redesigned for better usability.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Security Awareness Company\n<ul>\n<li>8 newsletters and security docs</li>\n<li>9 video modules</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>5 training modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>Saya University\n<ul>\n<li>2 training module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2021</td>\n<td>\n<ul>\n<li>We've made updates to the sender email addresses for our System Phishing Templates.</li>\n<li>We have released our new <strong>Optional Learning</strong> feature. You can now provide users with extra training from the ModStore that is not required. Optional learning will be listed in the <strong>Library</strong> tab of the Learner Experience. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500002656002'>Optional Learning Guide</a>.</li>\n<li>We have redesigned the Account Settings of your KnowBe4 console for better usability. See our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings </a>article for more information.</li>\n<li>Our SCIM service is being reworked and new SCIM setups are currently unavailable. Our next version of SCIM is estimated to be released in Q2 2021. Current SCIM setups are still supported.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Saya University\n<ul>\n<li>2 training modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>6 posters</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>5 training modules</li>\n<li>2 video modules</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>8 video modules</li>\n<li>3 training modules</li>\n<li>4 newsletters and security docs</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>7 training modules</li>\n<li>8 newsletter and security docs</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>Lawpilots\n<ul>\n<li>5 training modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2021</td>\n<td>\n<ul>\n<li>We have added a new section to your account settings called <strong>Account Privacy</strong>. Here, you can grant or restrict KnowBe4's access to your account. See <a href='https://support.knowbe4.com/hc/en-us/articles/360061335614'>this article</a> for more information.</li>\n<li>We have added new phish link domains to use in your simulated phishing tests. To view the new domains, go to <strong>Phishing &gt; Domains</strong>, then click the <strong>Show Hidden Domains</strong> toggle at the top of the page. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360061705153'>Phishing Domain Management</a> article.</li>\n<li>The options English (Australian) and English (Canadian) are no longer available as a Training Language. Users with either of these languages selected will be changed to English (Great Britain).</li>\n<li>In your Account Settings, under Users, you'll see the new setting <strong>Only allow console sessions from one IP at a time.</strong> Enabling this setting adds another layer of security by preventing admins and security role users from having simultaneous console sessions on multiple IP addresses.</li>\n<li>When importing users via CSV file or downloading a CSV user list, the column <strong>AD Managed</strong> is now <strong>Provisioning Managed</strong>. You can see this change noted on the Import User section and in the third example CSV file. See <a href='https://support.knowbe4.com/hc/en-us/articles/204873347#FIELDS'>this article</a> for more information.</li>\n<li>When uploading <a href='https://support.knowbe4.com/hc/en-us/articles/360019644394'>custom content</a>, you are required to upload a thumbnail for your content. For a better user experience, this artwork is now required to be a square image.</li>\n<li>The industry benchmarking data has been updated on your Dashboard, in Phishing Reports, and in Advanced Reports. Our benchmarking data was gathered from over 6 million users across over 23,000 customers. For more information on our industry benchmarking, please see <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628-Industry-Benchmarking'>this article</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>4 training modules</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>3 video modules</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>Inside Man season 3</li>\n<li>13 video modules</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 newsletter and security doc</li>\n<li>4 video modules</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>4 newsletters and security docs</li>\n<li>2 video modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2021</td>\n<td>\n<ul>\n<li>We have added <strong>Browser Language Detecting</strong> landing pages that automatically display in the same language as the user's browser. See <a href='https://support.knowbe4.com/hc/en-us/articles/360036273333-Landing-Page-Category-Glossary#B'>this article</a> for more information.</li>\n<li>You can now use the <strong>Same Random</strong> option when sending a localized phishing campaign. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513#CREATE_PHISHING'>Localized Phishing Campaign</a> section of our Localization Guide.</li>\n<li>We have released the new localization setting, Admin Console Language. Now admins can use their KnowBe4 console in one of three languages: English (United States), Japanese, or Portuguese (Brazil). To learn how to set your Admin Console Language, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a>.</li>\n<li>We've added a new section to the <strong>Phishing</strong> tab of your KnowBe4 console. The <strong>Domains</strong> subtab allows you to manage phish link domains for use in phishing campaigns. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360061705153'>Phishing Domain Management</a> article.</li>\n<li>We've added two new buttons in the SCIM section of your Account Settings:\n<ul>\n<li>The<strong> Force Sync Now</strong> button syncs data from your KnowBe4 SCIM database, without requiring a change from your Identity Provider.</li>\n<li>The <strong>Clear SCIM Database</strong> button clears the contents of your KnowBe4 SCIM database but does not impact the user information in your console.</li>\n</ul>\n</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>1 newsletter and security doc</li>\n<li>8 training modules</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>3 newsletters and security docs</li>\n<li>2 video modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 newsletter and security doc</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2020 Log'>\n<table style='table-layout: auto;'>\n<thead>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>December 2020</td>\n<td>\n<ul>\n<li>As of January 1st, 2021 we will no longer support Microsoft Internet Explorer (IE) or Edge Legacy as a compatible browser for the KnowBe4 admin console and the PhishER console. We will continue to support IE and Edge Legacy for end users on the Learner Experience.</li>\n<li>During December, we are releasing new localization features. This release allows you to send phishing security tests and training notifications in your users' preferred languages. You can also update user languages individually or in bulk using a CSV file. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide </a>for more information.</li>\n<li>We've localized our Learner Experience (LX) into eight additional languages:\n<ul>\n<li>Chinese Traditional</li>\n<li>Danish</li>\n<li>Finnish</li>\n<li>Romanian</li>\n<li>Swahili</li>\n<li>Thai</li>\n<li>Turkish</li>\n<li>UkrainianTo learn more about this feature and see what other languages are available, see this <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634-Learner-Experience-Guide#LOCALIZE'>article</a>.</li>\n</ul>\n</li>\n<li>User notifications from the KnowBe4 console, such as welcome emails and password reset notifications, are now localized and will be sent in the user's preferred training language. For more information on how your users' preferred language is selected, see <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634-Learner-Experience-Guide#LOCALIZE'>this article</a>.</li>\n<li>We made some text updates to Advanced Reporting, for a more concise and cohesive experience.</li>\n<li>We have added the columns <strong>Phishing Language</strong> and <strong>Training Language</strong> to the downloadable CSV versions of your phishing and training reports. This change does not impact any of the Advanced Reporting CSV files.</li>\n<li>We added the ability to track individual user scores for eligible training content. This option can be enabled on the Training Campaign creation screen. Scores will be displayed on the user's timeline and on the Users subtab of the training campaign.</li>\n<li>We are rolling out content options for eligible training content. You can edit these options for content in your Library that shows a gear icon next to the name. The first available option is to enable Non-Skip. More options will be released next year.</li>\n<li>We released updates to the <a href='https://support.knowbe4.com/hc/en-us/articles/227567968'>Vishing</a> feature of your KnowBe4 Console. You may notice the Vishing tab has faster speeds, improved functionality, and an enhanced user interface.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Security Awareness Company\n<ul>\n<li>9 video modules</li>\n<li>1 newsletter and security doc</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 training module</li>\n<li>1 video module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>9 training modules</li>\n</ul>\n</li>\n<li>Saya University **<em>new publisher!</em>**\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>5 newsletters and security docs</li>\n<li>1 game</li>\n<li>New translations available for the video module \"Stay Safe for the Holidays\"</li>\n<li>The 45-minute 2021 KnowBe4 Security Awareness Training</li>\n<li>The 30-minute 2021 KnowBe4 Security Awareness Training - 30min.</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 2020</td>\n<td>\n<ul>\n<li>We have created three articles to help you keep track of all the videos we offer for KSAT, PhishER, and our free tools.\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360000913668'>KSAT Tutorial Videos</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360057471914'>PhishER Tutorial Videos</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360057471414'>Free Tools Tutorial Videos</a></li>\n</ul>\n</li>\n<li>We made some text changes on the Account Settings page for a more concise and cohesive experience.</li>\n<li>The option to enable MFA in your admin profile has been redesigned to behave the same as the MFA option on a User's Profile page.</li>\n<li>We released our new Direct Message Injection (DMI) feature for Microsoft 365 users. DMI eliminates the need to whitelist simulated phishing emails by creating a secure link between your KnowBe4 console and your Microsoft 365 Account. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360054494394'>Direct Message Injection Guide </a>for more information.</li>\n<li>We have updated Vishing to call users from a number in the same country if a number from the same city is not available.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>The Security Awareness Company\n<ul>\n<li>2 newsletters and security docs</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>1 video module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2020</td>\n<td>\n<ul>\n<li>You can now integrate your KnowBe4 Security Awareness Console with your PhishER platform. You can now send PhishER Events and Actions to the user timeline and create Smart Groups based on the information that you gather from your users through this integration. For more information, please visit our <a href='https://support.knowbe4.com/hc/en-us/articles/360013919314-PhishER-Settings#KMSAT'>PhishER Settings</a> article.</li>\n<li>We released updates to the Advance Reporting feature of your KnowBe4 Console. You may notice the Reports tab has faster speeds, improved functionality, and an enhanced user interface.</li>\n<li>You can now update the training progress of your users in bulk using a CSV file. The Bulk Update option allows you to pass and reset the progress of multiple users for a training campaign or single training course. You can also use this feature to remove multiple users from a training campaign. See the Bulk Progress Update section of<a href='https://support.knowbe4.com/hc/en-us/articles/204726068'> this article</a> for more information.</li>\n<li>We have added SCIM support for Azure Active Directory and will be rolling out this feature during October. As part of this release, the Active Directory tab has been renamed to Provisioning. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374'>SCIM Configuration Guide</a> to learn more about SCIM.</li>\n<li>Our Free Tool, the Email Exposure Check, has been integrated with your KnowBe4 Security Awareness console. This is integration allows you to create monthly email exposure checks on your account's users to ensure that their information has not been found in any recent data breaches. For more information on this new integration, visit the <a href='https://support.knowbe4.com/hc/en-us/articles/210465178-Email-Exposure-Check-Pro-EEC-Pro-'>Email Exposure Check</a> article on our Knowledge Base.</li>\n<li>We released updates to the Dashboard of your KnowBe4 Console to improve functionality and streamline the user interface.</li>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/360015575313'>Quarterly Product Update video</a> in our Knowledge Base. This video covers new features that have been added to your Security Awareness Training platform over the previous quarter.</li>\n<li>October is Cybersecurity Awareness Month. To celebrate, we have created new landing pages and a weekly series of Security Hints and Tips newsletters.\n<ul>\n<li>The following landing pages are available under the Generic landing page category:\n<ul>\n<li>Cybersecurity Awareness: Password Safety</li>\n<li>Cybersecurity Awareness: Lock Your Screen</li>\n<li>Cybersecurity Awareness: Nightmare on Phish Street</li>\n<li>Cybersecurity Awareness: Cybersecurity Myths</li>\n</ul>\n</li>\n<li>The following templates are available under the Security Hints&amp;Tips (Not PST) and Security Hints&amp;Tips (Branded) (Not PST) System Categories:\n<ul>\n<li>Cybersecurity Awareness Month - Week 1: How to Use Cybersecurity in Your Everyday Life</li>\n<li>Cybersecurity Awareness Month - Week 2: How to Keep Your Organization Safe—In and Out of the Office</li>\n<li>Cybersecurity Awareness Month - Week 3: How to Safely Use Telehealth Services</li>\n<li>Cybersecurity Awareness Month - Week 4: How to Be Prepared for Future Threats</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>1 newsletter and security doc</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>2 video modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>3 video modules</li>\n<li>3 training modules</li>\n<li>5 newsletters and security docs</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 poster</li>\n<li>1 game</li>\n<li>9 newsletters and security docs</li>\n<li>1 video module</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2020</td>\n<td>\n<ul>\n<li>We've added the ability to add languages to the Microsoft 365 version of the Phish Alert Button. For more information, please see our <a href='https://support.knowbe4.com/hc/en-us/articles/360053756533-Adding-Languages-to-the-Phish-Alert-Button'>Adding Languages to the Phish Alert Button</a> article.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>The Security Awareness Company\n<ul>\n<li>1 video module</li>\n<li>2 newsletters and security docs</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 game</li>\n<li>4 training modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 poster</li>\n</ul>\n</li>\n<li>Twist and Shout\n<ul>\n<li>12 video modules</li>\n<li>6 training modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>2 training modules</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>3 video modules</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>A new placeholder was added: [[knowbe4_domain]]\n<ul>\n<li>This placeholder populates the KnowBe4 domain. While [[domain]] populates the email recipient's domain, [[knowbe4_domain]] populates the KnowBe4 domain.</li>\n<li>See our <a href='https://support.knowbe4.com/hc/en-us/articles/204949707-How-To-Use-Placeholders'>Placeholders</a> article for more information.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2020</td>\n<td>\n<ul>\n<li>We've updated our Security Culture Survey to include new questions. The survey is also now available in additional languages. For more information on the Security Culture Survey check out our <a href='https://support.knowbe4.com/hc/en-us/articles/360037393134'>What is the Security Culture Survey (SCS)?</a> article.</li>\n<li>We've added the ability to generate a unique entity ID to use when setting up single sign-on (SSO). You may want to use this feature if you have multiple accounts and your Identity Provider is unable to accept the same entity ID for each account. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/226457887/#SAML'>SAML</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887/'>How to Edit Account Settings</a> article.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>5 video modules</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 video module</li>\n<li>2 training modules</li>\n<li>5 newsletters and security docs</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>2 newsletters and security docs</li>\n<li>2 training modules</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>The Learner Experience (LX) for your users now includes a new Learner Dashboard. Here users will see a summary of their training completion including the training status and due dates. Optionally, you can choose to show the user's Phishing Test Results, Personal Risk Score, and gamification statistics.This new feature is disabled by default, but you can enable it by going to your Account Settings. <a href='https://support.knowbe4.com/hc/en-us/articles/360051484394'>See this article</a> for more information.</li>\n<li>In the first week of August, you'll see the following changes to the Users tab:\n<ul>\n<li>The Users, Groups, Import Users, Active Directory, Merge Users, and Security Roles tabs have been redesigned for better usability.</li>\n<li>The User and Group tabs have new filtering options, a more streamlined interface, and some text updates including a better format for selecting Smart Group criteria.</li>\n<li>A User's Profile is no longer one page, but is now organized into subtabs. This includes a new User Dashboard where you can see an overview of the user's security awareness training.</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360052372333'>Click here</a> for more information on these changes.</li>\n</ul>\n</li>\n<li>To help you troubleshoot issues that may arise when uploading Custom Content, we have created distinct error messages. See <a href='https://support.knowbe4.com/hc/en-us/articles/360019092633'>this article</a> for more information.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2020</td>\n<td>\n<ul>\n<li>We've added a new <strong>Phish-Prone Recommended</strong> section in the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> to include data-driven recommendations that create a more personalized experience. These recommendations are based on your users' Phishing Test results and are recommended to help improve your results over time. To learn more, check out the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore#NAVIGATE'>How do I navigate the content sections?</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> article.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>exploqii\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 assessment</li>\n<li>1 newsletter and security doc</li>\n<li>2 training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 training modules</li>\n<li>7 newsletters and security docs</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 training module</li>\n<li>4 posters</li>\n<li>6 video modules</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>We've added a new drop-down option called <strong>Font Size</strong> to our WYSIWYG editor to allow you to quickly change the size of the font in training notifications, phishing emails, and landing pages. As part of this update, we've added two new font options: Impact and Palatino. You can select these options from the <strong>Font</strong> drop-down menu. For more information on creating phishing emails and landing pages please read our <a href='https://support.knowbe4.com/hc/en-us/articles/204240768-Customizing-Emails-Landing-Pages'>Customizing Emails and Landing Pages</a> article and for information on creating training notifications read our <a href='https://support.knowbe4.com/hc/en-us/articles/360001547908-Customizing-Training-Notifications'>How Do I Edit or Create Training Notifications?</a> article.</li>\n<li>We revamped the design of our classic <strong>Oops!</strong> and <strong>SEI</strong> landing pages! This new look is mobile-friendly and is localized in over thirty languages. These new landing pages are available under the <strong>Generic</strong> and <strong>SEI (Platinum/Diamond Only)</strong> landing page categories. The new Oops landing page design will be the default for all phishing campaigns but you can still access and use our classic Oops page, which will remain available under the <strong>Generic</strong> and <strong>SEI (Platinum/Diamond Only)</strong> landing page categories.</li>\n<li>We have updated the way the Job Function risk score factor is calculated. This could greatly impact your user, group, and organization risk scores. <a href='https://support.knowbe4.com/hc/en-us/articles/360050531994'>See this article for more information</a>.</li>\n<li>We're making some updates to the <strong>USB</strong> tab of your KnowBe4 console. You may notice faster speeds, improved functionality, and some minor user interface enhancements.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2020</td>\n<td>\n<ul>\n<li>The Management Console now offers the ability to create a managed phishing campaign. A managed phishing campaign can be used to create a phishing campaign across multiple accounts. To learn more about this feature, check out our article <a href='https://support.knowbe4.com/hc/en-us/articles/360049400313-MSP-Reseller-Multi-Account-Org-How-to-Create-a-Managed-Phishing-Campaign'>How to Create a Managed Phishing Campaign</a>.</li>\n<li>We've added the ability to overwrite the return-path header with the reply-to address for reply-to campaigns. This option can be found in your Account Settings. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Settings#PHISHHEADERS'>Account Settings article</a>.</li>\n<li>We've added 6 new entries to our Landing Domains. Customers who require our phish domains, please request an updated list from the <a href='https://support.knowbe4.com/hc/en-us/requests/new'>support team</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>2 training modules</li>\n<li>3 video modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 newsletters and security docs available in 18 languages</li>\n<li>5 video modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 poster</li>\n<li>1 newsletter and security doc</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>2 video modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2020</td>\n<td>\n<ul>\n<li>We've added a new option to your <strong>Account Settings</strong> page under the Phishing section. You can now specify the domain used for the [[domain]] placeholder on phishing templates and landing pages. To learn more, see <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Setting#PHISHING'>this article</a>.</li>\n<li>We now support the full UTF-8 character set. You may now use email addresses with UTF-8 characters, including international characters.</li>\n<li>We've added a new option to your <strong>Account Settings</strong> page under the Phishing section. You now have the ability to disable specific attachment attack vectors from being sent out during a phishing campaign. To learn more, see <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Setting#PHISHING'>this article</a>.</li>\n<li>We made the following changes to the Training tab and ModStore in the month of May:\n<ul>\n<li>The Campaigns, Notification Templates, Policies, and Reports tabs have been redesigned for better usability.\n<ul>\n<li>The graph on a Campaign's Overview page has changed to include information about the User's Completion Activity in a monthly format instead of the previous Daily User Completion Activity.</li>\n<li>You can create a PDF and URL Policy from the Policy dropdown menu. You can also add Policies in multiple languages by clicking the +Add Language button. For more information, <a href='https://support.knowbe4.com/hc/en-us/articles/360001641907-How-to-Create-and-Manage-Policies-in-Your-KnowBe4-Console'>click here</a>.</li>\n</ul>\n</li>\n<li>The Store Purchases and Uploaded Content tabs have moved to the ModStore. Store Purchases has been renamed to Library and includes new ways to sort and analyze saved content.\n<ul>\n<li>You can now search your Library using keywords, sort by the content type and/or status, hide content, and remove unused content.</li>\n<li>For content you have used in a campaign, you can now view a Usage Summary. This summary includes the percentage of completed users, which campaigns contain this content, and how your users rated their experience.</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-and-Content-Management#MANAGINGSTOREPURCHASES'>Click here</a> for more information on the Library.</li>\n</ul>\n</li>\n<li>The My Training tab is retiring. To access your assigned training, click your email in the top right corner and select “My Training”.<a href='https://support.knowbe4.com/hc/en-us/articles/360047547314'>Click here</a> for more information on these changes.</li>\n</ul>\n</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Exploqii\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>4 video modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>5 video modules</li>\n<li>6 newsletters and security docs</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>2 newsletters and security docs</li>\n<li>2 training modules</li>\n<li>6 video modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2020</td>\n<td>\n<ul>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/360015575313-Video-Quarterly-Product-Update-April-2020-'>Quarterly Product Update video</a> in our Knowledge Base. This video covers new features that have been added to your Security Awareness Training platform over the previous quarter.</li>\n<li>The <strong>English - South Africa</strong> phishing template category was renamed to <strong>English - Africa</strong>.</li>\n<li>The new <strong>Brandable Content</strong> feature is now available in the ModStore. This feature allows you to add a branded theme to an active training campaign with eligible content. To learn more about this feature, see this <a href='https://support.knowbe4.com/hc/en-us/articles/360047284433-Brandable-Content'>article</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Twist and Shout\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>The Security Awareness Company:\n<ul>\n<li>2 newsletters available in 18 languages</li>\n<li>2 posters</li>\n<li>1 game</li>\n<li>2 newsletter and security docs</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 newsletter and security doc</li>\n<li>5 video modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>2 newsletters and security docs</li>\n<li>1 video module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>2 newsletters and security docs</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2020</td>\n<td>\n<ul>\n<li>We've updated three of our Free Tools RanSim and the Phishing Security Test to include 3 new simulations for RanSim and a new phishing template based on COVID-19 for the Phishing Security Test.</li>\n<li>We've localized our Learner Experience (LX) into six additional languages. The new languages are:\n<ul>\n<li>Czech</li>\n<li>Hindi</li>\n<li>Indonesian</li>\n<li>Korean</li>\n<li>Malay</li>\n<li>PolishTo learn more about this feature and see what other languages are available, see this <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634-Learner-Experience-Guide#LOCALIZE'>article</a>.</li>\n</ul>\n</li>\n<li>We've added 4 new Coronavirus-themed <a href='https://support.knowbe4.com/hc/en-us/articles/227567968'>vishing</a> templates:\n<ul>\n<li>Coronavirus Stimulus Package (SSN)</li>\n<li>Coronavirus Testing Kit (SSN)</li>\n<li>Coronavirus School Schedule (SSN)</li>\n<li>Increased Coronavirus Cases in Your Area (Zip Code)</li>\n</ul>\n</li>\n<li>An entry was added to our Phish Link Domains. Customers who require our phish domains, please <strong>request an updated list</strong> from the Support team.</li>\n<li>We've added a new topic called <strong>Working Remotely</strong> under <strong>Topics</strong> &gt; <strong>Popular Topics</strong> in the ModStore.<span>This new topic filter highlights the training content that will help teach your users how to stay safe online while working from home. Click the <strong>ModStore</strong> tab now to review what's available. </span>\n</li>\n<li>We've updated the interface for our in-platform release notes. These release notes are designed to keep you updated on major features and updates to your platform. For more information on in-platform release notes, check out <a href='https://support.knowbe4.com/hc/en-us/articles/360015497494-In-Platform-Release-Notes'>this article</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n<li>1 newsletter and security doc</li>\n<li>3 video modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n<li>2 newsletters and security docs</li>\n<li>2 video modules</li>\n</ul>\n</li>\n<li>Twist and Shout\n<ul>\n<li>14 video modules</li>\n<li>2 posters</li>\n</ul>\n</li>\n<li>Exploqii\n<ul>\n<li>2 newsletters and security docs</li>\n<li>9 video modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 training module</li>\n<li>1 newsletter and security doc</li>\n<li>6 video modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>4 video modules</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2020</td>\n<td>\n<ul>\n<li>Training notifications now include DKIM signatures. Signing domains are:\n<ul>\n<li>US: <strong>training.knowbe4.com</strong>\n</li>\n<li>EU: <strong>eu.knowbe4.com</strong>\n</li>\n</ul>\n</li>\n<li>We've added the ability to add a DKIM signature to your Phishing emails. You can do this from the Phishing section of your Account Settings page. See <a href='https://support.knowbe4.com/hc/en-us/articles/226457887#PHISHHEADERS'>this article</a> for more information.</li>\n<li>Our translated and localized phishing template category names were updated to follow this naming convention: Language - Region.</li>\n<li>We've added the following new <a href='https://support.knowbe4.com/hc/en-us/articles/115011714968-Phishing-Template-Category-Glossary'>phishing template categories</a>:\n<ul>\n<li>Romanian</li>\n<li>Swahili</li>\n<li>Chinese Traditional- Taiwan</li>\n</ul>\n</li>\n<li>\n<div>We've updated three of our Free Tools, the Weak Password Test, Breached Password Test, and Password Exposure Test to make some improvements on how the tools run. The new version numbers for the tools are listed as follows:</div>\n<ul>\n<li>Weak Password Test: version 1.0.0.48</li>\n<li>Breached Password Test: version 1.0.0.41</li>\n<li>Password Exposure Test: version 1.0.2.50</li>\n</ul>\n</li>\n<li>The Security Awareness Training platform now supports self-service SAML. You can enable and set up SAML from your Account Settings page. See <a href='https://support.knowbe4.com/hc/en-us/articles/360041935913-How-to-Set-Up-SAML-SSO-for-the-Security-Awareness-Training-Platform'>this article</a> for more information.</li>\n<li>The industry benchmarking data has been updated on your Dashboard, in Phishing Reports, and in Advanced Reports. Our benchmarking data was gathered from over 4 million users across over 17,000 customers. For more information on our industry benchmarking, please see <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628-Industry-Benchmarking'>this article</a>.</li>\n<li>We've made updates to the ModStore in your KnowBe4 account. You may notice faster speeds, improved functionality, and major user interface enhancements.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>2 video modules</li>\n<li>5 posters</li>\n<li>5 newsletters and security docs</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>2 newsletters and security docs</li>\n<li>16 training modules</li>\n</ul>\n</li>\n<li>Twist and Shout\n<ul>\n<li>19 video modules</li>\n<li>2 posters</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>3 training modules</li>\n<li>3 posters</li>\n<li>3 newsletter and security docs</li>\n<li>2 newsletters available in 18 languages</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2020</td>\n<td>\n<ul>\n<li>We're in the process of updating our server-side ADI processing. You will notice increased sync processing speed in the near future. However, there are no functional changes to how users, groups, and memberships are synced.</li>\n<li>We've updated the algorithm behind the Security Culture Survey results to provide you with a more accurate security culture score. For more information about the Security Culture Survey, see <a href='https://support.knowbe4.com/hc/en-us/articles/360037393134-What-is-the-Security-Culture-Survey-SCS-'>this article</a>.</li>\n<li>We've added the ability to download a json formatted text file of all Active Directory sync changes and download errors. You'll find this feature on the Details Page of any selected ADI sync.</li>\n<li>An entry was added to our Phish Link Domains. Customers who require our phish domains, please <strong>request an updated list</strong> from the Support team.</li>\n<li>We've released a new user agreement that requires account admins to accept our standard terms on the KSAT platform. This is required for legal and compliance purposes. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360041341534-KnowBe4-Privacy-Policy-and-Terms-of-Service'>KnowBe4 Privacy Policy and Terms of Service</a> article or visit <a href='https://www.knowbe4.com/legal'>knowbe4.com/legal</a>.</li>\n<li>We've added the ability to disable password-less logins for administrators on your account. You'll find this feature in your Account Settings.</li>\n<li>We've upgraded the design of our passwordless login email notifications. We've also revised the sender address from <strong>support@knowbe4.com</strong> to <strong>do-not-reply@knowbe4.com</strong>.</li>\n<li>As of January 25th, all Securable.io content will be retired from the ModStore and Securable.io will no longer appear as a publisher.</li>\n<li>We've localized our Learner Experience (LX) into additional languages. These new languages include Hungarian, Dutch, Italian, Norwegian, Russian, and Vietnamese. To learn more about this feature, see this <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634-Learner-Experience-Guide#LOCALIZE'>article</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>3 training modules</li>\n<li>4 newsletters and security docs</li>\n</ul>\n</li>\n<li>The Security Awareness Company:\n<ul>\n<li>5 newsletters and security docs</li>\n<li>1 training module</li>\n<li>1 newsletter available in 17 languages</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>In your ADI sync reports area, we've improved reporting accuracy by adding timestamps.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2016-2019 Log'>\n<table style='table-layout: auto;'>\n<thead>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>December 2019</td>\n<td>\n<ul>\n<li>We've updated our Phishing Security Test CSV downloads to have consistent casing on headers.</li>\n<li>We're in the process of updating our server-side ADI processing. You will notice increased sync processing speed in the near future. However, there are no functional changes to how users, groups, and memberships are synced.</li>\n<li>We've added the ability for you to be able to choose a language when using the free Phishing Security Test tool. You can now choose from a total of 21 languages. To learn more about this new update, click <a href='https://support.knowbe4.com/hc/en-us/articles/204843728-Free-Phishing-Security-Test-PST-Quickstart-Guide'>here</a>.</li>\n<li>We've added the ability to customize and create custom headers for phishing emails. You can check out these new fields under the Phishing Email Header section of your Account Settings. For more information on these settings, <a href='https://support.knowbe4.com/hc/en-us/articles/226457887#PHISHHEADERS'>click here</a>.</li>\n<li>We've added a new phishing template category: <a href='https://support.knowbe4.com/hc/en-us/articles/115011714968-Phishing-Template-Category-Glossary#E'>Education</a>.</li>\n<li>We've added the ability to export a CSV of user feedback for the Security Culture Survey (SCS). This option can be found under the Results tab for an SCS campaign. To learn more about the Security Culture Survey (SCS), click <a href='https://support.knowbe4.com/hc/en-us/articles/360037393134-What-is-the-Security-Culture-Survey-SCS-'>here</a>.</li>\n<li>We have added the ability to set the length of time the messages users see when they report an email using Google PAB. You can change the response duration from your Account Settings page under the Phish Alert section. For more information about the Phish Alert Button and its features, please see <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>this article</a> on our Knowledge Base.</li>\n<li>We've made updates to the Phishing tab in your KnowBe4 account. You may notice faster speeds, improved functionality, and minor user interface enhancements.</li>\n<li>We've added three new landing pages that feature Clark the Funtime Phisherman, one of our ModStore characters. Check them out under <strong>Phishing</strong> &gt; <strong>Landing Pages</strong>:\n<ul>\n<li>Clark the Funtime Phisherman: Social Engineering Red Flags</li>\n<li>Clark the Funtime Phisherman: Phish Alert Button (PAB)</li>\n<li>Clark the Funtime Phisherman: You've Been Phished</li>\n</ul>\n</li>\n<li>We've added a new landing page category called <strong>Interactive</strong>. This category includes interactive content in the form of quizzes, puzzles, and drag and drop exercises. Each page is designed to help your users learn about security awareness in a fun way. Check them out under <strong>Phishing</strong> &gt; <strong>Landing Pages</strong> &gt; <strong>Interactive</strong>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Twist and Shout\n<ul>\n<li>7 video modules</li>\n<li>1 poster</li>\n</ul>\n</li>\n<li>Syntrio\n<ul>\n<li>7 training modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 newsletter</li>\n<li>5 training modules</li>\n<li>1 assessment available in 34 languages</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>4 video modules</li>\n<li>3 posters available in 3 languages</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 game available in 4 languages</li>\n<li>2 training modules</li>\n<li>2 posters</li>\n<li>3 newsletters</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 video module available in 33 languages</li>\n<li>1 newsletter available in 34 languages</li>\n<li>1 poster available in 34 languages</li>\n<li>4 video modules</li>\n<li>1 poster available in 8 languages</li>\n<li>1 poster</li>\n<li>1 training module</li>\n<li>1 newsletter available in 16 languages</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 2019</td>\n<td>\n<ul>\n<li>We've made updates to the Phishing tab in your KnowBe4 account. You may notice faster speeds, improved functionality, and minor user interface enhancements. This change will only affect customers on <strong>eu.knowbe4.com</strong>.</li>\n<li>We've improved the encoding of phishing links used in our phishing emails to increase the security of these links.</li>\n<li>We've added the ability to use a custom header for training notifications. To learn more, please check out <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>this article</a>.</li>\n<li>We've updated the archive/delete functionality for Groups\n<ul>\n<li>After archiving a group, that group can now be permanently deleted. Deleted groups cannot be restored.</li>\n<li>Deleted group names can be reused.</li>\n<li>We've added the ability to bulk delete groups via CSV</li>\n</ul>\n</li>\n<li>We've updated our login URLs to no longer include email addresses in an effort to make our URLs more secure. We've updated the Login Link placeholder in our training notifications to reflect this change.</li>\n<li>We've added two new getting started videos for SSO users. Check them out here:\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360038046614-Video-Getting-Started-with-KnowBe4-Security-Awareness-Training-for-SSO-Users'>Getting Started with KnowBe4 Security Awareness Training for SSO Users</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360038144054-Video-Getting-Started-with-Cyber-Hero-Training-for-SSO-Users'>Getting Started with Cyber Hero Training for SSO Users</a></li>\n</ul>\n</li>\n<li>We've updated the Users tab for the Security Awareness Proficiency Assessment (SAPA). You will now be able to see your users' scores from the table. For more information on SAPA, check out <a href='https://support.knowbe4.com/hc/en-us/articles/360037392654-What-is-the-Security-Awareness-Proficiency-Assessment-SAPA-'>this article</a>.</li>\n<li>The industry benchmarking data has been updated on your Dashboard. Our benchmarking data was gathered from over 16 million users across nearly 28,000 customers. For more information on our industry benchmarking, please see <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628-Industry-Benchmarking'>this article</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Twist and Shout\n<ul>\n<li>21 video modules</li>\n<li>3 posters</li>\n<li>Inside Man Season 1 available in German</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>2 newsletters</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 video module</li>\n<li>2 training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 training module</li>\n<li>4 posters</li>\n<li>8 newsletters</li>\n<li>1 newsletter available in 17 languages</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2019</td>\n<td>\n<ul>\n<li>We have added the ability to set the length of time the messages users see when they report an email using the PAB stays on the screen. You can change the response duration from your Account Settings page under the Phish Alert section. For more information about the Phish Alert Button and its features, please see <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>this article</a> on our Knowledge Base.</li>\n<li>You can now assign assessments to your users. We offer two types of assessments: the Security Awareness Proficiency Assessment (SAPA) and the Security Culture Survey (SCS). Use the SAPA to test your users' knowledge of security knowledge. Use the SCS to survey your users to determine your organization's security culture. For more information, check out these articles on our Knowledge Base.\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360024195754-How-to-Use-Assessments'>How to Use Assessments</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360037392654'>What is the Security Awareness Proficiency Assessment (SAPA)?</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360037393134'>What is the Security Culture Survey (SCS)</a></li>\n</ul>\n</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Twist and Shout\n<ul>\n<li>22 video modules</li>\n<li>3 posters</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>3 posters</li>\n<li>2 video modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>2 assessments</li>\n</ul>\n</li>\n<li>Syntrio\n<ul>\n<li>6 training modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 game</li>\n<li>1 poster</li>\n<li>2 newsletters</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 training modules</li>\n<li>1 newsletter available in 17 languages</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2019</td>\n<td>\n<ul>\n<li>You can now disable the return-path header for training emails from your <strong>Account Settings</strong> area. You'll want to enable this setting if you are using SPF alignment checks and want to spoof your domain. See more information <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Settings#TRAINING'>here</a>.</li>\n<li>We've added a new phishing template category: <a href='https://support.knowbe4.com/hc/en-us/articles/115011714968-Phishing-Template-Category-Glossary#I'>Indian (English) Phishing Templates</a>.</li>\n<li>We have added the ability to customize the confirmation users see when they click the Phish Alert Button. You can change this message from your Account Settings page under the Phish Alert section. For more information about the Phish Alert Button and its features, please see <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>this article</a> on our Knowledge Base.</li>\n<li>An entry was added to our Phish Link Domains. Customers who require our phish domains, please <strong>request an updated list</strong> from the Support team.</li>\n<li>We've added a security role for the Uploaded Content tab. Previously, access to the Uploaded Content tab was included in the Training Store Purchases role. We have added this new security role to give you more control over who has access to upload and manage custom content. For more information about this new security role and other security roles, check out <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767'>this article</a> on our Knowledge Base.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Twist and Shout\n<ul>\n<li>7 video modules available in 17 languages</li>\n<li>7 posters</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>5 video modules</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>3 posters</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>2 training modules</li>\n<li>1 poster available in 17 languages</li>\n<li>1 newsletter</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>10 training modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>3 newsletters</li>\n<li>9 posters</li>\n<li>8 modules</li>\n<li>8 security docs</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>We've added a new landing page category: <strong>Role-Based</strong>. This category focuses on five different roles in an organization (Executive/CEO, Finance, Sales, Human Resources, and IT). Each landing page explains why a specific role is a target, potential attacks, and helpful tips to stay safe online.</li>\n<li>We now have two whitelisting wizards that can help guide you through the whitelisting process. Visit <a href='https://support.knowbe4.com/hc/en-us/articles/360035919673-Whitelisting-Troubleshooting'>here</a> to learn more about each wizard.</li>\n<li>We've added a new \"safelinks\" phish domains. If you whitelist our phish domains in your environment, make sure you whitelist the newest domain. If you're unsure which domain is new, <a href='https://support.knowbe4.com/hc/en-us/requests/new'>contact Support</a>.</li>\n<li>We've added seven new landing pages to our <strong>Point of Failure Video Training</strong> category. These landing pages are a part of the Cybersecurity Starter Kit video series.</li>\n<li>We recently updated our mail server infrastructure. This improvement may require you to update your current whitelisting setup. Visit our <a href='https://support.knowbe4.com/hc/en-us/articles/203645138-Whitelisting-Data-and-Anti-Spam-Filtering-Information'>whitelisting guide</a> for more information.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2019</td>\n<td>\n<ul>\n<li>You can no longer share landing page previews. In order to preview a landing page, you must be logged in to the console.</li>\n<li>We've updated the drop-down menus throughout the admin console and the learner experience to include new options and icons. You can now click your email in the top-right corner of the console and navigate to your training and PhishER from anywhere within the console.</li>\n<li>We've refined the AI algorithm behind our <a href='https://support.knowbe4.com/hc/en-us/articles/360001358728-Virtual-Risk-Officer-VRO-and-Risk-Score-Guide'>Virtual Risk Officer (VRO)</a> to lessen a user's Exposure Risk over time. The Exposure Risk factor is increased when user information is found in a data breach. With this update, the Exposure Risk factor will decrease over time for older breaches, while more recent breaches will have a stronger impact on the user's Exposure Risk.</li>\n<li>We've added a new phishing template category: <a href='https://support.knowbe4.com/hc/en-us/articles/115011714968-Phishing-Template-Category-Glossary#R'>Retired Current Events</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>2 security docs</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>Teach Privacy\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>2 training modules</li>\n<li>2 posters</li>\n</ul>\n</li>\n<li>Syntrio\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>2 training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 newsletter available in 15 languages</li>\n<li>2 security docs</li>\n<li>3 posters</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>We've added two new landing pages to the <strong>Phishing</strong> &gt; <strong>Landing Pages</strong> &gt; <strong>Generic</strong> category:\n<ul>\n<li>Warning Signs of Phishing (Translatable)</li>\n<li>20 Ways to Block Mobile Attacks (Translatable)</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>We've added new Google Apps Login landing pages that include multi-factor authentication. Check them out under the <strong>Phishing</strong> &gt; <strong>Landing Pages</strong> &gt; <strong>Phishing For Sensitive Information</strong> category:\n<ul>\n<li>Google Apps Login (Updated)</li>\n<li>Google MFA (Do Not Edit)</li>\n<li>Google Apps Login with MFA (Do Not Edit)</li>\n</ul>\n</li>\n<li>We've renamed our phishing template category \"Banking\" to \"Banking and Finance\" to better represent the templates within that category.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2019</td>\n<td>\n<ul>\n<li>We've added new policy statuses. When creating a policy, there will be a new drop-down field with the following status options: draft, published, or archived</li>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/360015575313'>Quarterly Product Update video</a> in our Knowledge Base.</li>\n<li>We've refined the AI algorithm behind our <a href='https://support.knowbe4.com/hc/en-us/articles/360001358728-Virtual-Risk-Officer-VRO-and-Risk-Score-Guide'>Virtual Risk Officer (VRO)</a>. You'll see a slight increase to your users' Risk Scores. The end goal is to increase the stratification between High and Low Risk users to more accurately reflect their risk to your organization.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>El Pescador\n<ul>\n<li>4 video modules</li>\n</ul>\n</li>\n<li>Exploqii\n<ul>\n<li>2 video modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>3 security docs</li>\n<li>5 training modules</li>\n<li>2 posters</li>\n</ul>\n</li>\n<li>Syntrio\n<ul>\n<li>2 training modules</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Our Reporting APIs have been updated to include user and group risk score information.\n<ul>\n<li>See more here: <a href='https://developer.knowbe4.com/'>KnowBe4 API Documentation</a>\n</li>\n</ul>\n</li>\n<li>Two changes have been added to user training sessions:\n<ul>\n<li>If users open duplicate training windows, only the most recent window will remain active. This will be indicated by a message that says \"Your training has been launched in another browser window. This training window will be closed.\"</li>\n<li>If users leave their training window unattended for four or more hours, their session will be closed and they will need to re-open their training. This will be indicated by a message that says \"Your training session has expired. Please relaunch your training from the KnowBe4 learner experience.\"</li>\n</ul>\n</li>\n<li>We added training notification templates with a new design that you can customize for your organization. These templates will have a <a href='https://support.knowbe4.com/hc/en-us/articles/360018763253-Understanding-Tags-on-Templates-and-Landing-Pages#NOTIFICATION'>(Banner)</a> or <a href='https://support.knowbe4.com/hc/en-us/articles/360018763253-Understanding-Tags-on-Templates-and-Landing-Pages#NOTIFICATION'>(Border)</a> tag in the template name.</li>\n<li>A new training notification template category was created: Blank Templates. This category includes blank versions of our training notification templates with styling. To understand how to best use this category, review <a href='https://support.knowbe4.com/hc/en-us/articles/360001547908/'>this article</a>.</li>\n<li>A new \"Summer: Don't get burned by the bad guys!\" landing page was added. Check it out under the <strong>Phishing</strong> &gt; <strong>Landing Pages</strong> &gt;<strong> Holiday/Seasonal Landing Pages</strong>.</li>\n<li>EZXploit was deprecated from new phishing campaigns.</li>\n<li>We've localized our Learner Experience (LX). You can now set the language for the LX interface using the language drop-down menu. To learn more about this feature, see this <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634-Learner-Experience-Guide#LOCALIZE'>article</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2019</td>\n<td>\n<ul>\n<li>Sign-ups are now open for our Knowledge Assessment beta! Our Knowledge Assessment allows you to measure your users' understanding of security-related topics so that you can make data-driven decisions about your security awareness plan. <a href='https://forms.gle/8iPCPQNTHwjyr1wv8'>Sign up for our beta here</a>.</li>\n<li>You can now enable surveys for new or existing training campaigns. Surveys will help you gather feedback from your users about the training content you are assigning them. To learn more about surveys, please read <a href='https://support.knowbe4.com/hc/en-us/articles/360023815053'>this article</a> on our Knowledge Base.</li>\n<li>You can now use a date range in Smart Groups criteria. For more information, see <a href='https://support.knowbe4.com/hc/en-us/articles/115012819668#TIMEFRAME'>this section</a> of our <a href='https://support.knowbe4.com/hc/en-us/articles/115012819668'>How to Use Smart Groups</a> article.</li>\n<li>We changed the word \"Cancel\" to \"Close\" on training campaigns.</li>\n<li>We've added three new local vishing numbers for Brazil, Australia, and South Africa. See more <a href='https://support.knowbe4.com/hc/en-us/articles/227567968-Vishing#LOCAL'>here</a>.</li>\n<li>You can now create branded training certificates using the certificate templates we've provided as a starting point (<a href='https://support.knowbe4.com/hc/en-us/articles/360024073373-How-Do-I-Customize-My-Users-Training-Certificates#TEMPLATES'>click here to view</a>). This setting is located in your Account Settings. Learn more by reading <a href='https://support.knowbe4.com/hc/en-us/articles/360024073373-How-Do-I-Customize-My-Users-Training-Certificates'>this article</a> on the knowledge base.</li>\n<li>Replaced the flag icon next to the Start button for a course with a language drop-down menu. Click the arrow next to the selected language to change the language for a course.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>1 video module</li>\n<li>2 security docs</li>\n<li>The Executive Series training modules are now also offered as video modules.</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 newsletter</li>\n<li>2 training module</li>\n<li>6 security docs</li>\n<li>8 posters</li>\n<li>3 Security One Sheets</li>\n<li>4 games</li>\n<li>3 video modules</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>El Pescador\n<ul>\n<li>1 video module</li>\n<li>1 training module</li>\n<li>1 security doc</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>5 security docs</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>The <a href='https://support.knowbe4.com/hc/en-us/articles/360024863474-User-Event-API'>User Event API</a> was released and it allows you to import your users' security-related events or training activities from external sources and push them into the console.\n<ul>\n<li>See more here: <a href='https://developer.knowbe4.com/'>KnowBe4 API Documentation</a>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2019</td>\n<td>\n<ul>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>1 poster</li>\n<li>1 security doc</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 newsletter</li>\n<li>2 video modules</li>\n<li>4 posters</li>\n<li>3 security docs</li>\n</ul>\n</li>\n</ul>\n</li>\n<ul>\n<li>A new publisher, El Pescador, was added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>.</li>\n<li>El Pescador\n<ul>\n<li>4 video modules</li>\n<li>3 posters</li>\n</ul>\n</li>\n</ul>\n<li>The ability to use a custom icon for the Phish Alert Button was added. For more information, please see <a href='https://support.knowbe4.com/hc/en-us/articles/360021256614-How-to-Change-the-PAB-Icon'>this article</a> on our Knowledge Base.</li>\n<li>We've added two new template categories: Current Event of the Week and Current Event of the Month. To understand how to best use these categories, review <a href='https://support.knowbe4.com/hc/en-us/articles/360022903314'>this article</a>.</li>\n<li>We've added a new Point of Failure Course landing page about phishing and spearphishing. Check it out under your Point of Failure Courses landing page category.</li>\n<li>Three tabs have been added to the Campaigns tab that categorizes Training Campaigns. These tabs are Active, Closed, and All. Use these tabs to choose which campaigns you'd like to view.</li>\n<li>The User Timeline has been changed to the Events Timeline and a new filter has been added that allows you to filter your results. Use the Event Type and Date Range drop-downs to find specific events in your user's history.</li>\n<li>The Learner Experience (LX) now has a View Details option where you can see the course's due date, the time spent on the course, and the date you completed the course for completed courses.</li>\n<li>You now have full control over which AD fields sync to your KnowBe4 console. This feature is optimal for admins wanting to have a mix of AD-managed and non-AD-managed fields, but without the worry of blank fields overwriting existing data during a sync. Learn more about how you can make the most of your AD sync by visiting <a href='https://support.knowbe4.com/hc/en-us/articles/360015798533#SYNCFIELDS'>here</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2019</td>\n<td>\n<ul>\n<li>In phishing reports, the first names of users with longer names will be truncated. Longer email addresses will also be truncated.</li>\n<li>You now have the ability to set a default landing page and default landing domain under your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887#PHISHING'>Account Settings</a>. Your default landing page and domain will be used across all phishing campaigns, unless otherwise specified when creating a campaign or phishing template.</li>\n<li>You can now upload videos as custom courses to your KnowBe4 console. You'll enroll your users and track their progress on your custom courses, just as you would with any content from the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>. See <a href='https://support.knowbe4.com/hc/en-us/articles/360019644394'>here</a> to learn more about uploading custom content.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Syntrio\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 security doc available in 32 languages</li>\n<li>1 training module</li>\n<li>Security Doc: 20 Ways to Block Mobile Attacks is now available in 32 languages</li>\n<li>The 15 minute 2019 KnowBe4 Security Awareness Training is now available</li>\n<li>The 30 minute 2019 KnowBe4 Security Awareness Training is now available</li>\n<li>1 game</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>8 training modules</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>1 newsletter</li>\n<li>The 2019 version of the Danger Zone game is now available.</li>\n<li>1 training module</li>\n<li>The Privacy Basics training module has been translated into 13 additional languages</li>\n<li>All 12 Cyber Hero Series modules are now available in French and Portuguese.</li>\n<li>8 video module</li>\n</ul>\n</li>\n<li>Landing Pages:\n<ul>\n<li>A new landing page category called <strong>Hack Attacks (Use With Caution)</strong> was added. This category mimics classic and newer ransomware attacks.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2019</td>\n<td>\n<ul>\n<li>You can now upload your own SCORM-compliant content in any language you choose, directly into your account! You'll enroll your users and track their progress on your custom courses, just as you would with any content from the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>. See <a href='https://support.knowbe4.com/hc/en-us/articles/360019644394'>here</a> to learn more about uploading custom content.</li>\n<li>We've added feature enhancements to your training campaigns! When your users miss their training deadlines, you can now extend the training due date for individual users or allow training assignments to be completed after the due date. Learn more about modifying your training campaign deadlines <a href='https://support.knowbe4.com/hc/en-us/articles/360019203233'>here</a>.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>9 posters</li>\n<li>18 security docs</li>\n<li>8 video modules</li>\n<li>1 game</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>1 newsletter</li>\n<li>7 Security One Sheets</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module\n<ul>\n<li>This is our 2019 version of the Kevin Mitnick Security Awareness training module which features increased functionality and accessibility.</li>\n</ul>\n</li>\n<li>5 security docs</li>\n<li>9 video modules</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>13 video modules</li>\n<li>13 posters</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2019</td>\n<td>\n<ul>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>1 video module</li>\n<li>1 training module</li>\n<li>1 poster</li>\n<li>1 security doc</li>\n</ul>\n</li>\n<li>Exploqii\n<ul>\n<li>48 video modules were translated into 11 languages</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>1 newsletter available in three languages</li>\n<li>8 Security One Sheets</li>\n</ul>\n</li>\n<li>Syntrio\n<ul>\n<li>17 training modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>4 training modules</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>The new learner experience (LX) was enabled.\n<ul>\n<li>Learn more about our new LX on our <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634-Learner-Experience-Guide'>Learner Experience Guide</a>, or watch our <a href='https://support.knowbe4.com/hc/en-us/articles/360000913668-Tutorial-Videos#LX'>LX-related videos</a>.</li>\n</ul>\n</li>\n<li>A new search filter was added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>: Targeted Traning.\n<ul>\n<li>You can now easily browse the industry and role-based training content available at your subscription level.</li>\n</ul>\n</li>\n<li>Phishing Templates:\n<ul>\n<li>Finnish and Danish templates were added</li>\n<li>Burmese and South African templates were added</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2019</td>\n<td>\n<ul>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Syntrio <em>**new publisher!**</em>\n<ul>\n<li>8 training modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>4 training modules</li>\n<li>5 posters</li>\n<li>7 video modules</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>3 training modules</li>\n<li>1 game</li>\n<li>3 Security One Sheets</li>\n<li>1 poster</li>\n<li>1 newsletter</li>\n<li>1 security doc (Activity Book for kids)</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>1 security doc (Activity Book for kids)</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>You now have the ability to clone Security Roles in your KnowBe4 console. See <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767-How-to-Use-Security-Roles#MANAGE'>here</a> for more information.</li>\n<li>You can now enable a sneak preview of our new training experience for your users. KnowBe4 is updating its user training interface, or learner experience, for all accounts in early February. This updated interface includes gamification, branding, a tour, and more.\n<ul>\n<li>See our <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634'>Learner Experience</a> guide to review all of the changes, and then enable the new learner experience in your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a> to try it out!</li>\n</ul>\n</li>\n<li>Our industry benchmarking numbers on your Dashboard and Reports were updated to include the latest data, as well as new available industries to select from. Learn more on our <a href='https://support.knowbe4.com/hc/en-us/articles/360000309628-Industry-Benchmarking'>industry benchmarking</a> article.</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/228373888'>Active Directory Integration (ADI)</a> Version 1.0.16.5 released.\n<ul>\n<li>This version adds additional sync fields for more user customization.<strong>Note:</strong> The &lt;domain&gt;.conf will be updated with the new user fields when the service first runs after installation.</li>\n<li>Improves ADI logging by now including &lt;domain&gt; in the log.</li>\n</ul>\n</li>\n<li>The Accounts tab of the Account Management Console was improved. See <a href='https://support.knowbe4.com/hc/en-us/articles/360013722293-MSP-Reseller-How-to-Manage-Existing-Accounts'>here</a> for more information.</li>\n<li>A Reports tab was added to the Account Management Console. You can now run reports that provide metrics for your managed accounts from one central location. For more information on the specific reports offered, read our <a href='https://support.knowbe4.com/hc/en-us/articles/360015189573-MSP-Reseller-Multi-Account-Org-Account-Management-Reporting-Guide'>How to Use Account Management Reporting</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>December 2018</td>\n<td>\n<ul>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>4 training modules</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>2 Security Docs</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>1 newsletter</li>\n<li>3 Security One sheets</li>\n<li>1 poster</li>\n<li>4 video modules</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>The Reseller Dashboard was renamed to Account Management Dashboard.</li>\n<li>You now have the ability to add your own allowed domains to your KnowBe4 console. See <a href='https://support.knowbe4.com/hc/en-us/articles/360013430414-How-to-Add-and-Verify-Allowed-Domains'>here</a> more information.</li>\n<li>Under <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Settings'>Account Settings</a>, the Business hours, Business days, and Time Zone information was moved from the Phishing section to the Company Information section.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 2018</td>\n<td>\n<ul>\n<li>Updated videos for <a href='https://support.knowbe4.com/hc/en-us/articles/115009600648'>Customizing Phishing Templates and Landing Pages</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/360012936434'>Customizing Training Notifications</a> were added.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Teach Privacy <em>**new publisher!**</em>\n<ul>\n<li>10 training modules</li>\n<li>1 game</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>7 posters</li>\n<li>5 Security Docs</li>\n<li>1 training module</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 poster</li>\n<li>1 training module</li>\n<li>6 video modules</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>1 newsletter</li>\n<li>2 Security Docs</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>New <a href='https://support.knowbe4.com/hc/en-us/articles/204949707'>placeholders</a> were added to your Placeholder dropdown on phishing templates, landing pages, and training notifications. You can now add dynamic numbers and dates to your custom content.</li>\n<li>A new tag was added to specific email templates: SPF. See more about what this tag means <a href='https://support.knowbe4.com/hc/en-us/articles/360011567653-What-Does-SPF-Indicate-on-a-Phishing-Template-'>here</a>.</li>\n<li>A new video for <a href='https://support.knowbe4.com/hc/en-us/articles/360011615933'>Domain Doppelganger</a> was added.</li>\n<li>Training-related certificates have been updated with a new design.</li>\n<li>Teach Privacy was added as a publisher to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467'>ModStore</a>.</li>\n<li>A new version of the Office 365 PAB was released which fixes an issue with centralized deployment. Server-based PABs update automatically. See more on our <a href='https://support.knowbe4.com/hc/en-us/articles/115003416867'>Phish Alert Release Notes</a>.</li>\n<li>You can now set a required password length for your users from your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a>.</li>\n<li>A free KnowBe4 training module and PDF printable has been released, only available for the holiday season (November and December)\n<ul>\n<li>See more here: <a href='https://blog.knowbe4.com/celebrate-the-holidays-here-is-a-brand-new-free-knowbe4-training-module'>Safe Travels for Road Warriors: Holiday Edition</a>\n</li>\n</ul>\n</li>\n<li>Added navigation buttons to email template previews for both phishing email templates and training email notifications.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2018</td>\n<td>\n<ul>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>2 training modules</li>\n<li>4 posters</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 video module</li>\n</ul>\n</li>\n<li>Security Awareness Company\n<ul>\n<li>5 posters</li>\n<li>3 newsletters</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>10 newsletters</li>\n<li>3 training modules</li>\n</ul>\n</li>\n<li>Twist &amp; Shout\n<ul>\n<li>30 pieces of artwork</li>\n</ul>\n</li>\n<li>ThinkHR\n<ul>\n<li>2 training modules</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>A new version of the PAB was released for <a href='https://support.knowbe4.com/hc/en-us/articles/360009015074'>Office 365 and the Outlook Mobile app</a>.\n<ul>\n<li>View our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a> to see which PAB installation method is compatible with your organization.</li>\n</ul>\n</li>\n<li>An option to modify the session timeout for admins and users was added to your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Settings#USERS'>Account Settings</a>. If inactive for the specified period of time, the admin or user will be logged out of their account automatically. <a href='https://support.knowbe4.com/hc/en-us/articles/219591508-MSP-Reseller-Instructional-Guide'>MSPs/Resellers</a> also have an admin session timeout available.</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360007952894'>Advanced Reporting</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/360001358728'>Virtual Risk Officer (VRO)</a> was released for US and EU accounts.\n<ul>\n<li>Advanced Reporting simplifies and expands your ability to create reports about your security awareness training plan progress, while our Virtual Risk Officer (VRO) feature calculates a risk score for users, groups, and your organization as a whole, helping you detect and strengthen the weakest points in your human firewall.</li>\n</ul>\n</li>\n<li>A new version of Second Chance was released which addresses several bugs.\n<ul>\n<li>View our <a href='https://support.knowbe4.com/hc/en-us/articles/360009238034'>Second Chance Release Notes</a> for more information.</li>\n</ul>\n</li>\n<li>Tutorial videos have been added/revised:\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360010801173'>User Profile Guide</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360010798273'>Account Settings Guide</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/115003640888'>Adding/Importing Users</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/226518427'>Creating Phishing Campaigns</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360001529067'>RanSim</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/226676668'>One Minute Baseline (Clicks)</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360011034793'>One Minute Baseline (Clicks and Data Entry)</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360010720554'>PAB Office 365 Install</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/115000446148'>PAB Exchange Install</a></li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360011034793-Video-One-Minute-Baseline-Check-Your-Password-Clicks-and-Data-Entry-'>One Minute Baseline: Check Your Password</a> (Clicks + Data entry)</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/226676668-Video-One-Minute-Baseline-Change-Your-Password-Clicks-'>One Minute Baseline: Change Your Password</a> (Clicks)</li>\n</ul>\n</li>\n<li>You can now update user time zones in bulk via CSV import.\n<ul>\n<li>See more here:\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/204873347-How-do-I-import-users-with-a-CSV-file-'>CSV Import</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/206345197-Time-Zones'>Time Zones</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>A new version of ADI was released which adds support for a large number of users. See our <a href='https://support.knowbe4.com/hc/en-us/articles/229696307'>ADI release notes</a> for more details.</li>\n<li>You can now filter users into <a href='https://support.knowbe4.com/hc/en-us/articles/115012819668-How-to-Use-Smart-Groups#TrainingCriteria'>Smart Groups</a> based on specific policies they have or have not been assigned, started, or completed.</li>\n<li>MSP/Resellers: Added the ability to sort columns under the Accounts tab from the Account Management portal.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2018</td>\n<td>\n<ul>\n<li>Videos are now called \"video modules\" and can be used as content for training campaigns.</li>\n<li>New tutorial videos are available on our <a href='https://support.knowbe4.com/hc/en-us/articles/360000913668'>Tutorial Videos</a> page:\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360008389614'>Automated Security Awareness Program (ASAP)</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360008528533'>Social Engineering Indicators (SEI)</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360008389734'>Policy feature overview</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360008942054-Video-Advanced-Reporting-'>Advanced Reporting</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360009084133-Video-Virtual-Risk-Officer-VRO-'>Virtual Risk Officer (VRO)</a></li>\n</ul>\n</li>\n<li>The ability to <a href='https://support.knowbe4.com/hc/en-us/articles/360000440548'>hide a phishing campaign from reports</a> during campaign creation was added.</li>\n<li>The ability to <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups#CSVIMPORT'>selectively notify admins upon user import via CSV</a> was added.</li>\n<li>Two new <a href='https://support.knowbe4.com/hc/en-us/articles/115007228048'>attachment types</a> for your simulated phishing tests were added, .docm and .xlsm.</li>\n<li>New landing pages are available:\n<ul>\n<li>Automatically branded versions of our basic \"Oops\" and SEI landing pages were added. Look for the tag (Branded).\n<ul>\n<li>These landing pages use your \"Company Logo URL\" as indicated in your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Settings#COMPANY'>Account Settings</a>.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Popcorn\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>The Security Awareness Company\n<ul>\n<li>5 posters</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>A new version of RanSim is available which adds a crypto-mining simulation scenario. See more in our <a href='https://support.knowbe4.com/hc/en-us/articles/229040167-RanSim'>RanSim product manual</a>.</li>\n<li>New user fields were added that you can add to user profiles, download in CSV reports, and use in Smart Groups, including:\n<ul>\n<li>Organization</li>\n<li>Department</li>\n<li>Risk Booster</li>\n<li>Language</li>\n<li>Employee Start Date</li>\n<li>Archived Date</li>\n<li>Comment</li>\n<li>Custom Fields (up to 4)</li>\n<li>Custom Date (up to 2)</li>\n</ul>\n</li>\n<li>We've released Domain Doppelgӓnger, a web-based tool that performs searches specific to your organization's domain and collects data on any potentially harmful or \"evil twin\" domains that the bad guys have registered with malicious intent.\n<ul>\n<li>See more here: <a href='https://support.knowbe4.com/hc/en-us/articles/360008865254'>Domain Doppelgänger Product Manual</a>\n</li>\n</ul>\n</li>\n<li>Added a drop-down that allows you to select which columns to hide or show in a phishing report.</li>\n<li>You can now filter <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> content by Duration.</li>\n<li>The name of the delete user button has been changed from Delete to Archive to more accurately reflect its functionality.</li>\n<li>You can now clone Groups.</li>\n<li>Added the ability to <a href='https://support.knowbe4.com/hc/en-us/articles/204367808-How-do-I-Archive-or-Delete-a-User-#BULKDELETE'>bulk delete users</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2018</td>\n<td>\n<ul>\n<li>New API endpoints were released to coincide with our new <a href='https://support.knowbe4.com/hc/en-us/articles/360001641907'>Policy feature</a>.\n<ul>\n<li>See: <a href='https://developer.knowbe4.com/'>KnowBe4 API Reference Guide</a>\n</li>\n</ul>\n</li>\n<li>Twist &amp; Shout and Canada Privacy Training were added as publishers to the ModStore.</li>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>Canada Privacy Training <em>**new publisher!**</em>\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>Twist &amp; Shout<em> **new publisher!**</em>\n<ul>\n<li>6 video modules</li>\n</ul>\n</li>\n<li>KnowBe4\n<ul>\n<li>1 training module</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>2 training modules</li>\n</ul>\n</li>\n<li>exploqii\n<ul>\n<li>1 video</li>\n<li>1 video module</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Our <a href='https://support.knowbe4.com/hc/en-us/articles/204949707-How-To-Use-Placeholders#TRAINING%20'>training-related placeholders</a> were revised and built-in training notifications were updated to reflect this. The previous versions of the placeholders will still be supported.</li>\n<li>Training reports were revised slightly to coincide with our new <a href='https://support.knowbe4.com/hc/en-us/articles/360001641907'>Policy feature</a>.</li>\n<li>The ability to include or exclude archived users from phishing reports was added to the <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a> area.</li>\n<li>The ability to <a href='https://support.knowbe4.com/hc/en-us/articles/360008327773'>clone a group</a> was added.</li>\n<li>A new version of PAB was released (1.2.30). See our <a href='https://support.knowbe4.com/hc/en-us/articles/115003416867'>Phish Alert Release Notes</a> for details.</li>\n<li>A content <strong>\"Duration\"</strong> search filter was added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore#FILTER'>ModStore</a>.</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360007952894'>Advanced Reporting</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/360001358728'>Virtual Risk Officer (VRO)</a> was released to beta.\n<ul>\n<li>Advanced Reporting simplifies and expands your ability to create reports about your security awareness training plan progress, while our Virtual Risk Officer (VRO) feature calculates a risk score for users, groups, and your organization as a whole, helping you detect and strengthen the weakest points in your human firewall.</li>\n<li>You can enable this in your KnowBe4 <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a> to participate in the beta. Send your feedback, comments, and questions regarding the beta to KnowBe4's <a href='https://support.knowbe4.com/hc/en-us/requests/new'>support team</a>.</li>\n</ul>\n</li>\n<li>The ability to <a href='https://support.knowbe4.com/hc/en-us/articles/204367808'>bulk delete users via CSV</a> was added. Additionally, the \"Delete\" button was changed to \"Archive\" throughout the Users tab to represent its actual functionality.</li>\n<li>Landing Pages:\n<ul>\n<li>A new multi-provider login landing page was added. Check it out under the <strong>Phishing</strong> &gt; <strong>Landing Pages</strong> &gt;<strong> Phishing for Sensitive Information</strong>.</li>\n</ul>\n</li>\n<li>Phishing Templates:\n<ul>\n<li>A new Security Hint and Tip was added.</li>\n<li>Several new Current Events templates were added.</li>\n<li>German, Malay, Thai, Vietnamese, and South African phishing templates were added.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2018</td>\n<td>\n<ul>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>KnowBe4\n<ul>\n<li>2 training modules</li>\n<li>30 posters in five different sizes</li>\n</ul>\n</li>\n<li>Security Awareness Company (SAC)\n<ul>\n<li>5 training modules</li>\n<li>6 Security One sheets</li>\n</ul>\n</li>\n<li>Popcorn\n<ul>\n<li>11 training modules (micro-modules)</li>\n</ul>\n</li>\n<li>ThinkHR\n<ul>\n<li>9 training modules</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>We've added a new Policies tab beneath the Training area of your platform.\n<ul>\n<li>Our <a href='https://support.knowbe4.com/hc/en-us/articles/360001641907'>Policy feature</a> allows you to store, distribute, and track various policy acknowledgments and agreements required of your employees as part of your security awareness training program.</li>\n</ul>\n</li>\n<li>We've added Release Notes to your console.\n<ul>\n<li>These release notes will inform you of any major updates, new features, or changes that have happened since your last login. Dismiss the messages by clicking the \"X\" icon in the top-right corner of the message.</li>\n</ul>\n</li>\n<li>Upgrades were made to the design of our phishing test attachments.\n<ul>\n<li>All attachments now include a link within it, so users can have a \"click\" failure in addition to an \"attachment opened\" failure and will be taken to a landing page upon clicking the link. The design was also changed to improve the overall user experience.</li>\n</ul>\n</li>\n<li>Landing Pages:\n<ul>\n<li>A new \"Robot CAPTCHA\" landing page was added. Check it out under the <strong>Phishing</strong> &gt; <strong>Landing Pages</strong> &gt;<strong> Generic</strong>.</li>\n<li>A new Instagram login landing page was added. Check it out under the <strong>Phishing</strong> &gt; <strong>Landing Pages</strong> &gt;<strong> Phishing for Sensitive Information</strong>.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2018</td>\n<td>\n<ul>\n<li>New items were added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>:\n<ul>\n<li>24 new Security Docs from Popcorn\n<ul>\n<li>These are one-page infographics that relate to their corresponding Popcorn training modules.</li>\n</ul>\n</li>\n<li>The Privacy Series of training modules (published by Popcorn) now has matching Posters (in 11x17, 18x24, and Digital Signage formats) and Security Docs available.</li>\n<li>New Posters and Security One Sheets from the Security Awareness Company</li>\n<li>2018 Creating Strong Passwords module (in each language) was enhanced to make each version more localized.</li>\n</ul>\n</li>\n<ul>\n<li>Our landing page interface was redesigned and now includes a Copy URL feature.</li>\n</ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/115011813867'>Second Chance</a> is now available on our EU server.</li>\n<li>KnowBe4's default landing domain for both servers has changed.</li>\n<li>New API endpoints for Training-related data were released.\n<ul>\n<li>See: <a href='https://developer.knowbe4.com/'>KnowBe4 API Reference Guide</a>\n</li>\n</ul>\n</li>\n<li>The ability to change the default <a href='https://support.knowbe4.com/hc/en-us/articles/360001555167'>Date/Time Format</a> in your console was added. This setting can be edited in your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a> area.</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360000950968'>Short demo videos</a> for all of KnowBe4's free tools are now available.</li>\n<li>A new version of <a href='https://support.knowbe4.com/hc/en-us/articles/228373888'>Active Directory Integration (ADI)</a> has been released that corrects an uncommon error related to using LDAPS to connect to your Domain Controller. ADI tools that are functioning as normal do not need to be updated to the latest version.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2018</td>\n<td>\n<ul>\n<li>New modules for Gold, Platinum, and Diamond-level subscriptions were added to the ModStore:\n<ul>\n<li>PCI Simplified</li>\n<li>2018 Common Threats, Part 2 - Kyle's Story</li>\n</ul>\n</li>\n<li>Enhancements were made to our Security Roles feature, allowing you to further limit permissions to only include specific, \"targeted groups\". See our <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767-How-to-Use-Security-Roles'>How to Use Security Roles</a> manual for more information.</li>\n<li>Banners will be added to new, updated, and soon-to-be-retired content in the ModStore. See <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore#RETIRING'>here</a> for more information on the \"Retiring Soon\" banner.</li>\n<li>Employee number option was added to <a href='hc/en-us/articles/115012819668-How-to-Use-Smart-Groups'>Smart Groups</a>.</li>\n<li>Benchmarking data settings on the Dashboard will be saved whenever changed. The setting is at the account-level, meaning all admins on the account will see the same saved settings.</li>\n<li>If you're using our server-based Phish Alert Button (PAB) with Mac OSX, we recommend upgrading to the latest version of High Sierra (10.13 or newer) if you experience issues. See our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Installation-Guide#compatible'>PAB compatibility matrix</a>.</li>\n<li>You can now <a href='https://support.knowbe4.com/hc/en-us/articles/360001214287-How-to-Remove-Failures-from-Phishing-Reports'>remove failures from your phishing tests</a>. All failure types can be removed from a user's timeline (on their individual profile page) or from within an individual Phishing Campaign's report.</li>\n<li>Changes to the Training Campaign Creation Screen were added:\n<ul>\n<li>The \"Courses\" dropdown has been modified to allow sorting by Published date, Duration, and Title.\n<ul>\n<li>Retired courses will also be hidden by default on this dropdown, but can be displayed if desired.</li>\n</ul>\n</li>\n<li>The order of courses can now be changed by dragging and dropping the selected courses in the order they should be prioritized.</li>\n</ul>\n</li>\n<li>17 new modules have been added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> from publisher ThinkHR for Diamond-level subscriptions. These courses cover a variety of topics, including (but not limited to) sexual harassment, bullying, campus security, and diversity.\n<ul>\n<li>To browse all ThinkHR courses, access the MODSTORE tab from within your console and beneath the Publisher filter, click \"ThinkHR\".</li>\n</ul>\n</li>\n<li>24 new posters by Popcorn have been added to the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> for Diamond-level subscriptions. These posters correspond to 24 of the Popcorn Cyber Heroes Series, Security Moments Series, and Something Phishy training modules. The posters are available in 11x17 tabloid, 18x24 large poster, and 16:9 digital signage formats.</li>\n<li>44 exploqii video modules are now live in the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> for Diamond-level subscriptions. These video modules are currently available in English and German. As well, our exploqii video modules have downloadable versions available in MP4 format and can be added to training campaigns.</li>\n<li>A new Phish Alert Button (PAB) training module is available. This module can be assigned to users within training campaigns as part of the process of implementing the PAB in your organization.\n<ul>\n<li>The module is titled \"Using the Phish Alert Button: Report Suspicious Emails\" and is available all subscription levels.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2018</td>\n<td>\n<ul>\n<li>Mailserver Security Assessment (MSA) was released. This tool allows you to test your email security controls and mail server with over 30 different types of email messages. Using this tool will provide you with the knowledge you need to understand the types of emails and email attachments that can reach your end users.\n<ul>\n<li>See our product manual here: <a href='https://support.knowbe4.com/hc/en-us/articles/360000913348'>MSA Product Manual</a>\n</li>\n</ul>\n</li>\n<li>Modules for Diamond-level subscriptions were added to the ModStore:\n<ul>\n<li>OWASP Top 10</li>\n<li>Executive Awareness and Leadership</li>\n<li>Computer Security &amp; Data Protection</li>\n<li>Mobile Security Basics</li>\n<li>End of the Day Security Challenge</li>\n<li>PCI DSS Retail Store Experience</li>\n</ul>\n</li>\n<li>A new version of <a href='https://support.knowbe4.com/hc/en-us/articles/115011813867'>Second Chance</a> was released which adds support for Gmail and Office 365. This new version also includes:\n<ul>\n<li>A new URL report in the console which lets you see what URLs are triggering Second Chance prompts for your users.</li>\n<li>The addition of URL unwinding, which decodes shortened or rewritten URLs to display the actual destination of the link that was clicked.</li>\n<li>The option to specify a Web Proxy during installation.</li>\n</ul>\n</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/227567968-Vishing'>Vishing 2.0</a> was released with support for US and international numbers. There are over 200 built-in templates and 21 different language categories.</li>\n<li>We have modules now available in 20 additional languages in the ModStore for Gold/Platinum/Diamond subscriptions:\n<ul>\n<li>2018 CEO Fraud</li>\n<li>2018 Ransomware</li>\n<li>2018 Safe Web Browsing</li>\n</ul>\n</li>\n<li>As part of the Popcorn Series \"Security Moments\", the module Hacking Emotions is now available in the ModStore for Diamond subscriptions.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2018</td>\n<td>\n<ul>\n<li>Industry benchmarking data was added to KnowBe4's <a href='https://support.knowbe4.com/hc/en-us/articles/204843728-Free-Phishing-Security-Test-PST-Quickstart-Guide'>Free Phishing Security Test</a>.</li>\n<li>Popcorn Training was added as a publisher in the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> and is available with Diamond-level subscriptions.</li>\n<li>A new version of PAB was released (1.1.17). See our <a href='https://support.knowbe4.com/hc/en-us/articles/115003416867'>Phish Alert Release Notes</a> for details.</li>\n<li>The EEC Pro has been updated. Customers receiving the previous version of the EEC will now receive the new EEC Pro moving forward. See more here: <a href='https://support.knowbe4.com/hc/en-us/articles/210465178-Email-Exposure-Check-Explanation-and-Use'>EEC Pro Product Manual</a>\n</li>\n<li>The \"2018 Mobile Device Security\" module is now available in 20 languages (Gold/Platinum/Diamond subscriptions).</li>\n<li>You now have the capability to use our Active Directory Integration (ADI) with Azure Active Directory Domain Services. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360000849407-ADI-and-Azure-AD-Domain-Services'>ADI and Azure AD Domain Services</a> article for more information.</li>\n<li>An external (non-KnowBe4) SAML vulnerability was announced and KnowBe4 promptly patched to prevent any issues with this vulnerability.\n<ul>\n<li>See more information here: <a href='https://www.kb.cert.org/vuls/id/475445'>Vulnerability Note VU#475445</a>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2018</td>\n<td>\n<ul>\n<li>An API has been released to allow you to pull user and group data from your console.\n<ul>\n<li>See more here: <a href='https://developer.knowbe4.com'>API Reference Guide</a>\n</li>\n</ul>\n</li>\n<li>Industry benchmarking data was added to the Dashboard of your console. This allows you to compare your security awareness program's results with those in your industry or others.\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360000309628'>Industry Benchmarking Data</a></li>\n</ul>\n</li>\n<li>There has been an update to the whitelisting process for <strong>Office 365 mail environments</strong>.\n<ul>\n<li>If you have whitelisted our mail servers by IP Address, see <a href='https://support.knowbe4.com/hc/en-us/articles/218134997-Whitelisting-by-IP-Address-in-Exchange-2013-2016-or-Office-365'>here</a>.</li>\n<li>If you have whitelisted our mail servers by email header, see <a href='https://support.knowbe4.com/hc/en-us/articles/212723707-Whitelisting-by-Email-Header-in-Exchange-2013-2016-or-Office-365'>here</a>.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2018</td>\n<td>\n<ul>\n<li>A video for your end users was released--it explains how to get started with their KnowBe4 training. You can include a link to this video with your training notifications if you'd like to, to help explain the training process.\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360000159887-Video-Getting-Started-with-KnowBe4-Security-Awareness-Training'>End User Training Video</a></li>\n</ul>\n</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/208969608#REPORTS'>Phish Alert Button</a> CSV download is now available on the KnowBe4 console Dashboard and shows the number of simulated vs. non-simulated emails reported.</li>\n<li>New Facebook, Office 365, and Netflix Landing Pages were added to System Landing Pages.</li>\n<li>Enhancements were made to all tabs that display email templates. This includes:\n<ul>\n<li>The My Templates, System Templates, and Community Templates tabs under the Phishing portion of the console</li>\n<li>The My Templates and System Templates tabs under the Training portion of the console\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360000169028'>Check out this quick video explaining the changes</a>.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>AwareGO was added as a publisher in the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> and is available with Diamond-level subscriptions.</li>\n<li>The \"2018 Creating Strong Passwords\" module is now available in 20 additional languages (Gold/Platinum/Diamond subscriptions).</li>\n<li>A new version of PAB was released (1.1.16). See <a href='https://support.knowbe4.com/hc/en-us/articles/115003416867'>Phish Alert Release Notes</a> for details.</li>\n<li>A reporting API for Phishing data was released and allows customers to pull Phishing data from their consoles. For more information, see the links below:\n<ul>\n<li><a href='https://developer.knowbe4.com'>KnowBe4 API Manual</a></li>\n</ul>\n</li>\n<li>A new category of \"Security Hints &amp; Tips\" templates was added to System Phishing Templates which automatically include your organization logo. Look for the (Branded) tag on the category.</li>\n<li>The <a href='https://support.knowbe4.com/hc/en-us/articles/219591508-MSP-Reseller-Instructional-Guide#LOGIN'>MSP/Reseller Console's Dashboard</a> page was updated to include more information, including subscription level and end date, number of active accounts, number of purchased seats, and number of active seats (paid/free/trial).</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>December 2017</td>\n<td>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/115015389767'>Security Roles</a> feature release</li>\n<li>New customers with Diamond-level subscriptions will not have any training content automatically added to their accounts.\n<ul>\n<li>You can select the content suitable for your organization, from the ModStore. Learn more <a href='https://support.knowbe4.com/hc/en-us/articles/115015693008'>here</a>.</li>\n</ul>\n</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/115011813867-Second-Chance-Installation-and-Product-Manual'>Second Chance</a> feature release\n<ul>\n<li>You can enable Second Chance in your existing KnowBe4 account by updating your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Settings'>Account Settings</a>.</li>\n</ul>\n</li>\n<li>Additions to <a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Course-Management#CampaignOverview'>Training Campaign</a> \"Users\" page, including the date the user was enrolled, how much time is left for each user, and if the user acknowledged any policy assigned to a training module in a particular campaign.</li>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360000169028'>Check out this quick video explaining the changes</a>.</li>\n</ul>\n<li>You can now see the length of available videos in the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 2017</td>\n<td>\n<ul>\n<li>Securable.io was added to our list of publishers within the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2017</td>\n<td>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/115012819668-How-to-Use-Smart-Groups'>Smart Groups</a> feature release</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/228373888'>Active Directory Integration (ADI)</a> Version 1.0.11.0 released\n<ul>\n<li>This version adds support for synchronizing group membership using a user's primary group. There is no need to upgrade functioning ADI deployments to this new version.</li>\n</ul>\n</li>\n<li>Update to <a href='https://support.knowbe4.com/hc/en-us/articles/204843728-Free-Phishing-Security-Test-PST-Quickstart-Guide'>Free Phishing Test</a> version 2.0 (additional template and landing page options offered) on EU server</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2017</td>\n<td>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/228373888'>Active Directory Integration (ADI)</a> Version 1.0.10.0 released\n<ul>\n<li>Addresses an issue with group synchronization when using userPrincipalName as the email address. If you are not experiencing issues with your ADI services, there is no need to upgrade your ADI version.</li>\n</ul>\n</li>\n<li>Phish Alert Button (PAB) Version 1.1.11 released\n<ul>\n<li>Addresses rare scenario where the Outlook Ribbon was disappearing. If you are experiencing this issue please see our <a href='https://support.knowbe4.com/hc/en-us/articles/115003416867-Phish-Alert-Button-PAB-Release-Notes'>Phish Alert Button (PAB) Release Notes</a>. If you are not experiencing issues there's no need to update.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2017</td>\n<td>\n<ul>\n<li>MSP/Resellers: Ability to <a href='https://support.knowbe4.com/hc/en-us/articles/115011301068'>import and export</a> Phishing Templates, Landing Pages, and Training Notifications is now available when logging into accounts via your Reseller console.</li>\n<li>We've updated our <a href='https://support.knowbe4.com/hc/en-us/articles/204949707-How-To-Use-Placeholders#TRAINING'>training notification placeholders</a> to be functional in manager and admin templates. The following placeholders: [[email]], [[first_name]], [[last_name]], and [[display_name]] were updated and can be used in notifications directed towards managers and admins.</li>\n<li>Improvements were made to the User List and Group Member List interfaces. You can now sort all columns, show/hide specific columns, and increase/decrease the number of entries per page.</li>\n<li>Enhancements made to the Phish Alert Button. You can now set up <a href='https://support.knowbe4.com/hc/en-us/articles/115012103388'>multiple Phish Alert Button instances</a> for your organization, allowing greater PAB customization.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2017</td>\n<td>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/115010358067-Automated-Security-Awareness-Program-ASAP-'>Automated Security Awareness Program (ASAP)</a> feature release</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/228373888'>Active Directory Integration (ADI)</a> Version 1.0.9.0 released\n<ul>\n<li>Addresses a crashing issue with the ADI service when an Active Directory has missing email address information. If you are not experiencing issues with your ADI services, there is no need to upgrade your ADI version.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2017</td>\n<td>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/115009156087-How-to-Enable-and-Use-Password-Less-Logins'>Password-less logins</a> feature released</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/115009509107-Can-I-Anonymize-User-Data-in-My-KnowBe4-Platform-'>Anonymous console data</a> feature released</li>\n<li>Enhancements to <a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Course-Management'>training campaigns and notifications</a>\n<ul>\n<li>You can now notify users, user managers, and admins with a variety of notification types</li>\n<li>Additional manual notifications added</li>\n<li>Ability to dynamically create training notifications while in training campaign creation screen was added</li>\n<li>Training Notification categories are displayed under template selection drop-down</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2017</td>\n<td>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/115006118227-Weak-Password-Test'>Weak Password Test</a> feature released</li>\n<li>Location field was added to CSV downloads</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2017</td>\n<td>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/234956728-Reply-To-Phishing'>Reply-to</a> is off by default on Phishing Campaign</li>\n<li>SSO links are now available in your Account Settings</li>\n<li>Ability to <a href='https://support.knowbe4.com/hc/en-us/articles/115005962328-How-to-Clone-a-Phishing-or-Training-Campaign'>clone campaigns</a> was added</li>\n<li>My Purchased Items will show the most current items at the top</li>\n<li>Added Sender's Name for Training Notification templates</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2017</td>\n<td>\n<ul>\n<li>Updates and improvements to <a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Course-Management'>Training Campaign Creation</a> Screen\n<ul>\n<li>Ability to add/remove users from groups once they complete training</li>\n<li>Ability to create campaigns with a \"relative duration\"</li>\n</ul>\n</li>\n<li>An entry was removed from our Phish Link Domains. Customers who require our phish domains, please <strong>request an updated list</strong> from the Support team</li>\n<li>Added <a href='https://support.knowbe4.com/hc/en-us/articles/115007228048-What-Attachments-Can-I-Add-to-my-Phishing-Campaign-and-How-are-they-Tracked-'>HTML Attachment and HTML Attachment with Link</a> available attack vectors on Phishing Template Creation screen</li>\n<li>Subscription level details are now shown under your Account Settings</li>\n<li>CSV download improvements</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2017</td>\n<td>\n<ul>\n<li>Update to <a href='https://support.knowbe4.com/hc/en-us/articles/204843728-Free-Phishing-Security-Test-PST-Quickstart-Guide'>Free Phishing Test</a> (additional template and landing page options offered) on US server</li>\n<li>Release of <a href='https://support.knowbe4.com/hc/en-us/articles/115001886067-Free-USB-Security-Test-UST-Quickstart-Guide'>Free USB Test</a>\n</li>\n<li>Language filter available in ModStore</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2017</td>\n<td>\n<ul>\n<li>Release of the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore'>ModStore</a> and Diamond-level service subscription</li>\n<li>Release of <a href='https://support.knowbe4.com/hc/en-us/articles/115001904547-Social-Engineering-Indicators-SEI-'>Social Engineering Indicators (SEI)</a>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>December 2016</td>\n<td>\n<ul>\n<li>New users added to your KnowBe4 console will inherit account time zone</li>\n<li>Ability for users to <a href='https://support.knowbe4.com/hc/en-us/articles/115002184927-How-Do-I-Change-the-Language-of-a-Training-Module-'>change what language their course is in</a>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/115009454228-KnowBe4-Security-Awareness-Training-KSAT-Change-Log"
  }
}