{
  "article": {
    "id": 115003416867,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115003416867.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115003416867.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 132,
    "vote_count": 186,
    "section_id": 27889964583699,
    "created_at": "2017-02-24T18:29:08Z",
    "updated_at": "2025-08-19T15:40:18Z",
    "name": "Phish Alert Button (PAB) Change Log",
    "title": "Phish Alert Button (PAB) Change Log",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-08-19T15:40:18Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "phish alert",
      "pab",
      "phish alert button",
      "release notes",
      "phish button",
      "change log",
      "changelog",
      "latest version of PAB",
      "latest version of phish alert",
      "current version of PAB",
      "current version of phish alert"
    ],
    "body": "<p>Use this article to stay up-to-date with changes to the PAB.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>Changes to the PAB may include new, updated, deprecated, or removed features. KnowBe4 reserves the right to terminate access to, use of, and support of features that are included as part of the Subscription Services, which is common with SaaS services as they are constantly changing and improving. This allows us to adapt to the evolving cybersecurity industry so we can provide current, high-quality services.</div>\n</div>\n<p>See the table below for a list of updates, with the latest updates displayed at the top.</p>\n<div class='js-tabs'>\n<div title='Hybrid'>\n<h3 id='h_01JT10V8293DVK4558M54HA04Z'>Hybrid PAB Updates</h3>\n<h4 id='h_01JT10V8292N2Y4YGZV59XEYYS'>Add-In Version Format: OA1.0 and OA2.0 (REST APIs), OA3.0 (Graph APIs)</h4>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>May 30, 2025</td>\n<td>\n<ul>\n<li>We've released the GCC High Hybrid PAB! This PAB will allow your users to report suspicious emails in Microsoft's Government Community Cloud (GCC) High environments. Contact our <a href='https://support.knowbe4.com/hc/en-us/requests/new'>support team</a> to enable GCC High PAB for your account. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/41420725323667-GCC-High-Phish-Alert-Button-PAB-Product-Manual'>GCC High Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 12, 2025</td>\n<td>\n<ul>\n<li>We've updated the fallback mechanism for the Hybrid PAB to default to REST mode when it detects that legacy exchange tokens are enabled. Once <a href='https://learn.microsoft.com/en-us/office/dev/add-ins/outlook/turn-exchange-tokens-on-off#turn-on-legacy-exchange-online-tokens' target='_blank' rel='noopener'>legacy Exchange Online tokens are fully deprecated</a>, the PAB will automatically default to GRAPH mode.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 28, 2025</td>\n<td>\n<ul>\n<li>We've updated the Hybrid PAB to support Microsoft 365 Outlook clients using Internet Explorer. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/38439352278803-Update-to-Nested-App-Authentication-Single-Sign-On-NAA-SSO-for-the-Phish-Alert-Button-PAB'>Update to Nested App Authentication Single Sign-On (NAA-SSO) for the Phish Alert Button (PAB)</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 3, 2025</td>\n<td>\n<ul>\n<li>We're excited to announce that we've added a new feature that will allow the PAB to recognize training notifications in the <strong>Phish Alert </strong>section of your account settings. Enabling this setting will prevent the PAB from reporting any training email from KnowBe4 with a valid training notification ID (TNID). For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 25, 2025</td>\n<td>\n<ul>\n<li>We're excited to share that we've combined the Hybrid and Graph Phish Alert Buttons (PABs), along with their manuals, to provide a more streamlined experience. As a result, the Graph PABs guides and information will now be included in the <a href='https://support.knowbe4.com/hc/en-us/articles/14701808484627-Hybrid-Phish-Alert-Button-PAB-Product-Manual'>Hybrid Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 11, 2025</td>\n<td>\n<ul>\n<li>We've updated the Hybrid Phish Alert Button (PAB) to support Nested App Authentication single sign-on (NAA-SSO). The NAA-SSO version of the Hybrid PAB will support installation for shared mailboxes. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/38439352278803-Update-To-Nested-App-Authentication-Single-Sign-On-NAA-SSO-For-The-Phish-Alert-Button-PAB'>Update to Nested App Authentication Single Sign-On (NAA-SSO) for the Phish Alert Button (PAB)</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 21, 2025</td>\n<td>\n<ul>\n<li>We've updated the Hybrid PAB to support the <strong>Add the reported message's headers to the forwarded message's body</strong> feature. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 14, 2024</td>\n<td>\n<ul>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>User Comments and Disposition</a> feature! Admins can now set a default disposition and customize the options that users will see when they are selecting a reported email's disposition. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 20, 2024</td>\n<td>\n<ul>\n<li>We've added the <strong>Send email headers as TXT attachments</strong> feature! When you send a copy of a reported message, you can now include a separate text file attachment containing the headers of the reported message. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>07/15/2024</td>\n<td>\n<ul>\n<li>We've updated the Hybrid PAB to support emails with larger attachments. When the Hybrid PAB uses REST APIs, you can now send file attachments up to 25 MB.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>03/11/2024</td>\n<td>\n<ul>\n<li>We've added the ability to submit reported emails directly to Microsoft 365 Defender's <strong>Submissions</strong> page. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/17538935276051'>How to Integrate Microsoft Defender for Office 365 with the Phish Alert Button (PAB)</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>12/19/2023</td>\n<td>\n<ul>\n<li>We've modified the way PAB handles read receipts. PAB will actively remove the read receipt flag when a user reports an email. With this flag removed, threat actors will not be informed if the email was read, nor will they know if the email address is active.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>12/11/2023</td>\n<td>\n<ul>\n<li>We've updated the PAB's architecture from Vue2 with Webpack 3 to Vanilla HTML, CSS, and Javascript with Webpack 5. This update resolves Webpack security issues, removes and replaces libraries that had vulnerabilities, and improves the UI design and text. The updated UI text now supports languages that read from right to left, like Hebrew, and it improves the PAB's accessibility and ADA compliance.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>06/15/2023</td>\n<td>\n<ul>\n<li>We've added an integration for the Hybrid PAB and Microsoft Defender for Office 365! When the <strong>Enable Microsoft 365 Defender Integration</strong> setting is enabled in your KSAT <strong>Account Settings</strong>, the PAB will send a copy of reported emails to Microsoft 365 Defender's <strong>Submissions</strong> page for analysis. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/17538935276051'>How to Integrate Microsoft Defender for Office 365 with the Phish Alert Button (PAB)</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>04/03/2023</td>\n<td>\n<ul>\n<li>We've released the <strong>Exclude original body text from reported emails</strong> feature, which allows you to send a copy of a reported email without body text. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608#ENABLING'>Phish Alert Button (PAB) Product Manual</a>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>03/14/2023</td>\n<td>\n<ul>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>User Comments and Disposition</a> feature. Admins can now specify different email recipients based on the reported email's disposition. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>12/15/2022</td>\n<td>\n<ul>\n<li>We've updated the Hybrid PAB to support the user comments and email disposition features for Microsoft Exchange servers. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>Adding User Comments and Email Disposition to the Phish Alert Button</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>11/30/2022</td>\n<td>\n<ul>\n<li>We've updated the Hybrid PAB so that when an email is sent out by the PAB, it will only have one attached EML file.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>08/08/2022</td>\n<td>\n<ul>\n<li>We've improved the formatting of the email response message. When an email is reported, the email response message displays a simplified “NotificationDialog” URL in the pop-up window.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>07/05/2022</td>\n<td>\n<ul>\n<li>We've improved the security of header validation. Now, the Hybrid PAB can use Campaign Recipient ID (CRID) validation to detect whether an email that is marked with a training header is a simulated phishing email or a legitimate threat.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>12/16/2021</td>\n<td>\n<ul>\n<li>We've added a feature that allows your users to add comments and decide the disposition of an email. These features can be used together to give your security team a warning about suspicious emails and the types of threats the emails may pose. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>Adding User Comments and Email Disposition to the Phish Alert Button</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>10/10/2021</td>\n<td>\n<ul>\n<li>We've released the <strong>Autofill Phishing Languages with PAB Locale</strong> feature. This feature allows the PAB to autofill your users' profiles with their preferred phishing language if that field is left blank. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual#ENABLING'>Phish Alert Button Product Manual</a> and our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513#INDIVIDUAL'>Localization Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/13/2021</td>\n<td>\n<ul>\n<li>We've released an email forwarding feature, which allows emails to be forwarded to services that require email forwarding, such as Proofpoint. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual#ENABLING'>Phish Alert Button Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/09/2021</td>\n<td>\n<ul>\n<li>We've updated the Hybrid PAB to support the Canada KSAT URL in the manifest files. This new update does not require existing Hybrid PAB users to reinstall the PAB.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>06/16/2021</td>\n<td>\n<ul>\n<li>We've improved the MAPI Properties of MSG attachments.</li>\n<li>We've included bug fixes for the Forward email prefix, Send a test, and the Unicode character support for attachment filenames.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>05/10/2021</td>\n<td>\n<ul>\n<li>We've released the Hybrid PAB for Microsoft 365. The Exchange server can automatically detect your users' mail client and backend server to configure the best version of the PAB for their environment.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='Microsoft Ribbon'>\n<h3 id='h_01JT10V829K0NK2AFKDKQ3XHY7'>Microsoft Ribbon PAB Updates</h3>\n<h4 id='h_01JT10V829NHD34ZZJD6RJ4FZT'>Add-In Version Format: OA4.0 (REST APIs), OA5.0 (Graph APIs)</h4>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>May 12, 2025</td>\n<td>\n<ul>\n<li>We've updated the fallback mechanism for the Microsoft Ribbon PAB to default to REST mode when it detects that legacy exchange tokens are enabled. Once <a href='https://learn.microsoft.com/en-us/office/dev/add-ins/outlook/turn-exchange-tokens-on-off#turn-on-legacy-exchange-online-tokens' target='_blank' rel='noopener'>legacy Exchange Online tokens are fully deprecated</a>, the PAB will automatically default to GRAPH mode.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 28, 2025</td>\n<td>\n<ul>\n<li>We've updated the Microsoft Ribbon PAB to support Microsoft 365 Outlook clients using Internet Explorer. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/38439352278803-Update-to-Nested-App-Authentication-Single-Sign-On-NAA-SSO-for-the-Phish-Alert-Button-PAB'>Update to Nested App Authentication Single Sign-On (NAA-SSO) for the Phish Alert Button (PAB)</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 3, 2025</td>\n<td>\n<ul>\n<li>We're excited to announce that we've added a new feature that will allow the PAB to recognize training notifications in the<strong> Phish Alert </strong>section of your account settings. Enabling this setting will prevent the PAB from reporting any training email from KnowBe4 with a valid training notification ID (TNID). For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 12, 2025</td>\n<td>\n<ul>\n<li>We've updated the Microsoft Ribbon Phish Alert Button (PAB) to support Nested App Authentication single sign-on (NAA-SSO). The NAA-SSO version of the Microsoft Ribbon PAB will support installation for shared mailboxes. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/38439352278803-Update-To-Nested-App-Authentication-Single-Sign-On-NAA-SSO-For-The-Phish-Alert-Button-PAB'>Update to Nested App Authentication Single Sign-On (NAA-SSO) for the Phish Alert Button (PAB)</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 28, 2025</td>\n<td>\n<ul>\n<li>We've updated the Microsoft Ribbon PAB to support the <strong>Add the reported message's headers to the forwarded message's body</strong> feature. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>December 18, 2024</td>\n<td>\n<ul>\n<li>We've updated the fallback mechanism for the Microsoft Ribbon PAB. This updated manifest will now allow the Microsoft Ribbon PAB to switch from the Graph API to the Rest API whenever it is in an environment that does not support the Microsoft Ribbon PABs Graph API. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/26106205842707-Microsoft-Ribbon-Phish-Alert-Button-PAB-Product-Manual'>Microsoft Ribbon Phish Alert Button Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 14, 2024</td>\n<td>\n<ul>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>User Comments and Disposition</a> feature! Admins can now set a default disposition and customize the options that users will see when they are selecting a reported email's disposition. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 20, 2024</td>\n<td>\n<ul>\n<li>We've added the <strong>Send email headers as TXT attachments</strong> feature! When you send a copy of a reported message, you can now include a separate text file attachment containing the headers of the reported message. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 19, 2024</td>\n<td>\n<ul>\n<li>We've updated the Microsoft Ribbon PAB to remove the unwanted <strong>More Info</strong> section from the manifest file.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>06/13/2024</td>\n<td>\n<ul>\n<li>We've released the Microsoft Ribbon PAB! You can now configure KnowBe4's PAB with Microsoft's integrated spam-reporting add-in. The integrated PAB will appear in the <strong>Home</strong> toolbar in your users' Outlook mail client ribbon, and it will allow your users to report suspicious emails to both the Microsoft 365 Defender platform and the KSAT console. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/26106205842707'>Microsoft Ribbon Phish Alert Button Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='EXE'>\n<h3 id='h_01JT10V829CFM0430N8M5MCFC8'>EXE PAB Updates</h3>\n<h4 id='h_01JT10V8299P1A6Q1ABH6KK9W3'>Add-In Version Format: 1.1.x.x - 1.4.x.x (MSI) and 1.10.x.x (EXE)</h4>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Version</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>August 14, 2025</td>\n<td>1.10.18</td>\n<td>\n<ul>\n<li>\n<p>We’re excited to announce that we’ve updated the EXE PAB to support the following features:</p>\n<ul>\n<li>\n<p><strong>Enhanced User Comments and Disposition Support</strong> - The EXE PAB now includes the same user comments and disposition capabilities available as our other Phish Alert Buttons! Admins can set a default disposition and customize the options that users will see when selecting a reported email's disposition.</p>\n</li>\n<li>\n<p><strong>Ignore Training Notifications</strong> - The EXE PAB can now recognize training notifications in the Phish Alert section of your account settings. Enabling this setting will prevent the PAB from reporting any training email from KnowBe4 with a valid training notification ID (TNID).</p>\n</li>\n<li>\n<p><strong>Enable Email Forwarding</strong> - There is now added support for email forwarding, which allows emails to be forwarded to services that require email forwarding, such as Proofpoint.</p>\n</li>\n<li>\n<p><strong>Autofill Phishing Languages with PAB Locale</strong> - The PAB can now autofill your users' profiles with their preferred phishing language if that field is left blank.</p>\n<p>For more information on these features, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a>.</p>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 15, 2024</td>\n<td>1.10.16</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to support the <strong>Add the reported message's headers to the forwarded message's body</strong> feature. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>06/13/2024</td>\n<td>1.10.14</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to improve the security for automatic updates.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>04/17/2024</td>\n<td>1.10.12</td>\n<td>\n<ul>\n<li>We've released an updated version of the PAB for Outlook! We've updated a support library and improved the security for automatic updates to the PAB.</li>\n<li>We've resolved an issue causing the PAB to incorrectly create EML file attachments for some reported emails.</li>\n<li>We've added the ability to submit reported emails directly to Microsoft 365 Defender's Submissions page. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/17538935276051'>Integrate Microsoft Defender for Office 365 with the Phish Alert Button (PAB)</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>12/14/2023</td>\n<td>1.10.10</td>\n<td>\n<ul>\n<li>We've implemented a bug fix for how the PAB for Outlook sends attachments. When Outlook is configured to prevent emails from being stored on the disk, the PAB will attach original emails in EML files.</li>\n<li>We've also updated the PAB to use a proxy server when one is specified during installation, and to use the current user's proxy settings when a proxy server is not specified.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>10/20/2023</td>\n<td>1.10.8</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to support the integration with Microsoft Defender for Office 365! When the <strong>Enable Microsoft 365 Defender Integration setting</strong> is enabled in your KSAT <strong>Account Settings</strong>, the PAB will send a copy of reported emails to Microsoft 365 Defender's Submissions page for analysis. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/17538935276051'>How to Integrate Microsoft Defender for Office 365 with the Phish Alert Button (PAB)</a> article.</li>\n<li>We've also updated the PAB to support the <strong>Exclude original body text from reported emails</strong> feature, which allows you to send a copy of a reported email without body text. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608#ENABLING'>Phish Alert Button (PAB) Product Manual</a>.</li>\n<li>We've implemented bug fixes for how the PAB responds to automatic updates, and how the PAB sends headers in EML attachments to PhishER.</li>\n<li>We've improved the installation process for the PAB so that a proxy server will successfully validate a license key. We've also improved the process for troubleshooting PAB errors.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>04/18/2023</td>\n<td>1.10.6</td>\n<td>\n<ul>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>User Comments and Disposition</a> feature. Admins can now specify different email recipients based on the reported email's disposition. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>. We've also updated the .NET Framework from 4.5.1 to 4.7.2.</li>\n<li>We've implemented a bug fix to resolve an issue causing Outlook to disconnect from Microsoft Exchange or Microsoft 365 when certain conditions are met.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>12/19/2022</td>\n<td>1.10.4</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to support the user comments and email disposition features. These features can be used together to give your security team a warning about suspicious emails and the types of threats the emails may pose. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>Adding User Comments and Email Disposition to the Phish Alert Button</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>11/11/2022</td>\n<td>1.10.2</td>\n<td>\n<ul>\n<li>We've implemented minor bug fixes and updated the PAB to support instances of KSAT.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>08/22/2022</td>\n<td>1.10.1</td>\n<td>\n<ul>\n<li>We've released an updated version of the PAB for Outlook, which will automatically update for existing users. We've reduced the size of the installer kit and reduced the length of time needed to start Outlook. We've also implemented a bug fix for downloading the PAB icon after it has been configured in your KSAT <strong>Account Settings</strong>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>08/02/2022</td>\n<td>1.10.2</td>\n<td>\n<ul>\n<li>We've improved the security of header validation. Now, the PAB for Outlook can use Campaign Recipient ID (CRID) validation to detect whether an email that is marked with a training header is a simulated phishing email or a legitimate threat.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>07/19/2022</td>\n<td>1.10.2</td>\n<td>\n<ul>\n<li>We've released the EXE version of the PAB for Outlook. This version of the PAB uses an EXE file instead of an MSI file and supports automatic updates. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/7142051893011'>Outlook (EXE Version) Phish Alert Button Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>03/07/2022</td>\n<td>1.1.17 and older</td>\n<td>\n<ul>\n<li>Starting July 1st, 2022, we will no longer support versions of the PAB older than version 1.2.30 that use TLS 1.0. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4545964359699'>End of Support for Phish Alert Buttons Using TLS 1.0</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>08/10/2021</td>\n<td>1.4.85</td>\n<td>\n<ul>\n<li>We've update the PAB for Outlook to allow it to communicate with the Canada instance upon installation.</li>\n<li>We've updated some core libraries that were responsible for generating .eml files.</li>\n<li>We've enabled a debugging option that allows the PAB for Outlook to generate multiple formats for attachment files. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/236187688'>How to Enable PAB's Debug Mode</a> article.</li>\n<li>We've implemented a minor bug fix for how the PAB consumes and parses the KSAT server's responses.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>04/14/2021</td>\n<td>1.4.68</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to allow PAB for Outlook to be installed without network connection or using a network incapable account to install. If the PAB for Outlook is installed or uninstalled without a network connection, it will not be able to increment or decrement the installed devices count.</li>\n<li>We've updated the PAB for Outlook so that when an email is sent out by the PAB, it will only have one attached EML file. The email content will no longer contain inline images.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>08/24/2020</td>\n<td>1.4.58</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to support Outlook 2010 and later. We have also removed the .NET4.0 requirement from our installation process.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>05/18/2020</td>\n<td>1.4.48</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to include a security update.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>05/18/2020</td>\n<td>1.4.42</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to support the new email forwarding feature. If no forwarding email addresses are set in the PAB configurations but want copies of emails to be sent to KnowBe4, the KnowBe4 email address is used as a To - recipient.</li>\n<li>We've updated the PAB for Outlook to change the <strong>source.eml</strong> file to <strong>phish_alert_sp2_2.0.0.0.eml</strong> for Microsoft 365 PAB users. We will be using this naming convention from now on, as it allows PhishER to identify PAB emails and provide better support.</li>\n<li>In the installer, we've implemented minor bug fixes for the PAB icon appearing pixelated or not displaying as expected. These fixes also correct a problem during remote installation with LANDESK.</li>\n<li>We've updated the EV certificate to now expire in two years.</li>\n<li>We've improved the overall user experience and integration with Microsoft Outlook.</li>\n<li>We've improved the PAB for Outlook to use the 64bit version of a support library when it is installed on a system running 64bit-Microsoft Outlook on 64bit Windows.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>04/21/2020</td>\n<td>N/A</td>\n<td>\n<ul>\n<li>We've implemented minor bug fixes and process improvements to support the PAB for Outlook on Windows 10 machines.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>05/07/2019</td>\n<td>1.3.98</td>\n<td>\n<ul>\n<li>We've updated the PAB for Outlook to support future PAB features.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>11/09/2018</td>\n<td>1.2.45</td>\n<td>\n<ul>\n<li>We've fixed a Hash Error message on some versions of Outlook.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>10/25/2018</td>\n<td>1.2.36</td>\n<td>\n<ul>\n<li>We've fixed an uncommon error with signature enforcement.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>08/16/2018</td>\n<td>1.2.30</td>\n<td>\n<ul>\n<li>We've fixed the issue of TLS 1.0/1.1 being disabled.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>08/02/2018</td>\n<td>1.2.29</td>\n<td>\n<ul>\n<li>We've fixed the issue of the PAB for Outlook appearing twice in the drop-down for Outlook 2010.</li>\n<li>We've fixed log files for users of the PAB for Outlook. Log files will be located in C:\\Users&lt;username&gt;\\AppData\\Roaming\\KnowBe4\\Phish Alert.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>03/13/2018</td>\n<td>1.1.17</td>\n<td>\n<ul>\n<li>We've fixed the <strong>ADX Loader - Error code: 0x80131022</strong> error.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>01/17/2018</td>\n<td>1.1.16</td>\n<td>\n<ul>\n<li>We've fixed a <strong>Failed to parse response</strong> error and an uncommon error where the PAB is unclickable.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/29/2017</td>\n<td>1.1.11</td>\n<td>\n<ul>\n<li>We've fixed the issue of the <strong>Outlook Ribbon</strong> disappearing.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>02/03/2017</td>\n<td>1.1.9</td>\n<td>\n<ul>\n<li>We've updated some of the libraries we use for the PAB for Outlook to the current versions.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>11/07/2016</td>\n<td>1.1.7</td>\n<td>\n<ul>\n<li>We've included a bug fix to support scaled fonts. This is for high-resolution devices, such as the Microsoft Surface, that have font scaling.</li>\n<li>We've added support for a debug log.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>10/20/2016</td>\n<td>1.1.6</td>\n<td>\n<ul>\n<li>Now, some of the PAB DLLs have been signed so there are no more security warnings in tight security environments.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>Updates to the Outlook PAB are delivered automatically, and your version number will change with the automatic updates.</div>\n</div>\n</div>\n<div title='Gmail Add-On'>\n<h3 id='h_01JT10V8291PA6FHXSWWD0T014'>Gmail Add-On PAB Updates</h3>\n<h4 id='h_01JT10V829D10GC5389PRYZT6C'>Add-In Version Format : GA1.x.x</h4>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>April 23, 2025</td>\n<td>\n<ul>\n<li>We're excited to announce that we've added a new feature that will allow the PAB to recognize training notifications in the <strong>Phish Alert </strong>section of your account settings. Enabling this setting will prevent the PAB from reporting any training email from KnowBe4 with a valid training notification ID (TNID). For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>December 17, 2024</td>\n<td>\n<ul>\n<li>We've made improvements to this PABs automatic activation functionality and added an option to reset all user data.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 14, 2024</td>\n<td>\n<ul>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>User Comments and Disposition</a> feature! Admins can now set a default disposition and customize the options that users will see when they are selecting a reported email's disposition. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>03/14/2023</td>\n<td>\n<ul>\n<li>We've updated the <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>User Comments and Disposition</a> feature. Admins can now specify different email recipients based on the reported email's disposition. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/21/2022</td>\n<td>\n<ul>\n<li>We've updated the Gmail Add-on PAB to support the user comments and email disposition features. These features can be used together to give your security team a warning about suspicious emails and the types of threats the emails may pose. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410882366611'>Adding User Comments and Email Disposition to the Phish Alert Button</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>07/19/2022</td>\n<td>\n<ul>\n<li>We've added support for email forwarding from the Gmail Add-on PAB.</li>\n<li>We've improved the security of header validation. Now, the Gmail Add-on PAB can use Campaign Recipient ID (CRID) validation to detect whether an email that is marked with a training header is a simulated phishing email or a legitimate threat.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>04/08/2022</td>\n<td>\n<ul>\n<li>We've released our new automatic activation feature for the Gmail Add-on PAB. With this features, users will no longer need to manually activate their PAB with a license key, and Magic Mail will not be required for users. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4649885043475'>How to Use Automatic Activation for the Gmail Add-on Phish Alert Button (PAB)</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/09/2021</td>\n<td>\n<ul>\n<li>We've updated the Gmail Add-on PAB to migrate the code from using a Contacts API to People API. For more information, see Google's <a href='https://developers.google.com/people/contacts-api-migration'>Contacts API Migration Guide</a> article.</li>\n<li>We've updated the PAB to support Magic Mail and manual registration for the Canada instance of the KSAT platform.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>05/10/2021</td>\n<td>\n<ul>\n<li>We've released the Gmail Add-on PAB for Google Workspace.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='Chrome'>\n<h3 id='h_01JT10V8291VR26DQFQJFQ4DQ1'>Chrome PAB Updates</h3>\n<h4 id='h_01JT10V829QHH35YZE86XDX4HY'>Add-In Version Format: 0.1.x.x - 0.3.x.x</h4>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>11/29/2023</td>\n<td>\n<ul>\n<li>We've fixed a bug from a Chrome update that prevented the PAB from displaying.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>05/10/2023</td>\n<td>\n<ul>\n<li>We've fixed a bug that caused an error message to display when users clicked the PAB icon on the Chrome toolbar, or required users to reload a Gmail tab to display the Chrome Extension PAB.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>03/15/2023</td>\n<td>\n<ul>\n<li>The Chrome Extension PAB now supports Google Chrome Manifest v3. The manifest file will automatically update for existing users.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>07/25/2022</td>\n<td>\n<ul>\n<li>We've improved the security of header validation. Now, the Chrome Extension PAB can use Campaign Recipient ID (CRID) validation to detect whether an email that is marked with a training header is a simulated phishing email or a legitimate threat.</li>\n<li>We've improved the response messages functionality for the Chrome Extension PAB. When emails are reported with the PAB, response messages are not displayed unless they are enabled in KSAT.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/15/2021</td>\n<td>\n<ul>\n<li>We've included a minor bug fix that reloads configuration data when a new Gmail tab is opened.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>08/17/2021</td>\n<td>\n<ul>\n<li>We've updated the OAuth consent configuration to add \"https://googleapis.com/auth/userinfo.profile\".</li>\n<li>We've fixed a bug that caused the <strong>Report By</strong> field to not populate in PhishER.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>12/01/2020</td>\n<td>\n<ul>\n<li>We've fixed a bug that caused the hover-over prompt to display when the cursor was over the <strong>Labels</strong> button.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/09/2020</td>\n<td>\n<ul>\n<li>We've updated the Google Suite PAB to send a copy of the reported email as a BBC when copying both the US and EU KnowBe4 email addresses.</li>\n<li>We've updated the Google Suite PAB to support showing the full body of the original email instead of sending the original email as an attachment when an email is forwarded.</li>\n<li>We've updated the Google Suite PAB to change the source attachment name in order for the email to be targeted by PhishER.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>12/10/2019</td>\n<td>\n<ul>\n<li>We've added the option to set the length of time that the users see the message when they report an email using the Google PAB. You can change the response duration from your <strong>Account Settings</strong> page under the <strong>Phish Alert</strong> section.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>10/07/2019</td>\n<td>\n<ul>\n<li>We've fixed the bug that caused the loading of the PAB icon to constantly load.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/10/2019</td>\n<td>\n<ul>\n<li>We've updated the Google Suite PAB to remove unwanted URLs and domains from the manifest file and to stop PAB from running when it is not configured in the domain.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>09/04/2019</td>\n<td>\n<ul>\n<li>We've updated the Google Suite PAB to support the new dynamic confirmation and thank you message features found on the Account Settings page.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>Updates to the Chrome PAB are delivered automatically.</div>\n</div>\n</div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/115003416867-Phish-Alert-Button-PAB-Change-Log",
    "images": [],
    "metadata": {
      "category": "General",
      "section": "Change Logs and Release Notes",
      "topics": [
        "alert",
        "change",
        "general",
        "logs",
        "notes",
        "pab",
        "phish",
        "release"
      ],
      "image_count": 0
    }
  }
}