{
  "article": {
    "id": 14193888378131,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/14193888378131.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/14193888378131.html",
    "author_id": 1534339111301,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 11,
    "vote_sum": 1,
    "vote_count": 1,
    "section_id": 7759989017491,
    "created_at": "2023-02-21T20:57:49Z",
    "updated_at": "2025-09-15T13:15:26Z",
    "name": "Integrate VirusTotal with Your PhishER Platform",
    "title": "Integrate VirusTotal with Your PhishER Platform",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-05T16:09:39Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot",
      "localizing",
      "answerbot_phisher"
    ],
    "body": "<p>From the <strong>VirusTotal</strong> subtab of your <a href='https://support.knowbe4.com/hc/en-us/articles/16569063307411'>PhishER Settings</a>, you can configure the VirusTotal integration for your PhishER platform. VirusTotal is a service that uses over 70 antivirus scanners to inspect and analyze files for malicious content. To integrate your VirusTotal account with PhishER, you must have an active VirusTotal API key. If you do not have a VirusTotal account, you can join for free on VirusTotal's <a href='https://www.virustotal.com/#/join-us' target='_blank' rel='noopener'>website</a>.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> KnowBe4 has approval from VirusTotal to integrate with the VirusTotal Public API, which is free. The VirusTotal Public API is limited to 500 requests per day and four requests per minute when running a scan in your PhishER platform. For more information, see VirusTotal's <a href='https://developers.virustotal.com/reference#public-vs-private-api' target='_blank' rel='noopener'>VirusTotal API v3 Overview</a> article.</div>\n</div>\n<h2 id='h_01HSBWVDPNCW0TTR1FPRTQ62E8'>Configuring the Integration</h2>\n<p>To configure the integration, fill out the fields on the <strong>VirusTotal</strong> subtab of your PhishER Settings. For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsVT.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsVT.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Disabled or Enabled</strong>: Use this toggle to disable or enable the integration.</li>\n<li>\n<strong>Enter your VirusTotal key</strong>: Enter your VirusTotal key in this field. For more information, see VirusTotal's <a href='https://support.virustotal.com/hc/en-us/articles/115002088769-Please-give-me-an-API-key' target='_blank' rel='noopener'>Please give me an API key</a> article.</li>\n<li>(Optional)<strong> VirusTotal Automatic Scanning</strong>: In this section, you can configure settings that allow VirusTotal to automatically scan parts of a message. To learn about these options, see the list below:\n<ul>\n<li>\n<strong>Automatically scan ALL Attachments (Hashes Only)</strong>: If you select this check box, VirusTotal will receive a hash of all attachments in your PhishER <strong>Inbox</strong>.</li>\n<li>\n<strong>Automatically scan ALL URLs</strong>: If you select this check box, VirusTotal will automatically be sent all URLs in your PhishER Inbox.</li>\n<li>\n<strong>Timeout if no response (seconds)</strong>: Enter a number of seconds to set a custom timeout period for your VirusTotal scan results. If VirusTotal does not return scan results within this timeout period, a <strong>VT_Bypassed</strong> tag will be applied to the corresponding message. By default, the timeout period is 120 seconds. To learn more about the tags that can be applied to the message, see the <a href='#h_01HSBWVDPNRWD3KHWE0CD58Y5Z'>VirusTotal Tags</a> section of this article.</li>\n</ul>\n</li>\n<li>\n<strong>Ignored Domains</strong>: Enter the domains that you would like VirusTotal to ignore when running a scan. Enter each domain as a new line in the text box. If you add a domain to this list, any subdomains of that domain will be excluded as well. However, if you add a subdomain to the list, the domain will not be excluded. Wildcards (*) and Uniform Resource Identifiers (URIs) are not supported.\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong>For a list of KnowBe4 domains that should not be sent as links or attachments to VirusTotal, see the <a href='#h_01HSBWVDPN1F4Q9S2RT7BVX2B8'>Excluding KnowBe4 Domains from Scans</a> section of this article.</div>\n</div>\n</li>\n<li>\n<strong>Save</strong>: Click this button to update your VirusTotal integration settings.</li>\n</ol>\n<h2 id='h_01HSBWVDPNC5QZCCK9JJ8JRE1P'>Scanning with VirusTotal</h2>\n<p>Once you integrate your VirusTotal account with your PhishER platform, you can run a VirusTotal scan on message attachments and URLs. To run a VirusTotal scan on a specific attachment or URL, click <strong>Scan with VirusTotal</strong> on the <strong>Message Details</strong> page.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/ScanWithVirusTotal.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/ScanWithVirusTotal.png' alt=' '></a></p>\n<p>You can also automatically run a VirusTotal scan against selected messages when you rerun your rules and actions. For more information about these options, see our <a href='https://support.knowbe4.com/hc/en-us/articles/13169303385619'>How to Use Your PhishER Inbox</a> article.</p>\n<p>VirusTotal assigns one or more tags to your scanned messages to indicate the results of the analysis. To learn more about the tags that can be applied to messages, see the <a href='#h_01HSBWVDPNRWD3KHWE0CD58Y5Z'>VirusTotal Tags</a> section of this article.</p>\n<div class='callout-warning'>\n<div>\n<strong>Important: </strong>If you enable the settings in the <strong>VirusTotal Automatic Scanning</strong> section of your settings, VirusTotal will automatically receive all links or hashes of attachments that PhishER is allowed to send for a VirusTotal scan. You can exclude URLs by adding their domains to your <strong>Ignored Domains</strong> list. The scanned URLs and hashed attachments will be shared publicly with the scan results in the VirusTotal community to spread awareness of verified malicious content. If you manually submit a file, the entire attachment is shared publicly with the scan results. This information is important to consider when running VirusTotal scans on URLs or on attachments with sensitive information.</div>\n</div>\n<h2 id='h_01HSBWVDPN1F4Q9S2RT7BVX2B8'>Excluding KnowBe4 Domains from Scans</h2>\n<p>KnowBe4 uses multiple domains that should not be sent as links or attachments to VirusTotal. You can enter these domains in the <strong>Ignored Domains</strong> field on the <strong>VirusTotal</strong> subtab of your PhishER Settings. For a full list of these domains, see the list below:</p>\n<ul>\n<li>kb4.io</li>\n<li>comano.us</li>\n<li>magnetonics.com</li>\n<li>bloemlight.com</li>\n<li>instantrevert.net</li>\n<li>phishing.guru</li>\n<li>phishtrain.org</li>\n<li>malwarebouncer.com</li>\n<li>phish.farm</li>\n<li>microransom.us</li>\n<li>msftemail.com</li>\n<li>compromisedblog.com</li>\n<li>com-onlinebanking.com</li>\n<li>com-token-auth.com</li>\n<li>2O2.lOl</li>\n<li>protected-forms.com</li>\n<li>cert-sha256.com</li>\n<li>wishyoudidntclickthis.com</li>\n<li>cert-sha256.co.uk</li>\n<li>internalportal.net</li>\n<li>twittermessage.net</li>\n<li>my-cloud-mail.com</li>\n<li>linkedlnu.com</li>\n<li>farenheit.net</li>\n<li>gooqleonline.com</li>\n<li>donotreply.biz</li>\n<li>aøl.com</li>\n<li>exchamge.org</li>\n<li>allibaba.org</li>\n<li>voipmessage.uk</li>\n<li>efaxonline.org</li>\n<li>bltly.us</li>\n<li>twittermessage.co.uk</li>\n<li>www-com.co.uk</li>\n<li>srvgov.com</li>\n<li>gooqle.eu</li>\n<li>allibaba.eu</li>\n<li>yourgunnalovetraining.com</li>\n<li>succesful.org</li>\n</ul>\n<h2 id='h_01HSBWVDPNRWD3KHWE0CD58Y5Z'>VirusTotal Tags</h2>\n<p>In the <strong>VirusTotal</strong> tags section of the <strong>VirusTotal</strong> subtab, you can view the tags that VirusTotal can attach to your messages after they are scanned. Based on the scan results, VirusTotal will apply one or more of the tags to your messages. To learn about the VirusTotal tags, see the list below:</p>\n<ol>\n<li>\n<strong>VT_Pending</strong>: This tag is attached to your message when a VirusTotal scan is queued. This tag will be removed when the scan is completed.</li>\n<li>\n<strong>VT_Bad</strong>: This tag is attached to your message when a VirusTotal scan determines that the attachment is malicious.</li>\n<li>\n<strong>VT_Scanned</strong>: This tag is attached to your message when a VirusTotal scan is completed and determined that the attachment is not malicious.</li>\n<li>\n<strong>VT_Bypassed</strong>: This tag is attached to your message when a VirusTotal scan times out. This tag is commonly attached with additional VirusTotal tags. You can set a custom timeout period under your <strong>VirusTotal Automatic Scanning</strong> settings.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If a VirusTotal timeout occurs, PhishER will allow automated actions to run against the message while the console waits for your VirusTotal results to return. After the automated actions are completed, VirusTotal can finish attaching tags to the message. Automated actions will not run again after the scan results return.</div>\n</div>\n</li>\n<li>\n<strong>VT_Hash_not_found</strong>: This tag is attached to your message when a VirusTotal scan doesn’t return a match for the hashed attachments.</li>\n<li>\n<strong>VT_Ignored</strong>: This tag is attached to your message when URLs or domains found on your whitelist are detected on a message.</li>\n</ol>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>A message with multiple attachments can have multiple VT tags since some scans may finish at different times or have different results.</div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/14193888378131-Integrate-VirusTotal-with-Your-PhishER-Platform"
  }
}