{
  "article": {
    "id": 14196559482387,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/14196559482387.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/14196559482387.html",
    "author_id": 1534339111301,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": -1,
    "vote_count": 1,
    "section_id": 7759989017491,
    "created_at": "2023-02-21T22:16:41Z",
    "updated_at": "2025-05-13T17:49:12Z",
    "name": "Create and Manage Webhooks in Your PhishER Platform",
    "title": "Create and Manage Webhooks in Your PhishER Platform",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T18:04:00Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot",
      "answerbot_phisher"
    ],
    "body": "<p>From the <strong>Webhook</strong> subtab of your PhishER Settings, you can create webhooks to connect your PhishER platform to other platforms you use. A webhook, also known as an HTTP push API, is a way for an application to provide another application with real-time information. When messages are triggered by specific PhishER actions, webhooks allow you to send data from the messages to another application.</p>\n<p>After you integrate webhooks with your PhishER platform, you can create a PhishER action and select the <strong>Send to Webhook</strong> option. This option allows PhishER to send the reported messages that are affected by that action to your organization’s webhook. After the action is triggered, you can click a related message in your PhishER <strong>Inbox</strong> and view which webhook the message is being sent to.</p>\n<div class='callout-tip'><div class='callout__content'>\n<strong>Tip:</strong> If you use Tines, you can set up webhooks to send a message to your Tines platform any time a user reports an email using the Phish Alert Button (PAB). For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4403664433683' target='_self'>Tines and PhishER Webhook Integration</a> article.</div></div>\n\n<h2 id='h_01HSBWS4ZWSZFVBT3G3WVHXCV0'>Creating a New Webhook</h2>\n<p>To connect a new webhook to your PhishER platform, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your PhishER platform.</li>\n<li>Navigate to <strong>Settings</strong> &gt; <strong>Webhook</strong>.</li>\n<li>Click the <strong>New Webhook</strong> button in the top-right corner of the page to open the <strong>Add Webhook Settings</strong> pop-up window.</li>\n<li>In the <strong>Add Webhook Settings </strong>pop-up window that opens, configure your webhook settings. To learn more about these settings, see the screenshot and list below:\n<ol type='a' role='list'>\n<li>\n<strong>Name:</strong> In this field, enter a custom name for your webhook.</li>\n<li>\n<strong>URL:</strong> In this field, enter the URL that you are trying to callback to. For a list of URL rewriters and shorteners that are compatible with PhishER, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360014171474#UNWINDING' target='_self'>PhishER FAQ</a> article.</li>\n<li>\n<strong>Authorization:</strong> From the drop-down menu, select one of the following protocols: <strong>No Auth</strong>, <strong>API Key</strong>, <strong>Bearer Token</strong>, or <strong>Basic Auth</strong>.</li>\n<li>\n<strong>Available Data:</strong> Select one or more types of data that you would like to send to the webhook.\n<div class='callout-note'><div class='callout__content'>\n<strong>Note:</strong>The <strong>Addresses</strong> data type sends all email addresses in the webhook payload, including the email addresses in the <strong>From</strong>, <strong>To</strong>, <strong>CC</strong>, <strong>Reply To</strong>, and <strong>Reported By</strong> fields.</div></div>\n</li>\n<li>\n<strong>Custom Data</strong>: To add custom data to your webhook’s payload, click the <strong>plus sign</strong> icon. Then, fill out the <strong>key</strong> and <strong>value</strong> fields. For example, if your application requires \"{ \"System\" : \"PhishER\" }\" in the payload to receive data, you could enter \"System\" and \"PhishER\".</li>\n<li>\n<strong>Custom Headers</strong>: If you would like to add a custom header, click the <strong>plus sign</strong> icon. Then, fill out the <strong>key</strong> and <strong>value</strong> fields. For example, if your firewall requires the \"{ \"Header\" : \"PhishER\" }” header to allow data to pass through, you could enter \"Header\" and \"PhishER\".</li>\n<li>\n<strong>Message Tags</strong>: In this section, you can select the <strong>Success</strong> or <strong>Failure</strong> check boxes if you would like PhishER to assign a tag when the webhook is used to send data. Then, enter a tag name in the field next to the selected check box. </li>\n</ol>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Webhooks/PhishER_Create_Webhook_Page.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Webhooks/PhishER_Create_Webhook_Page.png' alt='Create Webhook page'></a>\n</li>\n<li>Click <strong>Create</strong>.</li>\n</ol>\n\n\n<h2 id='h_01HSBWS4ZWCXQ8EP5H742AFX2H'>Managing Your Webhooks</h2>\n<p>From the <strong>Webhook</strong> subtab of your PhishER Settings, you can connect and manage your webhooks. To update a webhook, you can click a webhook’s name to open the <strong>Update Webhook Settings</strong> pop-up window. Then, you can update the webhook’s information.</p>\n<p>For more information about the <strong>Webhook</strong> subtab, see the screenshot and list below:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Webhooks/PhishER_Webhooks_Page.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Webhooks/PhishER_Webhooks_Page.png' alt='Webhook page'></a></p>\n\n<ol type='a' role='list'>\n<li>\n<strong>New Webhook:</strong> You can click this button to add a new webhook. For more information about adding a new webhook, see the above subsection of this article.</li>\n<li>\n<strong>Name:</strong> This column displays the name of the webhook.</li>\n<li>\n<strong>URL:</strong> This column displays the URL that the webhook will callback to.</li>\n<li>\n<strong>Selected Data:</strong> This column displays the types of data that you would like to send to the webhook.</li>\n<li>\n<strong>Success Tag:</strong> This column displays the tag that PhishER assigns to a message if the webhook successfully sent data and received a callback URL.</li>\n<li>\n<strong>Failure Tag:</strong> This column displays the tag that PhishER assigns to a message if the webhook was unable to send data and receive a callback URL.</li>\n<li>\n<strong>Actions:</strong> This column displays the actions available to run on a webhook entry. You can click the <strong>trash can</strong> icon to delete the entry.</li>\n</ol>\n",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/14196559482387-Create-and-Manage-Webhooks-in-Your-PhishER-Platform"
  }
}