{
  "article": {
    "id": 204936887,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/204936887.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/204936887.html",
    "author_id": 403968826754,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 22,
    "vote_count": 34,
    "section_id": 360000154687,
    "created_at": "2015-03-03T21:09:55Z",
    "updated_at": "2025-03-11T18:27:59Z",
    "name": "Users and Groups Management Guide",
    "title": "Users and Groups Management Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T18:27:59Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "users",
      "CSV",
      "delete users",
      "import users",
      "permanently delete",
      "archive",
      "User Management",
      "create new user",
      "localized",
      "answerbot",
      "create new groups",
      "new groups",
      "new users",
      "answerbot_kmsat"
    ],
    "body": "<p>From the Users tab, you can manage your users and groups, assign admins, and create and assign various security roles.</p>\n<h2 id='h_01HC01D0M7EBNJVACKW1KM02CM'>Adding Users</h2>\n<p>You have four options for importing users:</p>\n<ol role='list'>\n<li><a href='#h_01HC01D0M7YV98QFEM0HN158SD'>Quick Import</a></li>\n<li><a href='#h_01HC01D0M78DF5Y067R0S9H71Q'>CSV Import</a></li>\n<li><a href='#h_01HC01D0M77C04KR18VKTBD6VS'>User Provisioning</a></li>\n<li><a href='#h_01HC01D0M7XYVZZ2V5SE0CKQST'>Create Single User</a></li>\n</ol>\n<p>Alternatively, you can enable the <strong>Allow Users to Signup</strong> setting in your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a> to have users added automatically when they sign up for their own accounts. This setting is disabled by default.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Users who are added to the console will also be enrolled in any training campaign that has the \"Enable automatic enrollment for new users\" option selected. Before adding users, we recommend checking your campaigns' settings and disabling this option as needed.</div>\n</div>\n<h3 id='h_01HC01D0M7YV98QFEM0HN158SD'>Quick Import</h3>\n<p>The first method to add users is <strong>Quick Import</strong>. This method allows you to import your users' email addresses. If you'd like to import additional information about your users, we recommend using <a href='#h_01HC01D0M78DF5Y067R0S9H71Q'>CSV Import</a> or <a href='#h_01HC01D0M77C04KR18VKTBD6VS'>User Provisioning</a>.</p>\n<div><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/users+and+groups/2018/QuickImport_01.png'><img src='https://s3.amazonaws.com/helpimg/users+and+groups/2018/QuickImport_01.png' alt=' '></a></div>\n<ol role='list'>\n<li>Navigate to the <strong>Users</strong> tab and click <strong>Import Users</strong>.</li>\n<li>Type or paste your list of users’ email addresses into the text box. These email addresses must match the format outlined to the right of the text box. Make sure you only enter one email address per line.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>In most cases, the only email addresses the import will accept are addresses that use the domain your organization signed up with. If your organization uses multiple email domains, please see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013430414'>How to Add and Verify Domains</a> article for more information.</div>\n</div>\n</li>\n<li>Once imported, users will be asked to create their own password when they first log in for training. If you prefer to set a single password for all imported users, select the <strong>Set Password for Users </strong>checkbox.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>We recommend only using this option in special cases. You can select the new <strong>Require users to reset initial password set by admins</strong> check box to require users to change their set passwords after their first login.</div>\n</div>\n</li>\n<li>If you would like to add the imported users to a specific group or groups, select the <strong>Select Groups for Users </strong>checkbox. Then, choose one or more groups from the drop-down list.</li>\n</ol>\n<p>Once you've entered your users and details accordingly, click <strong>Import Users</strong>.</p>\n<div class='callout-warning'>\n<div class='callout__content'>\n<strong>Important:</strong>When using the quick import option, ensure that you only import valid single-user email addresses. Do not import distribution lists or generic \"catch-all\" email addresses.</div>\n</div>\n<h3 id='h_01HC01D0M78DF5Y067R0S9H71Q'>CSV Import</h3>\n<p>You can use our CSV import feature to bulk import users and add optional additional information about your users. This feature is located in the <strong>Users</strong> section under the <strong>Import Users</strong> tab.</p>\n<p>To learn more about how to import users using a CSV file and what user information fields you can include, read our article: <a href='https://support.knowbe4.com/hc/en-us/articles/204873347'>CSV Import: How do I import users with a CSV file?</a></p>\n<h3 id='h_01HC01D0M77C04KR18VKTBD6VS'>User Provisioning</h3>\n<p>You can use Active Directory Integration (ADI) or SCIM to bulk import users and add optional additional information about your users. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/228373888'>Active Directory Integration (ADI)</a> article or our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374'>SCIM Configuration Guide</a> article.</p>\n<h3 id='h_01HC01D0M7XYVZZ2V5SE0CKQST'>Create Single User</h3>\n<p>You can manually add a user with details such as their first and last name, email, and job title. To add a user, navigate to the <strong>Users</strong> tab. Click the <strong>Add Users</strong> drop-down and then click <strong>Create Single User</strong>.</p>\n<h2 id='h_01HC01D0M7CDR4QSGHBHJ5YT1T'>Managing and Editing Users</h2>\n<p>The <strong>Users</strong> tab lists all of your users. From this list, you can add users to or remove them from groups, promote or revoke admin rights, edit basic profile information, and export a list of your users to a CSV file.</p>\n<div><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/users+and+groups/ManageUsers.png'><img src='https://s3.amazonaws.com/helpimg/users+and+groups/ManageUsers.png' alt=' '></a></div>\n<ol role='list'>\n<li>\n<strong>Add Users</strong>: Use this drop-down to create a single user or bulk import users. When creating a new user, you can add details such as their first and last name, email, and job title.</li>\n<li>\n<strong>Filters</strong>: You can filter this table by status, the type of user, whether you want to see end-users, Admins or both, or by their assigned group or groups.\n<ul role='list'>\n<li>Under the <strong>Groups</strong> filter, you can select <strong>No Groups</strong> to filter by users who are not currently members of any group.</li>\n</ul>\n</li>\n<li>\n<strong>Bulk Archive</strong>: Clicking this link will open the <strong>Bulk Archive</strong> window. See the <a href='https://support.knowbe4.com/hc/en-us/articles/204367808'>How Do I Archive or Delete Users</a> article for more information.\n<ul role='list'>\n<li>When viewing <strong>Archived</strong> users, this button will be replaced with the <strong>Bulk Delete</strong> option. See the <a href='https://support.knowbe4.com/hc/en-us/articles/204367808'>How Do I Archive or Delete Users</a> article for more information.</li>\n</ul>\n</li>\n<li>\n<strong>Generate CSV</strong>: Click this button to generate a CSV file. Once generated, you can download the CSV file from your <strong>Download Center</strong>. See our <a href='https://support.knowbe4.com/hc/en-us/articles/4403282239891'>Download Center Guide</a> for more information.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you have more than 51,000 users, your download will be divided into multiple CSV files with a maximum of 50,000 users in each file.</div>\n</div>\n</li>\n<li>\n<strong>Search</strong>: This search bar can be used to filter the list by email or user name.</li>\n<li>\n<strong>User Email, Name, and Icon</strong>: Click on a user's name to see more details on that user. The icons indicate different information about a user. See the following list to learn more about each icon.\n<ul role='list'>\n<li>When ADI is enabled, these icons indicate whether a user was added to the console directly <span class='fa-brands fa-windows mod-ui'></span> or if the user is managed by ADI <span class='fa-brands fa-windows mod-ui'></span>.</li>\n<li>When SCIM is enabled, this icon <span class='fa-solid fa-cloud-arrow-down mod-ui'></span> indicates the user is managed by SCIM.</li>\n<li>The phish icon <span class='fa-kit fa-phisher fa-xl mod-ui'></span> indicates this user has access to your PhishER platform. See the <a href='https://support.knowbe4.com/hc/en-us/articles/360010802673'>PhishER Product Manual</a> for more information.</li>\n</ul>\n</li>\n<li>\n<strong>PPP</strong>: This is the user's <strong>Phish-prone Percentage</strong>. See our <a href='https://support.knowbe4.com/hc/en-us/articles/115010178267'>How Is Phish-prone Percentage Calculated?</a> article for more information.</li>\n<li>\n<strong>Risk</strong>: See our <a href='https://support.knowbe4.com/hc/en-us/articles/360001358728'>Risk Score Guide</a> for more information.</li>\n<li>\n<strong>Actions</strong>: Use the drop-down arrow to <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups#EDITUSERS'>edit</a>, <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups#DELETING'>archive</a>, or <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups#ASSIGNING%20&amp;%20REVOKING%20ADMIN'>change admin rights</a> for the specified user.</li>\n</ol>\n<h3 id='h_01HC01D0M7PBDC2C1W53FCSGA4'>Editing Users</h3>\n<p>You can click on any user’s email address to see detailed information about that user’s training history and phishing results. You can also manually edit any information you have imported into the system about that user from this window. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974'>User Profile Guide</a> for more information.</p>\n<div><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/user_profile/UserProfileTabs.png'><img src='https://s3.amazonaws.com/helpimg/user_profile/UserProfileTabs.png' alt=' '></a></div>\n<h3 id='h_01HC01D0M7M8TV29Y33N9BFD2V'>Archiving and Deleting Users</h3>\n<p>To help manage your user list, you have the ability to archive, restore, and delete users. See our <a href='https://support.knowbe4.com/hc/en-us/articles/204367808-How-do-I-Archive-or-Delete-a-User-'>How do I archive or delete a user?</a> article for more information.</p>\n<h2 id='h_01HC01D0M7T97WX18H9CJWE9V1'>Assigning or Revoking Admin Privileges</h2>\n<p>Admins have access to all available features in the console. You can assign or revoke admin privileges to users from the <strong>Users</strong> tab. Users who have admin privileges are shown with a blue background in the <strong>Users</strong> list. See our <a href='https://support.knowbe4.com/hc/en-us/articles/205015187'>How to Assign and Remove Admin Privileges</a> article for more information.</p>\n<h2 id='h_01HC01D0M7BG4N2JHP191E7JJB'>Security Roles</h2>\n<p>Platinum and Diamond customers can use our Security Roles feature to provide additional access to areas in the console to specific groups of users. See our <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767-How-to-Use-Security-Roles'>How to Use Security Roles</a> article or watch the <a href='https://support.knowbe4.com/hc/en-us/articles/115015565847'>How to Use Security Roles</a> video for more information.</p>\n<h2 id='h_01HC01D0M75RJ2421XMBT3G48D'>Managing Groups</h2>\n<p>The best way to get the most out of your KnowBe4 console is to use groups effectively. Groups can be used to target users with specific phishing or training campaigns. To view or manage your groups, navigate to the <strong>Users</strong> tab. Then, select the <strong>Groups</strong> subtab.</p>\n<div><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/users+and+groups/ManageGroups.png'><img src='https://s3.amazonaws.com/helpimg/users+and+groups/ManageGroups.png' alt=' '></a></div>\n<ol role='list'>\n<li>\n<strong>+ Create New Group</strong>: Click this button to create a new group.</li>\n<li>\n<strong>Status and Type</strong> <strong>Filters</strong>: You can filter this table by the group status, either Active or Archived, and by the type of group, options include: Console, Smart, SCIM Managed, and ADI Managed.</li>\n<li>\n<strong>Generate CSV</strong>: Click this button to generate a CSV file. Once generated, you can download the CSV file from your <strong>Download Center</strong>. See our <a href='https://support.knowbe4.com/hc/en-us/articles/4403282239891' target='_self'>Download Center Guide</a> for more information.</li>\n<li>\n<strong>Archive</strong>: Remove this group without deleting it from the console. See the <a href='#h_01HC01D0M862R7HVJMXJCBQDTP'>Archiving Groups</a> section for more information.</li>\n<li>\n<strong>Search</strong>: This search bar can be used to filter the table by group names.</li>\n<li>\n<strong>Group Name and Icon</strong>: Click on a group name to see more details on that group. The icons indicate whether a group is a console group, AD-managed group <span class='fa-brands fa-windows mod-ui'></span>, SCIM-managed group <span class='fa-solid fa-cloud-arrow-down mod-ui'></span>, or Smart Group <span class='fa-solid fa-users mod-ui'></span>.</li>\n<li>\n<strong>Risk Booster</strong>: The current risk booster set for this group. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360008243474'>Risk Boosters Guide</a> for more information.</li>\n<li>\n<strong>Actions</strong>: Use the drop-down arrow to <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups#CLONEGROUPS'>clone</a>, edit, or <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups#ARCHIVINGROUPS'>archive</a> a group. You can also choose to remove all users from the group or archive all users within the group.</li>\n</ol>\n<h3 id='h_01HC01D0M795RTF0418ZVZXP9Q'>Creating Groups</h3>\n<p>There are no premade groups so you will need to create the groups you need. You can create a group directly in your KnowBe4 console by using the CSV Import function or by using Active Directory Integration. See our <a href='https://support.knowbe4.com/hc/en-us/articles/115010243207'>How Do I Create a New Group?</a> article for more information.</p>\n<h3 id='h_01HC01D0M7KRZ9BQ4K5GBHNN0J'>Adding Users to Groups</h3>\n<p>After importing users, you can sort them into groups. Sorting can be done by department, location, domain, or any other characteristic you'd like. Users can be in as many groups as needed, and there is no limit to the number of groups you can create. See our <a href='https://support.knowbe4.com/hc/en-us/articles/205070247'>How Do I Add or Remove a User to or from a Group?</a> for more information.</p>\n<h3 id='h_01HC01D0M852Q3Q1NGT6Q54VB1'>Cloning Groups</h3>\n<p>You can make a copy of any existing group by cloning it. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360008327773-How-to-Clone-a-Group'>How to Clone a Group</a> article for more information.</p>\n<h3 id='h_01HC01D0M862R7HVJMXJCBQDTP'>Archiving Groups</h3>\n<p>You can archive groups that you no longer need. Archiving groups allows you to remove your group from use while maintaining users that were a part of the groups. You can also unarchive the group at any time to reinstate the memberships. To archive a group, follow the steps below:</p>\n<p>To archive a group:</p>\n<ol role='list'>\n<li>In your KnowBe4 console, navigate to <strong>Users</strong> &gt; <strong>Groups</strong>.</li>\n<li>From the list of groups, find the group you would like to archive.</li>\n<li>Under the <strong>Actions</strong> column, click the drop-down arrow next to the desired group and select <strong>Archive</strong>.</li>\n</ol>\n<h4 id='h_01HC01D0M8VEDS5AV499BHP6AB'>Viewing Archived Groups</h4>\n<p>To view your archived groups, use the <strong>Status</strong> drop-down menu above the groups list and select <strong>Archived</strong>.</p>\n<div><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/users+and+groups/ViewArchivedGroups.png'><img src='https://s3.amazonaws.com/helpimg/users+and+groups/ViewArchivedGroups.png' alt=' '></a></div>\n<h4 id='h_01HC01D0M82HCFP21MXXKF43AF'>Restoring Archived Groups</h4>\n<p>To restore an archived group, click the drop-down arrow next to the desired group, and select <strong>Restore</strong>.</p>\n<h3 id='h_01HC01D0M8EDC60J692X2DP28E'>Deleting Groups</h3>\n<p>You can delete groups that you no longer need. However, please be aware that any group you delete will be permanently deleted.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>When deleting a group, the user data within the group will remain unchanged. Only the group will be permanently deleted from your KnowBe4 console.</div>\n</div>\n<p>To delete a group, first <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups#ARCHIVINGROUPS' target='_self'>archive</a> the group. Then, view the archived groups by using the <strong>Status</strong> drop-down menu above the groups list and select <strong>Archived</strong>.</p>\n<div><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/users+and+groups/ViewArchivedGroups.png'><img src='https://s3.amazonaws.com/helpimg/users+and+groups/ViewArchivedGroups.png' alt=' '></a></div>\n<p>Click the red <strong>Delete</strong> button above the groups list. When a group is deleted, the users within that group will stay in the system.</p>\n<ol role='list'>\n<li>The<strong> Delete Selected</strong> option allows you to delete the groups you’ve selected. Click the checkbox to the left of the group or groups you wish to delete. Once you've selected all the groups you want deleted, click the red <strong>Delete</strong> button and choose <strong>Delete Selected</strong>.</li>\n<li>To use the <strong>Bulk Delete from CSV</strong> option, you must first prepare a CSV file to list each archived group you wish to delete. Groups named in the CSV that are not currently archived will not be deleted. When you’re ready to upload your CSV file, click the red <strong>Delete</strong> button and choose <strong>Bulk Delete from CSV</strong>. The following window will open:\n<ol role='list' type='a'>\n<li>Click <strong>Browse</strong> to select and upload your prepared CSV file.</li>\n<li>Select which users you wish to notify of these deletions (if any). Then, click <strong>Delete Groups</strong> to permanently delete the groups in the CSV.</li>\n</ol>\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/users+and+groups/BulkDelete.png'><img src='https://s3.amazonaws.com/helpimg/users+and+groups/BulkDelete.png' alt=' '></a>\n</li>\n</ol>\n<h2 id='h_01HC01D0M87V5Z99Z0JPG05R4P'>Smart Groups</h2>\n<p>Our Smart Groups feature, available for Platinum and Diamond accounts, lets you create dynamic groups based on specific criteria that you define. These groups are beneficial for phishing tests, training campaigns, and for generating a variety of reports.</p>\n<p>To learn more about Smart Groups, check out this <a href='https://support.knowbe4.com/hc/en-us/sections/360005208193'>list of Smart Group articles</a> on our Knowledge Base.</p>\n<h2 id='h_01HC01D0M8V8SRAKYGPJMTSS6A'>Groups and Phishing Campaigns</h2>\n<p>Using groups in your phishing campaigns allows you to target a subset of users with specific phishing templates. Groups can be used to target certain departments or create spear-phishing attempts on key staff members. You can even target multiple groups in a single phishing campaign. By using groups, you can conduct phishing campaigns for specific regions or locations if you are interested in obtaining specific metrics from these campaigns.</p>\n<p>We recommend that you create groups for different locations, repeat clickers, management, and other sets of high-risk users. Our Smart Groups feature helps with the creation of these types of groups. You can learn more about Smart Groups (Platinum or Diamond only) in our <a href='https://support.knowbe4.com/hc/en-us/articles/8354913796115'>Smart Groups Overview</a> article.</p>\n<p>To see how Groups are doing in terms of their Phish-prone Percentage and number of phishing failures, such as clicks, go to <strong>Phishing</strong> &gt; <strong>Reports</strong> to use our <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894-Advanced-Reporting-Guide'>Reporting</a> feature.</p>\n<h2 id='h_01HC01D0M8W7JZYKRTRNMBMEBW'>Groups and Training Campaigns</h2>\n<p>When you set up a training campaign, you can choose to enroll all users or only enroll specific groups of users.</p>\n<p>You can also set up an automated remedial training for a Clickers group to provide additional training to users who frequently fail tests from phishing campaigns. Then, you can remove those users from the Clickers group upon completion of the remedial training. You can also re-enroll the users in the future if they fail another phishing test. For more information about remedial training, read our <a href='https://support.knowbe4.com/hc/en-us/articles/206280728-Using-Groups-for-Remedial-Training'>Using Groups for Remedial Training</a> article.</p>\n<p>You can use groups to track training progress and run reports on different groups of users. For example, you could find out how many members of the Clickers group have started but not completed a specific course. Any training-related report can also be filtered by group. Group reports can be found on the <strong>Reports</strong> tab as well as under the main Reports tab, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894-Advanced-Reporting-Guide'>Reporting</a> article for more information.</p>\n<p>You can also use groups to track the training progress of users on a staggered or ordered basis. For example, you could set up four campaigns, one for each quarter of the year. Each campaign can start at the beginning of each quarter, with the Q1 campaign targeting All Users. The subsequent three campaigns can target a Q2 group, Q3 group, and Q4 group. Your Q1 campaign could add completed users to the Q2 group, your Q2 campaign could add completed users to the Q3 group, and so on. This way, users will only be enrolled in the additional courses if they have completed the previous campaign's courses, such as a prerequisite.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups-Management-Guide",
    "images": [
      {
        "url": "https://s3.amazonaws.com/helpimg/users+and+groups/2018/QuickImport_01.png",
        "alt": "This image displays the **Import Users** page within a system's user management interface.\n\n**1. Page Context and Navigation:**\n*   **Title:** Import Users (with a cloud icon).\n*   **Navigation Bar (Tabs):** The active section is highlighted by the selected tab, **Import Users**. Other visible tabs include Users, Groups, Provisioning, Merge Users, and Security Roles.\n\n**2. Import Method Selection and Input (Section 1):**\n*   **Method Tabs:** Two distinct import methods are available: **Quick Import** (currently selected and highlighted dark gray) and **CSV Import** (unselected).\n*   **Input Area:** A large text area is provided for manual entry, labeled: \"Enter one user email per line\".\n*   **Format Guidance:** A light blue/teal information box provides required formatting instructions: \"Email addresses should have the following format:\", followed by email examples (`user1@professorphisher.com`, etc.).\n\n**3. Configuration Options:**\n*   **Set Password (Section 2):** A configuration checkbox labeled \"Set Password for Users\". Below the checkbox is an associated input field for defining the password, currently empty.\n*   **Group Assignment (Section 3):** A configuration checkbox labeled \"Select Groups for Users\". A help icon (question mark) is present next to the label. Below the checkbox is a dropdown selector for assigning groups.\n\n**4. Action Button:**\n*   A primary blue action button is located at the bottom of the interface, labeled **Import Users**.",
        "position": 1,
        "context": "SV Import or User Provisioning."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/users+and+groups/ManageUsers.png",
        "alt": "This image depicts a \"Manage Users\" administrative interface, featuring a navigation bar, user filtering controls, bulk action options, and a user data table.\n\n**Interface Layout and Key Elements:**\n\nThe main header is \"Manage Users.\" Primary navigation tabs include \"Users\" (selected), \"Groups,\" \"Import Users,\" \"Provisioning,\" \"Merge Users,\" \"Messages,\" and \"Security Roles.\"\n\n1.  **Add Users Button:** A prominent blue button in the top right corner labeled \"Add Users,\" featuring a dropdown chevron for immediate access to creation options.\n2.  **Filters:** A row of persistent filtering dropdowns controlling the visible user list: \"Status: Active,\" \"Type: All,\" and \"Groups: All.\"\n3.  **Bulk Archive:** A text link/button allowing the execution of a bulk archiving function.\n4.  **Generate CSV:** A text link/button, indicated by a download icon, used to export the current user data list as a CSV file.\n5.  **Search Input:** A dedicated search field prompting \"Search by email or name...\" accompanied by a search icon and a settings/configuration gear icon.\n\n**User Data Table Structure:**\n\nThe table displays user records under the following sortable column headers: Checkbox, User, PPP, Risk, Groups, Joined on, Last Sign-In, and Actions.\n\n6.  **Selected User Row:** The top user row is highlighted in light blue, indicating selection or focus. The row includes a checked checkbox, the user's identity (blurred), a cloud icon (indicating provisioning status), and an additional status icon (fish symbol).\n7.  **PPP Column Data:** A numerical or percentage value (blurred/0% in example rows) representing the \"PPP\" metric for the user.\n8.  **Risk Column Data:** A numerical value (blurred/38.5 in example rows) representing the \"Risk\" metric for the user.\n9.  **Actions Dropdown:** A dropdown menu icon in the \"Actions\" column, providing access to context-specific operations (e.g., edit, suspend) for the corresponding user row. The date fields \"Joined on\" and \"Last Sign-In\" contain date stamps (e.g., 06/09/2021, 11/29/2021).",
        "position": 2,
        "context": "rights, edit basic profile information, and export a list of your users to a CSV file."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/user_profile/UserProfileTabs.png",
        "alt": "This image displays a header and a navigation element for a user detail view in a web application.\n\n**Header Section:**\n*   **Title:** The main heading is \"**User Details: Fritz.Connell@kb4-demo.com**\" in bold, large, black text.\n*   **Icon:** A solid black silhouette of a person (user icon) precedes the title.\n*   **Context:** This section identifies the current view as detailing the specific user account associated with the email address `Fritz.Connell@kb4-demo.com`. A horizontal separator line is present below the title.\n\n**Navigation Bar (Tab Menu):**\n*   A tab-based navigation bar is situated immediately below the header.\n*   **Active Tab:** \"**User Dashboard**\" is the currently selected tab, visually indicated by a gray background, slightly rounded corners, and black text.\n*   **Inactive Tabs (Links):** The remaining tabs are displayed as clickable links (blue text) in a horizontal row: \"**Phishing**\", \"**Training**\", \"**User Timeline**\", and \"**User Information**\".",
        "position": 3,
        "context": "nowbe4.com/hc/en-us/articles/360009588974'>User Profile Guide for more information."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/users+and+groups/ManageGroups.png",
        "alt": "This image displays the **Manage Groups** administrative interface, designed for viewing and manipulating user groups.\n\n## UI Elements and Layout\n\n**1. Navigation and Context:**\nThe interface title is **Manage Groups**. A secondary navigation bar contains tabs: Users, **Groups (Active Tab)**, Import Users, Provisioning, Merge Users, and Security Roles.\n\n**2. Primary Actions (Top Right):**\nA blue button labeled **+ Create New Group** is the primary action element.\n\n**3. Filtering and Search Controls:**\nBelow the navigation tabs are filtering dropdowns:\n*   **Status:** Currently set to \"Active.\"\n*   **Type:** Currently set to \"All.\"\n*   **Search Bar:** A text input field labeled \"Search by group name...\" is available for filtering the list.\n\n**4. Bulk Actions and Data Export:**\nAction buttons positioned above the table include:\n*   **Download CSV** (with a green download icon).\n*   **Archive** (a pink button with an archive icon, implying a bulk action for selected groups).\n\n**5. Group Table Structure:**\nThe main content is a data table listing groups, preceded by checkboxes for bulk selection. The table columns are:\n*   Checkbox (for selection)\n*   **Name** (Sortable)\n*   **Created On** (Sortable)\n*   **Risk Booster** (Sortable)\n*   **Risk Score** (Sortable)\n*   **Members** (Sortable)\n*   **Actions**\n\n## Data Details and Row Examples\n\n**6. Group Data:**\nVisible rows include example groups: \"All Permissions,\" \"Clickers,\" \"Completed,\" and \"knowbe4.com.\"\n*   **Synchronization Status:** Each group name (e.g., \"All Permissions\") is preceded by a cloud icon with a downward arrow, typically indicating that the group is synchronized from an external source (e.g., AD or SCIM).\n*   **Created On:** All visible groups were created on \"10/13/2020.\"\n\n**7. Risk Metrics:**\n*   **Risk Booster:** Displays status tags, universally showing a blue **\"Normal\"** tag for the visible groups.\n*   **Risk Score:** All visible groups show a score of **\"0.\"**\n*   **Members:** The count varies (e.g., \"All Permissions\" has 1 member, others have 0 or 4).\n\n**8. Actions:**\nThe final column contains a dropdown chevron for each row, providing contextual actions specific to that group.",
        "position": 4,
        "context": "Then, select the Groups subtab."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/users+and+groups/ViewArchivedGroups.png",
        "alt": "This image displays a segment of a user interface featuring a filter control bar overlaying a list view.\n\n**Filter Control Bar (Top):**\nThe top bar displays two filter controls:\n1.  **Status:** (Bold text) Set to the value \"Archived,\" indicated by a down-arrow dropdown selector.\n2.  **Type:** (Bold text) Set to the value \"All,\" indicated by a down-arrow dropdown selector.\n\n**Dropdown Menu (Popover):**\nA popover dropdown menu is actively displayed directly below the **Status** filter, obscuring content below. The menu contains three visible options:\n*   **Active:** Standard text entry.\n*   **Archived:** This option is highlighted with a solid blue background and white text, indicating the current selection or hover state.\n*   **New Hires:** Blue text preceded by a small blue icon depicting a group of three stylized people.\n\n**Underlying Structure:**\nTo the immediate left of the open dropdown, two data rows from an underlying list or table are visible. Each row includes an unchecked square checkbox and is separated by a thin horizontal dividing line.",
        "position": 5,
        "context": "rong> drop-down menu above the groups list and select Archived."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/users+and+groups/ViewArchivedGroups.png",
        "alt": "This image displays a segment of a user interface featuring a filter control bar overlaying a list view.\n\n**Filter Control Bar (Top):**\nThe top bar displays two filter controls:\n1.  **Status:** (Bold text) Set to the value \"Archived,\" indicated by a down-arrow dropdown selector.\n2.  **Type:** (Bold text) Set to the value \"All,\" indicated by a down-arrow dropdown selector.\n\n**Dropdown Menu (Popover):**\nA popover dropdown menu is actively displayed directly below the **Status** filter, obscuring content below. The menu contains three visible options:\n*   **Active:** Standard text entry.\n*   **Archived:** This option is highlighted with a solid blue background and white text, indicating the current selection or hover state.\n*   **New Hires:** Blue text preceded by a small blue icon depicting a group of three stylized people.\n\n**Underlying Structure:**\nTo the immediate left of the open dropdown, two data rows from an underlying list or table are visible. Each row includes an unchecked square checkbox and is separated by a thin horizontal dividing line.",
        "position": 6,
        "context": "rong> drop-down menu above the groups list and select Archived."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/users+and+groups/BulkDelete.png",
        "alt": "This is a UI modal for \"Bulk Delete from CSV.\" The form requires input of a CSV file containing groups to be permanently deleted and specifies notification settings and critical preconditions.\n\n**UI Elements and Input Fields:**\n\n1.  **CSV Upload:** Labeled \"Select a CSV file.\" It contains a text input displaying \"No file chosen\" and an adjacent \"Browse\" button.\n2.  **Notification Setting:** Labeled \"Notify upon bulk delete completion.\" This is a grouped button set with three mutually exclusive options:\n    *   **None** (Currently selected/active).\n    *   **All Console Admins**\n    *   **Specific Admins**\n\n**Contextual Information Panels:**\n\n1.  **Format Guide (Teal Panel):** Provides the required structure for the input file, titled \"Your CSV file should have the following format.\" The content shows examples: \"Name,\" \"Group Name 1,\" \"Group Name 2,\" and \"Group Name 3,\" indicating a single column input of group names.\n2.  **Warning and Preconditions (Red Panel):** Contains a critical warning note:\n    *   **Irreversibility:** \"This will delete all data associated with the groups included in the CSV. This action cannot be reversed.\"\n    *   **Prerequisite:** \"The groups must have been previously archived to be deleted through this method.\"\n\n**Action Buttons (Footer):**\n\n1.  **Cancel:** Standard gray button.\n2.  **Delete Groups:** High-priority, destructive action button colored red.",
        "position": 7,
        "context": "hen, click Delete Groups to permanently delete the groups in the CSV."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "groups",
        "management",
        "users"
      ],
      "image_count": 7
    }
  }
}