{
  "article": {
    "id": 215781208,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/215781208.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/215781208.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 11,
    "vote_sum": 11,
    "vote_count": 15,
    "section_id": 26427556772755,
    "created_at": "2016-01-15T18:40:34Z",
    "updated_at": "2025-11-11T18:29:27Z",
    "name": "Monitor and Review Overall Phishing Reports",
    "title": "Monitor and Review Overall Phishing Reports",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-10-24T20:28:55Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "phishing",
      "reports",
      "reporting",
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>In your KnowBe4 Security Awareness Training (KSAT) console, you can create and view reports about your phishing campaigns. You have the option to customize your report to include specific data, such as the number of clicks in a phishing test or the number of phishing emails your users have reported in a campaign. To view your phishing reports, log in to your KnowBe4 account and navigate to <strong>Phishing </strong> &gt; <strong>Reports</strong>.</p>\n<p>In this article, you'll learn how to customize and view your phishing reports. For more information about monitoring your phishing campaigns, see our<a href='https://support.knowbe4.com/hc/en-us/articles/217841868'> Monitor and Review Phishing Campaigns</a> article and our <a href='https://support.knowbe4.com/hc/en-us/articles/226677068'>Monitor Phishing Campaigns</a> video.</p>\n<h2 id='h_01HQR3FDAWV89TQJ2AEXA7ED1R'>Customizing Phishing Reports</h2>\n<p>You can customize your report on the <strong>Phishing Security Test Reports</strong> page by adjusting the filters at the top of the page. To learn about the filters on this page, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Phishing/Reports/KMSAT_PhishingReportSettings.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Phishing/Reports/KMSAT_PhishingReportSettings.png'> </a></p>\n<ol type='a'>\n<li>\n<strong>Date Range</strong>: Click this drop-down menu to select a specific date range to use for the report.</li>\n<li>\n<strong>Time Zone:</strong> Click this drop-down menu to select a specific time zone for this report.</li>\n<li>\n<strong>Include Selected Campaigns</strong>: Click this drop-down menu to select one or more phishing campaigns to include in the report.</li>\n<li>\n<strong>Include Campaigns Sent to</strong>: Click this drop-down menu to select one or more groups to include in the report.</li>\n<li>\n<p><strong>Compare</strong>: Click this drop-down menu to select which type of information you would like to compare. You can compare either phishing test <strong>Failures</strong> or <strong>Reported</strong> phishing tests.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong> You can only view data for the <strong>Reported</strong> option if your organization has installed the Phish Alert Button (PAB). For more information about the PAB, see our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button (PAB) Product Manual</a>.</div>\n</div>\n<p>If you select <strong>Failures </strong>or <strong>Reported</strong> from the drop-down menu, a <strong>Group Comparisons By</strong> drop-down menu will appear. From this drop-down menu, you can select the metric that you would like to compare to the phishing failures or reported phishing tests. For example, if you select <strong>Failures </strong>and then select <strong>Location</strong>, you can view a report that compares phishing failures by location. You could use this data to determine which locations fail phishing tests more frequently.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> To group users by a specific metric, you will need to have these metrics available. For example, if you want to compare by location, you will need to have your users' locations specified in their user information. You can add this information by importing your users with a CSV file or by using our user provisioning feature. For more information, see our<a href='https://support.knowbe4.com/hc/en-us/articles/204873347'> Import Users with a CSV File</a> article, our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374'>SCIM Configuration Guide</a>, and our<a href='https://support.knowbe4.com/hc/en-us/articles/228373888'> \"Active Directory Integration (ADI) Configuration Guide</a>.</div>\n</div>\n</li>\n<li>\n<strong>Include</strong><strong> Non-Failures</strong>: Select this check box to include all users in the report, including users who have not failed phishing tests. If you do not select this check box, only the users who have failed phishing tests will appear in the report.</li>\n</ol>\n<h2 id='h_01HQR3FDAW72EK8RWYG1VCTMD2'>Viewing Phishing Reports</h2>\n<p>After you customize your phishing report settings, click the <strong>Submit</strong> button to view your report. If you select an option in the <strong>Compare</strong> drop-down menu, a pie graph will display. If you do not select an option in the <strong>Compare</strong> drop-down menu, a line graph will display.</p>\n<p>Under each graph, you can click an item in the legend to remove it from the graph. For example, you can click <strong>Industry Average</strong> to remove the line that represents the industry average Phish-prone Percentage. To add the item back to the graph, click the item in the legend again.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/phishing_reports/How+to+remove+an+object+from+legend.gif'><img src='https://helpimg.s3.amazonaws.com/phishing_reports/How+to+remove+an+object+from+legend.gif' alt='Removing object from legend GIF'></a></p>\n<p>Below the graph, you can view a table with additional information. You can also print and download the report.</p>\n<p>To learn more about the information in the table, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/phishing_reports/KMSAT_Phishing+Data.png'><img src='https://helpimg.s3.amazonaws.com/phishing_reports/KMSAT_Phishing+Data.png' alt='Report data PNG'></a></p>\n<ol type='a'>\n<li>\n<strong>Search by...</strong> : If you selected an option in the <strong>Compare</strong> drop-down menu, you can search by the metric you selected in the <strong>Group Comparisons by </strong>drop-down menu. If you did not select an option in the <strong>Compare</strong> drop-down menu, you can search by your users' email addresses or names.</li>\n<li>\n<strong>Print Report</strong>: Click this button to print a PDF file of your report, including the graph and table. The PDF file will only display the columns selected in the <strong>gear icon &gt; Columns</strong> drop-down menu. For example, if you deselect the <strong>Location </strong>check box from the <strong>Columns</strong> drop-down menu, the PDF file will not display the <strong>Location</strong> column.</li>\n<li>\n<strong>Generate CSV</strong>: Click this button to generate a CSV file that displays the table. The CSV file will display all of the columns that are listed in the table's settings. For example, if you deselect the <strong>Location</strong> check box from the <strong>Columns</strong> drop-down menu, the CSV file will still display the <strong>Location</strong> column.</li>\n<li>\n<strong>Columns</strong>: Click the <strong>gear</strong> icon to open the <strong>Columns</strong> drop-down menu. This drop-down menu contains a list of available columns for the table. You can select the check box next to a category to add or remove the column from the table.</li>\n</ol>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/215781208-Monitor-and-Review-Overall-Phishing-Reports",
    "images": [
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Phishing/Reports/KMSAT_PhishingReportSettings.png",
        "alt": "This image depicts a user interface (UI) panel designed for filtering and submitting report parameters, organized into two rows of controls.\n\n**Row 1: Primary Temporal and Campaign Filters**\n\n1.  **Date Range:** A dropdown select field, labeled \"Date Range\" (with an accompanying help icon). The default selected value is **\"Last 6 months\"**.\n2.  **Time Zone:** A dropdown select field, labeled \"Time Zone\". The default selected value is **\"(GMT-04:00) Eastern Time (US & Canada)\"**.\n3.  **Include Selected Campaigns:** A dropdown select field, labeled \"Include Selected Campaigns\". The default selected value is **\"All Phishing Campaigns\"**.\n\n**Row 2: User Scope, Comparison, and Submission**\n\n4.  **Include Campaigns Sent to:** A dropdown select field, labeled \"Include Campaigns Sent to\". The default selected value is **\"All Users\"**.\n5.  **Compare:** A dropdown select field, labeled \"Compare\". The placeholder or default value is **\"Select option\"**.\n6.  **Options and Action:**\n    *   **Checkbox:** An unchecked checkbox labeled **\"Include Non-Failures\"**.\n    *   **Submission Button:** A solid blue rectangular button labeled **\"Submit\"**.",
        "position": 1,
        "context": "ilters on this page, see the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/phishing_reports/How+to+remove+an+object+from+legend.gif",
        "alt": "",
        "position": 2,
        "context": "d the item back to the graph, click the item in the legend again."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/phishing_reports/KMSAT_Phishing+Data.png",
        "alt": "",
        "position": 3,
        "context": "learn more about the information in the table, see the screenshot and list below:"
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "monitor",
        "overall",
        "phishing",
        "reports"
      ],
      "image_count": 3
    }
  }
}