{
  "article": {
    "id": 35666043722003,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/35666043722003.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/35666043722003.html",
    "author_id": 31899104510995,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 1,
    "vote_count": 1,
    "section_id": 35656853856403,
    "created_at": "2024-11-21T23:16:52Z",
    "updated_at": "2025-09-11T12:56:16Z",
    "name": "Defend - Feature Analysis",
    "title": "Defend - Feature Analysis",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-11T12:56:16Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot_defend"
    ],
    "body": "<p>Defend uses AI to detect and prevent the full spectrum of advanced phishing attacks. Leveraging machine learning, natural language processing, and natural language understanding, Defend detects the attacks that get through native security and Secure Email Gateways, including business email compromise.</p>\n<p>The following features are available with Defend. </p>\n<h2 id='h_01JEVM84CKB3DTKVPGB3NAKET4'>Advanced Phishing Detection</h2>\n<p>Defend features deliver inbound email protection using self-learning techniques, behavioral intelligence, language processing engines, and automation. Every aspect of an inbound email is analyzed in unison, enhancing detection efficacy. All controls are applied cross-platform, providing protection on any device or interface.</p>\n<h2 id='h_01JEVM84CKDM9TSBFV5YDQ7SJH'>Silent Mode</h2>\n<p>Silent mode allows Defend features to run in a monitoring mode without visual impact on end-users. This mode is typically used during a proof of concept (POC) or in the early stages of deployment while user communications are prepared.</p>\n<h2 id='h_01JEVM84CK3F667RSR8BMJZRKN'>Banners</h2>\n<p>Banners are a core part of the Defend service. Contextual color-coded HTML warning banners are added to emails received, immediately alerting users to the level of risk of an email. In this mode, links are typically rewritten to provide time-of-click protection. Banners provide real-time teachable moments for your users, explaining aspects of an email that indicate a threat and augmenting your security awareness and training.</p>\n<h2 id='h_01JEVM84CKDV0ZPTH6P543BHBJ'>Link Scanning and Rewriting</h2>\n<p>Defend features rewrite all URLs and scan links at the time of receipt and click. When scanning links, several checks are performed, including, but not limited to, blocklist checks, domain age, and number of redirects. The URL rewriting allows Defend to perform the checks again at the time of the click to protect against time-based attacks.</p>\n<p>The Defend URL rewriting feature can operate in conjunction with Microsoft SafeLinks. It cannot interoperate with other rewriting services from secure email gateways. This setting can be controlled via the Defend console <strong>Settings</strong> page.</p>\n<p><img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Defend+Link+Rewriting.png'></p>\n<h2 id='h_01JEVM84CKRM8EYSVMBQ0J1FHX'>Productivity Management</h2>\n<p>The Productivity Management feature encompasses graymail and spam detection and management to help users maintain clean, organized inboxes and focus on important communications.</p>\n<h3 id='h_01K4WDDX6MW0QG8XDMND7TE6FP'>Graymail </h3>\n<p>Graymail is a non-malicious bulk email sent from legitimate sources. Examples of graymail include opted-in newsletters, announcements, or advertisements. Defend features can detect graymail and action a graymail with the following functionality:</p>\n<ul>\n<li>Graymail banners</li>\n<li>Moving mail to a _Graymail folder</li>\n<li>Report as Graymail or not as Graymail buttons on email summary pages</li>\n</ul>\n<p>For full details, see the <a href='https://support.knowbe4.com/hc/en-us/articles/35666064197395-Defend-Graymail-Management'>Defend - Graymail Management</a> article.</p>\n<h3 id='h_01K4WDEE0531VK8N5WG45WYGKB'>Spam</h3>\n<p>Spam is unsolicited bulk email, also known as junk email. It's any kind of unwanted and unsolicited digital communication that gets sent out in bulk. Spam is usually sent for commercial purposes and can be dangerous when it contains malicious links or attachments. Defend can detect and act on spam emails with the following functionality:</p>\n<ul>\n<li>Spam banners</li>\n<li>Moving mail classified as spam to the Junk folder</li>\n<li>Report as spam or Report as not spam buttons on the email summary page</li>\n</ul>\n<p>For full details, see the <a href='https://support.knowbe4.com/hc/en-us/articles/37058465623443'>Defend - Spam Management</a> article.</p>\n<h2 id='h_01JEVM84CKPVPCVA9Z6EZYZB0P'>Reporting</h2>\n<p>The Defend console provides detailed reporting and analytics. All incidents are tracked along with granular details about the attack, including the phish type, payload, sender IP address, location, and authentication results. The Defend console can be used to investigate incidents, and an investigation status and comments section are available. Alternatively, events can be exported to your own SIEM or SOC.</p>\n<h2 id='h_01JEVM84CK7T701TKRGFJPX97E'>Remediation</h2>\n<p>Defend's email remediation controls, provided by Graph API, can be used to respond to threats quickly. In the case of a wider phishing attack sent to numerous internal recipients, Defend features can delete all identical or similar phishing emails.</p>\n<p>For full details, see the <a href='https://support.knowbe4.com/hc/en-us/articles/35666051020947-Defend-How-to-Remediate-Phishing-Emails'>Defend - How to Remediate Phishing Emails</a> article.</p>\n<h2 id='h_01JEVM84CKVEG2J6FZAQVYNAFS'>Abuse Mailbox</h2>\n<p><img src='https://helpimg.s3.us-east-1.amazonaws.com/egress/features_abuse_mailbox.png'>Usually, organizations have mailboxes that can be used to receive emails reported as phishing by end-users to be investigated. Defend features will monitor the specified abuse mailbox to see what is being reported by end-users and automatically remediate malicious and persistent phishing threats. Event notifications can also be configured to notify administrators when specific actions have occurred regarding the abuse mailbox.</p>\n<p>For full details, see the <a href='https://support.knowbe4.com/hc/en-us/articles/35666043364115-Defend-Abuse-Mailbox-Automation'>Defend – Abuse Mailbox Automation</a> article.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/35666043722003-Defend-Feature-Analysis",
    "images": [
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Defend+Link+Rewriting.png",
        "alt": "This image displays the configuration interface for **Link Rewriting**, a security settings panel organized into two columns and two rows on a dark background.\n\nEach configuration point includes a descriptive label, a help icon (question mark), and a dropdown selector indicating the current configuration state.\n\n**Configuration Settings:**\n\n| Position | Label/Description | Control Type | Current Value/Setting |\n| :--- | :--- | :--- | :--- |\n| **Row 1, Left** | Rewrite URLs to be scanned by Egress Defend | Dropdown Selector | Yes |\n| **Row 1, Right** | Prohibit users from accessing potentially harmful links | Dropdown Selector | Prevent users from following potentially harmful links fro... (Truncated text) |\n| **Row 2, Left** | Show Warning Page when user clicks on a link | Dropdown Selector | Only show Warning Page on potentially harmful links |\n| **Row 2, Right** | Display Egress Defend URL scanning page | Dropdown Selector | Enable |",
        "position": 1,
        "context": "This setting can be controlled via the Defend console Settings page."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/egress/features_abuse_mailbox.png",
        "alt": "This image is a dark-themed dashboard displaying email campaign security statistics and a detailed log for an \"Abuse Mailbox Automation\" feature.\n\n**Header and Navigation:**\n*   The title in the top left is \"Abuse Mailbox.\"\n*   The top right section shows the date range \"11/06/2024 - 02/03/2025,\" followed by the domain \"defend.kb4-demo.com\" and \"Defend Demo.\"\n*   Icons for a calendar, bell notification, and logout/exit are present on the far right.\n\n**Key Performance Indicators (KPIs) Section:**\nThe top section features five data cards summarizing campaign activity:\n1.  **Campaign Submissions:** 46 Analyzed, 0 Awaiting.\n2.  **Dangerous Campaigns:** 26\n3.  **Benign Campaigns:** 10\n4.  **Submission Accuracy:** 81%\n5.  **Campaigns Remediated:** 8 Manual, 9 Automatic.\n\n**Abuse Mailbox Automation Table:**\nBelow the KPIs is a detailed log titled \"Abuse Mailbox Automation.\" This table is sortable and includes **Filters** and **Export** buttons.\n\nThe table columns are:\n*   **Last Reported:** Timestamps like \"2/3/2025 2:03 AM.\"\n*   **Last Received:** Timestamps like \"2/3/2025 2:00 AM.\"\n*   **From:** (Content is redacted/blurred).\n*   **Subject(s):** Examples include \"Uber January offer,\" \"Urgent Overdue Refund Reques...\" and \"New Invoice.\"\n*   **Recipient(s):** Shows the count of recipients (e.g., \"6 Recipients\").\n*   **Reported By:** Shows the ratio of reporters to recipients (e.g., \"1/6 Recipients\").\n*   **Reanalysis:** Uses colored labels (Benign - blue, Dangerous - red, Inconclusive - yellow).\n*   **Status:** Uses colored labels indicating remediation state (e.g., \"No Action Required\" - gray/dark, \"Action Required\" - yellow, \"Remediated\" - blue, \"Auto Remediated\" - green, \"Remediation Stopped\" - red).\n\n**Example Data Rows (Focusing on Reanalysis and Status):**\n*   Row 1: Reanalysis: Benign, Status: No Action Required\n*   Row 2: Reanalysis: Inconclusive, Status: Action Required\n*   Row 3: Reanalysis: Dangerous, Status: Remediated\n*   Row 5: Reanalysis: Dangerous, Status: Auto Remediated",
        "position": 2,
        "context": "e4.com/hc/en-us/articles/35666051020947-Defend-How-to-Remediate-Phishing-Emails'>Defend - How to Rem"
      }
    ],
    "metadata": {
      "category": "Defend",
      "section": "Getting Started",
      "topics": [
        "analysis",
        "defend",
        "feature",
        "getting",
        "started"
      ],
      "image_count": 2
    }
  }
}