{
  "article": {
    "id": 360012723514,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360012723514.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360012723514.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 4,
    "vote_sum": 68,
    "vote_count": 88,
    "section_id": 4406914735251,
    "created_at": "2018-11-28T17:43:35Z",
    "updated_at": "2025-04-07T18:50:33Z",
    "name": "Learner Support: Leaderboards Guide",
    "title": "Learner Support: Leaderboards Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:13:34Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "browser",
      "Dashboard",
      "bandwidth",
      "Learner Dashboard",
      "localized",
      "IE_banner",
      "answerbot_kmsat"
    ],
    "body": "<p>Leaderboards are a fun way to compete with your colleagues and show off your security awareness skills. If your organization has enabled it, you can find it in the <strong>Leaderboard</strong> tab of your Learner Experience (LX). Depending on the setup, you may have an individual leaderboard or a group leaderboard. Read the sections below to learn more about these leaderboards and how rankings are calculated.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you're an admin looking to enable leaderboards for your organization, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014116634.html'>Leaderboards</a> section of our Learner Experience Guide.</div>\n</div>\n<h2 id='h_01HKAWXMBWBRMM8KE0BABYCR09'>Individual Leaderboard</h2>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/learner_experience/individual_leaderboard.png'><img src='https://helpimg.s3.amazonaws.com/learner_experience/individual_leaderboard.png' alt=' ' width='681' height='532'></a></p>\n<p>On the individual leaderboard, you’ll compete with your colleagues on how well you use the Phish Alert Button (PAB). For information on how to use the PAB, find the article for your specific email client in our <a href='https://support.knowbe4.com/hc/en-us/sections/4410339705875'>PAB Learner Support</a> section. Points are based on the percentage of simulated phishing emails you report and how quickly you report them.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important: </strong>If a campaign is deleted, the points you earned from it will be deducted from your total points on the leaderboard. The updated point totals may take up to 24 hours to display on the leaderboard. Also, only the closest 50 ranks above and below your position on the leaderboard can be displayed.</div>\n</div>\n<h3 id='h_01HKAX35BCFY82FTSQA6TGY4TF'>Detailed Point Calculation</h3>\n<p>To calculate your points for the individual leaderboard, we use the formula below:</p>\n<pre>(1000 x Percentage Reported) + Reaction Bonus</pre>\n<p><strong>Percentage Reported:</strong> This is calculated by dividing the number of simulated phishing emails you reported by the total number of phishing tests that were sent to you during a given timeframe.Depending on your organization’s settings, this timeframe may be monthly, quarterly, or annually.For example, if you receive four test emails but only report three, your percentage reported is 75 percent.</p>\n<p><strong>Reaction Bonus:</strong> Bonus points can only be earned within 72 hours of receiving a simulated phishing email. The bonus starts at 8,640 points, which equals two points for every minute of the earning period. From the time you receive a test email to the time you report it, the bonus decreases by two points every minute.For example, if you report a test email as soon as you receive it, you earn 8,640 bonus points. If you report a test email exactly one hour after receiving it, you earn 8,520 bonus points.</p>\n<p>Using the examples above in our formula, your total points would be 9,270.</p>\n<pre>(1000 x 75%) + 8520 = 9270</pre>\n<h2 id='h_01HKAWY3XKM0QE1ZK5QBV4RYCQ'>Group Leaderboard</h2>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/leaderboard.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/leaderboard.png' alt=' '></a></p>\n<p>On the group leaderboard, you’ll work in groups to complete all of your assigned training on time. The more training your group members have completed, the higher your group is on the leaderboard. Your organization sets up who is in each group and what the timeframe is for the leaderboard.</p>\n<p>Groups are ranked according to the percentage of training completed. This percentage is calculated by dividing the number of training assignments for each group member by the number of assignments they have completed.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360012723514-Learner-Support-Leaderboards-Guide"
  }
}