{
  "article": {
    "id": 360001641907,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360001641907.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360001641907.html",
    "author_id": 403968826754,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 7,
    "vote_sum": 20,
    "vote_count": 22,
    "section_id": 26429844577683,
    "created_at": "2018-06-29T22:18:11Z",
    "updated_at": "2025-09-03T14:32:27Z",
    "name": "Create and Manage Policies",
    "title": "Create and Manage Policies",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T18:32:35Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "policy",
      "languages",
      "hiding courses",
      "hide courses",
      "how to add",
      "end users",
      "acknowledge a policy",
      "advanced reports",
      "enterprise reports",
      "enterprise reporting",
      "lightningfast",
      "graduate",
      "hattrick",
      "cyberhero",
      "localized",
      "answerbot",
      "hostnames"
    ],
    "body": "<p>You can use our Policy Management feature to store, distribute, and track your organization’s policy acknowledgments. This feature allows you to assign policies and training content in the same training campaign while tracking your users’ policy acknowledgment progress.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Important: </strong>We also offer the option to create AI-generated policy quizzes to ensure your learners understand your organization’s policies. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/32559875558547-AIDA-Policy-Quiz-Guide'>AIDA Policy Quiz Guide</a>.</div>\n</div>\n<p>In your KnowBe4 console, you have the option to add your policy as a PDF file or as a URL. After you’ve added your policy, you can create a training campaign to assign the policy to your users. Once you’ve assigned the policy to a campaign, you can track your users’ progress and acknowledgments.</p>\n<p>Click the links below to learn more about our policy feature. If you prefer video tutorials, you see our <a href='https://support.knowbe4.com/hc/en-us/articles/360008389734' target='_self'>Adding Policies to the KnowBe4 Console</a> video or our <a href='https://support.knowbe4.com/hc/en-us/articles/4405460467219' target='_self'>Assigning and Monitoring Policies in a Campaign</a> video.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>The option to attach a policy directly to training content is a retired feature. All policies that were attached directly to training content when the feature was available will still continue to work. To view your previously attached policy, navigate to <strong>ModStore</strong> &gt; <strong>Library</strong> and find the content that you’d like to view. Then, click the <strong>Item Details</strong> icon and click <strong>Edit Policy</strong>.</div>\n</div>\n<h2 id='h_01HS1TWQV7Y21QNH3XYBHWDPES'>Adding PDF Policies</h2>\n<p>You have the ability to upload your organization's policies to your console as a PDF file or a URL. To upload a policy as a PDF file, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 console and navigate to <strong>Training</strong> &gt; <strong>Policies</strong>.</li>\n<li>Click the <strong>+ Add Policy</strong> drop-down menu.</li>\n<li>Select <strong>PDF</strong>.</li>\n<li>Fill out the fields on the <strong>Add PDF Policy</strong> page.</li>\n</ol>\n<p>For information about each of these fields, see the list below.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/policy_addpdf.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/policy_addpdf.png' alt=' '></a></p>\n<ol role='list'>\n<li>\n<strong>Policy Title:</strong> Enter the title of your policy or agreement. We recommend that you include the policy version or creation date in the title. This title will display on the interface your users will see when reading the policy.</li>\n<li>\n<strong>Status:</strong> Select the policy status. You can choose <strong>Draft</strong>, <strong>Published</strong>, or <strong>Archived</strong>. For more information about each of these statuses, see the <a href='#h_01FNRM62CN1WH4T6NEFAZWACDP' target='_self'>Policy Statuses</a> section of this article.</li>\n<li>\n<strong>Minimum Time Required:</strong> (Optional) Specify the minimum number of minutes that users must spend reviewing the policy before they can acknowledge the policy.</li>\n<li>\n<strong>Allow Download: </strong>(Optional) If you select this check box, your users will have the ability to download the policy from the <strong>Policy Viewer</strong> interface. For more information about the <strong>Policy Viewer</strong>, see the <a href='#h_01FNRNH53WMKG199EQPWC659WJ' target='_self'>User Experience</a> section of this article.</li>\n<li>\n<strong>Description:</strong> (Optional) In this field, you can enter a description of this policy for future reference.</li>\n<li>\n<strong>+ Add Language: </strong>Click this button to add a version of your policy. When you click, you’ll be taken to the <strong>Add Language</strong> page.\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>You can add as many language versions of your policy as you’d like, depending on your organization's needs. The first version that you add to the policy will be the default version for all users.</div>\n</div>\n</li>\n</ol>\n<p>Once you’ve filled out the fields above, fill out the fields on the <strong>Add Language</strong> page. For more information about the fields on the <strong>Add Language</strong> page, see the list below.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Policy+Management/PolicyMgmt_02.png'><img src='https://helpimg.s3.amazonaws.com/Policy+Management/PolicyMgmt_02.png' alt=' ' width='580' height='669'></a></p>\n<ol role='list'>\n<li>\n<strong>Policy Name:</strong> Enter a name for your policy. This name will be displayed to your users.</li>\n<li>\n<strong>Policy File: </strong>Click the <strong>Browse</strong> button to upload a PDF file of your policy.\n<div class='callout-warning'>\n<div class='callout__content'>\n<strong>Important:</strong>If you would like to upload a PDF file that was downloaded from DocuSign, the file must be unsigned. Signed PDF files from DocuSign will not upload successfully.</div>\n</div>\n</li>\n<li>\n<strong>Acceptance Requirements:</strong> Select your desired acknowledgment requirements. You can require your users to acknowledge each page of the policy or only the final page of the policy.</li>\n<li>\n<strong>Language:</strong> Select the language that the policy is written in. The first language that you add to the policy will be the default selection for all users.</li>\n<li>\n<strong>Acceptance Text:</strong> (Optional) Enter the text that you want to be displayed next to the acceptance check box when your users accept a policy.</li>\n<li>\n<strong>Per Page Acceptance Text:</strong> (Optional) Enter the text that you want to be displayed on all pages of the policy except the final page.</li>\n<li>\n<strong>Final Page Acceptance Text:</strong> (Optional) Enter the text that you want to be displayed on the final page of the policy.</li>\n<li>\n<strong>Save: </strong>Click this button to save this language version of the policy.</li>\n</ol>\n<p>You can add as many language versions of your policy as you’d like. Once you've added all language versions of the policy and customized your policy settings, click <strong>Create</strong>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>You can edit policies to add additional language versions at a later date. However, once you have added a policy to a campaign, the original policy files should not be changed to a revised version. For more information, see the <a href='#h_01FNRMHMKHW7H559FCTFHZPJ3X' target='_self'>Editing Policies</a> section of this article.</div>\n</div>\n<h2 id='h_01HS1TWQV76E3VQVM2QCK2YZKS'>Adding URL Policies</h2>\n<p>You have the ability to upload your organization's policies to your console as a PDF file or as a URL. To add a URL policy, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 console and navigate to <strong>Training</strong> &gt; <strong>Policies</strong>.</li>\n<li>Click the <strong>+ Add Policy</strong> drop-down menu.</li>\n<li>Select <strong>URL</strong>.</li>\n<li>Fill out the fields on the <strong>Add URL Policy</strong> page.</li>\n</ol>\n<p>For information about each of these fields, see the list below.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/policy_addurl.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/policy_addurl.png' alt=' '></a></p>\n<ol role='list'>\n<li>\n<strong>Policy Title:</strong> Enter the title of your policy or agreement. We recommend that you include the policy version or creation date in the title. This title will display on the interface your users will see when reading the policy.</li>\n<li>\n<strong>Status:</strong> Select the policy status. You can choose <strong>Draft</strong>, <strong>Published</strong>, or <strong>Archived</strong>. For more information about each of these statuses, see the <a href='#h_01FNRM62CN1WH4T6NEFAZWACDP' target='_self'>Policy Statuses</a> subsection below.</li>\n<li>\n<strong>Required Review:</strong> (Optional) You can enable this setting to require your users to open the URL before they can accept the policy.</li>\n<li>\n<strong>Description:</strong> (Optional) Enter a description of this policy for future reference.</li>\n<li>\n<strong>+ Add Language:</strong> Click this button to add a language version of your policy. The first version that you add to the policy will be the default version for all users.</li>\n</ol>\n<p>For more information about adding a language version, see the list below.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Policy+Management/URLPolicy2.png'><img src='https://helpimg.s3.amazonaws.com/Policy+Management/URLPolicy2.png' alt=' ' width='567' height='336'></a></p>\n<ol role='list'>\n<li>\n<strong>Policy Name:</strong> Enter a name for your policy. This name will be displayed to your users.</li>\n<li>\n<strong>Policy URL:</strong> Enter the URL for your policy.\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>We only accept Fully Qualified Domain Names, or FQDNs. Please enter a complete URL, not a shortened version of the URL.</div>\n</div>\n</li>\n<li>\n<strong>Language:</strong> Select the language that the policy is written in. </li>\n<li>\n<strong>Acceptance Text:</strong> (Optional) Enter the text you want to be displayed next to the acceptance check box when your users accept a policy.</li>\n<li>\n<strong>Save: </strong>Click this button to save this language version of the policy.</li>\n</ol>\n<p>You can add as many language versions of your policy as you’d like. Once you've added all language versions of the policy and customized your policy settings, click <strong>Create</strong>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>You can edit policies to add additional language versions at a later date. However, once you have added a policy to a campaign, the original policy files should not be changed to a revised version. For more information, see the <a href='#h_01FNRMHMKHW7H559FCTFHZPJ3X' target='_self'>Editing Policies</a> section of this article.</div>\n</div>\n<h2 id='h_01FNRMHMKHW7H559FCTFHZPJ3X'>Editing Policies</h2>\n<p>After you have created a policy, you can edit the policy or add additional language versions of the policy as needed.</p>\n<p>Edits to the policy take effect immediately. Users who have already been assigned the policy will be able to see your changes the next time they view the policy.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>If you have already assigned a policy in a campaign and you need to update your policy, we recommend that you create a new policy and a new campaign.</div>\n</div>\n<p>To edit a policy, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 console and navigate to <strong>Training</strong> &gt; <strong>Policies</strong>.</li>\n<li>Find the policy you’d like to edit from the policy list.</li>\n<li>Click the drop-down arrow next to the policy you’d like to edit.</li>\n<li>Select <strong>Edit</strong>.</li>\n</ol>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Policy+Management/PolicyMgmt_03.png'><img src='https://helpimg.s3.amazonaws.com/Policy+Management/PolicyMgmt_03.png' alt=' '></a></p>\n<p>From the policy editing page, you can edit the policy details, add additional language versions to the policy, edit existing language versions of the policy, and change the default policy language option. The default language is the first language shown in the drop-down menu that users see before they open the policy.</p>\n<p>After you’ve made your changes to the policy, click <strong>Update Policy</strong>.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/policies_updatepolicy.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/policies_updatepolicy.png' alt=' '></a></p>\n<h3 id='h_01FNRM62CN1WH4T6NEFAZWACDP'>Policy Statuses</h3>\n<p>Your policy can be in one of three statuses: <strong>Draft</strong>, <strong>Published</strong>, or <strong>Archived</strong>. You can change these statuses at any time by editing your policy.</p>\n<p>For more information about each of these statuses, see the table below:</p>\n<table>\n<tbody>\n<tr>\n<th scope='row'>Draft</th>\n<td>Use this status if you want to save your current policy progress but you don't want the policy to be available when you create a campaign.</td>\n</tr>\n<tr>\n<th scope='row'>Published</th>\n<td>Use this status when you are ready to use this policy in a campaign. This is the only status that makes the policy available on the <strong>Create New Training Campaign</strong> page.</td>\n</tr>\n<tr>\n<th scope='row'>Archived</th>\n<td>Use this status to archive the policy. You cannot assign an archived policy in a new campaign. However, if you included the archived policy in an active campaign, users will still be able to see the policy.</td>\n</tr>\n</tbody>\n</table>\n<h2 id='h_01HS1TWQV8HS84BJ9HE7EW1TEV'>Assigning Policies</h2>\n<p>Once you've added a policy to your account, you can create a training campaign to assign and distribute the policy to your users.</p>\n<p>To create a training campaign for your policy, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 console and navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>Click <strong>+ Create Training Campaign</strong>.</li>\n<li>From the <strong>Content</strong> drop-down menu, select the policy you would like to add.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> You have the ability to assign both policies and training content in the same campaign.</div>\n</div>\n</li>\n<li>Set up the rest of your training campaign however you’d like. For more information about creating a training campaign, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Course-Management#CREATING' target='_self'>Creating and Managing Training Campaigns</a> article.</li>\n<li>Once you’ve created your campaign, click <strong>Create Campaign</strong><span>.</span>\n</li>\n</ol>\n<h2 id='h_01FNRNKKG93KK9P2ECDK9ZJM1D'>Monitoring Policy Acknowledgments </h2>\n<p>Once your campaign has started, you can monitor your users’ policy acknowledgments as well as any other training content included in your campaign.</p>\n<p>To view details about your campaign, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 console and navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>Click on the name of the campaign you’d like to view to go to the campaign’s <strong>Overview</strong> page.</li>\n</ol>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/policies_policycampaignoverview.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/policies_policycampaignoverview.png' alt=' '></a></p>\n<p>On the campaign’s <strong>Overview</strong> page, you can see what content and policies were assigned in the campaign, see the campaign’s status, see how many users were enrolled in the campaign, and more. For more information about the <strong>Overview</strong> page, see the <a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Course-Management#MONITORINGCAMPAIGNS' target='_self'>Individual Campaign Overview</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Course-Management' target='_self'>Creating and Managing Training Campaigns</a> article.</p>\n<p>You can also monitor specific users’ policy acknowledgments from the <strong>Users</strong> subtab. On this page, you can view specific information about a specific user, such as the content assigned to the user, if they’ve completed their content, and more. For more information about the <strong>Users</strong> subtab, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360053311074' target='_self'>User Training Progress</a> article.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/Policy_Campaign_Users_Table.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/Policy_Campaign_Users_Table.png' alt=' '></a></p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>Users will <em>not</em> receive a completion certificate for policy acknowledgment campaign assignments. For more information about completion certificates, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360053311074' target='_self'>User Training Progress</a> article.</div>\n</div>\n<h2 id='h_01FNRNH53WMKG199EQPWC659WJ'>User Experience </h2>\n<p>If you've set up campaign notifications to remind your users to acknowledge a policy, your users can click the link in the notification to access their account.</p>\n<p>As an account admin, you can customize the notifications that you send to your users. You can send these notifications to your users, users' managers, and account admins at a frequency that you choose. For more information about creating and customizing training campaign notifications, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115010848868-Training-Campaign-Notifications' target='_self'>Training Campaign Notifications</a> article and our <a href='https://support.knowbe4.com/hc/en-us/articles/360001547908-Customizing-Training-Notifications' target='_self'>Customizing Training Notifications</a> article.</p>\n<p>When your users log in to their account, they'll see the active campaigns that they're enrolled in. They can click <strong>Start</strong> to open and view their policy assignment.</p>\n<p>When they click <strong>Start</strong>, the policy will open in a new window.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>To review the policy, your users must have their pop-up blocker turned off or allow the window to open when prompted.</div>\n</div>\n<p>If you've added multiple language versions of the policy, your users can click the <strong>Globe</strong> drop-down menu to choose their preferred language.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/policy_globedropdown.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/policy_globedropdown.png' alt=' ' width='333' height='270'></a></p>\n<p>Once your users click <strong>Start</strong>, they will be able to view your policy in the <strong>Policy Viewer</strong>.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/policy_policyviewer1.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/policy_policyviewer1.png' alt=' '></a></p>\n<p>In the <strong>Policy Viewer</strong>, your users can navigate through the policy by clicking the forward navigation arrow. If you've required users to agree to each page of the policy, they must select the acceptance check box before they can proceed to the next page of the policy.</p>\n<p>If you have not required users to agree to every page of the policy, your users will navigate through the entire policy then select the acceptance check box on the final page.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>After your users select the acceptance check box, they must close the <strong>Policy Viewer</strong> in order to receive a <strong>Completed</strong> status for their policy acknowledgment.</div>\n</div>\n<p>If you've enabled the <strong>Allow Download</strong> feature, your users can click the <strong>Download</strong> button at the top of the <strong>Policy Viewer</strong> to save a copy of the PDF file.</p>\n<p>If you've set <strong>Required Review Minutes</strong> for the policy, users must spend this amount of time reviewing the policy before they can accept the policy. If users attempt to select the final acknowledgment check box before they’ve reviewed the policy for the required amount of time, they will be prompted with a warning message.</p>\n<h2 id='h_01HS1TWQV8YFXS85JZD6MG5F20'>Frequently Asked Questions (FAQs)</h2>\n<ol role='list'>\n<li>\n<p><strong>Question:</strong> Will edits I make to a policy be reflected in the policy if I’ve already added the policy to a campaign?</p>\n<p><strong>Answer:</strong> Yes. Any edits made to the policy will be automatically reflected in the policy campaign. This includes any additional language versions of the policy that you may add.</p>\n</li>\n<li>\n<p><strong>Question:</strong> Can you preview all language versions of the policy?</p>\n<p><strong>Answer: </strong>You can only preview the default version of the policy in the console. If you'd like to preview the remaining language versions, temporarily change the default version of the policy to the language version you’d like to preview.</p>\n</li>\n<li>\n<p><strong>Question: </strong>Can I arrange the order of the content I assign through training campaigns?</p>\n<p><strong>Answer:</strong> Yes. From the <strong>Create New Training Campaign</strong> page, drag and drop the content in the desired order. When your users log in to complete their training or acknowledge policies, they'll see the content in the order you set. For an example of how to rearrange content, see the gif below.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Policy+Management/ChangeContentOrder.gif'><img src='https://helpimg.s3.amazonaws.com/Policy+Management/ChangeContentOrder.gif' alt=' '></a></p>\n</li>\n<li>\n<p><strong>Question:</strong> Why can't I see or select my policy when I create a training campaign?</p>\n<p><strong>Answer:</strong> Before you can add the policy to a training campaign, the policy must be in the <strong>Published</strong> status. To change the status of a policy, click the drop-down arrow to the far right of the policy name. Select <strong>Edit</strong>. Then, select <strong>Published</strong> from the <strong>Status</strong> drop-down menu and click <strong>Update Policy</strong>.</p>\n</li>\n<li>\n<p><strong>Question:</strong> Why don't the \"Users who did not acknowledge their course policies\" and \"Users who acknowledged their course policies\" reports under the <strong>Reports</strong> subtab include my policy campaign users?</p>\n<p><strong>Answer:</strong> These specific reports are related to the alternative method of mandating policy acknowledgments through your console. If you would like reports for your training campaigns that include PDF policies, see the <a href='#h_01FNRNKKG93KK9P2ECDK9ZJM1D' target='_self'>Monitoring Policy Acknowledgments</a> section of this article.</p>\n</li>\n<li>\n<p><strong>Question:</strong> Can I assign Security Roles to a user that I want to handle policy management, distribution, and acknowledgment?</p>\n<p><strong>Answer:</strong> Yes. You can add one or more users to a group in your console for the purpose of assigning the necessary Security Roles for policy management. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767-How-to-Use-Security-Roles' target='_self'>How to Use Security Roles</a> article.</p>\n</li>\n<li>\n<p><strong>Question:</strong> Is there a maximum file size for policy PDF files?</p>\n<p><strong>Answer:</strong> No. However, the system may time out if the PDF file is large. If the system times out, try to reduce the file size and upload the file again.</p>\n</li>\n<li>\n<p><strong>Question: </strong>I included links in my policy and I can't click them. Why can’t I click the links?</p>\n<p><strong>Answer:</strong> If you are using a MacBook and you want to include clickable links in your policy, you must use a PDF file that has been created in Adobe Acrobat.</p>\n</li>\n</ol>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360001641907-Create-and-Manage-Policies",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/training+campaigns/policy_addpdf.png",
        "alt": "This is a screenshot of a user interface for creating a new policy, titled **\"Add PDF Policy.\"**\n\n**Header and Navigation:**\nIn the upper right corner, a navigation link is available: **\"← Back to Policies.\"**\n\n**Form Fields (Policy Metadata):**\nThe primary section consists of five vertically stacked input fields, each accompanied by a help icon (circular question mark) on the right:\n\n1.  **Policy Title:** A standard empty text input field.\n2.  **Status:** A dropdown selection field currently defaulted to **\"Draft.\"**\n3.  **Minimum Time Required:** A numeric text input field defaulted to **\"0.\"**\n4.  **Allow download:** A toggle switch control, currently set to the **disabled/off** position (indicated by gray coloring).\n5.  **Description:** A multi-line text area, currently empty, with a resize handle in the bottom-right corner.\n\n**Language and Action Section:**\nA sub-heading, **\"Add Language,\"** is displayed below the main policy fields.\n\n6.  A primary action button is located in the bottom right corner, labeled **\"+ Add Language,\"** displayed as a blue button. A help icon is positioned immediately to the left of this button.",
        "position": 1,
        "context": "page.\n\nFor information about each of these fields, see the list below."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/Policy+Management/PolicyMgmt_02.png",
        "alt": "This image displays an \"Add Language\" configuration modal window used for defining localized settings and acceptance requirements for a policy.\n\n**UI Elements and Context:**\n\n*   **Title:** The modal header is labeled \"Add Language.\" A close icon (X) is present in the top right corner.\n*   **Help Icons:** A small question mark icon, indicating contextual help, is present next to almost every input field.\n\n**Input Fields (Top to Bottom):**\n\n1.  **Policy Name:** A standard text input field for entering the policy identifier.\n2.  **Policy File:** A file upload field, currently showing the status \"No file chosen,\" accompanied by a \"Browse\" button.\n3.  **Acceptance Requirements:** A dropdown menu (select box). The currently displayed value is \"Users must accept each page.\"\n4.  **Language:** A dropdown menu (select box) for selecting the language. The currently selected value is \"English - United States.\"\n5.  **Acceptance Text:** A single-line text input field. Placeholder text visible within the field is \"Accept.\"\n6.  **Per Page Acceptance Text:** A single-line text input field used for defining acceptance language on intermediate pages.\n7.  **Final Page Acceptance Text:** A multi-line text area, used for defining the final acceptance prompt.\n\n**Action Buttons (8):**\n\nThe bottom right corner contains two action buttons:\n\n*   **Cancel:** Secondary action button (dark gray).\n*   **Save:** Primary action button (blue).",
        "position": 2,
        "context": "re information about the fields on the Add Language page, see the list below."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/training+campaigns/policy_addurl.png",
        "alt": "The image displays the user interface for creating a new policy, titled **\"Add URL Policy.\"** A navigation link, **\"← Back to Policies,\"** is present in the top right corner.\n\nThe interface presents a form section containing four primary data fields, each paired with an informational help icon:\n\n1.  **Policy Title:** A single-line text input field.\n2.  **Status:** A dropdown selection field, currently displaying the default value **\"Draft.\"**\n3.  **Required Review:** A horizontal toggle switch, displayed in the disabled state (grayed out).\n4.  **Description:** A resizable multiline text area.\n\nA secondary section header, **\"Add Language,\"** is located below the policy details. This section contains the primary action button (5), a blue control labeled **\"+ Add Language,\"** which is preceded by a help icon.",
        "position": 3,
        "context": "page.\n\nFor information about each of these fields, see the list below."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/Policy+Management/URLPolicy2.png",
        "alt": "The image displays a user interface configuration form titled **\"Add Language,\"** designed for specifying localization settings for a policy. The form features four primary input fields, each accompanied by a contextual help icon (a gray question mark) on the right.\n\nThe fields, listed sequentially from top to bottom, are:\n\n1.  **Policy Name:** A blank text input field for entering the name of the language policy.\n2.  **Policy URL:** A text input field pre-populated with the scheme `https://`, intended for the complete policy document URL.\n3.  **Language:** A selectable dropdown field showing the default value **English - United States**.\n4.  **Acceptance Text:** A text input field with the placeholder text **Accept**, used to define the user action text for policy acceptance.\n\nThe interface concludes with a control bar at the bottom right containing two action buttons:\n\n5.  A secondary, gray button labeled **Cancel**.\n6.  A primary, blue button labeled **Save**.",
        "position": 4,
        "context": "ll users.\n\nFor more information about adding a language version, see the list below."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/Policy+Management/PolicyMgmt_03.png",
        "alt": "This image displays the **Policies** management interface, a web application screen detailing a list of uploaded documents.\n\n**Header and Navigation:**\n*   The primary page title is **Policies**.\n*   A blue call-to-action button, **+ Add Policy**, is located in the top-right corner.\n*   Four navigation tabs are present: Campaigns, Notification Templates, **Policies** (currently active/selected), and Reports.\n*   A search field labeled **Search** is positioned above the data grid, accompanied by a magnifying glass icon.\n\n**Data Table Structure:**\nThe interface features a data table listing policies, with seven columns, several of which are sortable (indicated by up/down caret icons):\n1.  **Title** (Links to the policy detail page)\n2.  **Page Count**\n3.  **Status**\n4.  **Type**\n5.  **Last Updated** (Date format MM/DD/YYYY)\n6.  **Default Language**\n7.  **Number of Languages**\n\n**Policy Data Rows (Examples):**\nAll visible policies share the green **Published** status tag and **PDF** document type.\n\n*   **Employee Policy:** 1 page, Last Updated 03/12/2020, Default Language Gaelic - Ireland, 1 language variant.\n*   **Drug Policy:** 3 pages, Last Updated 03/10/2020, Default Language English - United States, 2 language variants.\n*   **PTO Policy:** 5 pages, Last Updated 02/25/2020, Default Language Afrikaans, 3 language variants.\n\n**Action Menu:**\nA context menu is displayed, typically accessible via a dropdown arrow in the final column of a row. This menu offers two specific actions:\n*   **Preview** (preceded by an eye icon).\n*   **Edit** (preceded by a pencil icon).",
        "position": 5,
        "context": "w next to the policy you’d like to edit.\nSelect Edit."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/training+campaigns/policies_updatepolicy.png",
        "alt": "This image displays an administrative interface for editing a policy document, titled \"PDF PTO Policy.\"\n\n**Header and Navigation:**\n*   The page title is \"PDF PTO Policy,\" accompanied by a file icon stylized for PDF.\n*   In the top right corner, a link labeled \"← Back to Policies\" provides navigation.\n\n**Policy Details Section (Form Fields):**\nThe form contains several input fields and controls, each paired with a help icon ($\\text{?}$):\n1.  **Policy Title:** Text input field containing \"PTO Policy.\"\n2.  **Status:** Dropdown field currently showing \"Draft.\"\n3.  **Minimum Time Required:** Empty text input field.\n4.  **Allow download:** Toggle switch set to the 'Off' position (gray).\n5.  **Description:** Multi-line text area, currently empty.\n\n**Language Management Section:**\n*   A bold section header reads \"**Add Language**.\"\n*   To the right, a button labeled \"+ Add Language\" is present, along with a help icon ($\\text{?}$).\n\n**Language Table:**\nA table is displayed with three sortable columns:\n*   **Language:** Lists the language of the policy version.\n*   **Title:** Shows the title of the policy version.\n*   **Last Updated:** Displays the modification timestamp.\n\nThe table contains one row:\n*   **Language:** \"Spanish (Mexico)\" followed by a \"Default\" badge.\n*   **Title:** \"PTO Policy\"\n*   **Last Updated:** \"01/09/2020, 2:27 AM\"\n*   A kebab menu icon is visible at the end of the row.\n\n**Action Button:**\n*   A primary action button, highlighted in blue with an orange border, is located in the bottom right corner, labeled \"Update Policy.\"",
        "position": 6,
        "context": "p>After you’ve made your changes to the policy, click Update Policy."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/training+campaigns/policies_policycampaignoverview.png",
        "alt": "This is a technical description of a UI dashboard for a training or policy campaign, titled **\"Dress Code Policy 2021\"** targeting **\"Groups: All Users\"**.\n\n**Header and Navigation:**\n*   The top right features a link: \"← Back to Training\".\n*   Main navigation tabs are \"Overview\" (active) and \"Users\".\n*   A primary action button is visible: \"Notify Users\" (green, top right).\n\n**Campaign Summary (Right Panel):**\n*   **Completion Status:** A donut chart shows **0%** \"Completed All Content\".\n*   **Status:** \"In Progress\" (highlighted in green).\n*   **Start Date:** 08/09/2021, 9:00 AM.\n*   **Relative Duration:** 1 week.\n*   **Users:** 260.\n*   **Auto-Enroll:** Yes.\n*   **Scheduled Notifications:** \"Send welcome notification to Users, Managers on enrollment.\"\n\n**Campaign Content (Left/Center Panel):**\nThis section lists required assignments, showing 0% completion for both:\n1.  **Dress Code Policy PDF Version 3.1** (Document icon). Includes a \"User Progress\" button.\n2.  **Creating a Bully-Free Workplace: Employee Edition** (Graduation cap icon). Marked with a red pill-shaped tag: \"Retiring Soon\". Includes a \"User Progress\" button.\n\n**User Completion Activity (Graph):**\n*   **Title:** \"User Completion Activity\" with the subtitle \"Number of Users who have not completed their assignments\".\n*   **Graph Type:** A line graph tracking non-completion over time.\n*   **Y-Axis:** Represents the number of users, ranging from 0 to 300, marked every 50.\n*   **X-Axis:** Represents time, labeled 'Sep '21', 'Oct '21', and 'Nov '21', 'Dec '21'.\n*   **Data:** The line is approximately flat around the 250-260 user mark, indicating a high, stable number of users have not completed the assignments since the campaign began.",
        "position": 7,
        "context": "view to go to the campaign’s Overview page."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/training+campaigns/Policy_Campaign_Users_Table.png",
        "alt": "The image displays the **Users** tab of an administrative dashboard for a learning management system, centered on the **2022 Security Awareness Initiative** training program, filtered for \"Groups: All Users.\"\n\n**UI Components and Data Visualization:**\n\n1.  **Header and Navigation:** The screen title is \"2022 Security Awareness Initiative.\" A primary navigation bar features three tabs: \"Overview,\" **Users** (currently active), and \"Survey Results.\" A link titled \"← Back to Training\" is present in the upper right.\n2.  **Scorecard Metrics:** A status bar below the tabs provides an aggregate count of the 538 total users, categorized by progress:\n    *   **All Users:** 538 (Selected)\n    *   **Incomplete:** 20.4% (110 users)\n    *   **Not Started:** 10.4% (56 users)\n    *   **In Progress:** 10% (54 users)\n    *   **Completed:** 79.6% (428 users)\n    *   **Past Due:** 20.4% (110 users)\n3.  **Filtering and Action Bar:**\n    *   A search field allows filtering by \"Search for users by name or email.\"\n    *   A toggle switch is available to \"Include Archived Users.\"\n    *   Action buttons include \"Bulk Update\" (link), \"Generate CSV\" (green primary button), \"Enroll Users\" (blue button), and an \"Actions\" dropdown (gear icon).\n\n**Detailed Data Table:**\n\nThe lower half of the screen contains a detailed table listing individual enrollment statuses, sortable by the following columns: Checkbox (for bulk actions), **Content Name**, **Enrollment Date**, **Time Spent**, **Time Remaining**, **Score**, and **Status**.\n\nSampled data rows show specific content items (e.g., \"PCI Simplified,\" \"Handling Sensitive Information\") enrolled on \"07/19/2022.\" The status column prominently displays \"Past Due\" within a red tag for all visible entries, indicating overdue assignments. The first row displays a redacted username with an accompanying email icon.",
        "position": 8,
        "context": "en-us/articles/360053311074' target='_self'>User Training Progress article."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/training+campaigns/policy_globedropdown.png",
        "alt": "The image displays an active dropdown selection menu used for locale or language settings.\n\n**Header/Current State:**\nThe selection field header features a small gray globe icon, followed by the text \"English (United States),\" and a downward-pointing chevron, indicating an open selection list.\n\n**Dropdown Menu Content:**\nThe open menu lists available languages in a vertical format.\n\n1.  **Active/Selected Option:** The first option, \"English (United States),\" is highlighted with a light gray background, indicating the current selection or a hover state.\n2.  **Subsequent Options (Non-Highlighted):** The options \"Serbian - Cyrillic\" and \"Japanese\" are listed below, utilizing a thinner font weight.\n3.  **UI Indicator:** A faint vertical scrollbar is partially visible on the right edge of the menu container, confirming the presence of additional, non-visible language options.",
        "position": 9,
        "context": "an click the Globe drop-down menu to choose their preferred language."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/training+campaigns/policy_policyviewer1.png",
        "alt": "This image displays a web interface for reviewing a policy document within the KnowBe4 platform.\n\n**Header Section (Top Bar):**\n*   **Branding:** The top left features the orange \"KnowBe4\" logo with the tagline \"Human error. Conquered.\"\n*   **Title:** The center title reads: \"This is a sample policy\".\n*   **Toolbar Icons (Right):** Three function icons are visible: Magnify/Zoom In, Magnify/Zoom Out, and Download/Export.\n\n**Document Viewer Area:**\n*   A central white panel simulates a policy page (Page 1).\n*   **Policy Metadata:** The top of the policy page displays:\n    *   \"Sample Employee Policy\"\n    *   \"Language: EN-US\"\n    *   \"Page: 1\"\n*   The remainder of the page content is blank.\n\n**Footer Section (Bottom Bar):**\n*   **Page Navigation Status:** On the bottom left, the current position is indicated as: \"Page 1 of 3\".\n*   **Agreement Checkbox:** A prominent checkbox is labeled \"I Agree\" (currently unchecked).\n*   **Navigation Controls:** Two gray arrow buttons (Previous Page `<` and Next Page `>`) allow sequential navigation.\n*   **Action Button:** A rectangular, orange button labeled \"Submit\" is located on the far right.",
        "position": 10,
        "context": "/strong>, they will be able to view your policy in the Policy Viewer."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/Policy+Management/ChangeContentOrder.gif",
        "alt": "The image displays a user interface configuration section, likely for defining a training curriculum or enrollment policy.\n\n**UI Elements and Configuration Details:**\n\n1.  **Content Selection:** A field labeled **Content** displays a dropdown input showing \"**2 items selected**.\"\n2.  **Content Order:** The section header **Content Order** lists two sequential required items:\n    *   **1. (Graduation Cap Icon)** 2018 Kevin Mitnick Security Awareness Training - 45 Min\n    *   **2. (Document Icon)** 2020 Security Awareness Training Policy\n3.  **Survey Option:** A standard checkbox control for \"**Enable Content Survey**\" is present in an unchecked (disabled) state. A context-sensitive help icon (?) is adjacent to the label.\n4.  **Enroll Groups:** This setting uses a segmented control switch. The option **All Users** is currently selected (highlighted in dark gray), while **Specific Groups** is inactive. The entire control is followed by a help icon (?).\n5.  **Automatic Enrollment:** A final checkbox labeled \"**Enable automatic enrollment for new users**\" is checked (enabled), confirming automatic enrollment behavior. This setting also includes a context-sensitive help icon (?).",
        "position": 11,
        "context": "For an example of how to rearrange content, see the gif below."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "manage",
        "policies"
      ],
      "image_count": 11
    }
  }
}