{
  "article": {
    "id": 360021501394,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360021501394.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360021501394.html",
    "author_id": 21027160967,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 1,
    "vote_count": 1,
    "section_id": 8746041037587,
    "created_at": "2019-04-15T22:28:06Z",
    "updated_at": "2025-03-11T17:19:59Z",
    "name": "How to Create and Manage Vendor Profiles",
    "title": "How to Create and Manage Vendor Profiles",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:19:59Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "Vendor List",
      "vendor contact",
      "KCM Vendor",
      "vendor score",
      "data types",
      "KCM data types",
      "answerbot_kcmgrc"
    ],
    "body": "<p>The Vendor Risk Management (VRM) module in KnowBe4's KCM GRC platform lets you centralize your third-party risk management processes. You can prequalify risk, assess your vendors, and conduct remediation efforts all in one platform. The VRM module is available to Platinum subscriptions.</p>\n<p>As part of working in the VRM module, you can create a \"vendor profile\" for each of the internal or external third parties that you will be working with. Then, you can use vendor profiles to send questionnaire assessments and to work through any issues that may arise from assessment responses. From vendor profiles, you can also modify vendor scores and create risks for vendors. </p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> As a best practice for onboarding with the VRM module, we suggest <a href='https://support.knowbe4.com/hc/en-us/articles/360021582594' target='_blank' rel='noopener'>creating questionnaire assessments</a> before creating vendor profiles. For the full suggested order of workflow for onboarding with your VRM module, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021083194' target='_blank' rel='noopener'>Vendor Risk Management Module Guide</a>.</div>\n</div>\n<p>See the sections below to learn about creating new vendor profiles, adding vendor contacts, and working with vendor profiles in your KCM GRC account.</p>\n<h2 id='h_01HVVM17K0D8QNWJSWBXE0XEW2'>Vendors Page</h2>\n<p>You will create vendor profiles from the <strong>Vendors</strong> area of your VRM module. The <strong>Vendors</strong> page serves as a repository of the vendor profiles you have added to your account. To navigate to this page, from the navigation panel, click <strong>Vendor Management</strong> &gt; <strong>Vendors</strong>. </p>\n<p>Much of your VRM workflow will be carried out through vendor profiles, for example:</p>\n<ul role='list'>\n<li>Adding user accounts for vendor contacts</li>\n<li>Sending questionnaires</li>\n<li>Reviewing questionnaires</li>\n<li>Creating issues for questionnaire responses</li>\n<li>Communicating with vendors about questionnaire issues</li>\n<li>Closing questionnaire issues</li>\n</ul>\n<p>Once you've added vendor profiles to your account, your <strong>Vendors</strong> page will look similar to the image below.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/VendorList.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/VendorList.png' alt=' '></a></p>\n<ol role='list'>\n<li>The <strong>Name</strong> column displays the third-party organization's name. Click on the name of the organization to open their vendor profile.</li>\n<li>The <strong>Contact Name</strong> will be the name of your primary contact at the third-party company</li>\n<li>The <strong>Status</strong> of the vendor profile can be any of the following: Active, Inactive, Pending Approval, Rejected, Incomplete. </li>\n<li>You'll select the vendor <strong>Type</strong> when creating the vendor profile. The vendor type will be <strong>Internal</strong> or <strong>External</strong>.</li>\n<li>The vendor <strong>Score</strong> is calculated after the vendor has completed one or more questionnaire assessments. For more information about vendor scores, see the <a href='#WorkingVendorProfiles' target='_self'>Working With Vendor Profiles</a> section below.</li>\n<li>The <strong>Data Categories</strong> represent the types of data that the vendor will store, process, or transmit in order to carry out operations for your organization. You'll add these data types when creating a vendor profile. For details, see the <a href='#ORGCONTACTDETAILS' target='_self'>Organization Contact Details</a> section below.</li>\n</ol>\n<h2 id='h_01HVVM17K008THTX07FBCPMAS3'>Adding New Vendor Profiles</h2>\n<p>Before you begin sending questionnaires to your vendors, you'll create vendor profiles under the <strong>Vendors</strong> area of the VRM module. By adding contact information and other details relevant to business operations, the vendor profile helps you prequalify the level of risk associated with each third party.</p>\n<p>To create a vendor profile, you'll start by adding the <strong>Organization Contact Details</strong>, then you'll answer <strong>Qualifying Questions</strong> to prequalify the level of risk associated with each third-party or vendor. Before you can send questionnaires to your vendors, you'll create user accounts for the individuals who are responsible for completing your questionnaire assessments. Follow the next subsections below to complete the vendor onboarding process in your VRM module:</p>\n<h3 id='h_01HVVM17K0X59S6D82JB4MVXVY'>Organization Contact Details</h3>\n<p>From the navigation panel, navigate to the <strong>Vendors</strong> tab. Then, either import a CSV file containing the contact details for one or more vendors, or add vendors individually to your platform.</p>\n<p>To upload the contact details by importing a CSV file, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4402930479123' target='_self'>How Do I Import Vendors into My Account with a CSV File?</a> article. </p>\n<p>To add the contact details for vendors individually, click the <strong>Create New Vendor</strong> button from the <strong>Vendors</strong> page. Then, add information to the fields outlined below.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>We recommend that you avoid including the &lt; and &gt; special characters in these fields.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Updated+Create+New+Vendor+Page.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Updated+Create+New+Vendor+Page.png' alt='Create New Vendor Page PNG'></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Name:</strong> (Required) The name of the vendor or third party that you are working with or sending assessments to. </li>\n<li>\n<strong>Contact Name:</strong> (Required) The name of the primary person/contact you will be working with for questionnaire assessments. </li>\n<li>\n<strong>Contact Email:</strong> (Required) The email address of the person you've listed for the <strong>Contact Name</strong>, above.\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> The email address you enter for the <strong>Contact Email</strong> is where the automatic email notifications will be sent when you assign a questionnaire to your vendor. Before you can assign a questionnaire, you will need to create a user account for your vendor contact. See the <a href='#AddVendorUser' target='_self'>Adding User Accounts for Vendor Contacts</a> section below for details.</div>\n</div>\n</li>\n<li>\n<strong>Telephone: </strong>The telephone number for either the organization or for the primary vendor contact at the organization. </li>\n<li>\n<strong>Website:</strong> The web address for the vendor or third party. </li>\n<li>\n<strong>Vendor Type:</strong> Select <strong>Internal</strong> or <strong>External</strong>. For example, an internal vendor may be a contracted business unit that provides services to your organization, while an external vendor is one outside of your organization.</li>\n<li>\n<strong>Industry:</strong> Select the vendor's industry from the drop-down menu.</li>\n<li>\n<strong>Street Address:</strong> Use this and the remaining fields to add the vendor or third party's address.</li>\n<li>\n<strong>State/Province/Region:</strong> Enter the state, province, or region for the vendor or third party. If you select United States for the country, this field will change to a drop-down menu that you can use to select the state. If you select Canada for the country, this field will change to a drop-down menu that you can use to select the province. </li>\n<li>\n<strong>Zip/Postal Code:</strong> Enter the zip code or postal code for the vendor or third party. </li>\n<li>\n<strong>Data Types:</strong> Select all applicable categories of data that your vendor will store, process, or transmit in order to carry out operations for your organization. If the listed data types are not applicable, select <strong>Other</strong>. Click the drop-down below for details about the data types.\n<div class='accordion accordion--default'>\n<div class='accordion__item'>\n<div class='accordion__item-title'>Vendor Details: Data Types</div>\n<div class='accordion__item-content'>\n<table>\n<tbody>\n<tr>\n<td><strong>Acronym</strong></td>\n<td><strong>Data Type</strong></td>\n<td><strong>Description</strong></td>\n</tr>\n<tr>\n<td><strong>CHD</strong></td>\n<td>Cardholder Data</td>\n<td>Information related to a cardholder, including the cardholder's name and their card's expiration date, primary account number, and service code. </td>\n</tr>\n<tr>\n<td><strong>CPI</strong></td>\n<td>Client Privileged Information</td>\n<td>Any information that is considered confidential communication between an attorney and their client.</td>\n</tr>\n<tr>\n<td><strong>CUI</strong></td>\n<td>Controlled Unclassified Information</td>\n<td>Federal, non-classified information that must be safeguarded by adhering to security requirements and controls designed to secure sensitive information.</td>\n</tr>\n<tr>\n<td><strong>ECR</strong></td>\n<td>Export Controlled Research</td>\n<td>Includes any information that is regulated for reasons of national security, foreign policy, anti-terrorism, or non-proliferation. This includes ITAR and EAR data types.</td>\n</tr>\n<tr>\n<td><strong>FERPA</strong></td>\n<td>Family Educational Rights and Privacy Act</td>\n<td>This act governs access to and the release of student education records.</td>\n</tr>\n<tr>\n<td><strong>FISMA</strong></td>\n<td>Federal Information Security Management Act</td>\n<td>This act requires federal agencies and any contracted parties to develop, document, and implement an information security and protection program for federal data.</td>\n</tr>\n<tr>\n<td><strong>GLBA</strong></td>\n<td>Gramm Leach Bliley Act</td>\n<td>This act requires financial institutions to explain how they share and protect their customers' sensitive data.</td>\n</tr>\n<tr>\n<td><strong>PHI</strong></td>\n<td>Protected Health Information</td>\n<td>Under HIPAA, protected health information is considered to be individually identifiable information relating to the past, present, or future health status of an individual that is created, collected, transmitted, or maintained by a HIPAA-covered entity in relation to the provision of healthcare, payment for healthcare services, or use in healthcare operations.</td>\n</tr>\n<tr>\n<td><strong>IT</strong></td>\n<td>Information Technology (Security Information)</td>\n<td>Information pertaining to safeguarding organizational IT resources.</td>\n</tr>\n<tr>\n<td><strong>PCI</strong></td>\n<td>Payment Card Industry</td>\n<td>Information pertaining to storing, processing, or transmitting credit card, debit card, or any other type of payment card data.</td>\n</tr>\n<tr>\n<td><strong>PII</strong></td>\n<td>Personally Identifiable Information</td>\n<td>Sensitive data that could potentially identify a specific individual.</td>\n</tr>\n</tbody>\n</table>\n</div>\n</div>\n</div>\n</li>\n<li>\n<strong>Details of Services/Goods:</strong> You can optionally add details about the vendor in this field.</li>\n</ol>\n<p>Next, you can answer qualifying questions about the vendor. For more information, see the <a href='#QualifyingQuestions' target='_self'>Qualifying Questions</a> section below.</p>\n<h3 id='h_01HVVM17K0WXB5V6YR8VRC8EGE'>Qualifying Questions</h3>\n<p>Under the <strong>Organization Contact Details</strong> section, you can answer qualifying questions to help you assess the level of risk that is associated with working with the vendor.  <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Updated+Vendor+Qualifying+Questions.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Updated+Vendor+Qualifying+Questions.png' alt='Qualifying Questions'></a></p>\n<p>You can either answer the qualifying questions as you're creating your new vendor or answer the questions at a later time by navigating to the vendor's <strong>Vendor Details </strong>page. You can navigate to the <strong>Vendor Details</strong> page by selecting the <strong>Vendor</strong> tab (<strong>Vendor Management</strong> &gt; <strong>Vendors</strong>) and clicking the vendor name under the <strong>Name</strong> column.</p>\n<p>After you finish filling out the information for a vendor, click the <strong>Create</strong> button to create the vendor's profile.</p>\n<h3 id='h_01HVVM17K015PWEM5GKKB5ZYD8'>Adding User Accounts for Vendor Contacts</h3>\n<p>Once you're ready to send a questionnaire to a vendor, you'll add a user account in KCM GRC for the appropriate person so they can complete the questionnaire. This user will log in to a separate vendor portal that is associated with your account. This vendor portal is specifically for the vendor contact to answer their assigned questionnaires and to address <a href='https://support.knowbe4.com/hc/en-us/articles/360033813974' target='_self'>issues</a> that may arise from questionnaire responses.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> The <strong>Vendor User</strong> user role does not count against your licensed seat count for KCM. Vendor Users do not have access to the information in your organization's account, with the exception of any files you add to the <strong>Attachments</strong> tab on the <strong>Vendor Details</strong> page. See the <a href='#WORKFLOWS' target='_self'>Vendor Workflows</a> section below to learn about the <strong>Attachments</strong> tab. </div>\n</div>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important: </strong>Once created, the vendor user will immediately receive an email to activate their new account. You may want to inform your vendor contacts that you will be implementing this process before adding these users to KCM GRC.</div>\n</div>\n<p>Follow the steps below to add a vendor user account to your console:</p>\n<ol role='list'>\n<li>Navigate to the vendor profile by clicking <strong>Vendor Management</strong> &gt; <strong>Vendors</strong> from the navigation panel, then click the third-party organization's name from the <strong>Name</strong> column.</li>\n<li>From the <strong>Vendor Details</strong> page, click the <strong>Contacts</strong> tab (shown below), then click the <strong>Create Vendor Contact</strong> button on the right-hand side. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorDetails_Contactstab.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorDetails_Contactstab.png' alt='Image of the Contacts tab on the Vendor Details page, with a circle around the Create Vendor Contact tab.'></a>\n</li>\n<li>Fill out the user information, then click the <strong>Create</strong> button.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> The email address that you use to create the vendor contact should also be listed in the <strong>Contact Email</strong> field on the <strong>Organization Details</strong> area of the page. The email address in the <strong>Contact Email</strong> field is where the automatic email notifications are sent when you assign a questionnaire to your vendor.</div>\n</div>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> You can add multiple contacts to one vendor profile. All contacts that are listed under the <strong>Contacts</strong> tab are able to log in to the vendor's portal and they can access the questionnaires and issues that you've assigned to this vendor.</div>\n</div>\n</li>\n</ol>\n<p>See our <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833' target='_blank' rel='noopener'>How to Create and Manage KCM GRC User Accounts</a> article for more information about creating users. For more information on sending questionnaire assessments, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021582594' target='_blank' rel='noopener'>How to Create and Configure Questionnaires</a> article.</p>\n<h2 id='h_01HVVM17K0MCSSYSVRD9M4P1KX'>Working With Vendor Profiles (Vendor Details)</h2>\n<p>This section and the following subsections provide information about the <strong>Vendor Details</strong> page and the workflows that you can carry out from your vendor profiles. </p>\n<p>To learn about working with vendor profiles from the <strong>Vendors Details</strong> page, see the list below. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Organization+Details+Vendor.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Organization+Details+Vendor.png' alt=' '></a></p>\n<ol role='list'>\n<li>\n<strong>Update: </strong>Click this button to edit any of the information shown on the <strong>Vendor Details</strong> page.</li>\n<li>\n<strong>Archive: </strong>Click this button to archive the vendor profile. Archiving the vendor will automatically disable any Vendor Users listed under the <strong>Contacts</strong> tab in the vendor profile. This option may be helpful if you will be working with the vendor at a later time. Note, if a vendor profile is archived you will not be able to create a new vendor profile with the same name.</li>\n<li>\n<strong>Delete:</strong> Click this button to fully delete the vendor profile and all associated data. Only Account Administrators have access to this button. All iterations of questionnaires that were sent to or completed by this vendor will be deleted. Deleting the vendor will also automatically disable any Vendor Users listed under the <strong>Contacts</strong> tab of the vendor profile. This action cannot be undone.</li>\n<li>\n<strong>Vendor Score: </strong>This percentage is calculated once the vendor contact has completed and finalized one or more questionnaire assessments. Vendor scores range from 0 percent to 100 percent. The vendor score is the average score for all questionnaires that the vendor has completed. Generally, higher vendor scores indicate that the vendor has a lower risk level, and lower vendor scores indicate that the vendor has a higher risk level. If you'd like, you can manually change a vendor score from a vendor's vendor profile. To learn how to modify a vendor score, see the <a href='#ModifyVendorScore' target='_self'>Modifying Vendor Scores</a> section below. </li>\n<li>\n<strong>Create Risk for Vendor: </strong>To learn about creating a risk for a vendor, see the <a href='#RISK' target='_self'>Creating Risks for Vendors</a> section below.</li>\n<li>\n<strong>Notes</strong>: Use this widget to communicate information about the vendor to other KCM GRC users. For example, if you create a risk for a vendor, you can enter a note about the risk into the <strong>Notes</strong> widget. </li>\n</ol>\n<h3 id='h_01HVVM17K0W90QJETFB7HMEPJF'>Modifying Vendor Scores</h3>\n<p>Follow the steps below to offset the vendor score for a vendor profile.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/VendorScoreOffset.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/VendorScoreOffset.png' alt=' '></a></p>\n<ol role='list'>\n<li>Click the <strong>Update</strong> button at the top of the <strong>Vendor Details</strong> page.</li>\n<li>Then, use the <strong>Vendor Score Offset</strong> field (shown above) to enter any integer between -100 and 100. For example, if the original vendor score is 89.4% and you enter \"-3\" in the <strong>Vendor Score Offset</strong> field, the adjusted vendor score will be 86.4%.</li>\n<li>You can optionally leave a note explaining why you are offsetting the vendor score in the <strong>Vendor Score Adjustment Note</strong> field. </li>\n<li>Click the <strong>Save</strong> button to save the offset percentage.</li>\n</ol>\n<p>The adjusted vendor score will be displayed in the vendor profile along with the original vendor score that was calculated by KCM.</p>\n<h3 id='h_01HVVM17K0BXXBNWQYRTGVYPJ5'>Creating Risks for Vendors</h3>\n<p>As you assess a vendor or third party with questionnaires, you can monitor the vendor's vendor score to determine the amount of risk that working with the vendor poses for your organization. Then, you can create a risk for the vendor so that you can work towards mitigating the risk from your Risk Management module.  </p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>To access this feature, you must have access to both the Vendor Risk Management and Risk Management modules.</div>\n</div>\n<p>To create a risk for a vendor, follow the instructions below. </p>\n<ol role='list'>\n<li>From your navigation panel, navigate to the <strong>Vendors</strong> tab (<strong>Vendor Management</strong> &gt; <strong>Vendors</strong>).</li>\n<li>Select a vendor under the <strong>Name</strong> column</li>\n<li>In the <strong>Organization Details </strong>section of the page, click the <strong>Create Risk for Vendor</strong> button.  <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Create+Risk+for+Vendor+button.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Create+Risk+for+Vendor+button.png' alt='Create Risk for Vendor'></a>\n</li>\n<li>Fill out the field on the <strong>Create Risk for Vendor </strong>page. To learn more about these fields, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733#Create_Individual_Risks' target='_self'>Create Individual Risks</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733' target='_self'>How to Use Your Risk Register</a> article. </li>\n<li>Click the <strong>Save</strong> button. </li>\n</ol>\n<p>After you create the risk for a vendor, the risk will appear in your Risk Register. </p>\n<h3 id='h_01HVVM17K06AV175N3J6HN9QR1'>Vendor Workflows</h3>\n<p>Click on the tabs below to learn about the workflows you'll carry out from the tabs found on <strong>Vendor Details</strong> pages (vendor profiles), under your VRM module. </p>\n<div class='js-tabs'>\n<div title='Available Questionnaires'>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_AvailableQs.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_AvailableQs.png' alt=' '></a></p>\n<p>Use the <strong>Available Questionnaires</strong> tab to send questionnaire assessments to your vendors, or other third-party organizations. All finalized questionnaires are listed under this tab. In order for a questionnaire to be finalized, it must be marked as \"Configured\" and \"Reviewed\".</p>\n<p>Click the appropriate <strong>Send Questionnaire</strong> button to send the questionnaire to your vendor user's (vendor contact's) KCM account.</p>\n<p>To learn more about sending questionnaires, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360038671833' target='_self'>How to Send Questionnaires to Vendors</a> article. </p>\n</div>\n<div title='Schedules'>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_Schedules.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_Schedules.png' alt=' '></a></p>\n<p>The <strong>Schedules</strong> tab allows you to see all of the questionnaires you've scheduled to send to this vendor <em>on a reoccurring frequency</em>. You'll find the questionnaires that were sent <em>only one time</em> under the <strong>Assigned Questionnaires</strong> tab. </p>\n<ol role='list'>\n<li>The table will show the <strong>Start Date</strong> and the <strong>End Date</strong> that was set when scheduling the questionnaire.</li>\n<li>The <strong>Frequency</strong> column represents how often the questionnaire is scheduled to be sent.</li>\n<li>If applicable, the <strong>Due After</strong> column represents the number of days you've requested the assessment to be completed in.</li>\n<li>Click the cancel icon to cancel all future iterations of this questionnaire schedule.</li>\n<li>Click the eyeball icon (or the expand/collapse arrow on the left-hand side) to expand the table and view all iterations of this questionnaire schedule.</li>\n</ol>\n<p>For more information about questionnaire schedules, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360038671833' target='_self'>How to Send Questionnaires to Vendors</a> article.</p>\n</div>\n<div title='Assigned Questionnaires'>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_AssignedQuestionnaires.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_AssignedQuestionnaires.png' alt=' '></a></p>\n<p>The <strong>Assigned Questionnaires</strong> tab shows you the questionnaires that have already been sent to the vendor user's account. </p>\n<ol role='list'>\n<li>When the questionnaire is complete, click the questionnaire name link listed under the <strong>Name</strong> column to open and <a href='https://support.knowbe4.com/hc/en-us/articles/360033813974' target='_blank' rel='noopener'>review the questionnaire</a>.</li>\n<li>The questionnaire <strong>Status</strong> can be one of the following:\n<ul role='list'>\n<li>\n<span><strong>Sent:</strong></span> The questionnaire has been sent to the vendor. If the vendor has begun working on the questionnaire, their progress will be represented by blue in the progress bar, under the <strong>Progress</strong> column.</li>\n<li>\n<span><strong>Pending Review:</strong></span> The questionnaire has been finalized by the vendor user, but the KCM administrator has not begun the review process.</li>\n<li>\n<span><strong>In Review:</strong></span> The KCM administrator has begun, but not finished the review process for this questionnaire.</li>\n<li>\n<span><strong>Reviewed:</strong></span> The KCM administrator has completed reviewing this questionnaire.</li>\n</ul>\n</li>\n<li>Use the <strong>Nudge Vendor</strong> button to send a reminder email from KCM GRC.</li>\n<li>Use the <strong>Send Link</strong> button to open your native mail client program and draft an email to send to your vendor user.</li>\n<li>Click the <strong>Cancel</strong> button to cancel the questionnaire and remove it from the vendor user's account. Note, if the questionnaire is canceled all progress will be lost.</li>\n<li>Use the <strong>Export</strong> button to download a CSV file containing the questionnaire details. </li>\n</ol>\n<p>For more information about reviewing questionnaires in your VRM module, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360033813974' target='_blank' rel='noopener'>How to Review Questionnaires and Create Issues</a> article.</p>\n</div>\n<div title='Issues'>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_Issues.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_Issues.png' alt=' '></a></p>\n<p>If your vendor provided an undesirable answer to one or more questions in your assessment, an \"issue\" can be created to request additional information or to discuss the concern with your vendor.</p>\n<p>All of the issues you've created with this vendor will show under the <strong>Issues</strong> tab. To open an existing issue, click the description from the <strong>Issue Description</strong> column. </p>\n<p>For more information about working with issues in your VRM module, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360033813974' target='_blank' rel='noopener'>How to Review Questionnaires and Create Issues</a> article.</p>\n</div>\n<div title='Attachments'>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_Attachments.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_Attachments.png' alt=' '></a></p>\n<p>If you have files to share with your vendor, use the <strong>Attachments</strong> tab to add the files to the vendor user's (vendor contact's) vendor portal.</p>\n<p>Use the <strong>Upload New Attachment</strong> interface to drag and drop or click <span class='wysiwyg-underline'><strong>browse</strong></span> to navigate to the desired file on your computer. Once the file has been uploaded, it will be immediately available in the vendor user's KCM account.</p>\n<p>Click the trash can button under the <strong>Actions</strong> column to remove the file from the vendor portal and your KCM account.</p>\n</div>\n<div title='Contacts'>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_Contacts.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_VendorList/Tab_Contacts.png' alt=' '></a></p>\n<p>Before you can send a questionnaire to your vendor you'll navigate to the <strong>Contacts</strong> tab to add a user account for the individual who will be taking the assessment. Use the <strong>Create Vendor Contact</strong> button to add a new Vendor User account. For more information, see the <a href='#AddVendorUser' target='_self'>Adding User Accounts for Vendor Contacts</a> section above.</p>\n</div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360021501394-How-to-Create-and-Manage-Vendor-Profiles"
  }
}