{
  "article": {
    "id": 360063177973,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360063177973.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360063177973.html",
    "author_id": 403968826754,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 71,
    "vote_count": 125,
    "section_id": 20415438485651,
    "created_at": "2021-02-18T15:46:29Z",
    "updated_at": "2025-04-07T18:54:00Z",
    "name": "Learner Support: Contact Our Support Team",
    "title": "Learner Support: Contact Our Support Team",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:36:02Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "browser",
      "support",
      "risk scores",
      "Dashboard",
      "sound not working",
      "stuck",
      "Learner Dashboard",
      "localized",
      "IE_banner"
    ],
    "body": "<p>If you need assistance using our products, our support team is here to help.</p>\n<p>To open a support ticket, you can <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener noreferrer'>click here</a> or click the <strong>Submit a support request </strong>link at the bottom of every page on our Knowledge Base.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you’re an account administrator, we recommend that you grant our support team access to your account before submitting a request. Granting access to your account will allow our support team to provide you with more personalized assistance. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360061335614-Contact-Support-and-Grant-Access-to-Your-Account' target='_self'>Granting Support Access to Your Account</a> article.</div>\n</div>\n<p>When you open a support ticket, you will need to fill out the required fields. All required fields are marked with a red asterisk (*) symbol.</p>\n<p>After you've filled out the required fields, we recommend that you also provide the following information:</p>\n<ul role='list'>\n<li>Describe the issue that you're experiencing and what the expected behavior is.</li>\n<li>Include the email address you use to log in to take your training, if applicable.</li>\n<li>Include the method you use to log in to take your training, if applicable. For example, if you click a link in a training notification email or use single sign-on (SSO).</li>\n<li>Include the name of any training assignments that you're having trouble with or need a training certificate for, if applicable.</li>\n<li>Include your <a href='https://support.knowbe4.com/hc/en-us/articles/204467478' target='_self'>web browser</a> and the web browser's version number.</li>\n<li>Include the name of any extension or application that may impact your experience, such as ad-blockers or accessibility tools.</li>\n<li>Include your operating system (OS), such as Windows or MacOS.</li>\n<li>Include screenshots of any related settings, emails, or error messages. For best results, we recommend taking a screenshot of your entire screen.</li>\n<li>If you have already contacted your internal support, administrator, or supervisor about this issue, please provide their name in case we need to contact them directly.</li>\n</ul>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you're an account administrator, we also recommend including a list of affected users and groups, any troubleshooting steps that you've already taken, and any related configuration (CONFIG) files or sync logs.</div>\n</div>\n<p>Once you open a support ticket, our support team will contact you as soon as possible.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360063177973-Learner-Support-Contact-Our-Support-Team",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "contact",
        "learner",
        "our",
        "support",
        "team"
      ],
      "image_count": 0
    }
  }
}