{
  "article": {
    "id": 40003728753171,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/40003728753171.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/40003728753171.html",
    "author_id": 12677132815251,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 1,
    "vote_count": 1,
    "section_id": 26427750945555,
    "created_at": "2025-04-03T16:45:38Z",
    "updated_at": "2025-11-26T20:27:12Z",
    "name": "FAQ: SmartRisk Agent™ and Risk Score Guide",
    "title": "FAQ: SmartRisk Agent™ and Risk Score Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-26T20:27:12Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "risk score",
      "FAQ",
      "answerbot",
      "risk score v2",
      "smartrisk agent"
    ],
    "body": "<div class='callout-tip'>\n<div>\n<strong>Coming soon:</strong>On December 15, we’ll update the benchmarks for the Low, Medium, High, and Critical risk levels in the Risk Score available range based on data analysis across all customers. Your actual Risk Score won't change, but its risk level label may shift to reflect our new benchmarks better.</div>\n</div>\n<p>In this article, you can find frequently asked questions about using KnowBe4's SmartRisk Agent™ and Risk Score feature. If you have additional questions that this article doesn't include, please submit a ticket to our <a href='https://support.knowbe4.com/hc/en-us/requests/new'>support team</a>.</p>\n<p>To learn more about Risk Score, see our <a href='https://support.knowbe4.com/hc/en-us/articles/30048977242259'>SmartRisk Agent™ and Risk Score Guide</a>.</p>\n<h2 id='h_01JQY7FXMVVCHNE0K00XJQDGEG'>General Information</h2>\n<p>For general information about Smart Risk Agent and Risk Score, see the questions and answers below:</p>\n<ol>\n<li><a href='#h_01JQY89K80129NBW0MSGMCJ5AK'>What is the SmartRisk Agent™, and how does it enhance human risk management?</a></li>\n<li><a href='#h_01JQY89V84VT0S07C7GPAQEF3S'>How are the seven security types in Risk Score defined and calculated?</a></li>\n<li><a href='#h_01K2FT9EYN1APMG233DXDJ5S0R'>What is the available range for Risk Score?</a></li>\n<li><a href='#h_01JQY8B12NX9M13W3YBMXQ8V01'>What’s the difference between active and inactive risk factors?</a></li>\n<li><a href='#h_01JQY8AJJXSQ548C980NAZJTAQ'>How often is Risk Score updated, and is it in real time?</a></li>\n<li><a href='#h_01JZNP9FVERH1TK602P6QTPP05'>What are the differences between the new Risk Score and the legacy Risk Score?</a></li>\n</ol>\n<h3 id='h_01JQY89K80129NBW0MSGMCJ5AK'>What is the SmartRisk Agent™, and how does it enhance human risk management?</h3>\n<p>The SmartRisk Agent™ is KnowBe4's new Risk Score system that provides you with dynamic and actionable data for your organization’s security posture. By tracking users’ risk behaviors and trends over time, you can tailor your security training and policies effectively and focus on your riskiest or safest security areas.</p>\n<p>The SmartRisk Agent calculates Risk Scores for individual users, groups, and your organization as a whole. The calculation is based on risk factors or user events and behaviors. Risk factors include clicking phishing links, reporting phishing emails, and complying with security policies. Then, risk factors are categorized into security types. Risk factors can be active or inactive, showing you which user behaviors and user events are contributing to higher Risk Scores and which behaviors might indicate potential risk. With these detailed insights, you can pinpoint specific risk areas in your organization and specific users that need additional support or security awareness training.</p>\n<h3 id='h_01JQY89V84VT0S07C7GPAQEF3S'>How are the seven security types in Risk Score defined and calculated?</h3>\n<p>There are seven security types that represent different areas of user behavior and potential risk. Each security type contributes to a user’s or an organization’s overall Risk Score. These security types aggregate user events and behaviors that are classified as risky, secure, or mitigation. Here’s a sample of each security type, along with how they are defined and calculated:</p>\n<table>\n<thead>\n<tr>\n<th scope='col'>Security Type</th>\n<th scope='col'>Definition</th>\n<th scope='col'>Examples</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Email Security</td>\n<td>Evaluates risks based on a user's email-related actions</td>\n<td>\n<ul>\n<li>Reporting phishing emails with the Phish Alert Button (PAB) reduces risk.</li>\n<li>Clicking on phishing links or failing simulated phishing tests increases risk.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Endpoint Security</td>\n<td>Focuses on risks arising from a user's interaction with their devices</td>\n<td>\n<ul>\n<li>Malware detections on a user's device increases risk.</li>\n<li>Completing security awareness training or receiving SecurityTips decreases risk.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Data Security</td>\n<td>Assesses risks related to a user’s data handling and data sharing behaviors</td>\n<td>\n<ul>\n<li>Sharing files to external devices or systems increases risk.</li>\n<li>Completing security awareness training or receiving SecurityTips decreases risk.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Web Security</td>\n<td>Measures the risks associated with a user’s online browsing and web-based actions</td>\n<td>\n<ul>\n<li>Visiting harmful or potentially compromised websites increases risk.</li>\n<li>Avoiding risky sites decreases risk.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Account Hygiene</td>\n<td>Evaluates the overall security practices around a user’s accounts</td>\n<td>\n<ul>\n<li>Using strong, unique passwords decreases risk.</li>\n<li>Reusing passwords or failing multi-factor authentication attempts increases risk.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Compliance Electives</td>\n<td>Reflects a user's engagement in compliance-related training</td>\n<td>\n<ul>\n<li>Completing compliance-related training reduces risk.</li>\n<li>Failing to complete required compliance training increases risk.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Physical Security</td>\n<td>Measures the user’s engagement in security practices related to physical access and security</td>\n<td>\n<ul>\n<li>Using a security key for physical device access decreases risk.</li>\n<li>Failing to comply with physical security training increases risk.</li>\n</ul>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Currently, the only risk factor that contributes to this security type is security awareness training assignments regarding physical security.</div>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id='h_01K2FT9EYN1APMG233DXDJ5S0R'>What is the available range for Risk Score?</h3>\n<p>The Risk Score available range indicates your level of risk, with one being the least risky and 100 being the most risky. While the available range is between one and 100, your range will never be below 10 or above 90.</p>\n<p>We use a 10-90 scale to provide a realistic image of where your security stands and what you can improve. A score of 0–10 would imply near-perfect security, which is practically unattainable given evolving cybersecurity threats and potential unknown risks. Similarly, a score of 90–100 would suggest a catastrophic security posture, which isn’t typically accurate, even for high-risk organizations. By focusing on the 10-90 range, you get a practical range of risk that helps you prioritize improvements that will make a real difference in your security posture.</p>\n<p>See the table below for the color and risk level breakdown of the available range.</p>\n<table>\n<thead>\n<tr>\n<th scope='col'>Color</th>\n<th scope='col'>Risk Score</th>\n<th scope='col'>Risk Level</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Green</td>\n<td>10-15</td>\n<td>Low</td>\n</tr>\n<tr>\n<td>Yellow</td>\n<td>16-45</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Orange</td>\n<td>46-75</td>\n<td>High</td>\n</tr>\n<tr>\n<td>Red</td>\n<td>76-90</td>\n<td>Critical</td>\n</tr>\n</tbody>\n</table>\n<h3 id='h_01JQY8B12NX9M13W3YBMXQ8V01'>What's the difference between active and inactive risk factors?</h3>\n<p>Active factors are events from integrated KnowBe4 products that provide direct data for Risk Score calculations. Actions classified as risky increase Risk Scores, while secure actions decrease Risk Scores.</p>\n<p>Inactive factors are used when data for a security type isn’t available, and the SmartRisk Agent applies a default risk value. The default risk value reflects a general risk level for the security type based on industry standards and potential threats. KnowBe4 assumes that user behavior in these types is risky, which can lead to a higher overall Risk Score.</p>\n<h3 id='h_01JQY8AJJXSQ548C980NAZJTAQ'>How often is Risk Score updated, and is it in real time?</h3>\n<p>Risk Score is dynamically updated as new data becomes available, but is not strictly updated in real time. Risk Score is updated on a daily basis, and any risky, secure, or mitigation event will reflect on Risk Score in 24 hours at most.</p>\n<p>The SmartRisk Agent continuously monitors and records risky, secure, and mitigation events across the different security types. Events from each integrated product are ingested into the Risk Score data pipeline daily, and when new data is received, an incremental adjustment is triggered in Risk Score. For example, if a user completes a security training module or clicks a phishing link, that action will affect their Risk Score within 24 hours after the event.</p>\n<h3 id='h_01JZNP9FVERH1TK602P6QTPP05'>What are the differences between the new Risk Score and the legacy Risk Score?</h3>\n<p>See the chart below for some key differences between our SmartRisk Agent™ and Risk Score and our legacy Virtual Risk Officer (VRO) and Risk Score:</p>\n<table>\n<thead>\n<tr>\n<th scope='col'>Risk Domains</th>\n<th scope='col'>SmartRisk Agent™ and Risk Score</th>\n<th scope='col'>Virtual Risk Officer (VRO) and Risk Score</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Data Integration</td>\n<td>Integrates data from across KnowBe4's entire product suite</td>\n<td>Primarily uses data from phishing tests, training activities, job titles, and data breaches</td>\n</tr>\n<tr>\n<td>Manager Risk Score</td>\n<td>Offers a hierarchical view with the Manager Risk Score report and a new Organizational Chart filter coming soon</td>\n<td>Only available in the Learner Experience (LX) under the Team Dashboard</td>\n</tr>\n<tr>\n<td>Benchmarking</td>\n<td>Organization size and industry benchmarking are planned for late 2025 or early 2026</td>\n<td>Not applicable</td>\n</tr>\n<tr>\n<td>Actionable Insights</td>\n<td>Provides specific guidance for remediation plans based on security types and risk factors</td>\n<td>Offers more general risk reduction recommendations</td>\n</tr>\n<tr>\n<td>Reporting Capability</td>\n<td>Emphasizes flexible reporting for improved stakeholder communication</td>\n<td>Dashboard gauge and standard reporting options</td>\n</tr>\n<tr>\n<td>Job Title</td>\n<td>No longer a factor in the Risk Score calculation</td>\n<td>Evaluates risk based on organizational connection patterns</td>\n</tr>\n<tr>\n<td>User and Group Booster</td>\n<td>No longer a factor in the Risk Score calculation</td>\n<td>Manually boosts a user’s Personal or Group Risk Score</td>\n</tr>\n<tr>\n<td>Phish-prone Percentage</td>\n<td>No longer a factor in the Risk Score calculation</td>\n<td>The percentage of your users who clicked on a simulated phishing link or opened an attachment during a phishing test</td>\n</tr>\n</tbody>\n</table>\n<h2 id='h_01JQY8Y6NVK8YHVFPG36ECTN6M'>Calculation</h2>\n<p>For more information about the calculation of Risk Score, see the questions and answers below:</p>\n<ol>\n<li><a href='#h_01JQY8YNHQ16B41BNZM0AVMGEK'>Why does my Risk Score go up or down?</a></li>\n<li><a href='#h_01JQY8YXN4M7EKGY6GT36HCC4N'>What are risky, secure, and mitigation events?</a></li>\n<li><a href='#h_01JQY8ZVA9B0062WBVXHXAQQ6M'>What’s the new user bias?</a></li>\n<li><a href='#h_01JQY8ZYJR2GFZ9CBG4HS31Y19'>How do inactive factors affect my Risk Score?</a></li>\n<li><a href='#h_01JQY9051RSMZG0WKF4EHVF4GT'>How do inactive factors affect my available range?</a></li>\n<li><a href='#h_01JQY90DHCAXG7FY01ZWG5FKT8'>How long do specific events impact a user's Risk Score?</a></li>\n<li><a href='#h_01K20F7MG2NBZHY6F83ZD2WV37'>Are students included in my Risk Score calculation?</a></li>\n</ol>\n<h3 id='h_01JQY8YNHQ16B41BNZM0AVMGEK'>Why does my Risk Score go up or down?</h3>\n<p>Risk Score will increase or decrease based on specific risky or secure behaviors or mitigation events that are detected and logged by KnowBe4 products. These behaviors are categorized into seven security types representing a different area of security risk.</p>\n<h3 id='h_01JQY8YXN4M7EKGY6GT36HCC4N'>What are risky, secure, and mitigation events?</h3>\n<p>When you or your users engage in behaviors considered risky, the Risk Score goes up. Risky behaviors signal potential security vulnerabilities, so the score increases to reflect a higher level of risk. Examples of risky behaviors include phishing link clicks, weak password practices, malicious website visits, and malware detections on your device.</p>\n<p>Engaging in secure behaviors will lower your Risk Score. Secure behaviors demonstrate proactive security awareness and compliance, so Risk Score adjusts your score to reflect reduced risk. Examples of secure behaviors include reporting phishing emails, completing security training, using strong passwords and multi-factor authentication, and using security tokens for physical security.</p>\n<p>Mitigation events mitigate risk on previously recorded risky events. While risky events increase Risk Score, a later mitigation event reduces the impact of that risky event but doesn't completely offset it. Examples of mitigation events include SecurityTips from <a href='https://support.knowbe4.com/hc/en-us/articles/6654432814355'>SecurityCoach</a>, <a href='https://support.knowbe4.com/hc/en-us/articles/31935234273939'>AIDA Remedial Training</a> completions, and <a href='https://support.knowbe4.com/hc/en-us/articles/4406004172435'>PasswordIQ</a> vulnerability resolution events.</p>\n<h3 id='h_01JQY8ZVA9B0062WBVXHXAQQ6M'>What's the new user bias?</h3>\n<p>When a new user is added to your KSAT console, they automatically have a higher Risk Score for the first 90 days. This temporary increase is due to the new user bias, which accounts for the higher risk associated with users who haven't yet completed security training or familiarized themselves with your organization's security policies.</p>\n<p>After 90 days, the new user bias expires, and the Risk Score will adjust based on the user's actual behaviors and training completion.</p>\n<h3 id='h_01JQY8ZYJR2GFZ9CBG4HS31Y19'>How do inactive factors affect my Risk Score?</h3>\n<p>In Risk Score, inactive factors occur when your organization doesn't have certain KnowBe4 products or integrations set up. Inactive factors are data gaps in the security types. The SmartRisk Agent can't track user behavior because it lacks input from relevant security tools or products.</p>\n<p>When there are inactive factors due to missing integrations or products, the SmartRisk Agent assumes that these areas could pose a security risk. As a result, Risk Score treats inactive factors as potentially risky, leading to a slightly higher Risk Score for those security types.</p>\n<p>For example, if you don't have an integration that monitors endpoint security, the SmartRisk Agent can't track whether a user’s device has malware or other endpoint-related risks. This area will be considered inactive, and a slight risk will be factored in to account for potential threats.</p>\n<h3 id='h_01JQY9051RSMZG0WKF4EHVF4GT'>How do inactive factors affect my available range?</h3>\n<p>If your organization has fewer KnowBe4 products and integrations, your available range will generally be narrower and higher. If your organization has more products enabled, like <a href='https://support.knowbe4.com/hc/en-us/articles/4406004172435'>PasswordIQ</a> or <a href='https://support.knowbe4.com/hc/en-us/articles/6654432814355'>SecurityCoach</a>, you can have a wider available range that better reflects true risk based on actual user behavior data.</p>\n<p>The more integrations and active factors you have, the broader the SmartRisk Agent’s understanding of user behavior across the different security types, allowing for a more accurate and potentially lower Risk Score.</p>\n<h3 id='h_01JQY90DHCAXG7FY01ZWG5FKT8'>How long do specific events impact a user's Risk Score?</h3>\n<p>The SmartRisk Agent has maximum and minimum event count limits that affect each area of your Risk Score. These limits help standardize the influence of risky and secure events on a user’s or organization’s overall Risk Score. Beyond the specific limit set by the SmartRisk Agent, any additional events won’t affect the Risk Score further. For example, the maximum count limit of the Phish Alert Button (PAB) is three.</p>\n<p>The impact duration, or time-to-live (TTL) value, varies depending on the specific risk factor. For example, credential breaches related to email exposure checks have a 90-day TTL value, meaning the breach will no longer affect the Risk Score after 90 days. Similarly, for Personally Identifiable Information (PII) data breaches, the TTL value is 60 days.</p>\n<p>These limits are set to maintain a balanced score that accurately reflects risk without excessive skew from repetitive actions.</p>\n<h3 id='h_01K20F7MG2NBZHY6F83ZD2WV37'>Are students included in my Risk Score calculation?</h3>\n<p>If you’re using our <a href='https://support.knowbe4.com/hc/en-us/articles/28682011883155'>KnowBe4 Student Edition</a> feature, students will be included in your overall Risk Score calculation.</p>\n<h2 id='h_01JQY992NB15X9GWWP9B6TCB4P'>Customization and Focus</h2>\n<p>For more information about the customization and focus of Risk Score, see the questions and answers below:</p>\n<ol>\n<li><a href='#h_01JQY9A6ED5PMCK6ZBTMK72RNC'>Can I customize the weight of different security types or risk factors?</a></li>\n<li><a href='#h_01JQY9A8JYXSPJQN243T067GFE'>Is there a way to focus on specific areas of risk?</a></li>\n</ol>\n<h3 id='h_01JQY9A6ED5PMCK6ZBTMK72RNC'>Can I customize the weight of different security types or risk factors?</h3>\n<p>The weight of different security types or risk factors in your Risk Score isn't customizable. The calculation of the SmartRisk Agent aims to provide consistent, objective benchmarks across organizations, which could be compromised by custom weighting. This approach ensures that Risk Score benchmarks are universally comparable and prevents the potential misuse of altered weights to artificially lower Risk Scores without addressing real security concerns.</p>\n<h3 id='h_01JQY9A8JYXSPJQN243T067GFE'>Is there a way to focus on specific areas of risk?</h3>\n<p>Using the Risk Score report, your organization can focus on specific areas of risk by viewing the security types and user behaviors in the areas of concern. For example, in the report, you can expand specific security types and view risk factors related to user behavior that may indicate a security concern.</p>\n<h2 id='h_01JQY9A3ZHA2VJKESDYESFC723'>Improving and Managing Risk Scores</h2>\n<p>For more information about improving and managing Risk Scores, see the questions and answers below:</p>\n<ol>\n<li><a href='#h_01JQY9C34B9SNWN7KCG363Z85V'>How can high-risk employees reduce their Risk Score?</a></li>\n<li><a href='#h_01JQY9CJ4STWCRCY9V93YW4E56'>Does the SmartRisk Agent provide recommendations for improving Risk Scores?</a></li>\n<li><a href='#h_01JQY9E453P789JHHFXCWP94XZ'>Can I access raw data or more detailed analytics behind my user’s or my organization's Risk Scores?</a></li>\n</ol>\n<h3 id='h_01JQY9C34B9SNWN7KCG363Z85V'>How can high-risk employees reduce their Risk Score?</h3>\n<p>High-risk employees can reduce their Risk Score by engaging in security-positive actions. Completing assigned security training, using the Phish Alert Button (PAB) to report phishing emails, and receiving Security Tips all help to reduce your Risk Score. These actions help demonstrate security-aware behavior and reduce the overall Risk Score associated with risky employees.</p>\n<h3 id='h_01JQY9CJ4STWCRCY9V93YW4E56'>Does the SmartRisk Agent provide recommendations for improving Risk Scores?</h3>\n<p>The SmartRisk Agent encourages secure behavior with prioritized training recommendations, showing you which actions will have the greatest security impact. General recommendations include reporting phishing attempts, consistently completing security awareness training, and actively engaging in compliance activities. Employees who participate in these secure behaviors and maintain good security practices around data, endpoint, and account hygiene will see improvements in their individual and organizational Risk Scores. Specific security insights are available through our Risk Score reports to provide actionable data on areas needing improvement.</p>\n<h3 id='h_01JQY9E453P789JHHFXCWP94XZ'>Can I access raw data or more detailed analytics behind my user's or my organization's Risk Scores?</h3>\n<p>Currently, there is no direct access to raw data within the Risk Score reports. However, there are plans to make detailed analytics and underlying calculations available in future updates. The SmartRisk Agent provides comprehensive Risk Score reports that detail scores for different security types and associated risk factors. You can access these reports in your KSAT console by navigating to <strong>Reports</strong> &gt; <strong>Risk Score Reports</strong>.</p>\n<h2 id='h_01JZNQ0Y64GG6MR04G7C9PGCBZ'>Risk Score and KnowBe4's APIs</h2>\n<ol>\n<li><a href='#h_01JZNQ1TGB8JQT940TVV66XXBX'>How do I retrieve my account risk history?</a></li>\n<li><a href='#h_01JZNQ275A754401BXEDX1K5DR'>Will the KnowBe4 User Event API be updated to work with Risk Score?</a></li>\n</ol>\n<h3 id='h_01JZNQ1TGB8JQT940TVV66XXBX'>How do I retrieve my account risk history?</h3>\n<p>You can use our Reporting API to retrieve your account risk history. Your account will automatically transition to Risk Score, and your risk history data will continue to be available through the API.</p>\n<h3 id='h_01JZNQ275A754401BXEDX1K5DR'>Will the User Event API be updated to work with Risk Score?</h3>\n<p>Yes, the User Event API will work with Risk Score, but with important changes. For both GET operations (retrieving events) and POST operations (pushing events), the risk_level, risk_decay_mode, and risk_expire_date parameters will no longer be supported. These parameters were specific to our legacy Risk Score.</p>\n<p>We've added a new factor field on the User Event API, which can be used to create new event types to register user training activities that will positively impact Risk Scores. These new factors are:</p>\n<ul>\n<li>training_completion_email_security</li>\n<li>training_completion_endpoint_security</li>\n<li>training_completion_data_security</li>\n<li>training_completion_web_security</li>\n<li>training_completion_account_security</li>\n<li>training_completion_compliance_electives</li>\n<li>training_completion_physical_security</li>\n</ul>\n<p>These new factors allow you to record completion of security training across different risk domains, which will be factored into the Risk Score calculation.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/40003728753171-FAQ-SmartRisk-Agent-and-Risk-Score-Guide",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "agent",
        "faq",
        "risk",
        "score",
        "smartrisk"
      ],
      "image_count": 0
    }
  }
}