{
  "article": {
    "id": 4402971030419,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4402971030419.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4402971030419.html",
    "author_id": 1501549449361,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": -2,
    "vote_count": 2,
    "section_id": 8595204233491,
    "created_at": "2021-06-29T13:32:02Z",
    "updated_at": "2025-03-11T17:39:31Z",
    "name": "Partner and Multi-Account: Create Managed Training Notifications",
    "title": "Partner and Multi-Account: Create Managed Training Notifications",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:39:31Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>Training campaign notifications can be used to notify users, managers, and KSAT console admins of a user's enrollment in or progress on a training campaign. This article will show you how to create managed training notification templates that your partners can use in their training campaigns.</p>\n<div class='callout-note'><div class='callout__content'>\n<strong>Note:</strong> In order to create managed training notification templates, admins will need to be granted the right permissions. Managing these templates can be done from the <strong>Admins</strong> tab of your management platform. To learn more, please see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013722733.html' target='_self'>Editing a Partner Admin</a> section of the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013722733.html'>Partner/Multi-Account How to Manage Partner Admins</a> article.</div></div>\n<p>To create new managed training notification templates, navigate to <strong>Training</strong> &gt; <strong>Notification Templates</strong>. Then, click the <strong>+ New Training Notification Template</strong> button in the top-right corner of the screen. This will take you to the <strong>New Training Notification Template</strong> screen.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/ManagedTrainingNotifications.png'><img src='https://helpimg.s3.amazonaws.com/reseller/ManagedTrainingNotifications.png' alt=' '></a></p>\n\n<ol role='list'>\n<li>\n<strong>Template Name</strong>: Enter a name for your training notification template. This name will help you determine the purpose of the notification at a glance. Admins for the accounts you are creating training notifications for will see this name as well.</li>\n<li>\n<strong>Sender’s Email Address</strong>: Enter the email address that you want the notification to appear to be coming from. You can use any email address you would like.</li>\n<li>\n<strong>Sender’s Name</strong>: Assign a name for the sender. This name will display on the training notification email next to the sender’s email address.</li>\n<li>\n<strong>Subject</strong>: Enter the email’s subject line. The recipient will see this subject line in their inbox. If you haven't added a Template Name, the subject line will also be used as the title of the template.</li>\n</ol>\n<p>Once you are done specifying your campaign settings, click <strong>Save</strong>.</p>\n\n<div class='callout-note'><div class='callout__content'>\n<strong>Note:</strong>To access customized training templates in your managed accounts, they must first be added to a <strong>Managed Templates </strong>category.</div></div>\n\n<p>Another way to create or edit a training notification template, navigate to <strong>Training</strong> &gt; <strong>Notification Templates</strong>. Under <strong>System Templates</strong>, you can click on one of our built-in training notification templates to open it in our What You See is What You Get (WYSIWYG) editor and make changes. Saving changes to a built-in system template will save a copy of your edit to the <strong>Drafts</strong> category under <strong>Managed Templates</strong>.</p>\n\n<div class='callout-note'><div class='callout__content'>\n<strong>Note:</strong>To use the templates you create as part of a training campaign, you will have to create one or more categories under <strong>Managed Templates</strong> and move your custom templates out of the <strong>Drafts</strong> category and into a different category.</div></div>\n\n",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/4402971030419-Partner-and-Multi-Account-Create-Managed-Training-Notifications"
  }
}