{
  "article": {
    "id": 4404148900755,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4404148900755.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4404148900755.html",
    "author_id": 1507801285842,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 8749663244179,
    "created_at": "2021-07-23T19:50:25Z",
    "updated_at": "2024-04-18T22:31:12Z",
    "name": "How Can I Engage My Stakeholders in My KCM GRC Risk Management Plan?",
    "title": "How Can I Engage My Stakeholders in My KCM GRC Risk Management Plan?",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-04-18T22:31:12Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "stakeholders",
      "Risk module",
      "risk management"
    ],
    "body": "<p>To ensure that your organization gets the most value out of your program, your stakeholders should understand the benefits of using KCM GRC for risk management initiatives.</p>\n<p>As a best practice, we recommend sending an email out to any of your stakeholders, such as C-level employees and your Director of IT, before creating risk management tasks. This will help to ensure that your stakeholders are prepared for any questions or concerns that users may have when they are assigned to tasks.</p>\n<p>Below, we provide a sample email that you can use as a template to send to your stakeholders. Please review the following text to ensure that the content matches your unique risk management initiatives, and change the text in brackets to personalize the template.</p>\n<blockquote>\n<p>All,</p>\n<p><em>As you know, increasing our organization’s risk management initiatives is imperative to the safety and success of our organization. I am excited to announce that we have partnered with KnowBe4 to help us manage risk and protect our organization. KnowBe4's KCM GRC software allows our organization to assign tasks to the individuals who work to mitigate our organization's risks. </em></p>\n<p><em>KCM GRC provides a Risk Wizard tool that we can use to identify and add risks from a catalog of pre-defined risks that are likely to affect our organization. Once it is set up, the KCM GRC Risk Management module displays at-a-glance and in-depth views of <strong>[your company]</strong>'s greatest risks while considering the controls that we have implemented to monitor these risks.</em></p>\n<p><em>Our goal is to identify and track risks so that we can <strong>[improve/begin]</strong> our risk assessment process and streamline the risk management process.</em></p>\n<p><em>I am excited to have this new program in place, and I welcome any questions or concerns.</em></p>\n<p><em>Thank you,</em></p>\n<p><strong><em>[Your Name]</em></strong></p>\n</blockquote>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/4404148900755-How-Can-I-Engage-My-Stakeholders-in-My-KCM-GRC-Risk-Management-Plan",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "engage",
        "grc",
        "kcm",
        "management",
        "risk",
        "stakeholders"
      ],
      "image_count": 0
    }
  }
}