{
  "id": 115001904547,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/115001904547.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/115001904547.html",
  "author_id": 1450288687,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 18,
  "vote_sum": 6,
  "vote_count": 8,
  "section_id": 26428532206995,
  "created_at": "2017-01-24T21:43:37Z",
  "updated_at": "2025-09-29T14:33:48Z",
  "name": "Social Engineering Indicators (SEI) Guide",
  "title": "Social Engineering Indicators (SEI) Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-09-19T20:57:42Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "phishing",
    "sei",
    "red flags",
    "social engineering indicators",
    "reviewed_OH_09_2019",
    "localized",
    "answerbot",
    "answerbot_kmsat"
  ],
  "body": "<p>KnowBe4's Social Engineering Indicators (SEI) feature allows every simulated phishing email you send to become a point-of-failure training exercise. It shows your users exactly what Social Engineering Indicators, or red flags, they overlooked when they clicked on a simulated phishing email.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> SEI is only available to Platinum and Diamond subscription levels.</div>\n</div>\n<h2 id='h_01HS1MPRK5KC04M4GV4VSA96GD'>Why Should I Use SEI?</h2>\n<p>SEI reinforces your cybersecurity awareness training efforts by answering the common question from users \"How do I know emails are phishing emails?\" The point-of-failure feedback they receive does not include vague, generalized tips. What they will see instead is the exact phishing test email they clicked on, pointing out the details that should have raised a red flag for them. This feature enhances and strengthens your security awareness training program.</p>\n<h2 id='h_01HS1MPRK58V58NCDSX0GH1CP5'>How Does it Work?</h2>\n<p>Once you set up a phishing test with one of our built-in SEI landing pages, and your user fails a phishing test by clicking a link or opening an attachment, they will be taken to the landing page, which will display exactly what red flags should have caused them to be suspicious.</p>\n<p><strong>Sample of SEI Landing Page</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_LandingPageExample.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_LandingPageExample.png' alt=''> </a></p>\n<p>Our phishing templates are pre-loaded with red flags to get you started on dynamically training your users through this method.</p>\n<p>To preview the red flags on our templates, click on <strong>Phishing &gt; Phishing Templates &gt; System Templates</strong>, then click any topic to see what templates are in that topic. Click the preview button to the right of the template, as shown below:</p>\n<p><strong>Previewing System Templates</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_PreviewRedFlagsPhishing.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_PreviewRedFlagsPhishing.png' alt=''> </a></p>\n<p>Next, click <strong>Toggle Red Flags</strong> on the top right of the email template preview to view what Social Engineering Indicators are marked on that particular template. The text of the SEI red flag will appear when you hover over the flagged elements of the email.</p>\n<p><strong>Template Preview: Toggle Red Flags</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_ToggleRedFlags.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_ToggleRedFlags.png' alt=''> </a></p>\n<h2 id='h_01HS1MPRK5VRTZEA4N5JR5BJ4Q'>How Do I Set up a Phishing Campaign Using SEI?</h2>\n<p>Set up a Phishing Campaign as you normally would and select our built-in SEI landing page as the landing page for that campaign. Alternatively, you can make your own SEI landing page. To learn how to create your own SEI landing page, see <a href='#SEIlandingpage'>How Do I Add the SEI Template Placeholder to Another Landing Page?</a></p>\n<p>Choose what topics you'd like to use in the campaign, as well as any other settings you prefer for your test. If you're selecting your own topics rather than our built-in templates, be sure that your templates contain red flags.</p>\n<p><strong>Selecting the SEI Landing Page</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_SelectingSEILandingPage.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_SelectingSEILandingPage.png' alt=''> </a></p>\n<h2 id='h_01HS1MPRK58WZGA0RZKWFK3T2Y'>Can I Use SEI With Any Phishing Template or Landing Page?</h2>\n<p>Yes! Our phishing templates are pre-loaded with red flags to get you started quickly and easily. You can alter our existing red flags however you wish but keep in mind that after making changes to a System Template, the template will be saved as a new template under the <strong>My Templates</strong> area.</p>\n<p>You can choose an SEI landing page from within the template editor or when you set up the phishing campaign. Choosing the SEI landing page when you set up the phishing campaign is recommended.</p>\n<p>For landing pages, we've included SEI landing pages to get you started, but you can easily make your own or edit our other landing pages to include the SEI template placeholder. See: <a href='#SEIlandingpage'>How Do I Add the SEI Template Placeholder to Another Landing Page?</a></p>\n<h2 id='h_01HS1MPRK5BKBGPP7NHXSTA807'>How Do I Add Red Flags to Templates?</h2>\n<p>You'll want to navigate to the template you'd like to edit under <strong>Phishing &gt; Phishing Templates &gt; System Templates</strong>. In any of the phishing emails in <strong>System Templates</strong>, you can clone a template to use in your phishing campaigns. When you clone a template, it will automatically be saved to the <strong>My Templates</strong> section of the <strong>Phishing Templates</strong> subtab. Then, simply click on the title of the template to open the template editor.</p>\n<p>You'll notice the option <strong>A</strong><strong>dd a Red Flag</strong> around the elements of the template. Simply click on <strong>A</strong><strong>dd a Red Flag</strong> to add or edit the red flag. For example, in the LinkedIn template below, an alternative red flag could say <strong>The sender email is coming from our domain, rather than LinkedIn</strong>.</p>\n<p>You can also add red flags to any text, links, or images in the body of the email. To do so, select the text, link, or image and then click the <strong>Red Flag</strong> button on the menu bar. Enter the text for the red flag as you wish, then click OK.</p>\n<p><strong>Example of a Red Flag on Sender Email and Text Within Email Body</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/SEI/BodyRedFlag.gif'><img src='https://helpimg.s3.amazonaws.com/SEI/BodyRedFlag.gif' alt=' ' width='1017' height='608'></a></p>\n<p><strong>Example of a Red Flag on a Link and a Generic Red Flag</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/SEI/LinkandGenericRedFlag.gif'><img src='https://helpimg.s3.amazonaws.com/SEI/LinkandGenericRedFlag.gif' alt=' ' width='977' height='584'></a></p>\n<p>If you'd like the red flag to be an overall red flag for the whole email template, click the <strong>Red Flag</strong> button and enter the red flag text, then click the Generic Flag checkbox on.</p>\n<p>An example generic red flag for the above template could be <strong>This LinkedIn email is vague. If you hover over the link, you will see it doesn't take you to the LinkedIn website. Think before you click! </strong></p>\n<p>Once you save your template, you can find it under the <strong>Phishing Templates &gt; My Templates</strong> area. Click the eyeball icon to Preview the template, as well as the red flags you created.</p>\n<p><strong>Previewing Your Template</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/SEI/SEIPreview_01NEW.png'><img src='https://helpimg.s3.amazonaws.com/SEI/SEIPreview_01NEW.png' alt=' '></a></p>\n<p><strong>Click \"Toggle Red Flags\" to Preview Red Flags</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/SEI/SEIPreview2.png'><img src='https://helpimg.s3.amazonaws.com/SEI/SEIPreview2.png' alt=' '></a></p>\n<p><strong> Hover Over Flagged Items to See SEI Text</strong></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/SEI/SEIPreview3.png'><img src='https://helpimg.s3.amazonaws.com/SEI/SEIPreview3.png' alt=' '></a></p>\n<h2 id='h_01HS1MPRK5106D4YS0WWVQNAMJ'>Can I Manually Add a Red Flag Using HTML?</h2>\n<p>Yes, you can manually add red flags within the body of the phishing template.</p>\n<p>To do so, open the template editor for the template you'd like to edit, and click the Source button in the menu bar of the editor. Find where you'd like to enter the red flag.</p>\n<p>If you want to mark a red flag on <strong>a particular line of text, image, or link</strong>, you'll want to contain the item to be flagged within the following code:</p>\n<p><code>&lt;x-sei title='Here is the text of the red flag.'&gt;Here is the text,\n    image or link you'd like to mark as a red flag.&lt;/x-sei&gt;</code></p>\n<p>If you would like to mark a <strong>Generic Flag</strong> on the template (an overall explanation of why the user should have been concerned about clicking the links in the email), you can do so with the following code:</p>\n<p><code>&lt;x-sei generic='true' title='Here is where you can place Generic Flag\n    text, to let the users know why they should have known the email was\n    potentially dangerous.'&gt;&lt;/x-sei&gt;</code></p>\n<h2 id='h_01HS1MPRK5F9379CE25YE141R4'>How Do I Add the SEI Template Placeholder to Another Landing Page?</h2>\n<p>In your landing page editor, there is a drop-down called SEI Placeholders. Click this drop-down and add <strong>Red flag indicators</strong><span> to add the placeholder. Wherever you add the placeholder is where the SEI-flagged template will appear. You can also type the placeholder </span><strong>[[template_sei]]</strong><span> anywhere on the landing page if that is easier.</span></p>\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong> To avoid display issues with SEI placeholders on your landing pages, we recommend using simple HTML code that does not include scripts. As a security measure, the What You See is What You Get (WYSIWYG) editor does not allow you to save certain code or scripts.</div>\n</div>\n<p>You can edit one of our existing landing pages, or create your own from scratch.</p>\n<p><strong>Landing Page Editor</strong></p>\n<p><a data-fancybox='single' data-src='http://helpimg.s3.amazonaws.com/SEI/AddingSEIPlaceholderToLP.png'><img src='http://helpimg.s3.amazonaws.com/SEI/AddingSEIPlaceholderToLP.png' alt=' '></a></p>\n<p>Once the landing page is finalized, simply click Save. The landing page will be saved under the <strong>Phishing &gt; Landing Pages &gt; My Landing Pages</strong> area of your console and will need to be placed within a category in order to be utilized.</p>\n<h2 id='h_01HS1MPRK5WXRP27K7244KJH1C'>Where Can I Get a List of Red Flags to Use?</h2>\n<p>If you'd like, you can use any of our 22 red flags to get started on marking up your templates, or you are free to create your own. Ours are listed below:</p>\n<p><strong>SENDER</strong></p>\n<ol>\n<li>Were you expecting an email from this sender?\n<ul>\n<li>\n<strong>Explanation:</strong> The email came from a sender that was outside of your organization.</li>\n</ul>\n</li>\n<li>Do you know this sender?\n<ul>\n<li>\n<strong>Explanation:</strong> The email came from a sender that you don't know and is not recognized by anybody in your organization.</li>\n</ul>\n</li>\n<li>Sender email address is from your organization but could be spoofed.\n<ul>\n<li>\n<strong>Explanation:</strong> The sender's email address comes from your organization, a customer, vendor, or partner but is unusual and out of that person's character.</li>\n</ul>\n</li>\n<li>Email domain is strange or suspicious.\n<ul>\n<li>\n<strong>Explanation: </strong>You don't recognize the sender's email address and the domain is strange and unusual.</li>\n</ul>\n</li>\n<li>Email domain is spoofing a popular website or well-known organization.\n<ul>\n<li>\n<strong>Explanation:</strong> The email domain is a weird variation of a popular website or a well-known organization.</li>\n</ul>\n</li>\n<li>Email domain is a misspelling of a popular website or well-known organization.\n<ul>\n<li>\n<strong>Explanation:</strong> The email domain is misspelled.</li>\n</ul>\n</li>\n</ol>\n<p><strong>SUBJECT</strong></p>\n<ol>\n<li>Subject line is irrelevant or doesn’t match the content of the email.\n<ul>\n<li>\n<strong>Explanation:</strong> The email has a subject line that does not match the actual content of the email.</li>\n</ul>\n</li>\n<li>Subject line shows a “reply” to something you never sent or requested.\n<ul>\n<li>\n<strong>Explanation:</strong> The email is a reply to an email that was never requested by you.</li>\n</ul>\n</li>\n<li>Subject line shows the message was forwarded to you, but content doesn’t apply to you.\n<ul>\n<li>\n<strong>Explanation:</strong> The email was forwarded to you but the content does not align with your job responsibilities.</li>\n</ul>\n</li>\n</ol>\n<p><strong>CONTENT</strong></p>\n<ol>\n<li>Ambiguous salutation. (Example: “Dear user”)\n<ul>\n<li>\n<strong>Explanation:</strong> A generic greeting such as All, Dear Sir/Madam, To whom it may concern.</li>\n</ul>\n</li>\n<li>Tells you to click a link or open an attachment.\n<ul>\n<li>\n<strong>Explanation:</strong> The email is telling you to click a link or open an attachment that seems unusual.</li>\n</ul>\n</li>\n<li>Warns of negative consequence if you don’t complete request.\n<ul>\n<li>\n<strong>Explanation:</strong> The email tells you that there will be a negative consequence that happens if you do not click the link or open an attachment.</li>\n</ul>\n</li>\n<li>Prompts you to complete a request to gain something of value.\n<ul>\n<li>\n<strong>Explanation: </strong>The email tells you that you can win something of value if you click a link or open an attachment.</li>\n</ul>\n</li>\n<li>Spelling/grammar errors.\n<ul>\n<li>\n<strong>Explanation:</strong> Are there obvious spelling and grammar errors in the email?</li>\n</ul>\n</li>\n<li>Sense of urgency. (Example: “Do this now!”)\n<ul>\n<li>\n<strong>Explanation:</strong> The email tells you that you only have a certain amount of time to complete the action.</li>\n</ul>\n</li>\n<li>Do you normally receive this kind of email at work?\n<ul>\n<li>\n<strong>Explanation:</strong> The email is unusual and not something that you normally receive at work.</li>\n</ul>\n</li>\n<li>Shocking content to entice you to click a link or open an attachment.\n<ul>\n<li>\n<strong>Explanation:</strong> The email is using shocking information to get you to click a link or open an attachment.</li>\n</ul>\n</li>\n<li>Aggressive content to scare you into clicking a link or opening an attachment.\n<ul>\n<li>\n<strong>Explanation:</strong> The email is using aggressive language, and content, to scare you into clicking a link or opening an attachment.</li>\n</ul>\n</li>\n</ol>\n<p><strong>ATTACHMENTS</strong></p>\n<ol>\n<li>Attachment is strange or has an enticing title that makes you want to open it.\n<ul>\n<li>\n<strong>Explanation:</strong> The email included an attachment that has an intriguing title or is unnecessary for the content of the email.</li>\n</ul>\n</li>\n<li>Attachment has a possibly dangerous file extension.\n<ul>\n<li>\n<strong>Explanation:</strong> The email included an attachment that has a potentially dangerous file extension.</li>\n</ul>\n</li>\n</ol>\n<p><strong>LINKS</strong></p>\n<ol>\n<li>Hover over the link. Link is taking you to a different address than what is shown.\n<ul>\n<li>\n<strong>Explanation:</strong> The link is showing a different address than the one that is shown in the email.</li>\n</ul>\n</li>\n<li>Hover over the link. Link does not take you to the site the email content says it will.\n<ul>\n<li>\n<strong>Explanation:</strong> The link is showing a different website than the one that is shown in the email.</li>\n</ul>\n</li>\n</ol>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/115001904547-Social-Engineering-Indicators-SEI-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_LandingPageExample.png",
      "alt": "This image displays a security awareness training feedback page following a simulated phishing test failure. The structure consists of three main content areas: results notification, the simulated email review, and preventative safety rules.\n\n**I. Results Notification and Context**\n\nThe page is headed by prominent text declaring the test outcome:\n*   **Header 1:** \"Oops!\"\n*   **Header 2:** \"You clicked on a simulated phishing test!\"\n*   **Header 3:** \"Here are the red flags you missed:\"\n\n**II. Simulated Email Review Panel**\n\nA centralized graphical element simulates an email client window with dark gray headers and standard window control buttons (minimized, maximized, close).\n\n*   **UI Element:** A button in the top right corner is labeled \"Toggle red flags.\"\n*   **Email Headers:**\n    *   **From:** IT <IT@knowbe4.com>\n    *   **Reply-to:** IT <IT@knowbe4.com>\n    *   **Subject:** Change of Password Required Immediately\n*   **Email Body (Key Content and Red Flags):** The text conveys urgency and a fabricated security event. Certain phrases are preceded by a small red flag graphic (indicating areas of failure or suspicion):\n    *   \"We suspect a security breach happened earlier this week. In order to prevent further damage, we need everyone to [red flag marker] change their password immediately.\"\n    *   A link is provided: \"[red flag marker] Please click here to do that:\" followed by the hyperlinked call-to-action: \"[red flag marker] Change Password.\"\n    *   The email concludes with a prompt for immediate action (\"Please do this right away. Thanks!\") and the signature \"Sincerely, IT.\"\n\n**III. Instructional Safety Rules**\n\nBelow the email simulation, a heading introduces a set of guidelines: \"Remember these three rules to stay safe online:\". These rules are presented in three separate, numbered instructional panels:\n\n*   **Rule 1:** Always stop, look, and think before you click!\n*   **Rule 2:** Check for red flags that indicate a phishing attack is happening.\n*   **Rule 3:** Verify suspicious emails with the sender through a different medium.\n\n**IV. Footer/Disclaimer**\n\nThe bottom of the page contains a concluding instruction and security reminder: \"Remember: Always report suspicious emails to your supervisor or IT team. There are many ways that internet criminals will try to scam you. Stay alert—YOU are the last line of defense!\"",
      "position": 1,
      "context": "to be suspicious.\nSample of SEI Landing Page"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_PreviewRedFlagsPhishing.png",
      "alt": "This image displays a System Topics management interface, featuring a left-hand navigation pane for categories and a main content area for filtered results.\n\n**UI Elements and Context:**\n\n1.  **Header:** Titled \"System Topics.\"\n2.  **Filter Area (Top):** Contains three dropdown filters (\"Languages,\" \"Difficulty\") and a search input field (\"Search\"). Below these is an expandable section labeled \"Additional Filters.\"\n3.  **Left Navigation Pane (Topics List):** Displays a vertical list of topic categories.\n    *   A toggle switch is present, labeled \"Show Excluded Topics.\"\n    *   Categories include \"All Templates\" (7850), \"Account Notifications\" (43), \"Attachments with Macros\" (0), and \"Baseline Templates\" (0).\n    *   The category **\"Business Communication\"** is actively selected (highlighted in blue) and shows a count of **17** items.\n    *   Other visible categories are \"Business Finance,\" \"CEO Fraud,\" \"Compliance,\" and \"Current Event of the Month.\"\n4.  **Results Pane (Main Content):** Displays a tabular list of templates filtered by the selected topic.\n    *   **Title:** \"Business Communication - 1474 Results.\" (Note: This result count, 1474, conflicts with the selected category count, 17, suggesting the filters applied above the table are overriding the category selection, or 17 is the count of *something else* related to this topic).\n    *   An action button \"Clear Filters\" with a refresh icon is located in the upper right.\n\n**Table Structure and Data (First Three Rows):**\n\nThe results table includes the following sortable column headers:\n\n*   (Checkbox)\n*   **Template Name** (Sort indicator present)\n*   **Topics**\n*   **Languages** (Sort indicator present)\n*   **Difficulty** (Sort indicator present)\n*   **Updated On** (Sort indicator present)\n*   **Origin** (Sort indicator present)\n*   **Actions**\n\n**Example Data Rows:**\n\n| Template Name | Topics | Languages | Difficulty | Updated On | Origin | Actions |\n| :--- | :--- | :--- | :--- | :--- | :--- | :--- |\n| Updated list (Excel Attachment) (Spoofs Domain) | 3 Topics | English (United States) | 4 out of 5 stars (filled) | 09/15/2025 | Fishhook icon (Gray) | Blue eye icon (Preview tooltip indicated by cursor) |\n| IT: Microsoft Teams Premium participation (Link) (Spoofs Domain) | 3 Topics | English (United States) | 4 out of 5 stars (filled) | 09/15/2025 | Fishhook icon (Gray) | Blue eye icon (Preview tooltip indicated by cursor) |\n| [[company\\_name]] Office News (Link) (Spoofs Domain) | 2 Topics | English (United States) | 3 out of 5 stars (filled) | 09/11/2025 | Refresh/Recycle icon (Gray) | Blue eye icon (Preview tooltip indicated by cursor) |\n\n**Annotation:**\n\nA red arrow points specifically to the \"Actions\" column, highlighting a mouseover state where the tooltip \"Preview\" is displayed over the rightmost blue eye icon. The left icon in the \"Actions\" column is a second blue eye icon, potentially indicating \"View\" or \"Toggle Visibility.\"",
      "position": 2,
      "context": "shown below:\nPreviewing System Templates"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_ToggleRedFlags.png",
      "alt": "This image displays the preview interface for an email template, titled **\"Preview - Updated list (Excel Attachment) (Spoofs Domain)\"**. This interface includes configuration options, email metadata, action buttons, and a representation of the email body content, highlighting specific security indicators (\"Red Flags\").\n\n**UI Elements and Configuration:**\n\n*   **Title Bar:** Displays the template name and context: \"Preview - Updated list (Excel Attachment) (Spoofs Domain).\" A close button (X) is present on the top right.\n*   **Localization Dropdown:** A selection box is set to **\"English (United States)\"**.\n*   **Action Buttons (Right Panel):**\n    *   A primary blue button labeled **\"Send Me a Test Email\"** (with an envelope icon).\n    *   A secondary button labeled **\"Toggle Red Flags\"** (with a red flag icon), used to hide or display the highlighted security indicators.\n*   **Template Identification:** The system displays a long string labeled **\"Template ID:\"** (`339255-2d0c9ccd-9c21-4164-b075-30aaaeabcbce8`).\n\n**Email Metadata and Flagged Content:**\n\nThe header section details the sender information, where three key fields are highlighted as security concerns (indicated by a red flag icon and red underlining):\n\n*   **From:** `manager@knowbe4.com` (Flagged)\n*   **Reply-To:** `manager@knowbe4.com`\n*   **Subject:** `Updated list`\n*   **Attachment:** An attachment icon is followed by a red flag icon and the underlined filename **`inventory.xlsx`** (Flagged).\n\n**Email Body Content:**\n\nThe body of the email is brief and transactional:\n\n*   **Salutation:** `Hi [Blurred Text] `\n*   **Body Text:** A central sentence is flagged with a red flag icon and underlined: **\"Attached is the updated inventory list.\"**\n*   **Closing:** `Thanks,`",
      "position": 3,
      "context": "of the email.\nTemplate Preview: Toggle Red Flags"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/security_coach/SEI_SelectingSEILandingPage.png",
      "alt": "This image displays the configuration settings for a simulated phishing link, structured under the bold heading **\"Phishing Link\"**.\n\nThe interface presents two distinct configuration fields, each utilizing a label and a select box input with an accompanying help icon (question mark in a circle) positioned to the right.\n\n1.  **Phish Link Domain:**\n    *   **Label:** Phish Link Domain\n    *   **Input Type:** Dropdown/Select box.\n    *   **Current State:** Placeholder text or unselected value reads \"Random Domain\".\n    *   **Controls:** Dropdown chevron.\n\n2.  **Landing Page:**\n    *   **Label:** Landing Page\n    *   **Input Type:** Dropdown/Select box that supports a selected value.\n    *   **Current State:** Selected value is displayed as \"SEI Landing Page (Translatable) (Platinum/Diamond Only)\".\n    *   **Controls:** A clear/remove button (`x`) precedes the standard dropdown chevron.",
      "position": 4,
      "context": "ed flags.\nSelecting the SEI Landing Page"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/SEI/BodyRedFlag.gif",
      "alt": "This image displays the configuration interface for a phishing simulation template, titled **\"LinkedIn: Join My Network on LinkedIn (Link) (Spoofs Domain)\"**.\n\n**UI Elements and Configuration Fields:**\n\nThe upper section contains input fields for email metadata:\n*   **Sender's Email Address** and **Reply-To Email Address** are both set to the variable `linkedin@[[domain]]`.\n*   **Sender's Name** and **Reply-To Name** are both set to `LinkedIn`.\n*   **Subject** is `Join my network on LinkedIn`.\n*   Fields for **Attachment File Name** (empty) and **Attachment Type** (dropdown) are present.\n*   Security tagging functionality is indicated by the presence of **\"Add a red flag\"** links beneath most input boxes.\n\n**Content Editor:**\n\nThe configuration fields transition into a robust WYSIWYG (What You See Is What You Get) editor. The toolbar includes controls for Source view, standard text formatting, font selection, and specialized elements such as **\"Placeholder,\" \"Phish Link,\"** and **\"Red Flag.\"**\n\n**Email Content Preview (The Template):**\n\nThe preview simulates a standard LinkedIn invitation email:\n*   The header prominently features the text **\"LinkedIn\"**.\n*   The main body text states: **\"Someone from [[domain]] has indicated you are a Friend:\"**\n*   A call-to-action (CTA) section displays a yellow button labeled **\"Accept\"** and a hyperlinked text labeled **\"View invitation from Someone.\"**\n    *   Note: The **\"View invitation from Someone\"** link is visually marked with a red flag icon, typically denoting the malicious payload link within the simulation platform.\n*   The email concludes with a promotional footer regarding LinkedIn Answers.",
      "position": 5,
      "context": "hen click OK.\nExample of a Red Flag on Sender Email and Text Within Email Body"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/SEI/LinkandGenericRedFlag.gif",
      "alt": "This image displays a configuration screen for creating a simulated phishing email, likely within a security training platform.\n\n**UI Elements and Context:**\n\nThe screen is structured with input fields for defining email parameters and a rich text editor for composing the email body.\n\n**Input Fields (Top Section):**\n\n*   **Name:** \"LinkedIn: Join My Network on LinkedIn (Link) (Spoofs Domain)\"\n*   **Sender's Email Address:** `linkedin@[[domain]]` (Placeholder `[[domain]]` indicates a variable field)\n*   **Sender's Name:** `LinkedIn`\n*   **Reply-To Email Address:** `linkedin@[[domain]]`\n*   **Reply-To Name:** `LinkedIn`\n*   **Subject:** `Join my network on LinkedIn`\n*   **Attachment File Name:** Empty text field.\n*   **Attachment Type:** Dropdown labeled \"Select option.\"\n\nSeveral fields include an option to \"Add a red flag,\" suggesting customizable warning indicators for suspicious elements.\n\n**Rich Text Editor (Lower Section):**\n\nThe screen includes a WYSIWYG editor toolbar featuring standard text formatting options (Source, bold, italics, links, lists, styles, font), and specific security training tools (\"Placeholder,\" \"Phish Link,\" \"Red Flag\").\n\n**Email Content Preview:**\n\nThe editor displays a preview of an email designed to mimic a LinkedIn network invitation:\n\n*   **Header:** \"LinkedIn\" (in bold, large font).\n*   **Body Text 1 (Headline):** **\"Someone from [[domain]] has indicated you are a Friend:\"** (The word \"Someone\" and placeholder `[[domain]]` are flagged with a red flag icon next to them).\n*   **Body Text 2:** \"I'd like to add you to my professional network on LinkedIn.\"\n*   **Action Buttons:**\n    *   A yellow button labeled \"Accept\" (also flagged with a red flag icon).\n    *   A hyperlink labeled \"View invitation from Someone\" (flagged with a red flag icon).\n*   **Footer/Callout:** \"DID YOU KNOW THAT LinkedIn can find the answers to your most difficult questions? Post those vexing questions on LinkedIn Answers to tap into the knowledge of the world’s foremost business experts.\"",
      "position": 6,
      "context": "ht='608'>\nExample of a Red Flag on a Link and a Generic Red Flag"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/SEI/SEIPreview_01NEW.png",
      "alt": "This image displays two rows of a list view, likely representing templates or event entries within a system interface.\n\n**Interface Elements and Data Fields:**\n\n1.  **Selection Checkbox:** Both visible rows begin with an unchecked square checkbox for multi-item selection.\n2.  **Hyperlink Title (Teal/Cyan):** The primary data field contains the event or template title, formatted as a link. Examples include:\n    *   Row 1: \"Powerball: You May Have Won (Link)\"\n    *   Row 2: \"Win a Spa Giveaway (Link)\"\n3.  **Date Stamp:** A consistent date field is present: \"11/07/2019\".\n4.  **Rating Metric:** A five-star rating display uses red/orange filled stars to denote rating level:\n    *   Row 1: Four out of five stars filled (4/5).\n    *   Row 2: Three out of five stars filled (3/5).\n5.  **Status/Category Text:** A label is displayed: \"My Current Events\".\n6.  **Action Icons (Teal/Cyan):** Each row concludes with two action indicators:\n    *   **Preview Icon:** An 'eye' icon (indicating a view or preview function).\n    *   **Status Toggle:** A horizontal toggle switch, displayed in the **ON** (active) position.\n\n**Contextual Overlay:**\n\nA black rectangular tooltip with the text **\"Preview this template\"** is overlaid on the upper right side, pointing directly toward the 'eye' icon and toggle switch of the first list item.",
      "position": 7,
      "context": "template, as well as the red flags you created.\nPreviewing Your Template"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/SEI/SEIPreview2.png",
      "alt": "This image is a screenshot of an email template preview, likely within a phishing simulation or security analysis tool, indicated by the control elements surrounding the email content.\n\n**UI and Context Elements:**\n\n*   **Template Identification:** Template ID: `339255-202029` is displayed in the top right corner.\n*   **Header Metadata:** The displayed email is sourced from: `[Red Flag Icon] Navy Federal <accountalert@navyfederalcred.ita>`. The Subject line is `Suspicious Login Attempts Noticed`. The email address uses a non-standard or suspicious `.ita` domain.\n*   **UI Controls (Top):**\n    *   A toggle switch is present for `Show Remote Images`.\n    *   Two action buttons are visible: `[Envelope Icon] Send Me a Test Email` and `[Red Flag Icon] Toggle Red Flags`. An orange arrow specifically highlights the \"Toggle Red Flags\" button, suggesting points of suspicion are being marked within the template.\n\n**Email Content (Navy Federal Credit Union Template):**\n\n*   **Branding:** The email uses the official Navy Federal Credit Union logo and branding colors (dark blue and orange).\n*   **Internal Header:** Includes the title `Navy Federal Security Zone` and masked access information (`Access XXXXXXXXXXXXXX`).\n*   **Title:** The central title reads `Online Account Verification` (Orange text).\n*   **Phishing Hook (Body Text):** The primary text states: \"A temporary hold has been placed on your account affecting your debit card due to [Red Flag Icon] unusual log-in attempts.\" It instructs the recipient: \"[Red Flag Icon] Use the link below to activate your login information...\"\n*   **Call to Action (CTA):** A large, underlined link is provided: `[Red Flag Icon] SIGN IN NOW`.\n*   **Footer:** The email attempts to establish legitimacy by including blue, hyperlinked-style navigation links (Products & Services, FAQs, Mobile Banking, Contact Us) and a detailed disclaimer listing a physical address (PO Box 3000, Merrifield, VA 22119-3000) and customer service number (`1-888-842-6000`).\n*   **Regulatory Text:** The footer includes standard financial institution language, including the bold phrase: **\"Federally insured by NCUA.\"** and a separate `Privacy Policy` link.",
      "position": 8,
      "context": "IPreview_01NEW.png' alt=' '>\nClick \"Toggle Red Flags\" to Preview Red Flags"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/SEI/SEIPreview3.png",
      "alt": "This image displays the technical preview of a simulated phishing email template, titled \"Email Preview - Facebook: Update on recent personal data hack (Link).\"\n\n**I. UI and Template Metadata:**\n*   **Context:** Email preview interface, showing navigation controls (left/right chevrons) and a close button (X).\n*   **Template ID:** `339255-2266734`.\n*   **Controls:** Two primary action buttons are visible: a blue button labeled \"Send Me a Test Email,\" and a red button labeled \"Toggle Red Flags.\"\n*   **Settings:** A toggle switch labeled \"Show Remote Images\" is active (blue).\n\n**II. Email Header Information:**\n*   **From:** `Facebook <noreply@facebook-updates.com>` (Note: The domain `facebook-updates.com` is non-standard).\n*   **Reply-To:** `Facebook <noreply@facebook-updates.com>`.\n*   **Subject:** `Update on recent personal personal data hack`.\n\n**III. Email Body Content and Threat Indicators:**\n*   **Branding:** The email begins with the standard Facebook 'f' logo in blue.\n*   **Recipient:** The greeting addresses a specific, placeholder email: `Dear admin@kb4u-demo.com,`.\n*   **Phishing Lure:** The body claims Facebook \"recently experienced a personal data hack\" and instructs the user to check if their data was exposed.\n*   **Threat Indicators (Red Flags):** Small red flag icons are embedded in the text to highlight specific threat vectors:\n    1.  Preceding the phrase: \"...personal data hack where some of our users' data may have been exposed.\" (Urgency/Fear inducement).\n    2.  Preceding the phrase: \"Once you click the submit button, you will be redirected to a new website with your answer.\" (Confirming malicious redirect).\n*   **Diagnostic Overlay:** A large, red rectangular overlay, inserted by the preview software, explicitly identifies the vector: \"Tells you to click a link or open an attachment.\"\n\n**IV. Call to Action (CTA) Mechanism:**\n*   The email contains a form requiring user input:\n    *   Label: `Enter Email Address:`\n    *   Input Field: A blank text entry box.\n    *   Submit Button: A blue button labeled **Submit**.\n*   **Closing:** The email concludes with a standard link for contact (\"contact us here\") and a sign-off: \"Thank you, The Facebook Team.\"",
      "position": 9,
      "context": "om/SEI/SEIPreview2.png' alt=' '>\n Hover Over Flagged Items to See SEI Text"
    },
    {
      "url": "http://helpimg.s3.amazonaws.com/SEI/AddingSEIPlaceholderToLP.png",
      "alt": "This image captures a web application interface for **Editing a Landing Page**.\n\n**Context and Main Elements:**\n1.  **Header:** The page title is displayed as \"**Editing Landing Page**\".\n2.  **Navigation:** A link in the top right corner reads \"**← Back To Landing Pages**\".\n3.  **Page Metadata:** A text field labeled \"**Title**\" contains the input \"**SEI Landing Page**\".\n4.  **Content Editor (WYSIWYG):** A rich text editor component is present, featuring a multi-row toolbar and a large content preview area.\n    *   **Toolbar:** The toolbar includes standard formatting and editing controls (e.g., Source, bold, italics, alignment, font selection).\n    *   **Dropdown Menu:** A specific dropdown menu labeled \"**SEI Placeholders**\" (flag icon) is currently open, listing the option \"**Red flag indic...**\" (partially visible text). A mouse cursor icon suggests the user is selecting this option.\n    *   **Content Preview:** The content area displays a dark background template with an orange center section.\n        *   **Top (Dark):** Contains the text \"**KnowBe4.com**\".\n        *   **Center (Orange):** Contains large white text: \"**Oops! You clicked on a Phish...**\" and \"**Hover over the red flags to see what...**\" followed by the placeholder tag `[[template_sei]]`.\n        *   **Bottom (Dark - \"Please Note\" Section):** Contains boilerplate compliance or educational text regarding KnowBe4, Inc. and the purpose of the simulated phishing attack.\n5.  **Footer/Status Bar:** A faint status bar at the bottom of the editor indicates the current element path: \"**body div**\".\n6.  **Action Button:** A prominent blue button labeled \"**Save**\" is located at the bottom left of the screen.",
      "position": 10,
      "context": "anding pages, or create your own from scratch.\nLanding Page Editor"
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "engineering",
      "indicators",
      "sei",
      "social"
    ],
    "image_count": 10
  }
}