{
  "id": 12731036715411,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/12731036715411.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/12731036715411.html",
  "author_id": 31340001883283,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 3,
  "vote_sum": 6,
  "vote_count": 6,
  "section_id": 4406922364307,
  "created_at": "2023-01-04T16:55:51Z",
  "updated_at": "2025-10-24T19:49:17Z",
  "name": "KnowBe4 Console Account Settings: User Management",
  "title": "KnowBe4 Console Account Settings: User Management",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-10-24T19:49:17Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "answerbot",
    "answerbot_kmsat",
    "answerbot_ksat"
  ],
  "body": "<p>In this article, you'll learn about the <strong>User Management</strong> section of your KSAT <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/226457887.html'>Account Settings</a>. In the <strong>User Management</strong> section, you can update your user provisioning settings and your general user settings.</p>\n<p><a data-fancybox='single' data-src='https://support.knowbe4.com/hc/article_attachments/45797578792339'> <img src='https://support.knowbe4.com/hc/article_attachments/45797578792339' alt='' width='446' height='569'> </a></p>\n<h2 id='h_01HQKJ62SATAPA3S4WGHRC012T'>User Provisioning</h2>\n<p>In the <strong>User Provisioning</strong> section, you can edit your user provisioning settings. You have the ability to use Active Directory Integration (ADI), SCIM, or Google User Provisioning (GUP) to provision your users.</p>\n<p>See below for more information about the settings in this section:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_userprovisioning.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_userprovisioning.png' alt=' '></a></p>\n<ol>\n<li>\n<strong>Enable User Provisioning: </strong>Select this check box if you would like to use Active Directory (AD), SCIM, or Google User Provisioning (GUP) to manage your users. After you select this check box and save your <strong>Account Settings</strong>, you'll have access to a new <strong>Provisioning</strong> subtab. To access this subtab in your console, navigate to <strong>Users </strong>&gt; <strong>Provisioning</strong>.</li>\n<li>\n<strong>Test Mode:</strong> This check box is selected by default. We recommend that you keep this check box selected until you’re satisfied with the results of your sync. If you use test mode, you have the ability to view details about your sync and what actions would have occurred if test mode was disabled. To see these details, navigate to <strong>Users</strong> &gt; <strong>Provisioning</strong>.</li>\n<li>\n<strong>Active Directory Integration Settings:</strong> Select <strong>Active Directory Integration (ADI)</strong> to show this menu and see options for syncing with ADI.\n<ol type='a'>\n<li>\n<strong>Show Group Domain:</strong> If your users are split between multiple domain sources, you can select this check box to add the root domain to each of the AD-synced group names in the KSAT console. Adding the root domain allows you to better organize your users.</li>\n<li>\n<strong>ADI Sync Token:</strong> This is the unique account token you'll need during the ADI installation process. You can generate a new token by clicking the <strong>Regenerate ADI</strong> <strong>Token</strong> button.\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Please be aware that if you regenerate your ADI Sync token, you will not be able to sync your Active Directory until you update your Active Directory Sync Tool with the new sync token. We recommend that you only regenerate your ADI token to stop existing syncs from a tool that you don't know the location of. For more information about ADI, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/228373888.html'>Active Directory Integration (ADI) Configuration Guide</a>.</div>\n</div>\n</li>\n<li>\n<strong>Download Active Directory Sync Tool:</strong> <span class='fa-solid fa-download mod-ui'></span> Select this button to download and install the ADI sync tool.</li>\n</ol>\n</li>\n<li>\n<strong>SCIM:</strong> Select <strong>SCIM</strong> to show this menu and see options for syncing with SCIM.<br>\n<ol>\n<li>\n<strong>Tenant URL:</strong> In this section, you can enter your tenant URL to connect KSAT with your identity provider.</li>\n<li>\n<strong>Generate SCIM Token:</strong> Select this button to generate a new SCIM token. This token can only be viewed once, so you'll need to make sure to save the information before closing the window. If you regenerate a SCIM token, you'll need to be sure to update your identity provider with the most recent token. For more information, see our<a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360052380374.html'>SCIM Configuration Guide</a>.</li>\n</ol>\n</li>\n<li>\n<strong>Google User Provisioning Settings:</strong> Select <strong>Google</strong> to show this menu and see options for syncing with Google User Provisioning.\n<ol>\n<li>\n<strong>View Setup Process:</strong> Select this drop-down menu to see the steps for configuring your Google Workspace Admin console.</li>\n<li>\n<strong>Google Workspace Customer ID: </strong>You can enter your<strong> Google Workspace Customer ID </strong>here. You can find it by logging in at <a href='https://admin.google.com' target='_blank' rel='noopener noreferrer'>Google's Admin page</a> and then clicking <strong>Account</strong> &gt; <strong>Account Settings</strong>.</li>\n<li>\n<strong>Google Workspace Admin Email Address: </strong>In this field, you can enter your Google Workspace Admin Email Address. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/29586165576339.html'>Google User Provisioning (GUP) Guide</a>.</li>\n</ol>\n</li>\n</ol>\n<h2 id='h_01HQKJ62SB4Z4EWJF8ZY95S485'>User Provisioning Notifications</h2>\n<p>In the <strong>User Provisioning Notifications</strong> section, you can enable notifications to alert users if your organization doesn’t receive a user provisioning sync within a selected time frame. Notifications include an email alert and a banner at the top of the KSAT console.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Account+Settings/userprovisioningnotification_notificationemail.png'><img src='https://helpimg.s3.amazonaws.com/Account+Settings/userprovisioningnotification_notificationemail.png' alt=' '></a></p>\n<p>See below for more information about the settings in this section:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Account+Settings/accountsettings_userprovisioningnotifications.png'><img src='https://helpimg.s3.amazonaws.com/Account+Settings/accountsettings_userprovisioningnotifications.png' alt=' '></a></p>\n<ol>\n<li>\n<strong>Enable User Provisioning Notifications: </strong>Select this check box to enable user provisioning notifications.</li>\n<li>\n<strong>Time Frame: </strong>Select the amount of time that should pass before alerting users that a user provisioning sync has not been received. For example, if you would like to be notified if a sync hasn’t been received in 48 hours, select <strong>48 hours</strong>.</li>\n<li>\n<strong>Notification Recipients: </strong>Enter the email addresses of users you would like to receive notifications.</li>\n</ol>\n<h2 id='h_01HQKJ62SBA19258AW6VQ3EKNQ'>User Settings</h2>\n<p>In the <strong>User Settings</strong> section, you can edit user and admin permissions.</p>\n<p>See below for more information about the settings in this section:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_usersettings3.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_usersettings3.png' alt=' '></a></p>\n<ol>\n<li>\n<strong>Allow Users to Create Accounts:</strong> Select this check box to allow your users to create their own accounts. We recommend that you only enable this setting in special cases.</li>\n<li>\n<strong>Use Password-less Login:</strong> Select this check box to allow users to log in to the Learner Experience (LX) without entering a password. If you enable this setting, make sure to use training notifications that have the \"password-less\" tag. You can also create your own training notifications using our Password-less Link placeholders. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115009156087.html'>Enable and Use Password-Less Logins</a> article.\n<ol>\n<li>\n<strong>Disable Password-less Login for Admins:</strong> Select this check box to disable password-less logins for admins.</li>\n<li>\n<strong>Disable Automatic Email Generation for Password-less Login:</strong> Selecting this option will require users to select the <strong>Next</strong> button on the login page to receive a new password-less login link.</li>\n<li>\n<strong>Expire Password-less Link After:</strong> If you have enabled password-less logins, this setting defines how long the password-less link will remain active for your users. This duration must be between one and 999 days.</li>\n</ol>\n</li>\n<li>\n<strong>Require users to reset initial password set by admins:</strong> Select this check box to allow admins to set users' initial passwords and require users to change their passwords after their first login.</li>\n<li>\n<strong>Limit a user's console sessions to one IP address:</strong> Select this check box to allow admins to log in to separate instances of the console at the same time, as long as they log in from the same IP address. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500004792801.html'>Session Settings Guide</a>.</li>\n<li>\n<strong>Only allow console sessions from specific IP ranges:</strong> Select this check box to restrict admin and security role user sessions to the IP addresses entered below. You can either enter the IP addresses individually and separate them with commas, or you can enter a range of IP addresses. For example, you could enter an IP address range of 147.160.167.0/26. If you'd like to enter multiple IP ranges, you can separate each range with commas.</li>\n<li>\n<strong>Admin Session Timeout:</strong> Select the time period that you'd like admin account sessions to remain active. If the session is still inactive after this time period, admins will be logged out of their accounts. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500004792801.html'>Session Settings Guide</a>.</li>\n<li>\n<strong>User Session Timeout:</strong> Select the time period that you’d like LX sessions to remain active. If the session is still inactive after this time period, your users will be logged out of their accounts. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500004792801.html'>Session Settings Guide</a>.</li>\n<li>\n<strong>Minimum Password Length:</strong> Select the minimum length required for user passwords. You can choose between eight and 32 characters.</li>\n<li>\n<strong>Require MFA:</strong> Select whether Multi-factor authentication (MFA) is required for all users, just for admins, or is not necessary for either group. MFA must be set up the next time they log in. For further instructions regarding restoring a user’s access when this setting is enabled, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/225681448.html'>Unlocking a User’s Account</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/225681448.html'>Enable Two-Factor or Multi-Factor Authentication on Your Account</a> article.</li>\n<li>\n<strong>Remember Trusted Device:</strong> If enabled, users and admins only need to log in with MFA once per trusted device for the specified time period below.</li>\n<li>\n<strong>Remember Device for:</strong> Enter the number of days you want the system to remember MFA for your trusted device.</li>\n</ol>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/12731036715411-KnowBe4-Console-Account-Settings-User-Management",
  "images": [
    {
      "url": "https://support.knowbe4.com/hc/article_attachments/45797578792339",
      "alt": "This image displays an active user profile dropdown menu accessed from the top navigation bar of a web application.\n\n**Contextual Elements:**\n1.  **Top Banner:** A partially visible banner reads: \"Click here for Account Management console.\"\n2.  **Trigger Element:** The dropdown menu originates from a blurred input field (likely user identity) adjacent to a help icon and a chevron/up arrow.\n\n**Dropdown Menu (UI Elements and Text):**\nThe menu lists nine options (excluding two blurred identifier lines at the top):\n\n1.  Personal Settings (Icon: User silhouette)\n2.  **Account Settings** (Icon: Gear/Cog; Highlighted in solid blue, indicating selection focus)\n3.  Audit Log (Icon: Pen/Pencil)\n4.  My Training (Icon: Graduation cap)\n5.  Go To PhishER (Icon: Forward arrow/play symbol)\n6.  Hide Account Mgmt Banner (Icon: Crosshair/Target symbol)\n7.  Log Out (Icon: Exit/Logout arrow)\n8.  English (United States) (Icon: Globe/World)\n\n**Annotation:**\nA large, prominent orange/red arrow points directly at the highlighted \"Account Settings\" menu item, indicating the intended selection or instructional focus.",
      "position": 1,
      "context": "section, you can update your user provisioning settings and your general user settings."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_userprovisioning.png",
      "alt": "The image displays the configuration interface for **User Provisioning** and **User Sync Settings**.\n\n**Overall Status and Settings:**\nThe top section confirms that **Enable User Provisioning (User Syncing)** and **Test Mode** are active (checked).\n\n**User Sync Settings Configuration:**\nThe configuration panel is divided into three distinct integration methods:\n\n1.  **Active Directory Integration (ADI):**\n    *   Status: Marked as **Enabled** (green tag).\n    *   Settings include a checkbox for **Show Group Domain**.\n    *   A read-only field displays the **ADI Sync Token** (e.g., `DMFB EFF117...`). A button is available to **Regenerate ADI Token**.\n    *   A link and icon are provided for downloading the setup file: **ADI Tool (ADISyncSetup.exe)**.\n\n2.  **SCIM:**\n    *   Status: Marked as **Disabled** (red tag).\n    *   The **Tenant URL** is displayed in a read-only field (e.g., `https://demo.scim.knowbe4.com/v2`).\n    *   A button allows the generation of a token: **Generate SCIM Token**.\n    *   A resource link, **View Our SCIM Guide**, is provided.\n\n3.  **Google:**\n    *   Status: Marked as **Disabled** (red tag).\n    *   A collapsible section titled **View Setup Process** is available.\n    *   Two empty input fields are displayed for configuration: **Google Workspace Customer ID** and **Google Workspace Admin Email Address**.\n    *   Action buttons include **Cancel** (gray) and **Save Google Sync Settings** (green).\n    *   A resource link, **View Our Google Provisioning Guide**, is provided.",
      "position": 2,
      "context": "w for more information about the settings in this section:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Account+Settings/userprovisioningnotification_notificationemail.png",
      "alt": "This image displays a notification email from KnowBe4 concerning a user provisioning failure.\n\n**UI Context and Header Details:**\n*   **Subject Line:** `KnowBe4 User Provisioning for [Redacted Domain] - No syncs within the past 24 hours`\n*   **Sender:** `do-not-reply@knowbe4.com`\n*   **Recipient:** `to dyla[redacted]`\n*   **Timestamp:** Tue, Jan 24, 1:53 PM.\n*   **Status:** The email is labeled as \"Inbox.\"\n\n**Body Content and Technical Context:**\nThe email body immediately states the critical issue: \"Your KnowBe4 account for [redacted domain] has not successfully received a user provisioning sync within the past 24 hours.\"\n\n**Instructions and Call to Action:**\nThe notification provides explicit instructions for remediation and investigation:\n1.  Log in to the KnowBe4 account.\n2.  Navigate to the **Users -> Provisioning** page to review the last successful sync and configured provisioning method.\n3.  A hyperlink is provided for further documentation: \"How to Use the Provisioning Tab article.\"\n\n**Footer and Support:**\nThe email closes with \"The KnowBe4 Team.\" A disclaimer in a smaller font indicates the message is an automated user provisioning notification. A support contact is listed: `support@knowbe4.com`.",
      "position": 3,
      "context": "ail alert and a banner at the top of the KSAT console."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Account+Settings/accountsettings_userprovisioningnotifications.png",
      "alt": "This image displays a configuration panel titled **User Provisioning Notifications**. The interface is structured into three main editable sections:\n\n1.  **Notification Enablement:** A checkbox control labeled **Enable User Provisioning Notifications** is displayed and currently **checked (enabled)**. A help icon (question mark) follows the label.\n\n2.  **Time Frame Selection:** Labeled **Time Frame**, this section utilizes a dropdown menu (select field). The currently selected value is **48 hours**.\n\n3.  **Notification Recipients:** Labeled **Notification Recipients**, this section contains a free text input field. The field is populated with comma-separated sample email addresses: `example@gmail.com,example2@gmail.com`. Immediately beneath the input field is the instructional text: **Separate multiple email addresses with a comma.**",
      "position": 4,
      "context": "or more information about the settings in this section:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_usersettings3.png",
      "alt": "This UI configuration screen manages system-wide authentication and session parameters, grouped into three primary sections: User Settings, Security Settings, and Multi-Factor Authentication.\n\n**User Settings:**\n1.  **Account Management:** \"Allow Users to Create Accounts\" and \"Require users to reset initial password set by admins\" are unchecked.\n2.  **Password-less Login:** This feature is **checked** and active. Sub-options \"Disable Password-less Login for Admins\" and \"Disable Automatic Email Generation\" are unchecked. The password-less link expiry is set via a text field to **3 days**.\n\n**Security Settings:**\n3.  **IP Restrictions:** \"Limit a user's console sessions to one IP address\" is unchecked. \"Only allow console sessions from specific IP ranges\" is **checked**, exposing a multi-line text input field labeled \"Enter IP here...\" for defining allowed ranges.\n4.  **Timeouts:** Both \"Admin Session Timeout\" and \"User Session Timeout\" dropdowns are set to **8 hours**.\n5.  **Password Policy:** The \"Minimum Password Length\" dropdown is set to **8 characters**.\n\n**Multi-Factor Authentication:**\n6.  **MFA Requirement:** The \"Require MFA\" dropdown is set to **Not Required (Default)**.\n7.  **Trusted Device:** The \"Remember Trusted Device\" checkbox is **checked**. The corresponding duration input field specifies remembering the device for **1 day**.",
      "position": 5,
      "context": "elow for more information about the settings in this section:"
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "account",
      "console",
      "management",
      "settings"
    ],
    "image_count": 5
  }
}