{
  "id": 13169303385619,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/13169303385619.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/13169303385619.html",
  "author_id": 1534339111301,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": -1,
  "vote_count": 1,
  "section_id": 20416681683219,
  "created_at": "2023-01-18T21:04:26Z",
  "updated_at": "2025-10-21T19:42:59Z",
  "name": "PhishER Inbox Guide",
  "title": "PhishER Inbox Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-07-02T19:49:26Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "reseller",
    "Template",
    "PhishML",
    "localized"
  ],
  "body": "<p>The PhishER <strong>Inbox</strong> displays emails that your users report manually or by using the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/208969608.html'>Phish Alert Button (PAB)</a>. Once your users start reporting emails, you can view and manage them from your Inbox.</p>\n<p>See the sections below to learn how to use your Inbox.</p>\n<h2 id='h_01HSA0KAQM937DCN0Y4XS685VX'>Navigating the Inbox</h2>\n<p>If you would like to show or hide specific Inbox columns, select the gear icon at the top-right corner of the <strong>Inbox</strong> page. When you click this icon, the <strong>Inbox Table Settings</strong> pop-up window will open. You can show or hide columns by selecting or deselecting the check box to the left side of the column name.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/inboxSettings.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/inboxSettings.png' alt=' ' width='188' height='490'></a></p>\n<p>For more information about the <strong>Inbox</strong> page, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/inboxScreen.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/inboxScreen.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Category</strong>: This column displays the grouping of messages based on disposition. A message can be categorized or dispositioned in one of three ways: <strong>Clean</strong>, <strong>Spam</strong>, or <strong>Threat</strong>. Each message will be dispositioned as <strong>Unknown</strong> until a different disposition is determined.</li>\n<li>\n<strong>From</strong>: This column displays the sender name associated with the original message.</li>\n<li>\n<strong>From Email</strong>: This column displays the email address associated with the original message.</li>\n<li>\n<strong>Subject</strong>: This column displays the text found in the subject line of the original message.</li>\n<li>\n<strong>First Disposition Date</strong>: This column displays the timestamp of when the message was first dispositioned.</li>\n<li>\n<strong>Current Disposition Date</strong>: This column displays the timestamp of when the message's current disposition was applied.</li>\n<li>\n<strong>Reported At</strong>: This column displays the date and time of when the message was received by the Inbox.</li>\n<li>\n<strong>Reported By</strong>: This column displays the name of the user who reported the message.</li>\n<li>\n<strong>Reported By (Email)</strong>: This column displays the email address of the user who reported the message.</li>\n<li>\n<strong>Status</strong>: This column displays a message's analysis status. A message can have a status of <strong>Received</strong>, <strong>In Review</strong>, or <strong>Resolved</strong>.</li>\n<li>\n<strong>Tags</strong>: This column displays a label attached to a message based on the message's attributes. There is no limit to the number of tags a message can have. All tags are clickable. By clicking a tag, you can create a filtered view of the PhishER Inbox based on that tag. Tags can be automatically or manually assigned to a message. To learn about the ways tags can be assigned, see the list below:</li>\n<li>Users can suggest a tag for a message with the Phish Alert Button (PAB) disposition feature. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4410882366611.html'>Adding User Comments and Email Disposition to the Phish Alert Button</a> article.</li>\n<li>An admin can manually add a tag to a message from the <strong>Inbox</strong> or <strong>Message Details</strong> page of the PhishER Inbox. Admins can also add tags to multiple messages by selecting multiple messages in the Inbox.</li>\n<li>Tags are automatically assigned to a message when the message matches a rule containing that specific tag.</li>\n<li>\n<strong>Priority</strong>: This column indicates if a message needs urgent review due to potential malicious content. A message can have a <strong>Low</strong>, <strong>Medium</strong>, <strong>High</strong>, <strong>Critical</strong>, or <strong>Unknown</strong> priority. The priority of a message is determined initially by your organization's rules and actions. However, admins can change the priority at any time.</li>\n<li>\n<strong>PhishRIP</strong>: This column will be available if <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360045742834.html' target='_self'>PhishRIP is enabled</a> in your PhishER platform. You can click on the plus icon to initiate PhishRIP. If PhishRIP was already initiated on the message, a fishbone icon will display instead.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/PhishRIP/phishrip_method-inbox.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/PhishRIP/phishrip_method-inbox.png' alt=' '></a></p>\n</li>\n</ol>\n<h2 id='h_01HSBNJSFZD96SVN0QZNP4RYZX'>Downloading the Inbox CSV</h2>\n<p>You can download a CSV file of your PhishER Inbox by clicking the <strong>Download CSV</strong> button in the top-right corner of the <strong>Inbox</strong> page. This CSV file will include all visible and hidden columns in the Inbox.</p>\n<p>If the CSV file does not exceed the maximum number of items, it will automatically download directly through your browser. The maximum number of CSV file items for direct download is set to 5,000 by default. You can set the item limit in the <strong>Preferences</strong> subtab of your PhishER <strong>Settings</strong>. If the CSV file includes more than the maximum number of items, it will be generated first in your PhishER console before you can download it. You will receive an alert in your console when the file is fully generated and available to download. The file will also be displayed in the <strong>Downloads</strong> subtab of your PhishER <strong>Settings</strong>. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/16567660822163.html'>PhishER Settings: Account</a> article.</p>\n<p>For more information about these columns, see the table below:</p>\n<table>\n<thead>\n<tr>\n<th scope='col'>Column Name</th>\n<th scope='col'>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>id</td>\n<td>This column displays a unique string sequence used to identify the message.</td>\n</tr>\n<tr>\n<td>md5</td>\n<td>This column displays the hash value of the message using the MD5 algorithm.</td>\n</tr>\n<tr>\n<td>sha1</td>\n<td>This column displays the hash value of the message using the SHA1 algorithm.</td>\n</tr>\n<tr>\n<td>sha256</td>\n<td>This column displays the hash value of the message using the SHA256 algorithm.</td>\n</tr>\n<tr>\n<td>status</td>\n<td>This column displays the status of the message. A message can have a status of <strong>Received</strong>, <strong>In Review</strong>, or <strong>Resolved</strong>.</td>\n</tr>\n<tr>\n<td>attachments_count</td>\n<td>This column displays the number of attachments included in the message.</td>\n</tr>\n<tr>\n<td>category</td>\n<td>This column displays the category of a message. A message can be categorized or dispositioned in one of four ways: <strong>Clean</strong>, <strong>Spam</strong>, <strong>Threat</strong>, or <strong>Unknown</strong>. For more information, see the <a href='#h_01HSA0KAQM937DCN0Y4XS685VX'>Navigating the Inbox</a> section above.</td>\n</tr>\n<tr>\n<td>from</td>\n<td>This column displays the email address associated with the original message.</td>\n</tr>\n<tr>\n<td>from_name</td>\n<td>This column displays the sender name associated with the original message.</td>\n</tr>\n<tr>\n<td>reply_to</td>\n<td>This column displays the email address that will populate the <strong>to</strong> field of an email if a user replies to the message.</td>\n</tr>\n<tr>\n<td>reply_to_name</td>\n<td>This column displays the name or email address that will populate the <strong>to</strong> field of an email if a user replies to the message.</td>\n</tr>\n<tr>\n<td>reported_at</td>\n<td>This column displays the date and time of when the message was received by the PhishER Inbox. The date and time are in the Coordinated Universal Time (UTC) format.</td>\n</tr>\n<tr>\n<td>reported_by</td>\n<td>This column displays the email address of the user who reported the message.</td>\n</tr>\n<tr>\n<td>reported_by_name</td>\n<td>This column displays the name of the user who reported the message.</td>\n</tr>\n<tr>\n<td>priority</td>\n<td>This column displays the priority of a message. A message can have a <strong>Low</strong>, <strong>Medium</strong>, <strong>High</strong>, <strong>Critical</strong>, or <strong>Unknown</strong> priority. For more information, see the <a href='#h_01HSA0KAQM937DCN0Y4XS685VX'>Navigating the Inbox</a> section above.</td>\n</tr>\n<tr>\n<td>subject</td>\n<td>This column displays the text found in the subject line of the original message.</td>\n</tr>\n<tr>\n<td>tags</td>\n<td>This column displays all tags that are attached to the message.</td>\n</tr>\n<tr>\n<td>IngestionAddress</td>\n<td>This column displays the reporting email address used to forward the message to PhishER.</td>\n</tr>\n<tr>\n<td>Current disposition date</td>\n<td>This column displays the date and time of when the message was last dispositioned. The date and time are in the UTC format.</td>\n</tr>\n<tr>\n<td>First disposition date</td>\n<td>This column displays the date and time of when the message was first dispositioned. The date and time are in the UTC format.</td>\n</tr>\n</tbody>\n</table>\n<h2 id='h_01HSBNJSG0A31YGGKPDPM86D9G'>Filtering the Inbox</h2>\n<p>You have the ability to filter your Inbox messages. To learn about the filters you can select, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/FilterMessages.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/FilterMessages.png' alt=' '></a></p>\n<ul role='list'>\n<li>\n<strong>Filter by Category</strong>: This section allows you to filter messages based on disposition. For more information, see the options listed below:\n<ul role='list'>\n<li>\n<strong>Clean</strong>: Select this option to display all messages dispositioned as clean.</li>\n<li>\n<strong>Spam</strong>: Select this option to display all messages dispositioned as spam.</li>\n<li>\n<strong>Threat</strong>: Select this option to display all messages dispositioned as threat.</li>\n<li>\n<strong>Unknown</strong>: Select this option to display all messages that are not dispositioned as one of the three main dispositions.</li>\n</ul>\n</li>\n<li>\n<strong>Filter by Status</strong>: This section allows you to filter messages based on their analysis status in PhishER. For more information, see the options listed below:\n<ul role='list'>\n<li>\n<strong>Received</strong>: Select this option to display all messages that have not been reviewed in PhishER.</li>\n<li>\n<strong>In Review</strong>: Select this option to display all messages that are in review.</li>\n<li>\n<strong>Resolved</strong>: Select this option to display all messages that have been reviewed and resolved.</li>\n</ul>\n</li>\n<li>\n<strong>Filter by Priority</strong>: This section allows you to filter messages based on their assigned priority. For more information, see the options listed below:\n<ul role='list'>\n<li>\n<strong>Unknown</strong>: Select this option to display all messages that have not been prioritized.</li>\n<li>\n<strong>Low</strong>: Select this option to display all messages marked as low priority.</li>\n<li>\n<strong>Medium</strong>: Select this option to display all messages marked as medium priority.</li>\n<li>\n<strong>High</strong>: Select this option to display all messages marked as high priority.</li>\n<li>\n<strong>Critical</strong>: Select this option to display all messages marked as critical priority.</li>\n</ul>\n</li>\n</ul>\n<p>For more filter options, you can use the <strong>Search...</strong> box to filter your Inbox using Lucene queries. You can also save a customized filter by clicking the <strong>Save query as room</strong> button. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013027534.html'>How to Use Lucene Query Syntax</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013805414.html' target='_self'>How to Create and Manage PhishER Rooms</a> articles.</p>\n<h2 id='h_01HCNEBF8CJQ98GE9PGM7HGDZ0'>Running Actions on Selected Messages</h2>\n<p>To select a message, select the check box to the left of the message. When a message is selected, the <strong>Run</strong> drop-down menu will display in the top-left corner of the <strong>Inbox</strong> page. From this drop-down menu, you can select an action listed under <strong>Replay</strong>,<strong> PhishRIP, Email</strong>, or <strong>Actions</strong>.</p>\n<p>For more information about these options, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/RunMenu.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/RunMenu.png' alt=' ' width='284' height='397'></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Replay</strong>: This subsection allows you to rerun your rules and actions against selected messages. For more information about the available actions, see the list below:</li>\n<li>\n<strong>All Rules</strong>: This action allows you to run all of your custom rules against any selected messages. If manually selected, this will also run for emails that do not match the criteria of your tags.</li>\n<li>\n<strong>All Rules and All Actions</strong>: This action allows you to run all of your custom rules and actions against any selected messages. If your organization has enabled <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/16569063307411.html' target='_self'>VirusTotal</a> or <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360043312933.html' target='_self'>PhishML</a>, they will run against any selected messages as well.</li>\n<li>\n<strong>PhishRIP</strong>: If your organization has enabled PhishRIP, this subsection allows you to run PhishRIP actions against any selected messages. For more information about the available actions, see the list below:</li>\n<li>\n<strong>Find Similar Messages</strong>: This action will open the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360045742834.html'>Find Similar Messages</a> pop-up window, which allows you to select the match criteria of your <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP</a> query.</li>\n<li>\n<strong>Create KSAT Template</strong>: This action will send the selected email to your KSAT console to create a <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500005846941.html'>new phishing template</a> using a clean version of the email.</li>\n<li>\n<strong>Email</strong>: This subsection allows you to send an email. You can click <strong>Send Custom Email</strong> to open the template editor in a pop-up window. When your email is ready to be sent, click the <strong>Send</strong> button.</li>\n<li>\n<strong>Actions</strong>: This subsection allows you to run custom actions against any selected messages.\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>Alternatively, you can select a custom quick action from the <strong>QuickActions</strong> bar on the top-right side of the Inbox page to run against your selected messages. Both options may be helpful if a message was received before an action was created.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/quickActions_Inbox.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/quickActions_Inbox.png' alt=' ' width='566' height='68'></a></p>\n</li>\n</ol>\n<p>From the top of the Inbox page, you can also set a <strong>Category</strong>, <strong>Status</strong>, and <strong>Priority </strong>for the selected messages and add multiple tags.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/setMessage.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/setMessage.png' alt=' '></a></p>\n<p>If you would like to clear the selected messages, you can click the <strong>Clear Selection</strong> button.</p>\n<h2 id='h_01HSBNJSG08QSNX68WRPFFKP7Y'>Viewing Message Details</h2>\n<p>If you click an individual message in your PhishER Inbox, the <strong>Message Details</strong> page will open. For more information about the top of the <strong>Message Details</strong> page, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/messageDetails01.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/messageDetails01.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>From</strong>: This field displays the name or email address of the person who sent the original message.</li>\n<li>\n<strong>Reply-to</strong>: This field displays the name or email address that will populate the <strong>to</strong> field of an email if a user replies to the message.</li>\n<li>\n<strong>To</strong>: This field displays the name or email address of the original message recipient.</li>\n<li>\n<strong>CC</strong>: This field displays any of the email addresses copied on the original message.</li>\n<li>\n<strong>Reported</strong>: This field displays the date and time of when the message was reported by a user.</li>\n<li>\n<strong>Reported by</strong>: This field displays the name or email address of the user who reported the message.</li>\n</ol>\n<p>All email addresses in this section of the <strong>Message Details</strong> page are clickable. Clicking an email address will take you to a filtered view of your Inbox and display all of the messages tied to the specific email address.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>The timestamp in the top-right corner will display when the message was received by the reporter. A phish hook icon will display next to the date and time if the message was reported using the Phish Alert Button (PAB). A forwarding arrow icon will display next to the date and time if the message was not reported using the PAB.</div>\n</div>\n<p>The <strong>Message Details</strong> page contains subtabs with information about the message. For more information, click the tabs below:</p>\n<div class='js-tabs'>\n<div title='Preview'>\n<p>The <strong>Preview</strong> tab contains an overview of the message. The overview will include the content found in the body of the message. From this overview, you will also be able to see the number of attachments and URLs in the message.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/previewMD.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/previewMD.png' alt=' '></a></p>\n</div>\n<div title='Raw Message'>\n<p>The <strong>Raw Message</strong> tab contains the raw version of the message. The raw version is the entire message, including header and body.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_Raw.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_Raw.png' alt=' '></a></p>\n</div>\n<div title='Headers'>\n<p>The <strong>Headers</strong> tab provides a view of the message headers. You can use the drop-down menu in the top-right corner to view <strong>All Headers</strong>, <strong>Standard Headers</strong>, or <strong>Non-Standard Headers</strong>. You can also search through the message headers for specific information using the search bar.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_Headers.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_Headers.png' alt=' '></a></p>\n<p>By default, the following information will already be highlighted for a quick header scan:</p>\n<ul role='list'>\n<li>DomainKeys Identified Mail (DKIM)</li>\n<li>Domain-based Message Authentication, Reporting and Conformance (DMARC)</li>\n<li>Sender Policy Framework (SPF)</li>\n<li>IP address</li>\n</ul>\n</div>\n<div title='Attachments'>\n<p>The <strong>Attachments</strong> tab contains more information about the attachments sent with the message.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Attachments/EN/AttachmentsTab.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Attachments/EN/AttachmentsTab.png' alt=' '></a></p>\n<p>If available, the following information will be displayed:</p>\n<ul role='list'>\n<li>File Size</li>\n<li>File Type</li>\n<li>MD5</li>\n<li>SHA1</li>\n<li>SHA256</li>\n</ul>\n<p>You have the option to download the attachment by clicking the download icon to the right of the attachment name. If you would like to see all of the messages in your PhishER Inbox that have this attachment, click on the title of the attachment to be taken to a filtered view of your Inbox.</p>\n<p>You can filter your <strong>Attachments</strong> tab by clicking the <strong>All Attachments</strong> drop-down button. You can narrow your list to only viewing attachments that were labeled as <strong>Bad Attachments</strong>.</p>\n<p>You may also run a scan through VirusTotal by clicking the VirusTotal <strong>Scan</strong> button. If a scan was completed, the <strong>Click to View Report</strong> option will display.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>To scan with VirusTotal, your PhishER platform must be integrated with VirusTotal. For more information about integrating PhishER with VirusTotal, visit our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/14193888378131.html'>How to Integrate VirusTotal with Your PhishER Platform</a> article.</div>\n</div>\n<p>You may also detonate and analyze a file through CrowdStrike by clicking the CrowdStrike <strong>Detonate</strong> button. If a detonation was completed, the <strong>View Report</strong> option will display.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Attachments/EN/CrowdStrikeViewReportButton.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Attachments/EN/CrowdStrikeViewReportButton.png' alt=' '></a></p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>To detonate a file through CrowdStrike, you must have a PhishER Plus subscription and your PhishER platform must be integrated with the CrowdStrike Falcon Sandbox. For more information about integrating PhishER with CrowdStrike, visit our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/18853966211219.html'>How to Integrate CrowdStrike with Your PhishER Platform</a> article.</div>\n</div>\n</div>\n<div title='Domains and URLs'>\n<p>The <strong>Domains and URLs</strong> tab contains details about each domain and URL detected in the message. For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Domains_and_URLs/EN/DomainsAndURLsTab.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Domains_and_URLs/EN/DomainsAndURLsTab.png' alt=' ' width='664' height='473'></a></p>\n<ul role='list'>\n<li>\n<strong>Sender Info</strong>: This section displays information about the sender's domain associated with the original source of the message. For example, \"thisismyfull-link.com\".</li>\n<li>\n<strong>Links Info</strong>: This section displays information about links detected in the message, including the full URL, when the link was first detected, and when the link was most recently detected.</li>\n</ul>\n<p>If you would like to view all of the messages in your PhishER Inbox that contain a specific link, click the link to be taken to a filtered view of your Inbox. To copy the link, click the copy icon to the right of the URL. To create a PhishER Blocklist entry using the link, click the <strong>Create Blocklist Entry</strong> button next to the copy icon.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_CreateBlocklistEntry.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_CreateBlocklistEntry.png' alt=' '></a></p>\n<p>You can filter all of the redirector links found in the message from the <strong>All URLs</strong> drop-down menu. If a message does not have redirector links, the target URL will be used to filter your results. You can filter your URL view based on the following drop-down menu options: <strong>All URLs</strong>, <strong>Ignored URLs</strong>, <strong>Observed URLs</strong>, <strong>Scanned URLs,</strong> and <strong>Unscanned URLs</strong>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/URLFilter.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/URLFilter.png' alt=' ' width='250' height='651'></a></p>\n<p>You can run a scan through VirusTotal by clicking the VirusTotal <strong>Scan</strong> button. If a scan was completed, the <strong>Click to View Report</strong> option will display.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>To scan with VirusTotal, your PhishER platform must be integrated with VirusTotal. You must also have Full Message and Message Details access in order to use the <strong>Scan with VirusTotal</strong> button. For more information about integrating PhishER with VirusTotal, visit our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/14193888378131.html'>How to Integrate VirusTotal with Your PhishER Platform</a> article. For more information about Security Role access, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/16568413567635.html'>Roles</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/16568413567635.html'>PhishER Settings: Security Roles</a> article.</div>\n</div>\n<p>You can run a scan through CrowdStrike by clicking the CrowdStrike <strong>Detonate</strong> button. If a scan was completed, the <strong>Click to View Scan Results</strong> option will display.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>To scan with CrowdStrike, you must have a PhishER Plus subscription and your PhishER platform must be integrated with the CrowdStrike Falcon Sandbox. For more information about integrating PhishER with CrowdStrike, visit our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/18853966211219.html'>How to Integrate CrowdStrike with Your PhishER Platform</a> article.</div>\n</div>\n<p>You can run a scan through the Threat Intel integration with Webroot by clicking the Threat Intel <strong>Scan</strong> button. If a scan was completed, the <strong>Click to View Scan Results</strong> option will display. PhishER keeps the scan results for two hours. If you scan the URL again after two hours, PhishER resends it to Webroot and displays the new scan results.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>To scan with Threat Intel, you must have a PhishER Plus subscription and your PhishER platform must be integrated with Threat Intel. You must also have a Security Role set up with <strong>Full</strong> access to the PhishER Inbox and select the <strong>Inbox Message Details Access</strong> check box in order to use the <strong>Scan</strong> button. For more information about integrating PhishER with Threat Intel, visit our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/27765887530131.html'>Integrate Threat Intel with Your PhishER Platform</a> article.</div>\n</div>\n</div>\n<div title='Matched Rules'>\n<p>The <strong>Matched Rules</strong> tab contains a table of all of the rules that the message matched after the system runs. This tab provides insight into why a certain tag was assigned to the message. Each row displays the name and description of the rule, when it was matched to messages, the number of matched messages, and the tags associated with the rule.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_MatchedRules.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_MatchedRules.png' alt=' '></a></p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>The <strong>Matched Count</strong> column refers to the number of times the rule has matched a message in your Inbox.</div>\n</div>\n</div>\n<div title='History'>\n<p>The <strong>History</strong> tab contains all of the user, action, and rule events associated with the message. For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_History.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_History.png' alt=' '></a></p>\n<ul role='list'>\n<li>\n<strong>User Event</strong>: A user event is a user-initiated action that was manually applied to a message and caused the message to change. For example, a user event could be \"<strong>Field changed</strong> by User <strong>User_Name</strong> on <strong>Mon DD, YYYY at H:MM</strong>\", or \"VirusTotal scan initiated for <strong>Link URL or Attachment Name</strong>\".</li>\n<li>\n<strong>Action Event</strong>: An action event occurs when a triggered action causes a message to change. For example, an action event could be \"<strong>Email sent</strong> by Action <strong>Action_Name</strong> on <strong>Mon DD, YYYY at H:MM</strong>\".</li>\n<li>\n<strong>Rule Event</strong>: A rule event occurs when a matched rule causes a message to change. For example, a rule event could be \"<strong>Tag changed by</strong> Rule <strong>Rule_Name </strong>on<strong> Mon DD, YYYY at H:MM</strong>\".</li>\n</ul>\n</div>\n</div>\n<h2 id='h_01HSBNJSG00XWX0JP4N1RJ9GQA'>Viewing the Actions and Discussion</h2>\n<p>On the right side of the <strong>Message Details</strong> page, you can view the <strong>Actions and Discussion</strong> sidebar. From this sidebar, you can open the <strong>Actions</strong> and <strong>Discussion</strong> subtabs.</p>\n<p>For information about these subtabs, see the subsections below:</p>\n<h4 id='h_01HCNEBF8D79AHB3ZDGGZRFRHP'>Actions</h4>\n<p>From the <strong>Actions</strong> subtab, you can update the message's dispositioning and tags, download the original reported email, and run actions against the message. If PhishRIP is enabled, you can create and view PhishRIP queries, and you can view your PhishML confidence results. For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/PhishRIP/actionsSidebar_MessageDetails.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/PhishRIP/actionsSidebar_MessageDetails.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Category, Status, Priority</strong>: Use these options to change the message's dispositioning. For more information, see the <a href='#h_01HSBNJSG0A31YGGKPDPM86D9G'>Filtering the Inbox</a> section above.</li>\n<li>\n<strong>QuickActions</strong>: Click one of your custom <strong>QuickActions</strong> to run an action against the message.</li>\n<li>\n<strong>PhishRIP</strong>: This section displays how many PhishRIP queries were initiated and the date of the last query. Click <strong>Create New Query</strong> to initiate a <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP</a> query. Click <strong>View Query</strong> to see the past PhishRIP queries that were created for this message.</li>\n<li>\n<strong>Download Original Email</strong>: Click this button to download a copy of the original email as an .eml file.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>If an email was manually forwarded to your PhishER Inbox instead of being reported via the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/208969608.html'>Phish Alert Button (PAB)</a>, the downloaded message will not include email headers.</div>\n</div>\n</li>\n<li>\n<strong>Run</strong>: You can click this button then select one of the following options from the drop-down menu. For more information, see the <a href='#h_01HCNEBF8CJQ98GE9PGM7HGDZ0'>Running Actions on Selected Messages</a> section above.\n<ul role='list'>\n<li>\n<strong>Actions</strong>: Run a single action against the message.</li>\n<li>\n<strong>Email</strong>: Send a custom email.</li>\n<li>\n<strong>PhishRIP</strong>: Create a KSAT template.</li>\n<li>\n<strong>Replay</strong> Run all rules or all rules and actions against the message.</li>\n</ul>\n</li>\n<li>\n<strong>Assigned Tags</strong>: Add or remove a message's Assigned Tags.</li>\n<li>\n<strong>PhishML Confidence</strong>: Review your <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360043312933.html' target='_self'>PhishML</a> confidence results. If you have a PhishER Plus subscription, click <strong>Generate Explanation</strong> to view your <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/35149214884627.html'>PhishML Insights</a> explanation.</li>\n<li>\n<strong>Delete Message</strong>: Click this button to delete the message.</li>\n</ol>\n<h4 id='h_01HCNEBF8DHBH7TG1JKXSM1MZA'>Discussion</h4>\n<p>From the <strong>Discussion</strong> subtab, you can communicate with other admins about a message. Similar to a chat window, this method of communication may be useful for organizations with multiple admins managing the PhishER Inbox.</p>\n<p>Users can communicate with admins about specific messages when they use the PAB. When users leave a comment while using the PAB, the comment will appear in the <strong>Discussion</strong> subtab. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4410882366611.html'>Phish Alert Button (PAB) User Comments and Email Disposition Guide</a>.</p>\n<p>Admins can communicate with users who report emails using the PAB. From the <strong>Message Details</strong> page of your PhishER <strong>Inbox</strong>, you can send emails to users who report messages with the PAB. The <strong>Discussion</strong> subtab displays the full conversation and allows you to send an external message from the PhishER console when the user responds. User responses will generate an <strong>Event</strong> under <strong>Alerts</strong>, which you can click to navigate directly to their comment. For more information, see the <strong>Viewing Alerts for Downloads and Comments</strong> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/16567660822163.html'>PhishER Settings: Account</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/PhishRIP/discussionSidebar_MessageDetails.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/PhishRIP/discussionSidebar_MessageDetails.png' alt=''></a></p>\n<ol type='a'>\n<li>You can click in the <strong>Comment here</strong> text box and type a message to save internally or send as an email to your user.</li>\n<li>Click the <strong>Save Internal Note</strong> button to make your comment visible to all admins with PhishER access.</li>\n<li>Click the <strong>Send Email</strong> button to send a response to your user from the PhishER console.</li>\n</ol>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/13169303385619-PhishER-Inbox-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/inboxSettings.png",
      "alt": "This image displays the configuration panel titled **\"Inbox Table Settings\"**. The panel contains one primary section labeled **\"Show/Hide Columns,\"** which allows the user to control the visibility of data fields within the associated table view via a vertical list of checkbox controls.\n\n**UI Elements and Current State:**\n\nThe panel lists twelve potential columns, with the following eight currently selected (checked, typically indicating visibility) and four unselected (unchecked, typically indicating hidden):\n\n**Selected Columns (Visible):**\n*   Category\n*   Subject\n*   Reported At\n*   Reported By Name\n*   Status\n*   Tags\n*   Priority\n*   PhishRIP\n\n**Unselected Columns (Hidden):**\n*   From Email\n*   Reported By Email\n*   First Disposition Date\n*   Current Disposition Date\n\n**Action Control:**\n\nAt the bottom of the interface, a single rectangular button is present, labeled **\"Close,\"** which serves to dismiss the configuration panel.",
      "position": 1,
      "context": "g or deselecting the check box to the left side of the column name."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/inboxScreen.png",
      "alt": "This image displays the user interface for an \"Inbox\" view, likely within a security or email management platform, utilizing a searchable data table format.\n\n**Header and Global Actions:**\nThe title of the page is \"Inbox.\" Global actions in the top-right corner include two buttons: \"Download CSV\" (with a download icon) and \"Refresh\" (with a circular arrow icon).\n\n**Search and Filtering Controls:**\nBelow the main title is a panel containing search, pagination, and filtering controls:\n1.  **Search Input:** A large input field is available on the left, displaying placeholder text \"Search...\".\n2.  **Pagination:** Display text indicates the current view range: \"1-200 of [total number].\"\n3.  **Saved Query Action:** A prominent, salmon-colored button is labeled \"Save query as room.\"\n4.  **Filters:** Horizontal button groups are organized by category:\n    *   *Filter by Category:* Unknown, Clean, Spam, Threat.\n    *   *Filter by Status:* Received, In Review, Resolved.\n    *   *Filter by Priority:* Includes input fields and controls indicated by a question mark icon, directional chevrons (up/down), and a settings gear icon.\n\n**Data Table Structure:**\nThe interface presents tabular data with thirteen columns, allowing for individual row selection via a checkbox:\n\n| Column Header | UI Note / Context |\n| :--- | :--- |\n| Checkbox | Row selection mechanism. |\n| Category | Email classification (e.g., Clean, Threat). |\n| From | Sender name. |\n| From (Email) | Sender email address. |\n| Subject | Email subject line. |\n| First Disposition Date | Date/time of initial action or classification. |\n| Current Disposition Date | Date/time of last modification or reclassification. |\n| Reported At | Date/time the item was reported. |\n| Reported By | Name of the user who reported the item. |\n| Reported By (Email) | Email address of the reporting user. |\n| Status | Current workflow state. The column is actively sorted ascendingly (indicated by an upward arrow). |\n| Tags | Custom labels applied to the item. |\n| Priority | Priority rating or status. |\n| PhishRIP | Action column, indicated by a plus (+) icon in each row. |\n\n**Data Examples (Rows 1-4):**\nAll visible rows have the status \"In Review.\"\n*   **Row 1:** Category is a green \"Clean\" tag. A paperclip icon (indicating an attachment) appears under the *First Disposition Date* column. Tags include a gray \"NEWP\" pill.\n*   **Rows 2-4:** Categories are red \"Threat\" tags. Tags vary, including \"TEST,\" \"NEWZZYS,\" \"ALL,\" and a purple tag labeled \"PML:SPAM\" in Row 4.\n*   The *Priority* column for all rows displays a gray question mark icon.",
      "position": 2,
      "context": "t the Inbox page, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/PhishRIP/phishrip_method-inbox.png",
      "alt": "This screen displays the primary Inbox interface for managing reported threats, organized into a data grid view.\n\n**1. Layout and Navigation:**\n*   **Primary Navigation (Left Sidebar):** A dark vertical sidebar features the 'ER' logo and main modules: Dashboard, Rooms, Inbox (currently active), Rules, and Actions.\n*   **Header Actions:** The top right corner includes two action buttons: \"Download CSV\" (with a download icon) and \"Refresh\" (with a circular arrow icon).\n\n**2. Filtering and Search Controls:**\n*   **Search Input:** A horizontal search field utilizes \"Search...\" as placeholder text.\n*   **Saved Query Action:** An orange button is present labeled \"Save query as room.\"\n*   **Filter Groups:** The system offers controls to filter the results:\n    *   **Filter by Category:** Includes buttons for \"Unknown,\" \"Clean,\" \"Spam,\" and \"Threat.\"\n    *   **Filter by Status:** Includes buttons for \"Received,\" \"In Review,\" and \"Resolved.\"\n    *   **Filter by Priority:** A control group featuring six priority levels (indicated by various arrow icons) and a settings gear icon.\n\n**3. Data Grid (Inbox Content):**\n*   **Item Count:** The count indicator displays \"1-50 of 51.\"\n*   **Columns:** The data grid includes the following sortable columns (header text):\n    *   Checkbox (for bulk selection)\n    *   Category\n    *   From\n    *   Subject\n    *   Reported At (currently sorted descending, indicated by a down arrow)\n    *   Reported By\n    *   Reported By (Email)\n    *   PhishRIP\n\n**4. Data Examples (Row 1):**\n*   **Category:** Displays a purple badge with the label \"Spam.\"\n*   **From:** \"Internal IT Team.\"\n*   **Subject:** \"New Email System test -- Please Read.\"\n*   **Reported At:** \"Apr 5, 2020, 6:05 PM.\"\n*   **PhishRIP:** An actionable plus sign (+) icon is visible in this column.",
      "position": 3,
      "context": "eady initiated on the message, a fishbone icon will display instead."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/FilterMessages.png",
      "alt": "This image displays a horizontal control strip used for searching and filtering data.\n\n**UI Elements and Text (Left to Right):**\n\n1.  **Search Input Field:** A standard text input box with the placeholder text and icon: \"Search...\".\n2.  **Action Button:** A salmon-colored button labeled \"Save query as room,\" used to persist the current search and filter settings.\n3.  **Filter Group 1 (Category):** Labeled \"Filter by Category,\" containing a segmented control group with four options: \"Unknown,\" \"Clean,\" \"Spam,\" and \"Threat.\"\n4.  **Filter Group 2 (Status):** Labeled \"Filter by Status,\" containing a segmented control group with three options: \"Received,\" \"In Review,\" and \"Resolved.\"\n5.  **Filter Group 3 (Priority):** Labeled \"Filter by Priority,\" containing a segmented control group consisting of five buttons representing priority levels, from unassigned/unknown ('?') to high priority (double up arrow icon).\n6.  **Settings Icon:** A standalone button displaying a gear/cog icon, typically used to access configuration options.",
      "position": 4,
      "context": "out the filters you can select, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/RunMenu.png",
      "alt": "This image depicts an active dropdown menu, initiated by the orange-bordered \"Run\" button, listing execution options within a UI.\n\n**Header/Context:**\nThe upper section shows the \"Run\" button (with a chevron dropdown icon) and, to its right, a text field labeled \"Add new tag\" preceded by a plus sign icon.\n\n**Menu Structure (Categories and Options):**\nThe menu is organized into distinct categories, separated by thin horizontal rules. Each major element is accompanied by an orange circular annotation (a-h).\n\n1.  **Replay** (Category, 'a'):\n    *   All Rules ('b')\n    *   All Rules and All Actions ('c')\n\n2.  **PhishRIP** (Category, 'd'):\n    *   Find Similar Messages ('e')\n    *   Create KSAT Template ('f')\n\n3.  **Email** (Category, 'g'):\n    *   Send Custom Email\n\n4.  **Actions** (Category, 'h'):\n    *   (Sub-options under this category are cropped out)",
      "position": 5,
      "context": "rmation about these options, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/quickActions_Inbox.png",
      "alt": "This image displays a segment of a user interface categorized under the heading **\"Quick Actions\"** (rendered in grey text).\n\nThe core component is a horizontal, segmented action bar or selection group containing five distinct, selectable labels separated by thin vertical grey dividers, enclosed within a rectangular white container with subtle borders.\n\nThe labels, from left to right, are:\n1. **Internal Mail**\n2. **Outside Threat**\n3. **Spam**\n4. **Invoice**\n5. **CEO Fraud**\n\nContextually, this component functions as a classification or rapid tagging tool, likely for processing security incidents or classifying received messages (e.g., emails).",
      "position": 6,
      "context": "a message was received before an action was created."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/setMessage.png",
      "alt": "The image displays three segmented UI controls used for setting properties in a bulk action or configuration interface.\n\n1.  **Set Category:** A segmented control containing four mutually exclusive text options:\n    *   `Unknown`\n    *   `Clean`\n    *   `Spam`\n    *   `Threat`\n\n2.  **Set Status:** A segmented control containing three mutually exclusive text options:\n    *   `Received`\n    *   `In Review`\n    *   `Resolved`\n\n3.  **Set Priority:** A segmented control representing a five-level priority scale using symbols:\n    *   `?` (Indicates Unknown or Unset priority)\n    *   Double Down Chevron (`< <`) (Lowest priority)\n    *   Single Down Chevron (`<`) (Low priority)\n    *   Single Up Chevron (`>`) (High priority)\n    *   Double Up Chevron (`> >`) (Highest priority)\n\nAll controls are presented in their default, unselected state (white background, dark gray text).",
      "position": 7,
      "context": "ong>Priority for the selected messages and add multiple tags."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/messageDetails01.png",
      "alt": "This image displays the header section of an email message within a technical interface titled \"Message Details.\" The content details the source, recipient, delivery, and reporting status of a promotional email.\n\n**Message Subject and Delivery:**\nThe subject line is prominently displayed as **\"Hours Left To Shop Our Green Monday Sale! ⏰\"** (including an alarm clock emoji).\nThe original delivery time (indicated by a clock icon) is **Dec 11, 2018 at 6:10 PM**, accompanied by a hook icon, suggesting it was flagged upon arrival.\n\n**Sender and Recipient Details:**\n*   **(a) from:** The displayed sender name is \"Reebok\" with the associated email address `<reebok@reebokus-news.reebok.com>`.\n*   **(b) reply to:** The designated reply address is \"US Reebok CustomerService\" with the email address `<newsletter@onlineshop.reebok.com>`.\n*   **(c) to:** The recipient address is present but redacted (blurred).\n*   **(d) cc:** This field is empty.\n\n**Reporting Status:**\n*   **(e) Reported Status:** The message is marked as **\"Reported\"**. The date and time of the report are **Dec 12, 2018 at 8:17 AM**.\n*   **(f) Reported by:** The identity of the user who reported the message is present but redacted.",
      "position": 8,
      "context": "essage Details page, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/previewMD.png",
      "alt": "The image displays a horizontal tabbed navigation interface, typical for reviewing an entity's metadata or contents (e.g., an email or log entry).\n\n**UI Elements and States:**\n\n*   **Active Tab:** The tab labeled **PREVIEW** is highlighted in orange, indicating the currently selected view.\n*   **Inactive Tabs (L to R):** The remaining tabs are displayed in a neutral gray color, indicating inactive states: **RAW MESSAGE**, **HEADERS**, **ATTACHMENTS**, **DOMAINS & URLS**, **MATCHED RULES**, and **HISTORY**.\n*   **Count Badges:** Two tabs feature red or orange circular count badges:\n    *   **ATTACHMENTS** displays a count of **1**.\n    *   **DOMAINS & URLS** displays a count of **12**.\n*   **Context:** The navigation bar is situated above an empty, white content area, separated by a thin horizontal divider line, suggesting the area below is reserved for displaying the content associated with the active \"PREVIEW\" tab.",
      "position": 9,
      "context": "also be able to see the number of attachments and URLs in the message."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_Raw.png",
      "alt": "This image displays a segment of a web application interface used for analyzing email content.\n\n**UI Structure and Navigation:**\n\n*   A horizontal tab navigation bar is visible at the top, listing seven options: \"PREVIEW,\" \"RAW MESSAGE,\" \"HEADERS,\" \"ATTACHMENTS,\" \"DOMAINS & URLS,\" \"MATCHED RULES,\" and \"HISTORY.\"\n*   The **\"RAW MESSAGE\"** tab is currently active, indicated by its prominent orange text color and background contrast (white background/orange text compared to grey text for inactive tabs).\n*   The **\"DOMAINS & URLS\"** tab features a circular orange badge containing the number \"2,\" indicating two domains or URLs were found.\n\n**Content Display Area:**\n\n*   Below the navigation, a dark grey text box displays the raw email data, formatted in a monospace font (likely courier) typical for source code or technical logs.\n*   The visible content begins with standard email header fields:\n    *   `Return-Path: <stephaniet@knowbe4.com>`\n    *   `Received: from mail-pg1-f176.google.com (mail-pg1-f176.google.com [209.85.215.176])`\n    *   The receipt path continues: `by inbound-smtp.us-east-1.amazonaws.com with SMTP id 4s97ngs375q5128eegv96luei hqsla85199c1vg1 for a35644ed-d626-43a8-9a82-5513f4beeb82@phisher.knowbe4.com;`\n    *   The message receipt timestamp is: `Tue, 18 Oct 2022 18:42:04 +0000 (UTC)`\n\n**Context:**\n\nThe interface is clearly designed for forensic analysis of email messages, providing categorized views of the message components (Raw Message, Headers, Attachments, etc.). The active tab displays the raw data stream, including key SMTP relay information, sender/recipient addresses, and timestamps.",
      "position": 10,
      "context": "raw version is the entire message, including header and body."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_Headers.png",
      "alt": "This image displays the **HEADERS** view within a tabbed user interface (UI) used for analyzing message metadata, likely within an email security or tracking platform.\n\n**UI Navigation and Controls:**\n\n*   A top navigation bar presents message analysis tabs: `PREVIEW`, `RAW MESSAGE`, `HEADERS` (currently selected/highlighted), `ATTACHMENTS`, `DOMAINS & URLS` (indicated with a numeric badge '2'), `MATCHED RULES`, and `HISTORY`.\n*   A search bar labeled `Search headers...` is present below the navigation for filtering the displayed data.\n*   An interactive button labeled `All Headers` is located on the right, indicating options for viewing header depth.\n\n**Data Display (Key Headers Shown):**\n\nThe main content area lists email headers as key-value pairs.\n\n1.  **Return-Path:** Displays the envelope sender address (partially obfuscated).\n2.  **Received:** Documents the message transfer path. The value confirms the email originated from `mail-pg1-f176.google.com` with the IP address **`209.85.215.176`** (highlighted) and was received by an Amazon Web Services (AWS) inbound SMTP server on Tuesday, 18 Oct 2022.\n3.  **Received-Spf:** Shows the result of the Sender Policy Framework check.\n    *   **Result:** `pass`\n    *   **Validation Details:** The SPF validation confirms that the originating IP **`209.85.215.176`** is designated as a permitted sender for the domain `knowbe4.com`. The IP address is highlighted, confirming its role in the SPF check.",
      "position": 11,
      "context": "age headers for specific information using the search bar."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Attachments/EN/AttachmentsTab.png",
      "alt": "This image displays the **ATTACHMENTS** view within a security analysis or message processing interface.\n\n**Header and Navigation:**\nThe top navigation bar features several tabs, with **ATTACHMENTS (1)** and **DOMAINS & URLS (1)** highlighted with a red counter indicating one item in each category. The active tab is ATTACHMENTS. A contextual action button, **All Attachments** (dropdown), is visible in the upper right.\n\n**Attachment Details Card:**\nA distinct card provides details for a single file, **TextSave.cs**.\n\n*   **File Metadata:**\n    *   Filename: `TextSave.cs`\n    *   Action Icons: Download icon and Block/Deny icon.\n    *   File Size: `387` (Units not specified).\n    *   File Type: `application/rtf`. The potential MIME type mismatch `(application/octet-stream)` is noted in red text, accompanied by an information icon.\n    *   Hash Digests: Fields for `MD5`, `SHA1`, and `SHA256` are listed with associated (partially blurred) hash values.\n\n*   **External Security Scanning Status:**\n    *   **VirusTotal:** Status is `Click to View Report` (Green text) with a green checkmark icon, indicating a completed scan. An action button labeled **Scan** is present.\n    *   **CrowdStrike (Detonation/Sandbox):** Status is `Auto Scan Has Not Run` (Grayed text). An action button labeled **Detonate** is present to initiate manual execution analysis.",
      "position": 12,
      "context": "re information about the attachments sent with the message."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Attachments/EN/CrowdStrikeViewReportButton.png",
      "alt": "A UI notification element is displayed on a light background.\n\n**Text Content:**\n1.  **Main Heading/Context:** \"CrowdStrike: Auto Scan Found No Results\"\n    *   The preceding element \"CrowdStrike:\" is bold and dark gray.\n    *   The succeeding message \"Auto Scan Found No Results\" is regular weight, italicized, and light gray, indicating a successful negative result (no threats found).\n\n**UI Element:**\n1.  **Button:** A rectangular, rounded-corner button with a solid orange background.\n    *   **Label:** \"View Report\" in white text.\n    *   This button provides a call to action to access detailed scan information.",
      "position": 13,
      "context": "rong>View Report option will display."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/Inbox/MessageDetails/Domains_and_URLs/EN/DomainsAndURLsTab.png",
      "alt": "This technical description documents a segment of a security analysis dashboard focused on email message components.\n\n**I. Interface Context and Navigation**\n\nThe interface utilizes a horizontal tab navigation system. The current view is active on the **DOMAINS & URLS** tab, which displays a notification badge of **1**. Adjacent tabs include **ATTACHMENTS (2)**, PREVIEW, RAW MESSAGE, HEADERS, MATCHED RULES, and HISTORY.\n\n**II. SENDER INFO**\n\nA section titled **SENDER INFO** contains one entry:\n*   **Domain:** [Blurred domain data].\n\n**III. LINKS INFO (URL Table)**\n\nThe primary data view, labeled **LINKS INFO**, presents a table of associated URLs. A filter button in the upper right, labeled **All URLS** (with a dropdown), controls the scope of the list.\n\nThe table columns are:\n1.  **Full Link:** Displays a single, blurred URL entry, accompanied by a link icon, a copy icon, and a prohibition icon. Subordinate text identifies the link as a **(redirector link)**.\n2.  **First Seen:** Shows the initial detection timestamp: **May 23, 2024 at 10:06 PM**.\n3.  **Last Seen:** Shows the most recent detection timestamp: **Jun 3, 2024 at 10:04 PM**.\n\n**IV. Security Analysis Integration Status**\n\nBelow the URL entry, three external security integration status panes are displayed, providing current scanning status and manual execution options:\n\n1.  **VirusTotal:**\n    *   Status: **Report Pending** (clickable blue text).\n    *   Action Button: **Scan** (light orange outlined button).\n\n2.  **CrowdStrike:**\n    *   Status: *Auto Scan Has Not Run* (gray italic text).\n    *   Action Button: **Detonate** (light orange outlined button).\n\n3.  **Threat Intel:**\n    *   Status: **Click to View Scan Results** (red clickable text) accompanied by a red alert icon.\n    *   Action Button: **Scan** (light orange outlined button).",
      "position": 14,
      "context": "ore information, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_CreateBlocklistEntry.png",
      "alt": "This image depicts a segment of a user interface, likely related to data display or link management.\n\n**UI Structure and Text:**\n1.  The primary heading is displayed at the top left: **\"Full Link.\"**\n2.  Below the heading, a data display row is visible.\n3.  The row contains a URL, indicated by a leading **chain link icon**. The URL text itself is intentionally obscured/blurred (visible structure suggests \"http://professorphisher.com\").\n\n**UI Elements and Controls:**\nThe right side of the data row features two functional icons:\n1.  A **Copy icon** (represented by two overlapping document shapes).\n2.  A **Prohibition symbol** (a circle with a diagonal slash), rendered in orange, typically signifying removal, deletion, or blocking functionality.\n\n**Annotation:**\nA large, prominent, thick **orange arrow** is superimposed onto the image, pointing specifically toward the orange Prohibition symbol on the far right of the data row.",
      "position": 15,
      "context": "Entry button next to the copy icon."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/URLFilter.png",
      "alt": "The image displays an active UI filter dropdown menu overlaying a data view. The control button triggering the menu is labeled \"All URLs\" and features an orange border and a downward chevron icon, indicating a filter selection state. The open dropdown menu presents six filtering options, with the top option highlighted in solid orange to signify the current selection:\n\n1.  **All URLs** (Currently Selected)\n2.  **VT\\_BAD URLs**\n3.  **Ignored URLs**\n4.  **Observed URLs**\n5.  **Scanned URLs**\n6.  **Unscanned URLs**",
      "position": 16,
      "context": "g>, Scanned URLs, and Unscanned URLs."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_MatchedRules.png",
      "alt": "This interface segment displays the **MATCHED RULES** view, highlighted via an orange/brown active tab indicator.\n\n**1. Navigation Menu (Horizontal Tabs):**\nThe top section features a navigation bar listing data categories. The active tab is **MATCHED RULES**. Other visible tabs include PREVIEW, RAW MESSAGE, HEADERS, ATTACHMENTS, DOMAINS & URLS (with a numerical badge indicating '10' items), and HISTORY (inactive).\n\n**2. Data Table Structure:**\nThe main content area is a table detailing the rules that have been matched. The column headers are:\n*   Name\n*   Description\n*   Matched On\n*   Matched Count\n*   Tags\n\n**3. Matched Rule Entry (Single Row):**\nA single row of data is visible:\n*   **Name:** Find \"Test\"\n*   **Description:** looking for \"test\"\n*   **Matched On:** Jan 25, 2021 / 2:24 PM\n*   **Matched Count:** 2403\n*   **Tags:** A gray, pill-shaped UI element containing the uppercase text \"TEST\".",
      "position": 17,
      "context": "ched messages, and the tags associated with the rule."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/MessageDetails_History.png",
      "alt": "This image displays the **HISTORY** section of a data object detail view within a web application interface.\n\n**UI Elements and Navigation:**\nThe top section features a set of navigational tabs: `PREVIEW`, `RAW MESSAGE`, `HEADERS`, `ATTACHMENTS`, `DOMAINS & URLS`, `MATCHED RULES`, and `HISTORY`. The **HISTORY** tab is active/selected. The **DOMAINS & URLS** tab displays an orange circular badge with the count `29`.\n\n**Content (History Log):**\nThe primary content is a reverse chronological list detailing events and modifications to the object. Each entry is separated by a horizontal line and preceded by a small orange chevron. The format typically includes the action, the responsible entity (Rule, User, or Action), and a full timestamp.\n\nVisible log entries (from latest to earliest):\n\n1.  **Tag changed** by Rule **Find \"Test\"** on **Oct 1, 2021 at 2:10 PM**\n2.  **Marked as read** by User **QA Test** on **May 23, 2019 at 9:26 AM**\n3.  **Field changed** by Action **Random** on **May 20, 2019 at 3:59 PM**\n4.  **Rules pipeline completed, Tag changed** by Rule **Every Rule** on **May 20, 2019 at 3:59 PM**\n5.  **Phish ML Completed** on **May 20, 2019 at 3:58 PM**\n6.  **Created** on **May 20, 2019 at 3:58 PM**",
      "position": 18,
      "context": "For more information, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/PhishRIP/actionsSidebar_MessageDetails.png",
      "alt": "This image displays the 'Actions' tab of a technical incident response UI, likely focused on email security analysis. The interface is organized vertically into several functional modules for classification, remediation, and data analysis.\n\n**Top Navigation:**\nThe navigation bar indicates the active context is **Actions**, alongside the available tab **Discussion**.\n\n**1. Classification Module (a):**\nThis section allows manual override and setting of core message attributes:\n*   **Category:** A selector grouping of 'Unknown', 'Clean', 'Spam' (currently selected/highlighted), and 'Threat'.\n*   **Status:** A selector grouping of 'Received', 'In Review', and 'Resolved' (currently selected/highlighted).\n*   **Priority:** A control set allowing selection of five priority levels, represented by a question mark and multiple up/down chevron icons. The medium-low priority (double down chevron) is selected.\n\n**2. QuickActions Module (b):**\nA group of six predefined action buttons used for rapid categorization and workflow execution: 'Internal Mail', 'Outside Threat', 'Spam', 'Invoice', 'CEO Fraud', and 'Manual Trigge...'.\n\n**3. PhishRIP Module (c):**\nDisplays metrics for an automated remediation or search tool, titled PhishRIP.\n*   Metrics: 'Queries Initiated: 2', 'Last Query: May 15, 2020 at 1:47 PM', 'Last Query Found: 0'.\n*   Action Buttons: 'Create New Query' and 'View Queries'.\n\n**4. Core Actions (d, e):**\n*   Button (d): 'Download Original Email' (for forensic purposes).\n*   Button (e): A split action button labeled 'Run', indicating execution of a dynamic workflow.\n\n**5. Assigned Tags (f):**\nA section for metadata tagging, featuring an input field placeholder: 'Add new tag'.\n\n**6. PhishML Confidence (g):**\nDisplays the Machine Learning scoring for the message, titled PhishML Confidence.\n*   Scores: 'Clean: 7', 'Spam: 17', 'Threat: 76' (indicating a high probability of a threat).\n*   Action Button: 'Generate Explanation' (for model transparency).\n\n**7. Final Action (h):**\nA prominent, full-width button at the base of the interface for definitive incident resolution: 'Delete Message'.",
      "position": 19,
      "context": "For more information, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/PhishRIP/discussionSidebar_MessageDetails.png",
      "alt": "This screen displays the **Discussion** view within a multi-tabbed interface (sibling tab: **Actions**). The **Discussion** tab is active, indicated by the orange highlight and a pending count badge displaying **3**.\n\nThe main body of the screen is a chronological log of communications regarding a specific ticket or incident, featuring:\n\n*   **Communication Entries:** Three distinct message boxes display sender information (masked), timestamps, message type, and content.\n*   **Sent Email:** An analyst-sent response (April 28, 2025, 4:58 PM) confirmed successful reporting. Indicated by \"Sent email\" and a green envelope icon.\n*   **User Reply Emails:** Two subsequent entries (April 28 and April 29) are indicated by \"User reply email\" and a gray envelope icon, documenting user feedback and follow-up requests.\n\nThe lower portion of the screen provides input and action controls:\n\n*   **(a) Comment Field:** A large text area for input, using the placeholder text \"Comment here\".\n*   **(b) Save Internal Note:** A secondary (outlined orange) Call-to-Action (CTA) button used to save input as an internal record viewable only by analysts.\n*   **(c) Send Email:** A primary (solid blue) CTA button used to transmit the input content as an external email response to the user.",
      "position": 20,
      "context": "ml'>PhishER Settings: Account article."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "inbox",
      "phisher"
    ],
    "image_count": 20
  }
}