{
  "article": {
    "id": 1500007668501,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/1500007668501.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/1500007668501.html",
    "author_id": 360978864968,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 5,
    "vote_sum": 10,
    "vote_count": 12,
    "section_id": 360011640414,
    "created_at": "2021-04-19T14:00:23Z",
    "updated_at": "2025-03-12T12:33:29Z",
    "name": "KSAT and KCM GRC Data Privacy Impact Assessment (DPIA)",
    "title": "KSAT and KCM GRC Data Privacy Impact Assessment (DPIA)",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-12T12:33:29Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p>1. <strong>SCOPE</strong></p>\n<p>This KnowBe4 Data Privacy Impact Assessment (DPIA) is only applicable to the extent KnowBe4, Inc. and/or its affiliates (KnowBe4) is a processor of personal data for its KSAT and KCM GRC products and services. The purpose of this DPIA  is to provide information about KnowBe4’s personal data processing practices and to allow customers to complete their own data protection impact assessments on KnowBe4’s products and services. This DPIA only covers KnowBe4’s KSAT and KCM GRC products and services. </p>\n<p><strong>Description of KnowBe4 Services</strong></p>\n<p>KnowBe4 is a B2B SaaS (software as a service) company that provides its customers with a variety of services. The services that will be included in this document are:</p>\n<ul role='list'>\n<li>\n<strong>KSAT Console</strong>: A simulated phishing and security awareness and compliance training platform.</li>\n<li>\n<strong>KCM GRC Tool</strong>: A tool designed to help manage company governance, risk, compliance, and audits.</li>\n</ul>\n<p><strong>Describe the data that will be stored, used, collected, or otherwise processed while using KnowBe4's services. </strong></p>\n<ul role='list'>\n<li>\n<strong>KSAT Console</strong>: Name, email address, telephone number, title, security awareness training and simulated phishing campaign results and metrics, strictly necessary cookie information, IP addresses, web browser information, and information uploaded by customers.</li>\n<li>\n<strong>KCM GRC Tool</strong>: Email address, browser information, strictly necessary cookie information, and information that customers upload into the console (including audit reports, compliance reports, etc.).</li>\n</ul>\n<p><strong>Does KnowBe4 collect special categories of data (including criminal convictions, health information, etc.)?</strong></p>\n<p>No, KnowBe4 does not request nor provide appropriate fields for submitting special categories of data for any of its tools. Any special categories of data that may be received would be incidental and can be deleted upon request.</p>\n<p><strong>Where are KnowBe4’s servers located?</strong></p>\n<p>KnowBe4 operates instances within the United States, the European Union, the United Kingdom, Germany, and Canada. Customers may choose where data is stored during the course of the services. However, KnowBe4 leverages subprocessors in the United States and generally personal data will always be processed in the United States.</p>\n<p><strong>Does KnowBe4’s processing of personal data include automated decision making which can produce legal effects concerning data subjects?</strong></p>\n<p>No.</p>\n<p><strong>Do you provide notice to data subjects about the processing of their personal data?</strong></p>\n<p>KnowBe4 acts as a processor for its customers, so it does not initiate direct contact with data subjects unless specifically instructed to. When processing personal data, KnowBe4 adheres to the terms of our data processing agreements and data protection notices found <a href='https://www.knowbe4.com/product-privacy-notice?hsLang=en' rel='noopener'>here</a>. Data stored in KnowBe4’s products and services are provided by customers. Our customers are responsible for making their users aware of how their data is being processed. </p>\n<p>2. <strong>ACCESS TO PERSONAL DATA</strong></p>\n<p><strong>How is access to personal data handled?</strong></p>\n<p>KnowBe4 provides products and services that leverage role-based action control, or RBAC. Customer administrators are able to set users' roles and permissions to limit access. KnowBe4’s employees and other personnel are only granted access to data on a restricted basis. Access is only granted to fulfill KnowBe4’s contractual obligations, legal obligations, or legitimate business interests, such as meeting service-level agreements (SLAs) or upon a customer’s written permission. </p>\n<p><strong>How do you ensure the security of KnowBe4's products and services?</strong></p>\n<p>KnowBe4 has security policies, procedures, and controls to ensure the security of its products and services. These controls may be found by reviewing KnowBe4’s SOC 2 Type 2. You may request KnowBe4's SOC 2 Type 2 by emailing your KnowBe4 point of contact after executing a non-disclosure agreement (NDA). You may also review KnowBe4’s public-facing SOC 3 report found <a href='https://d0.awsstatic.com/whitepapers/compliance/soc3_amazon_web_services.pdf'>here</a>. </p>\n<p><strong>How does KnowBe4 handle customer data subject access requests (DSARs)?</strong></p>\n<p>KnowBe4’s procedure for handling end-user DSARs for customers is to forward the request to the console or service administrator and provide assistance as requested.</p>\n<p>3.<strong> INFORMATION FLOWS</strong></p>\n<p><strong>International Data Transfer</strong></p>\n<p>You may also execute a Data Processing Addendum with standard contractual clauses (SCCs) with KnowBe4 by following the instructions found <a href='https://www.knowbe4.com/terms?hsLang=en'>here</a>.</p>\n<p><strong>Describe KnowBe4’s product data flows.</strong></p>\n<p>KSAT and KCM GRC are both built in the cloud leveraging Amazon Web Services (AWS). </p>\n<ul role='list'>\n<li>\n<strong>KSAT Data Flow Description</strong>: Customer administrators are able to upload end-user information into the console. Personal data is also generated when users complete security modules or are subject to phishing campaigns. This data is then stored in KnowBe4’s cloud storage (AWS).</li>\n<li>\n<strong>KCM GRC Data Flow Description</strong><em>:</em> Customers create a user account with their business email address. KCM GRC users then upload information into the KCM GRC console. This information is then stored in KnowBe4’s cloud storage (Amazon AWS).</li>\n</ul>\n<p><strong>What sub-processors does KnowBe4 leverage in order to provide services?</strong></p>\n<p>KnowBe4 leverages sub-processors that process personal data in order to provide services to customers. You may request a list of sub-processors by emailing your KnowBe4 point of contact. Data processing agreements (DPAs) have been executed with all sub-processors in order to ensure the protection of personal data. </p>\n<p>4. <strong>DATA SECURITY &amp; PRIVACY BY DESIGN (PbD)</strong></p>\n<p><strong>Where can I find KnowBe4’s security documentation?</strong></p>\n<p>KnowBe4 takes security seriously and takes appropriate measures to protect personal data. For more information about our security practices, you may visit our Security page found<span> </span><a href='https://www.knowbe4.com/security?hsLang=en'>here</a>. Additionally, our Consensus Assessment Initiative Questionaire (CAIQ) is available <a href='https://www.knowbe4.com/security?hsLang=en'>here</a>. You may also request a copy of our SOC 2 Type 2 from your KnowBe4 point of contact after executing a non-disclosure agreement (NDA). Our public-facing SOC 3 report can be found <a href='https://www.knowbe4.com/security?hsLang=en'>here</a>.</p>\n<p><strong>How does KnowBe4 incorporate privacy by design (PbD) into its products?</strong></p>\n<p>KnowBe4 conducts data privacy impact assessments and takes its data protection obligations into account when creating new products and services. </p>\n<p><strong>Are KnowBe4 employees and agents bound by confidentiality agreements?</strong></p>\n<p>KnowBe4 employees and other personnel who may have access to personal data are required to sign confidentiality agreements.</p>\n<p><strong>Do KnowBe4 employees receive privacy and security awareness training?</strong></p>\n<p>Yes, KnowBe4 employees receive periodic privacy and security awareness training. </p>\n<p><strong>Does KnowBe4 maintain a record of processing activities?</strong></p>\n<p>Yes, KnowBe4 maintains a record of processing activities. </p>\n<p>5. <strong>DATA RETENTION</strong></p>\n<p><strong>How long does KnowBe4 store personal data for?</strong></p>\n<p>KnowBe4 retains customer personal data in accordance with its customer contracts (i.e. service agreements and data processing agreements) as well as in accordance with other legal obligations.</p>\n<p>6.<strong> HAS KNOWBE4 APPOINTED A DATA PROTECTION OFFICER?</strong></p>\n<p>Yes, KnowBe4 has appointed a Data Protection Officer. You may contact KnowBe4’s Data Protection Officer by emailing <a href='mailto:privacy@knowbe4.com'>privacymanager@knowbe4.com</a>. </p>\n<p>7. <strong>WHO CAN I REACH OUT TO IF I HAVE MORE QUESTIONS?</strong></p>\n<p>If you have more questions, you can either contact your KnowBe4 point of contact or send an email to <a href='mailto:privacy@knowbe4.com'>privacymanager@knowbe4.com</a>.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/1500007668501-KSAT-and-KCM-GRC-Data-Privacy-Impact-Assessment-DPIA",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "and",
        "assessment",
        "dpia",
        "grc",
        "kcm",
        "ksat",
        "privacy"
      ],
      "image_count": 0
    }
  }
}