{
  "id": 16569063307411,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/16569063307411.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/16569063307411.html",
  "author_id": 1534339111301,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 3,
  "vote_sum": 3,
  "vote_count": 3,
  "section_id": 20416655766931,
  "created_at": "2023-05-12T00:28:42Z",
  "updated_at": "2025-04-07T15:46:55Z",
  "name": "PhishER Settings: Integrations",
  "title": "PhishER Settings: Integrations",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-14T14:33:23Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "localized",
    "answerbot",
    "answerbot_phisher"
  ],
  "body": "<p>In the <strong>Integrations</strong> section of your <a href='https://support.knowbe4.com/hc/en-us/articles/360013919314' target='_self'>PhishER Settings</a>, you can view and manage integrations with your mail server, the third-party integrations supported by PhishER, and the integration with your KSAT console.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>For more information about specific PhishER integrations, see the <a href='https://support.knowbe4.com/hc/en-us/sections/7759989017491' target='_self'>Integrations</a> subsection of our Knowledge Base.</div>\n</div>\n<h2 id='h_01HBSA1XCSD12G73MRM9PW2J1C'>Mail Servers</h2>\n<p>The <strong>Mail Servers</strong> subtab displays the mail servers connected to your PhishER platform. From this subtab, you can connect and manage your Microsoft 365 and Google Workspace mail server instances. After you connect your mail server instances on this subtab, you can enable PhishRIP or the PhishER Blocklist for your platform.</p>\n<p>Once you connect a mail server to a feature on your PhishER platform, you can edit and test the connection. If you update a mail server instance, the instance will automatically update across your PhishER platform. You can also connect mail servers from the <strong>Blocklist</strong> or <strong>PhishRIP</strong> subtabs of your PhishER <strong>Settings</strong>.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsMailServers.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsMailServers.png' alt=' '></a></div>\n<p>To learn how to connect and manage mail servers, see the subsections below.</p>\n<h3 id='h_01HBSA1XCSMYJB11KP26F2TQYD'>Connecting a Microsoft 365 Mail Server</h3>\n<p>To connect a new instance of your Microsoft 365 mail server, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your PhishER platform.</li>\n<li>Navigate to <strong>Settings</strong> &gt; <strong>Mail Servers</strong>.</li>\n<li>If you would like to connect to PhishRIP, click <strong>New PhishRIP Connection</strong> and follow the steps in the <a href='https://support.knowbe4.com/hc/en-us/articles/360045742834#M365' target='_self'>Enabling for Microsoft 365</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360045742834' target='_self'>How to Use PhishRIP</a> article. If you would like to connect to the PhishER Blocklist, click <strong>New Blocklist Connection</strong> and follow the steps in the <a href='#h_01HBSA1XCTSE02GRCKF514NH6G'>Blocklist</a> section of this article.</li>\n</ol>\n<h3 id='h_01HBSA1XCT7WKBKAPTDH8DVCTZ'>Connecting a Google Workspace Mail Server</h3>\n<p>To connect a new instance of your Google Workspace mail server, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your PhishER platform.</li>\n<li>Navigate to <strong>Settings</strong> &gt; <strong>Mail Servers</strong>.</li>\n<li>Click the <strong>New PhishRIP Connection</strong> button and follow the steps in the <a href='https://support.knowbe4.com/hc/en-us/articles/360045742834#GOOGLE' target='_self'>Enabling for Google Workspace</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360045742834' target='_self'>How to Use PhishRIP</a> article.</li>\n</ol>\n<h3 id='h_01HBSA1XCTKTPGKKR747WQHT4M'>Managing Your Mail Servers</h3>\n<p>Once you connect a mail server instance, it will display on the <strong>Mail Servers</strong> page. If you edit or delete a mail server instance, the changes will automatically apply to your PhishER platform. If you disconnect an instance, it will continue to display on the Mail Servers page until you delete it or reconnect it.</p>\n<p>To learn more about the settings on the <strong>Mail Servers</strong> page, see the screenshot and list below.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Settings/MailServers/EN/MailServers_Settings.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Settings/MailServers/EN/MailServers_Settings.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>New PhishRIP Connection</strong> and <strong>New Blocklist Connection</strong>: You can click these buttons to add a new mail server instance or reconnect a disconnected instance. For more information about connecting an instance, see the above subsections of this article.</li>\n<li>\n<strong>Pencil icon</strong>: You can click this icon to customize the name of a mail server instance.</li>\n<li>\n<strong>Test PhishRIP Connection</strong>: You can click this link to confirm that a mail server is connected to your PhishER platform. The date and time of when the connection was successfully tested will display next to the link. <strong>User Mailboxes Scanned</strong> will display the number of mailboxes scanned when the connection was tested.</li>\n<li>\n<strong>Funnel icon</strong>: You can click this icon to open the <strong>User Mailboxes Selection</strong> pop-up window. In the pop-up window, you can enter email domains or regular expressions in the fields to indicate the user mailboxes that PhishRIP can scan. For more information, read the User Mailboxes Selection section below.</li>\n<li>\n<strong>Disconnect PhishRIP</strong> and <strong>Disconnect Blocklist</strong>: You can click these buttons to disconnect a mail server from PhishRIP or the PhishER Blocklist.</li>\n<li>\n<strong>Trash can icon</strong>: You can click this icon to delete a disconnected mail server instance.</li>\n</ol>\n<h3 id='h_01HS8TFMMXRR4XGW97B02Y5D19'>Selecting User Mailboxes</h3>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Settings/MailServers/EN/UserMailboxesSelectionWindow.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Settings/MailServers/EN/UserMailboxesSelectionWindow.png' alt=' ' width='615' height='367'></a></div>\n<p>After the first PhishRIP query is run, your mail server instance will display a <strong>funnel</strong> icon. You can click the icon to open the <strong>User Mailboxes Selection</strong> pop-up window. This pop-up window displays the email domains or regular expressions that indicate the user mailboxes that PhishRIP can scan. You can enter email domains in the <strong>Domain Scan List</strong> field or enter regular expressions in the <strong>Regular Expression Scan List</strong> field. Enter each value on a separate line. Then, click <strong>Save</strong> to save your changes. PhishRIP queries will only search in mailboxes of users who have a matching domain or regex string from the lists. If you want PhishRIP queries to search in all the available user mailboxes, remove all entries from both fields.</p>\n<h2 id='h_01HBSA1XCTSE02GRCKF514NH6G'>Blocklist</h2>\n<p>From the <strong>Blocklist</strong> subtab, you can enable the <strong>PhishER Blocklist</strong> feature. This feature helps your mail server prevent malicious or spam emails from reaching your users’ inboxes. With this feature, you can block emails from senders, domains, URLs, and file hashes.</p>\n<p>If you have a PhishER Plus subscription, you can also enable the <strong>Global Blocklist</strong> feature, which connects your mail server to a blocklist managed by KnowBe4's Threat Research Lab. If you enable the Global Blocklist and <a href='https://support.knowbe4.com/hc/en-us/articles/360045742834' target='_self'>PhishRIP</a> in your platform, you can enable the <strong>Global PhishRIP</strong> feature to remove email threats from your user's inboxes using the Global Blocklist. For more information about these features, see our <a href='https://support.knowbe4.com/hc/en-us/articles/15906868504211' target='_self'>How to Use the Global Blocklist</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/17305995205523' target='_self'>How to Use Global PhishRIP</a> articles.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>To enable the PhishER Blocklist and Global Blocklist in your PhishER platform, your organization must have an active Microsoft 365 instance that is tied to your organization’s domain.</div>\n</div>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsBlocklist.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsBlocklist.png' alt=' '></a></div>\n<p>To enable your blocklist, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your PhishER platform.</li>\n<li>Navigate to <strong>Settings</strong> &gt; <strong>Blocklist</strong>.</li>\n<li>Click the <strong>Connect to Microsoft 365</strong> button. This button will take you to the Microsoft 365 login page.</li>\n<li>Once you have logged in, the <strong>Permissions requested Accept for your organization</strong> pop-up window will display. Once you've read the permissions, click the <strong>Accept</strong> button. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Settings/Blocklist/EN/Blocklist_M365_Permissions'><img src='https://helpimg.s3.amazonaws.com/PhishER/Settings/Blocklist/EN/Blocklist_M365_Permissions.png' alt=' ' width='401' height='656'></a>\n</li>\n<li>Turn on the toggle next to <strong>Disabled</strong>.</li>\n<li>From the <strong>Blocklist Entry Duration</strong> drop-down menu, select the amount of time that you would like entries to remain on your blocklist. A duration of 60 days is selected by default.</li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<p>Once the PhishER Blocklist is enabled, a <strong>block</strong> icon <span class='fa-regular fa-ban mod-ui'></span> will display in the navigation panel on the left side of your PhishER platform. You can click this icon to access your blocklist.</p>\n<p>After you enable the PhishER Blocklist, you will need to <a href='https://learn.microsoft.com/en-us/powershell/exchange/app-only-auth-powershell-v2?view=exchange-ps#step-5-assign-azure-ad-roles-to-the-application' target='_blank' rel='noopener'>assign the Exchange Administrator role</a> to the PhishER Blocklist application to authenticate it.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>If you <a href='https://support.knowbe4.com/hc/en-us/articles/15906868504211#ENABLING_BLOCKLIST'>enable the Global Blocklist</a> after setting up the PhishER Blocklist, you won't need to repeat the steps for connecting your mail server and assigning the Exchange Administrator role.</div>\n</div>\n<p>To assign the Exchange Administrator role to the application, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to the <a href='https://entra.microsoft.com/' target='_blank' rel='noopener noreferrer'>Microsoft Entra admin center</a> using your admin credentials. You must have at least a Privileged Authentication Administrator role.</li>\n<li>Navigate to <a href='https://entra.microsoft.com/#blade/Microsoft_AAD_IAM/TenantOverview.ReactView' target='_blank' rel='noopener noreferrer'>Microsoft Entra ID</a> &gt; Identity &gt; Roles &amp; admins &gt; <a href='https://entra.microsoft.com/#view/Microsoft_AAD_IAM/RolesManagementMenuBlade/~/AllRoles' target='_blank' rel='noopener noreferrer'>Roles &amp; admins</a>.</li>\n<li>Click the <strong>Exchange Administrator</strong> role name and click <strong>Add assignments</strong>.</li>\n<li>In the search bar, enter \"PhishER Blocklist\" and click <strong>Add</strong>.</li>\n</ol>\n<p>Once you’ve completed the steps above, you can add and manage blocklist entries. For more information about using your blocklist, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12913849104147' target='_self'>How to Use the PhishER Blocklist</a> article.</p>\n<h2 id='h_01HDF55DVNGW5X6WQGN0YTYQJ1'>CrowdStrike</h2>\n<p>From the <strong>CrowdStrike</strong> subtab, you can configure your integration with CrowdStrike Falcon Sandbox. CrowdStrike Falcon Intelligence is a threat intelligence service that combines with the Falcon Sandbox to analyze files and URLs for malicious content. To integrate the CrowdStrike Falcon Sandbox with PhishER, you must have a PhishER Plus subscription and an active CrowdStrike Falcon Intelligence subscription. If you do not have a CrowdStrike subscription, you can purchase one on CrowdStrike’s <a href='https://www.crowdstrike.com/products/threat-intelligence/falcon-sandbox-malware-analysis/' target='_blank' rel='noopener noreferrer'>website</a>.</p>\n<p>For more information about integrating CrowdStrike with your PhishER platform, see our <a href='https://support.knowbe4.com/hc/en-us/articles/18853966211219'>How to Integrate CrowdStrike with Your PhishER Platform</a> article.</p>\n<h2 id='h_01HBSA1XCTRV53VSWREVN7E4MC'>VirusTotal</h2>\n<p>From the <strong>VirusTotal</strong> subtab, you can configure your integration with VirusTotal. VirusTotal is a service that uses over 70 antivirus scanners to inspect and analyze files for malicious content. To integrate your VirusTotal account with PhishER, you must have an active VirusTotal license key. If you do not have a VirusTotal account, you can join for free on VirusTotal's website.</p>\n<p>For more information about integrating VirusTotal with your PhishER platform, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14193888378131' target='_self'>VirusTotal and PhishER Integration</a> article.</p>\n<h2 id='h_01HY4JX802R1ZN2Z3R2G3W7B22'>Threat Intel</h2>\n<p>From the <strong>Threat Intel</strong> subtab, you can configure your integration with Threat Intel. Threat Intel uses Webroot’s BrightCloud Web Classification &amp; Web Reputation Service to analyze URLs. To configure Threat Intel with your PhishER platform, you must have a PhishER Plus subscription. For more information about integrating Threat Intel with your PhishER platform, see our <a href='https://support.knowbe4.com/hc/en-us/articles/27765887530131'>Integrate Threat Intel with Your PhishER Platform</a> article.</p>\n<h2 id='h_01HBSA1XCTVS6B8J41CF9Q6119'>Syslog</h2>\n<p>From the <strong>Syslog</strong> subtab, you can configure the Syslog servers connected to your PhishER platform. System Logging Protocol, or Syslog, is a protocol that generates logs for network devices or servers. You can integrate Syslog servers with your PhishER account to log when PhishER actions are triggered.</p>\n<p>For more information about integrating Syslog servers with your PhishER platform, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14194394933651' target='_self'>How to Integrate Syslog with Your PhishER Platform</a> article.</p>\n<h2 id='h_01HBSA1XCT6D93XT4SE3H5V525'>Webhooks</h2>\n<p>From the <strong>Webhooks</strong> subtab, you can configure the webhooks connected to your PhishER platform. A webhook, also known as an HTTP push API, allows applications to provide other applications with information in real time. You can receive a callback based on a PhishER action that is attached to a message.</p>\n<p>For more information about configuring webhooks for your PhishER platform, see our <a href='https://support.knowbe4.com/hc/en-us/articles/14196559482387' target='_self'>How to Create and Manage Webhooks in Your PhishER Platform</a> article.</p>\n<h2 id='h_01HBSA1XCT0DMS8EGY8S193DXW'>Cyren Inbox Security (CIS)</h2>\n<p>When using Cyren Inbox Security (CIS), you have the option to send scanned or reported emails to your PhishER platform. For more information about this feature, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4411071693843' target='_self'>Cyren Inbox Security (CIS) Integration</a> article.</p>\n<h2 id='h_01HBSA1XCTVPE08JPHA6JVJ6MV'>KSAT Console</h2>\n<p>From the <strong>KSAT Console</strong> subtab, you can configure your integration with your KSAT console to update events on KSAT User Timelines. If you have a Platinum or Diamond-level subscription, you can use the KSAT integration option to see two types of events on your users' KSAT User Timelines. The first event is the disposition of the messages that your users have reported with the Phish Alert Button (PAB). The second event is the disposition and location of a message that PhishRIP has quarantined.</p>\n<p>For more information about the settings on the <strong>KSAT Console</strong> subtab, see the screenshot and list below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsKMSAT.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsKMSAT.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>User Event API Key</strong>: This field displays the last four characters of your <strong>User Event API Key</strong>. To update this field, click <strong>Update Key</strong>. In the <strong>Update Key</strong> pop-up window that opens, enter your <strong>User Event API Key</strong> in the <strong>New User Event API Key</strong> field and click <strong>Save</strong>.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>You can find your <strong>User Event API Key</strong> in the <strong>User Event API</strong> section of your KSAT <strong>Account Settings</strong>.</div>\n</div>\n</li>\n<li>\n<strong>Send Events to KSAT via PhishER Actions</strong>: Select this check box to enable the <strong>Send to KSAT</strong> option for PhishER actions. You can use this option to send information to your KSAT console when users report a message with the PAB.</li>\n<li>\n<strong>Automatically send PhishRIP Events to KSAT Console</strong>: Select this check box to send information to your KSAT console when PhishRIP quarantines a message. The event on your User Timelines will display the message’s disposition and the location where it was found in the user's inbox.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>You must enable <a href='https://support.knowbe4.com/hc/en-us/articles/360045742834' target='_self'>PhishRIP</a> to use the <strong>Automatically send PhishRIP Events to KSAT Console</strong> integration feature. Leaving the <strong>Automatically send PhishRIP Events to KSAT Console</strong> check box deselected will not prevent you from seeing the disposition of reported emails on the KSAT User Timeline.</div>\n</div>\n</li>\n<li>\n<strong>Exclude emails from Sent, Spam, Deleted, and Quarantine folders</strong>: Select this check box to exclude information from emails that were found in your users’ Sent, Spam, Deleted, or Quarantine folders.</li>\n<li>\n<strong>Send PhishRIP events to KSAT when the Source of the PhishRIP query is labeled as</strong>: You can select specific dispositions if you would like to send information about messages that received a specific disposition only.</li>\n<li>\n<strong>Save</strong>: Click this button to update your KSAT integration settings.</li>\n</ol>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/16569063307411-PhishER-Settings-Integrations",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsMailServers.png",
      "alt": "This image displays the \"Mail Servers\" configuration screen within a technical platform's \"SETTINGS\" menu. The interface is segmented into a vertical navigation sidebar and a main content area.\n\n**UI Context and Navigation:**\nThe left navigation sidebar is dark, featuring a list of account, security, and integration settings. The \"Mail Servers\" option, located under the **INTEGRATIONS** category, is currently selected and highlighted.\n\n**Main Content Area – Connection Setup:**\nThe top section facilitates new integrations, divided by service:\n1.  **Connect to Microsoft 365:** Provides two orange action buttons: **\"New PhishRIP Connection\"** and **\"New Blocklist Connection.\"**\n2.  **Connect to Google Workspace:** Provides one orange action button: **\"New PhishRIP Connection.\"**\n\nBelow the connection prompts is a light blue alert banner stating: \"You must set up your mail server to allow access to the blocklist,\" with a link to **\"View Setup Process.\"**\n\n**Main Content Area – Existing Connections:**\n\n**1. Microsoft 365 Connections:**\nOne active connection is detailed in a card. It includes an obscured ID and two pink disconnection buttons: **\"Disconnect PhishRIP\"** and **\"Disconnect Blocklist.\"**\n*   Status Metadata: The connection was successfully tested on \"Jun 27, 2023 at 3:25 PM.\"\n*   Metrics: \"User Mailboxes Scanned: 57 scanned on Jul 13, 2023 at 12:10 PM.\"\n\n**2. Google Workspace Connections:**\nTwo active connections are listed in separate cards.\n*   Each card features a pink **\"Disconnect PhishRIP\"** button.\n*   Status Metadata: Both connections were successfully tested on \"Jul 12, 2023 at 9:30 AM.\"\n*   Metrics: The first connection scanned 16 mailboxes, and the second scanned 6 mailboxes, both on \"Jul 13, 2023 at 12:10 PM.\"",
      "position": 1,
      "context": "subtabs of your PhishER Settings."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/Settings/MailServers/EN/MailServers_Settings.png",
      "alt": "This image displays a dashboard for managing email platform integrations, divided into two primary sections: \"Connect to Microsoft 365\" (left) and \"Connect to Google Workspace\" (right).\n\n**UI Structure and Actions:**\n\n*   **Microsoft 365 Connection Panel:**\n    *   **Top Actions (a):** Provides two primary orange call-to-action buttons: **\"New PhishRIP Connection\"** and **\"New Blocklist Connection.\"**\n    *   **Active Connection Card:** Displays a connected service instance with an obscured ID.\n        *   **Status/Controls:** Includes an Edit icon (**b**), and two purple-bordered disconnect buttons: **\"Disconnect PhishRIP\"** and **\"Disconnect Blocklist.\"**\n        *   **Testing and Metrics (c, d):** Features a clickable link **\"Test PhishRIP Connection.\"** The status reports success: \"Connection successfully tested on Feb 15, 2024.\" Scan statistics are listed: **\"User Mailboxes Scanned: 59 scanned on Mar 18, 2024 9:11 AM.\"**\n\n*   **Google Workspace Connection Panel:**\n    *   **Top Actions:** Provides one primary orange button: **\"New PhishRIP Connection.\"**\n    *   **Active Connection Card:** Displays one connected service instance.\n        *   **Status/Controls (e):** Includes an Edit icon and a single disconnect button: **\"Disconnect PhishRIP.\"**\n        *   **Testing and Metrics:** Connection status is successful, and scan metrics are provided: **\"User Mailboxes Scanned: 6 scanned on Mar 18, 2024 9:11 AM.\"**\n    *   **Inactive Connection Card (f):** Displays a second server instance with the status message: **\"This mail server isn't currently connected to any PhishER features.\"** This card includes both Edit (pencil) and Delete (trash can) action icons.",
      "position": 2,
      "context": ">Mail Servers page, see the screenshot and list below."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/Settings/MailServers/EN/UserMailboxesSelectionWindow.png",
      "alt": "This UI view is a configuration panel for defining user mailboxes to be scanned by the PhishRIP service.\n\n**Header and Context:**\nThe page is titled \"User Mailboxes Selection for [blurred alphanumeric identifier]\". Below the title is an instructional paragraph: \"You can enter email domains or regular expressions in the fields to indicate the user mailboxes that PhishRIP can scan.\" This instruction is accompanied by an informational icon.\n\n**Input Fields:**\nThe interface contains two distinct multi-line textarea input fields for specifying targets:\n\n1.  **Domain Scan List:** This field is used to list specific domains.\n    *   *Current Content:* The field contains two example entries on separate lines: `google.com` and `knowbe4.com`.\n2.  **Regular Expression Scan List:** This field is used for inputting regular expressions.\n    *   *Current Content:* The field contains one example entry: `/test/`.\n\n**Action Controls:**\nThe bottom of the panel includes two control buttons for submission:\n\n*   **Cancel:** A secondary action button.\n*   **Save:** A primary action button (highlighted in orange).",
      "position": 3,
      "context": "h_01HS8TFMMXRR4XGW97B02Y5D19'>Selecting User Mailboxes"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsBlocklist.png",
      "alt": "This image displays the \"Blocklist\" configuration page within the \"SETTINGS\" section of a security platform's administrative interface.\n\n**UI Context and Navigation:**\n*   The page utilizes a left-hand vertical navigation sidebar, where the **Blocklist** item under the **INTEGRATIONS** category is currently selected and highlighted. The main page title is \"Blocklist.\"\n\n**Blocklist Settings Configuration:**\nThe central content area presents three distinct configuration sections:\n\n1.  **Blocklist Enablement and Duration:**\n    *   A primary toggle switch, labeled **Enabled**, is activated (green).\n    *   The **Blocklist Entry Duration** section defines the maximum lifespan for blocklist entries. A dropdown menu is set to **60 Days**.\n    *   A separate toggle switch for **Global Blocklist Enabled** is also activated (green).\n\n2.  **Find Similar Messages (Quarantine and Query Settings):**\n    *   Two associated checkboxes are active (checked):\n        *   **Initiate PhishRIP queries for new Global Blocklist entries** (includes an information icon).\n        *   **Automatically quarantine all found messages.**\n    *   A large, orange **Save** button is located beneath these options.\n\n3.  **Connected Mail Servers (Integration Status):**\n    *   The status text confirms: \"There is currently **1 mail server** connected to your blocklist.\"\n    *   A blue-bordered alert box advises: \"You must set up your mail server to allow access to the blocklist,\" followed by a collapsible link, \"View Setup Process.\"\n    *   An action button is provided for integration setup: **Connect to Microsoft 365**.",
      "position": 4,
      "context": "instance that is tied to your organization’s domain."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/Settings/Blocklist/EN/Blocklist_M365_Permissions.png",
      "alt": "This image displays a **Microsoft application consent screen** for an organizational administrator reviewing permissions for a third-party application.\n\n**UI Context and Branding:**\n*   The header features the **Microsoft logo** (four colored squares) and the text \"Microsoft.\"\n*   Below the logo, a blurred section likely contains the organization's name or domain.\n\n**Main Content and Headings:**\n*   The primary bold heading is **\"Permissions requested.\"**\n*   The subheading is \"Review for your organization.\"\n\n**Application Details:**\n*   The application name is **\"PhishER Blocklist\"** (bold text).\n*   The publisher is **\"KnowBe4\"** (blue text), followed by a blue checkmark indicating verification.\n\n**Requested Permissions (List):**\nThe app is requesting five distinct permissions, each preceded by a downward chevron icon:\n1.  Read domains\n2.  Run hunting queries\n3.  Sign in and read user profile\n4.  Use Exchange Web Services with full access to all mailboxes\n5.  Manage Exchange As Application\n\n**Informational Text and Warnings:**\n*   **First paragraph:** \"If you accept, this app will get access to the specified resources for all users in your organization. No one else will be prompted to review these permissions.\"\n*   **Second paragraph (includes warning):** \"Accepting these permissions means that you allow this app to use your data as specified in their terms of service and privacy statement. The publisher has not provided links to their terms for you to review. You can change these permissions at https://myapps.microsoft.com.\"\n*   The URL `https://myapps.microsoft.com` and the text \"Show details\" are clickable links.\n*   **Suspicion Query:** \"Does this app look suspicious? Report it here\" (\"Report it here\" is a clickable link).\n\n**Call-to-Action Buttons:**\nThe bottom of the screen features two action buttons:\n*   **Cancel** (Grey, standard button style)\n*   **Accept** (Blue, highlighted/primary button style)",
      "position": 5,
      "context": "e you've read the permissions, click the Accept button."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/integrationsKMSAT.png",
      "alt": "The image displays the \"KMSAT Console\" configuration page within the \"SETTINGS\" section of a web application, likely a security or email management platform.\n\n**Navigation:**\nThe left panel confirms the user is in the \"SETTINGS\" section. Under the \"INTEGRATIONS\" category, \"KMSAT Console\" is the active, highlighted navigation item.\n\n**Instructional Context:**\nA prominent blue informational box outlines the requirements for integration (retrieving the KnowBe4 User Event API Key) and describes the resulting functionalities:\n1. Enabling \"Send Events to KMSAT via PhishER Actions.\"\n2. Automatically sending disposition and location data for messages quarantined by PhishRIP.\n\n**Authorization Settings:**\nThis section manages connectivity to the KMSAT system:\n*   **User Event API Key:** An input field displays a masked key (`****aaHM`).\n*   **Update Key:** An orange button allows for updating the stored API key.\n\n**Configuration Settings:**\nThis section controls which events are sent to the KMSAT Console:\n\n1.  **Send Events to KMSAT via PhishER Actions:** A checked checkbox controlling PhishER integration.\n2.  **Automatically send PhishRIP Events to KMSAT Console:** A checked checkbox enabling automated event submission.\n    *   *Nested Option:* **Exclude emails from Sent, Spam, Deleted, and Quarantine folders:** A checked checkbox nested under the automatic sending option.\n3.  **Send PhishRIP events to KMSAT when the Source of the PhishRIP query is labeled as:** A group of checkboxes allowing filtering based on the source label:\n    *   Clean (Checked)\n    *   Spam (Checked)\n    *   Threat (Checked)\n    *   Unknown (Unchecked)\n\n**Action Button:**\nAn orange \"Save\" button is located at the bottom of the configuration panel to commit changes.",
      "position": 6,
      "context": "g>KSAT Console subtab, see the screenshot and list below:"
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "integrations",
      "phisher",
      "settings"
    ],
    "image_count": 6
  }
}