{
  "id": 204948207,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/204948207.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/204948207.html",
  "author_id": 403968826754,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 1,
  "vote_sum": 38,
  "vote_count": 50,
  "section_id": 360000156688,
  "created_at": "2015-03-04T19:09:00Z",
  "updated_at": "2025-08-20T15:40:40Z",
  "name": "Training Campaigns Guide",
  "title": "Training Campaigns Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T18:28:23Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "languages",
    "phishing templates",
    "hide courses",
    "acknowledge a policy",
    "advanced reports",
    "nightowl",
    "newrecruit",
    "cyberhero",
    "pfp",
    "phish-failure percentage",
    "localized",
    "answerbot",
    "phishing template search"
  ],
  "body": "<p>On the <strong>Training</strong> tab of your KnowBe4 console, you can create training campaigns, edit training notification templates, prepare policies for user acknowledgment, and view <a href='https://support.knowbe4.com/hc/en-us/articles/204950377' target='_self'>training reports</a>. Training campaigns allow you to select the content that your users will see in their Learner Experience.</p>\n<p>If you prefer video tutorials, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226519807' target='_self'>Setting Up a Training Campaign</a> video and our <a href='https://support.knowbe4.com/hc/en-us/articles/226683248' target='_self'>Monitoring Training Campaigns</a> video</p>\n<h2 id='iv_01H84ZMYTY9KJDN7Z45EMK6WQC'>Preparing for Your Training Campaign</h2>\n<p>Before you create a training campaign, we recommend you follow the steps below:</p>\n<ol role='list'>\n<li>Customize your <strong>Learner Experience (LX).</strong> For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634'>Learner Experience Guide</a>.</li>\n<li>If you have policies that you’d like your users to acknowledge, add these policies to your KnowBe4 console. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360001641907' target='_self'>How to </a><a href='https://support.knowbe4.com/hc/en-us/articles/360001641907' target='_self'>Create and Manage Policies in Your KnowBe4 Console</a> article.</li>\n<li>Add our training content to your library or upload your own training content. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore' target='_self'>ModStore and Library Guide</a> and our <a href='https://support.knowbe4.com/hc/en-us/articles/360019644394' target='_self'>Uploading Custom Content to Your KnowBe4 Platform </a>article.</li>\n<li>Review our training notifications or customize your own training notifications. See our <a href='https://support.knowbe4.com/hc/en-us/articles/115010848868'>Training Campaign Notifications</a> article or our <a href='https://support.knowbe4.com/hc/en-us/articles/360001547908'>Customizing Training Notifications</a> article for more information.</li>\n</ol>\n<h2 id='iv_01H84ZMYTY0NFK6REANVA7KDS2'>Creating a Training Campaign</h2>\n<p>To create a training campaign, log in to your KnowBe4 console and click the <strong>Training </strong>tab. Then, click the <strong>+ Create Training Campaign</strong> button at the top-right corner of the page. Once you click this button, you will see the <strong>Create New Training Campaign</strong> page.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Important: </strong>We also offer the option to include AI-generated knowledge refreshers that can be used to automatically create and assign short and fun quizzes that help your learners remember their training. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/33016697488787-AIDA-Knowledge-Refresher-Guide'>AIDA Knowledge Refresher Guide</a>.</div>\n</div>\n<div><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/training+course+mgmt/CampaignCreationPt1v2.png'><img src='https://s3.amazonaws.com/helpimg/training+course+mgmt/CampaignCreationPt1v2.png' alt=' '></a></div>\n<p><strong>Campaign Name</strong>,<strong> Content</strong>, and<strong> Enroll Groups</strong> are the only fields required to create a campaign. However, we encourage you to customize the campaign settings as much as you'd like. When you are satisfied with your campaign settings, click the <strong>Create Campaign</strong> button at the bottom-left corner of the page.</p>\n<p>For more information about a specific field, click the field name in the drop-down list below.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> You can create a training campaign to assign assessments to your users. For specific instructions on how to set up a training campaign to assign assessments, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360024195754' target='_self'>How to Use Assessments</a> article.</div>\n</div>\n<ul class='js-toggles' role='list'>\n<li title='1. Campaign Name'>\n<p>Name your campaign something descriptive, such as \"Work from Home Training\" or \"<a href='https://support.knowbe4.com/hc/en-us/articles/206280728-Using-Groups-for-Remedial-Training' target='_self'>Remedial Training</a>\". The campaign name can help you remember the purpose or scope of your campaign.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> Enrolled users will see the campaign name in the <strong>Training</strong> tab of their Learner Experience (LX) and in some training notifications.</div>\n</div>\n</li>\n<li title='2. Start Date'>\n<p>Set the time that this campaign should start. This field is helpful if you want to create a campaign that starts at a later date.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> By default, training campaigns will use the time zone that is set in your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887-How-to-Edit-Your-Account-Settings#COMPANY'>Account Settings</a>. If you would like the campaign to use a different time zone, you can select the desired time zone from the drop-down menu. For more information about setting a time zone in your Account Settings, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226457887' target='_self'>How to Edit Your Account Settings</a> article.</div>\n</div>\n</li>\n<li title='3. End Date'>\n<p>Select when this training should be completed by. There are three end date options:</p>\n<ol role='list' type='a'>\n<li>\n<strong>Specific Date</strong>: Select a specific date and time for this campaign to end. Training must be complete by this date, regardless of when users enroll in the campaign.</li>\n<li>\n<strong>Relative Duration</strong> (Recommended): This option sets the due date based on when a user was enrolled in the campaign. You can set this duration in days, weeks, or months. For example, if a user enrolls in the campaign on March 1 and the relative duration is set to three weeks, the user will have until March 21 to complete the training in this campaign.</li>\n<li>\n<strong>No End Date</strong>: Select this option if you’d like the campaign to not have an end date. If you have enabled Optional Learning in your Account Settings, this training campaign will be considered optional. The selected training content will be added to the <strong>Library</strong> tab of each user’s Learner Experience (LX). See our <a href='https://support.knowbe4.com/hc/en-us/articles/1500002656002' target='_self'>Optional Learning Guide</a> for more information.</li>\n</ol>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> If you change a campaign's end date after the campaign starts, training notifications based on the campaign end date will be affected. For example, if you extend your campaign's due date after you send a <strong>Remind Before Due Date</strong> notification, your users will receive extra notifications.</div>\n</div>\n</li>\n<li title='4. Assignments After Due Date'>\n<p>Select the <strong>Allow assignments to be completed after due date</strong> check box to allow users to complete their assignments after the campaign end date. When this option is enabled, a clock icon is displayed next to the campaign duration on the <strong>Campaigns</strong> subtab.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you have enabled the <strong>Allow assignments to be completed after due date</strong> setting and your campaign is <em>completed</em>, your users will still be able to complete their training after the campaign end date. If your campaign is completed and you enable this setting, you can also continue to send your users <a href='https://support.knowbe4.com/hc/en-us/articles/115010848868#ATYPES' target='_self'>Past Due notifications</a>, if you'd like. However, if you have enabled the <strong>Allow assignments to be completed after due date </strong>setting and your campaign is <em>closed</em>, your users will not be able to complete training after the campaign end date. If the campaign has been closed, your users will not receive any Past Due notifications. For more information about the different campaign statuses, see the <a href='#EDIT' target='_self'>Managing and Editing Training Campaigns</a> section below.</div>\n</div>\n<p>For more information about this setting, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360019203233'>How to Modify Training Deadlines</a> article.</p>\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/training+course+mgmt/pastdue_icon.png'><img src='https://s3.amazonaws.com/helpimg/training+course+mgmt/pastdue_icon.png' alt=' ' width='217' height='85'></a>\n</li>\n<li title='5. Content'>\n<p>Use the <strong>Content</strong> drop-down menu to add content to your campaign. You can select <a href='https://support.knowbe4.com/hc/en-us/articles/360001641907' target='_self'>policies</a> that you’ve added as well as <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467' target='_self'>training content</a> that has been added to your library.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> If you would like to add content to your library, you can click the <strong>Visit ModStore</strong> link. This link will open the <strong>ModStore</strong> subtab in a new browser tab, where you can add content to your library. After you add content, return to the <strong>Create New Training Campaign</strong> page and click the refresh button to refresh your available content.</div>\n</div>\n<p>Within the drop-down menu, you can sort the content by title, duration, and date published. You can also type a keyword into the <strong>Search</strong> field to filter content.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+course+mgmt/ContentDrop-DownMenu.gif'><img src='https://helpimg.s3.amazonaws.com/training+course+mgmt/ContentDrop-DownMenu.gif' alt=' ' width='495' height='371'></a></div>\n<p>By default, retired training content will not be listed in the drop-down menu. To view retired content, select the <strong>Include Retired Content</strong> check box in the drop-down menu.</p>\n<p>Once you select your content, click out of the drop-down menu to view your content list. If you’d like to change the content order, click the content titles and drag them into the order that you’d like users to see their training listed.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> Once a campaign starts, you can’t add or remove content to the campaign. Include all necessary training and policies before your campaign starts. If you forget to include content, you can assign the content in another training campaign.</div>\n</div>\n</li>\n<li title='6. Enable Content Survey'>\n<p>If you select the <strong>Enable Content Survey</strong> check box, users will be prompted to take a survey after they complete each training assignment. Enabling surveys allows users to provide you with feedback about your training plan. If you select the <strong>Allow users to leave comments</strong> check box, users will be able to leave comments on their survey. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360023815053' target='_self'>How to Use Surveys</a> article for more information.</p>\n</li>\n<li title='7. Allow Survey Comments'>\n<p>Select the <strong>Allow users to leave comments</strong> check box to allow users to add an additional text comment to their survey feedback. Leave this feature disabled if you do not want text comments.</p>\n</li>\n<li title='8. Track Scores'>\n<p>Select the <strong>Track Scores</strong> check box to save individual user scores for all eligible content in this campaign. To see these scores, go to the <strong>Users</strong> subtab of your training campaign or the <strong>User Timeline</strong> subtab of a user’s profile.</p>\n</li>\n<li title='9. Anonymize Assessment Scores'>\n<p>Select <strong>Anonymize Assessment Scores</strong> to hide user assessment scores on the <strong>Users</strong> subtab of the training campaign overview page. You will only see this option if you select an assessment from the <strong>Content</strong> drop-down menu.</p>\n</li>\n<li title='10. Enroll Users'>\n<p>Use the <strong>Enroll Users</strong> option to enroll users in this campaign. To enroll all your users, click <strong>All Users</strong>. To enroll specific users, click <strong>Specific Users</strong> and select any user groups from the drop-down menu that displays.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>If you would like to create a group to enroll specific users, you can click the <strong>View All Groups</strong> link. This link will open the <strong>Users</strong> subtab in a new browser tab, where you can create a new group. After you create a group, return to the <strong>Create New Training Campaign</strong> page and click the refresh button to refresh your available groups.</div>\n</div>\n</li>\n<li title='11. Enroll with CSV File'>\n<p>Click the <strong>Browse</strong> button to select a CSV file to bulk enroll users with. This option allows you to enroll multiple users with a CSV file and is only available if you selected <strong>Specific Users</strong>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>You can only attach one CSV file at a time. If you remove and replace your existing CSV file, only the users from the new CSV file will be enrolled when the campaign begins. If you remove and replace your existing CSV file during an active campaign, new users will be added and existing users will not be deleted.</div>\n</div>\n</li>\n<li title='12. Automatically Enroll New Users'>\n<p>Select the <strong>Enable automatic enrollment for new users</strong> check box to automatically enroll users in this campaign when they’re added to a group that is enrolled in this campaign.</p>\n<p>If you choose to enroll all users, any user who is added to the console after the campaign starts will be automatically enrolled in this campaign.</p>\n</li>\n<li title='13. Enable Progress Reset for Remedial Training'>\n<p>The <strong>Enable progress reset for remedial training</strong> setting should only be used for remedial training campaigns. This setting resets a user's original training progress if they've re-enrolled in this campaign. See our <a href='https://support.knowbe4.com/hc/en-us/articles/206280728' target='_self'>Using Groups for Remedial Training</a> article for more information.</p>\n</li>\n<li title='14. Add Completed Users To'>\n<p>You have the option to add users who complete this training campaign to a specific group. To add these users to a group, select the desired group from the <strong>Add Completed Users To</strong> drop-down menu.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> If you would like to create a group, you can click the <strong>Visit All Groups</strong> link above the Enroll Groups drop-down menu. This link will open the <strong>Users</strong> subtab in a new browser tab, where you can create a new group. After you create a group, return to the <strong>Create New Training Campaign</strong> page and click the refresh button to refresh your available groups.</div>\n</div>\n<p>You can use this setting to make sure your users are being sent simulated phishing emails as soon as they complete training to reinforce the skills they learned as part of training. For example, you can create an ongoing phishing campaign targeting a Trained Users group. Then, in your training campaigns, you can use this setting to add completed users to the Trained Users group upon completion of their assigned training.</p>\n</li>\n<li title='15. Remove Completed Users From'>\n<p>You have the option to remove users who complete this training from a specific group. To remove these users, select the desired group from the <strong>Remove Completed Users From</strong> drop-down menu.</p>\n<p>You can use this setting to help with <a href='https://support.knowbe4.com/hc/en-us/articles/206280728' target='_self'>remedial training campaigns</a> and to assign training on a staggered or ordered basis. For more information about how to effectively use groups with training campaigns, read the <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups#GROUPSTRAINING' target='_self'>Groups and Training Campaigns</a> section of the <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups' target='_self'>Users and Groups</a> article.</p>\n</li>\n<li title='16. Notifications'>\n<p>In the <strong>Notifications</strong> section, you have the option to set up automatic notifications to send to users, managers, and admins in your account. There is no limit to the number of notifications you can set up. To set up notifications for a campaign, click the <strong>+Add Notification button</strong>. See below for an overview of the notification options. For more details on this section, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115010848868' target='_self'>Training Campaign Notifications</a> article.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/trainingcampaigns_notifications2.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/trainingcampaigns_notifications2.png' alt=' ' width='600' height='293'></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>Notification Type</strong>: From this drop-down menu, select when the notification will be sent. Select from the following options: Welcome, Remind After Enrollment, Remind Before Due Date, Campaign Completion, or Past Due.</li>\n<li>\n<strong>Select Recipients and Templates:</strong><span> Select the appropriate check box to send notifications to your desired recipients. Select from the following options: User, Manager, Admin, or a combination of these three options.</span>\n</li>\n<li>\n<strong>Select Template</strong><span>: From the drop-down menu, select which notification template to send to the recipient type. To preview the selected template, click the eye icon on the right side of the field.</span>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you have enabled password-less logins in your <strong>Account Settings</strong>, be sure to select the training notifications that are labeled as \"(Password-less)”.</div>\n</div>\n</li>\n<li>\n<strong>Manage Training Notification Templates</strong>: Click this link to view available notification templates in a new window. We provide several system email templates for you to choose from. You can click this option to customize our notifications or create your own notifications.\n<p>When you are satisfied with your notification selections, click the <strong>Save</strong> button. To add another notification, click the <strong>+Add Notification</strong> button again.</p>\n</li>\n</ol>\n</li>\n</ul>\n<h2 id='iv_h_01FEM1YXKSNSJHQ388Y3FHAKFR'>Managing and Editing Training Campaigns</h2>\n<p>Once you have created training campaigns, you can manage or edit the campaign at any time. To manage and edit your training campaigns, navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</p>\n<p>To learn more about the options in this section, see below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/trainingcampaigns_statuses2.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/trainingcampaigns_statuses2.png' alt=' '></a></div>\n<ol type='a'>\n<li>\n<strong>Active, Inactive, and All:</strong> Use these buttons to filter which type of campaigns you would like to view. For more information about the filters, see the list below:\n<ul role='list'>\n<li>\n<strong>Active:</strong> Use this filter to view only campaigns in Created and In Progress status.</li>\n<li>\n<strong>Inactive:</strong> Use this filter to view only campaigns in Completed and Closed status.</li>\n<li>\n<strong>All:</strong> Use this filter to view all campaigns.</li>\n</ul>\n</li>\n<li>\n<strong>Training Campaigns</strong>: This table lists training campaigns by name. For each campaign, you can see which groups are enrolled, what content is included, and the percentage of users that have completed the training.</li>\n<li>\n<strong>Campaign Status:</strong> Above the campaign name, you can see a banner that displays the status of the campaign. For example, the campaign in the screenshot above is displaying the In Progress status. For more information about the campaign statuses, see the list below:\n<ul role='list'>\n<li>\n<strong>Enrolling:</strong> The campaign is being created and users are being enrolled.</li>\n<li>\n<strong>Created:</strong> The campaign has not started yet.</li>\n<li>\n<strong>In Progress: </strong>The campaign is active and ongoing because the campaign either has not reached its end date or has a relative duration. While a campaign is in this status, you can continue to enroll additional users.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>Campaigns that have a relative duration will always display the In Progress status, even if the completion percentage is 100 percent. These campaigns are active so that you can enroll users in the campaign at a later date.</div>\n</div>\n</li>\n<li>\n<strong>Completed:</strong> The campaign is inactive because the campaign has passed its end date.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If the campaign's <strong>Allow assignments to be completed after due date</strong> check box is selected and the campaign is in the Completed status, the enrolled users will still be able to complete their training and receive training notifications for the campaign.</div>\n</div>\n</li>\n<li>\n<strong>Closed:</strong> The campaign is inactive because an admin manually closed the campaign. Users will no longer receive training notifications for this campaign.</li>\n</ul>\n</li>\n<li>\n<strong>Name:</strong> Click the name of a campaign to view the details of the campaign. For more information, see the <a href='#01H84ZMYTZPM1TTMWJW0MS53JX'>Individual Campaign Overview</a> section below.</li>\n<li>\n<strong>Total Duration:</strong> This column lists the combined time of all modules included in the campaign.</li>\n<li>\n<strong>Actions:</strong> Click the drop-down arrow in the rightmost column to view the available actions for a campaign. These actions include:\n<ul role='list'>\n<li>\n<strong>Edit:</strong> Click <strong>Edit</strong> to open the <strong>Edit Training Campaign</strong> screen, which is similar to the <strong>Create New Training Campaign</strong> screen. Edit options as needed, then click the <strong>Update Campaign</strong> button at the bottom-left corner of the page to save your changes. Options in gray cannot be changed.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you edit or add automated notifications, these notifications will not be sent retroactively. For example, if you add a Welcome notification, users who were already enrolled in this training will not receive the new notification. We recommend that you send <a href='https://support.knowbe4.com/hc/en-us/articles/115010848868-Training-Campaign-Notifications#MANUAL' target='_self'>manual training notifications</a> for a campaign in progress.</div>\n</div>\n</li>\n<li>\n<strong>Clone:</strong> Click <strong>Clone</strong> to create a copy of an existing campaign. The new campaign will have the same settings and content as the original campaign except for a new start time and the word \"Clone\" in the campaign name. Once you click <strong>Clone</strong>, you’ll be redirected to the <strong>Clone Training Campaign</strong> screen where you can change the campaign name and other settings before you save the cloned campaign.</li>\n<li>\n<strong>Close:</strong> Click <strong>Close</strong> to end a campaign and save user completion data.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>A closed campaign is different from a completed campaign. For more information about the difference between the Closed campaign status and the Completed campaign status, see letter C above.</div>\n</div>\n</li>\n<li>\n<strong>Delete:</strong> Click <strong>Delete</strong> to permanently delete a training campaign and all associated data. This includes the completion data of all enrolled users.\n<div class='callout-warning'>\n<div class='callout__content'>\n<strong>Important:</strong>Be cautious when clicking <strong>Delete</strong> for a training campaign. This action will permanently delete the campaign and all data associated with it.</div>\n</div>\n</li>\n<li>\n<strong>Enroll Users:</strong> Click <strong>Enroll Users</strong> to individually enroll additional users in this campaign. For more information see our <a href='https://support.knowbe4.com/hc/en-us/articles/115002986387' target='_self'>Can I Enroll Users in a Training Campaign That Is in Progress?</a> article.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>This option will only display for active training campaigns that are In Progress.</div>\n</div>\n</li>\n</ul>\n<h2 id='iv_01H84ZMYTZPM1TTMWJW0MS53JX'>Individual Campaign Overview</h2>\n<p>From the <strong>Campaigns</strong> tab, click the name of a campaign to view the <strong>Campaign Overview</strong> subtab. To learn more about the individual campaign overview, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226683248-Video-Monitoring-Training-Campaigns' target='_self'>Monitoring Training Campaigns</a> video or see the information below.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+course+mgmt/TrainingCampaignOverview_2021.png'><img src='https://helpimg.s3.amazonaws.com/training+course+mgmt/TrainingCampaignOverview_2021.png' alt=' '></a></div>\n</li>\n</ol>\n<ol role='list'>\n<li>The <strong>Users</strong> subtab provides more detailed information about each user and their progress during the training campaign. You can also manually change a user’s progress, send manual notifications, and download completion certificates. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360053311074' target='_self'>User Training Progress</a> article.</li>\n<li>The <strong>Survey Results</strong> subtab will only display if you have enabled content surveys for the training campaign. This tab lists the results of these surveys. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360023815053-How-to-Use-Surveys' target='_self'>How to Use Surveys</a> article for more information.</li>\n<li>In the <strong>Campaign Content</strong> section, you can see a list of all content included in the campaign and the completion percentage for all content.</li>\n<li>Similar to the <strong>Users</strong> subtab, the <strong>User Progress</strong> button takes you to a page with specific user details for that training assignment. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360053311074' target='_self'>User Training Progress</a> article.</li>\n<li>The <strong>Assessment Results</strong> button will only display if you have assigned a <a href='https://support.knowbe4.com/hc/en-us/articles/360037392654' target='_self'>Security Awareness Proficiency Assessment (SAPA)</a> or <a href='https://support.knowbe4.com/hc/en-us/articles/360037393134' target='_self'>Security Culture Survey (SCS)</a> to your users. Click this button to view the results of the assessment. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360024195754' target='_self'>How to Use Assessments</a> article for more information.</li>\n<li>Click the <strong>Notify Users</strong> button to send manual training notifications to users, managers, or account admins.</li>\n<li>The <strong>Campaign Summary</strong> section includes a graph that shows which users have completed all the content in the campaign. This section also lists the status, start date, relative duration, number of users, auto-enroll option, and scheduled notifications for the campaign.</li>\n</ol>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Guide",
  "images": [
    {
      "url": "https://s3.amazonaws.com/helpimg/training+course+mgmt/CampaignCreationPt1v2.png",
      "alt": "This technical manual describes the UI configuration page titled \"Create New Training Campaign.\" The page is structured as a vertical form with a persistent \"Campaign Checklist\" sidebar.\n\n**Form Elements (Create New Training Campaign):**\n\n1.  **Campaign Name:** Text input field for the campaign title.\n2.  **Start Date:** Configured to **03/29/2024** at **9:00 AM**. The system notes the time zone as *(GMT-04:00) Eastern Time (US & Canada)*.\n3.  **End Date:** A segmented control panel offers three options:\n    *   **(a) Specific Date:** (Selected). Configured to **04/29/2024** at **11:59 PM**.\n    *   **(b) Relative Duration:** (Unselected).\n    *   **(c) No End Date:** (Unselected).\n4.  **Due Date Policy:** Checkbox labeled \"Allow assignments to be completed after due date\" (Unchecked).\n5.  **Content:** Indicates **2 items selected**. A link \"Visit ModStore\" and a refresh button are present.\n    *   **Content Order:** Lists two items: 1. \"Compliance Series: PCI DSS for Merchants\" and 2. \"Security Awareness Proficiency Assessment (SAPA).\"\n6.  **Enable Content Survey:** Checkbox (Checked).\n7.  **Survey Sub-Option:** Nested checkbox \"Allow users to leave comments\" (Unchecked).\n8.  **Track Scores:** Checkbox (Unchecked).\n9.  **Anonymize Assessment Scores:** Checkbox (Checked).\n10. **Enroll Users:** Enrollment is configured via tabs: \"All Users\" (Unselected) and **Specific Users** (Selected).\n    *   A dropdown allows selection from groups (\"Select one or more groups from the list...\"), complemented by a \"View All Groups\" link and a refresh button.\n11. **Enroll with CSV File:** File input field with \"Please select a file...\" and a \"Browse\" button.\n12. **Automatic Enrollment:** Checkbox \"Enable automatic enrollment for new users\" (Checked).\n13. **Remedial Option:** Nested checkbox \"Enable progress reset for remedial training\" (Unchecked).\n14. **Add Completed Users To:** Dropdown for selecting destination groups.\n15. **Remove Completed Users From:** Dropdown for selecting source groups.\n16. **Notifications:** Button labeled **+ Add Notification**.\n\n**Action and Footer:**\n*   Primary action button: **Create Campaign**.\n*   A persistent note banner at the bottom states: *Note: It may take up to 10 minutes for a campaign to start after it is created or activated.*\n\n**Sidebar (Campaign Checklist):**\nThe right pane features an orange \"Campaign Checklist\" status box prompting the user to complete tasks. It highlights the need to \"Add Users\" to the KMSAT console, linking to a \"CSV File Import →.\"",
      "position": 1,
      "context": "A-Knowledge-Refresher-Guide'>AIDA Knowledge Refresher Guide."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/training+course+mgmt/pastdue_icon.png",
      "alt": "This image displays a single list item or task card detailing a scheduled activity within a user interface.\n\n**UI Elements and Text:**\n\n1.  **Status Badge:** A prominent, amber-colored, rounded rectangular tag in the upper left corner. It contains the text **\"In Progress\"** in white/light text, indicating the current state of the activity.\n2.  **Activity Title:** The primary text line, rendered in a large, blue font, reads **\"2020 Security Culture Survey.\"** This typically denotes the name of the task or item, often serving as a clickable link.\n3.  **Metadata/Timeline:** A secondary line of smaller, black text provides temporal context: **\"01/04/2020 - 1 week.\"** This specifies the start date and duration.\n4.  **Iconography:** The timeline text is immediately followed by a gray **circular clock icon**, reinforcing the time-based nature of the associated duration.\n5.  **Divider:** A thin, horizontal gray line is present at the bottom, functioning as a separator for subsequent list items.\n\n**Context:** The entry provides a concise summary of a security-related survey, noting its current active status and scheduled timeline.",
      "position": 2,
      "context": "owbe4.com/hc/en-us/articles/360019203233'>How to Modify Training Deadlines article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/training+course+mgmt/ContentDrop-DownMenu.gif",
      "alt": "This image displays a segment of a web application configuration interface, presenting various options for managing content access, surveys, tracking, and user enrollment groups.\n\n**UI Elements and Configuration Settings:**\n\n1.  **Content Selection:**\n    *   Label: \"Content\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more items from the list...\"\n\n2.  **Content Survey Options:**\n    *   Checkbox (Checked): \"Enable Content Survey\" (Followed by an information/help icon: \"?\")\n    *   Nested Checkbox (Unchecked, within a shaded/highlighted background box): \"Allow users to leave comments\"\n\n3.  **Tracking Option:**\n    *   Checkbox (Unchecked): \"Track Scores\" (Followed by an information/help icon: \"?\")\n\n4.  **Enrollment Group Selection:**\n    *   Label (Partially Visible): \"...roll Groups\"\n    *   Input Type: Segmented button control with two options:\n        *   \"All Users\" (Active/Unselected style)\n        *   \"Specific Groups\" (Selected/Dark Gray style)\n    *   Information/help icon (\"?\") follows the segmented control.\n    *   Below the segmented control is a Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\" (This input field is relevant only when \"Specific Groups\" is selected).\n\n5.  **Automatic Enrollment Options:**\n    *   Checkbox (Checked): \"Enable automatic enrollment for new users\" (Followed by an information/help icon: \"?\")\n    *   Nested Checkbox (Unchecked, within a shaded/highlighted background box): \"Enable progress reset for remedial training\" (Followed by an information/help icon: \"?\")\n\n6.  **Additional Group Assignments (Partially Visible):**\n    *   Label (Partially Visible): \"...d Users To\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\"\n\n7.  **Completion Assignments (Partially Visible):**\n    *   Label (Partially Visible): \"...Completed\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\"\n\n**Contextual Details:**\n*   The interface utilizes checkboxes, segmented controls, and dropdowns for configuration.\n*   The use of shaded background boxes indicates dependent or secondary options that are enabled by the primary checkbox above them (e.g., \"Allow users to leave comments\" is dependent on \"Enable Content Survey\").\n*   A mouse cursor is visible in the upper right quadrant, pointing towards the area above the \"Allow users to leave comments\" box.\n*   Question mark icons (\"?\") are used extensively to indicate the availability of tooltips or supplementary help information for specific settings.",
      "position": 3,
      "context": "o type a keyword into the Search field to filter content."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/training+campaigns/trainingcampaigns_notifications2.png",
      "alt": "This image displays a configuration screen titled \"**Add Automatic Training Notifications**\" within a **Notifications** module. The interface is organized into two main sections:\n\n1.  **Notification Type Selection (a):** A label \"**Notification Type**\" is associated with a dropdown menu placeholder text reading \"**Select Notification Type**.\"\n2.  **Recipients and Templates Selection:** This section is preceded by the header \"**Select Recipients and Templates**\" and consists of a list of recipients linked to template selection tools.\n\n    *   **Recipient Configuration (b):** Three potential recipients are listed, each with a checkbox for selection and a help icon (question mark): \"**User**,\" \"**Manager**,\" and \"**Admin**.\"\n    *   **Template Selection (c):** Each recipient row has a corresponding dropdown menu placeholder reading \"**Select Template**.\" To the right of each dropdown is a light blue eye icon, indicating a preview function.\n    *   **Template Management Link (d):** Below the template selection fields, a hyperlink is present: \"**Manage Training Notification Templates**.\"\n\nThe configuration screen concludes with two primary action buttons at the bottom left: a blue, filled button labeled \"**Save**\" and a gray, filled button labeled \"**Cancel**.\"",
      "position": 4,
      "context": "868' target='_self'>Training Campaign Notifications article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/training+campaigns/trainingcampaigns_statuses2.png",
      "alt": "This image displays the **Campaigns** management interface, structured as a data table listing active training or survey initiatives.\n\n**Navigation and Filtering:**\n*   The primary horizontal navigation bar includes tabs for **Campaigns** (currently active), **Notification Templates**, **Policies**, and **Reports**.\n*   A search field labeled \"Search\" is located in the top-right corner.\n*   (a) A filtering control allows users to view campaigns based on status: **Active** (selected), **Inactive**, or **All**.\n\n**Campaign Data Table Structure:**\nThe main content is a table with the following sortable columns:\n*   (b) **Name:** Campaign title, status tag, and date range.\n*   **Groups:** Target user group(s).\n*   **Content:** List of modules or surveys included in the campaign, often prefixed by an icon (e.g., checklist for surveys, graduation cap for training).\n*   (e) **Total Duration:** Estimated time required to complete all content.\n*   (e) **Complete %:** Percentage completion tracker for the campaign, shown numerically and via a progress bar.\n*   **Actions:** Dropdown menu for campaign management.\n\n**Example Data Rows:**\n*   **Row 1 (c):** Campaign named \"Security Culture Survey\" (In Progress, 03/18/2024 - 04/18/2024), targeted at the \"Beginner Phishing\" group, contains one item (\"Security Culture Survey (SCS)\"), has a total duration of 10 minutes, and shows **0% Completed**.\n*   **Row 2 (d):** Campaign named \"Security Awareness Initiative\" (In Progress), targeted at \"Beginner Phishing,\" contains three training modules, totals 43 minutes, and shows **0% Completed**.\n\n**Action Dropdown (f):**\nThe Actions dropdown, visible on the first row, provides the following management options for the selected campaign:\n*   **Edit** (pencil icon)\n*   **Clone** (copy icon)\n*   **Close** (X icon)\n*   **Delete** (trash can icon)\n*   **Enroll Users** (person/plus icon)",
      "position": 5,
      "context": ">.\nTo learn more about the options in this section, see below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/training+course+mgmt/TrainingCampaignOverview_2021.png",
      "alt": "This screen is a campaign reporting dashboard titled **\"2020 Security Awareness Initiative\"** for **\"Groups: All Users.\"** The active tab is **\"Users,\"** indicating a focus on individual progress and metrics.\n\n## UI Elements and Navigation\n\n*   **Primary Navigation:** Tabs include \"Overview,\" \"**Users**\" (active), and \"Survey Results.\"\n*   **Action Button:** A green button labeled **\"Notify Users\"** (with an envelope icon) is displayed in the top right corner, above the summary panel.\n*   **External Link:** **\"← Back to Training\"** is present in the top right corner.\n\n## Campaign Content Details (Left Panel)\n\nThis section details the completion status of the two campaign components, both showing **79% Completed** via a horizontal progress bar:\n\n1.  **Training Module:** \"2020 Your Role: Internet Security and You.\" The active content view is **\"User Progress.\"**\n2.  **Assessment:** \"2020 Security Culture Survey.\" The active content view is **\"Assessment Results\"** (highlighted blue button), alongside the \"User Progress\" option.\n\n## Campaign Summary (Right Panel)\n\nThis panel provides high-level campaign metadata and progress:\n\n*   **Completion Metric:** A doughnut chart displays **79% Completed All Content**.\n*   **Status Table:**\n    *   **Status:** In Progress (Green text).\n    *   **Start Date:** 02/16/2021, 1:45 AM.\n    *   **Relative Duration:** 3 weeks.\n    *   **Users:** 538.\n    *   **Auto-Enroll:** No.\n*   **Scheduled Notifications:** Lists actions, including \"Send welcome notification to Users on enrollment.\"\n\n## User Completion Activity (Data Visualization)\n\nA line graph tracks user completion status over time:\n\n*   **Title:** User Completion Activity.\n*   **Metric:** Number of Users who have not completed their assignments.\n*   **Y-Axis:** Represents the number of incomplete users (Ranging from 0 to 600).\n*   **X-Axis:** Represents the date range (February 16th through February 25th).\n*   **Trend:** The graph shows a declining trend, starting near 530 non-completed users on February 16th and decreasing sharply to below 100 non-completed users by February 25th.",
      "position": 6,
      "context": "toring Training Campaigns video or see the information below."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "campaigns",
      "training"
    ],
    "image_count": 6
  }
}