{
  "id": 208969608,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/208969608.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/208969608.html",
  "author_id": 383255683393,
  "comments_disabled": true,
  "draft": false,
  "promoted": true,
  "position": 0,
  "vote_sum": 48,
  "vote_count": 100,
  "section_id": 20421506472979,
  "created_at": "2015-09-11T13:38:53Z",
  "updated_at": "2025-11-11T20:11:18Z",
  "name": "Phish Alert Button (PAB) Product Manual",
  "title": "Phish Alert Button (PAB) Product Manual",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-11-11T20:11:18Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "Template",
    "PhishML",
    "PhishML Tags",
    "localized",
    "Security Coach"
  ],
  "body": "<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Starting February 17, 2025, Microsoft deprecated legacy Exchange Online tokens. This deprecation may impact the functionality of the Microsoft Ribbon Phish Alert Button. The <a href='https://learn.microsoft.com/en-us/office/dev/add-ins/outlook/turn-exchange-tokens-on-off' target='_blank' rel='noopener'>legacy Exchange Online tokens can be reenabled</a> until June 2025. We recommend <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/38439352278803.html'>authorizing Graph APIs and NAA-SSO in your phish alert account settings</a> to prevent authentication issues. For more information, see <a href='https://learn.microsoft.com/en-us/office/dev/add-ins/outlook/faq-nested-app-auth-outlook-legacy-tokens' target='_blank' rel='noopener'>Microsoft’s Nested app authentication and Outlook legacy tokens deprecation FAQ</a>.</div>\n</div>\n<p>The Phish Alert Button (PAB) add-in for Microsoft Outlook, Microsoft Exchange, Microsoft 365, and Google Workspace gives your users the ability to report suspicious emails.</p>\n<p>In this article, you will learn how to <strong>enable and configure the PAB</strong>, <strong>choose the PAB installation guide best suited for your organization</strong>, and <strong>how to set up multiple PAB instances</strong>.</p>\n<p>To learn how installing the PAB can benefit your organization and for best practices, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115013738548.html'>Best Practices for Phish Alert Button (PAB) Implementation</a> article.</p>\n<h2 id='iv_01H8CHZ6DEWHYPA3RY255WV9EB'>What Data Is Sent to Our Servers?</h2>\n<p>The PAB communicates with our API over <span>TLS 1.2</span>, which is securely encrypted. The external IP address, user agent, and other standard browser information are sent to us as part of the standard HTTPS communication.</p>\n<p>The information that is sent from the user's machine to our servers is listed below:</p>\n<ul>\n<li>License Key</li>\n<li>PAB version</li>\n<li>Operating system (OS)</li>\n<li>Operating system architecture\n<ul>\n<li>This includes 32-bit or 64 bit.</li>\n</ul>\n</li>\n<li>Microsoft Outlook version</li>\n<li>Windows configured language\n<ul>\n<li>This is the language code. For example, EN for English, DE for German, and so on.</li>\n</ul>\n</li>\n<li>Operating System ID\n<ul>\n<li>This is a random GUID generated for each individual workstation.</li>\n</ul>\n</li>\n<li>User's email address\n<ul>\n<li>We do not store your users' email addresses unless it is already in our system.</li>\n</ul>\n</li>\n</ul>\n<p>When the user reports an email that is not a simulated phishing email, the reported email will not be sent to us unless you have the <strong>Send Us a Copy </strong>setting enabled in your Account Settings. When this setting is enabled, reported emails are forwarded to us, and to the email addresses specified in your Account Settings. For more information about this setting, see the <a href='#01H8CHZ6DE0JZC4DB92E8X7X2N'>Enable and Configure PAB</a> section below.</p>\n<h2 id='iv_01H8CHZ6DE0JZC4DB92E8X7X2N'>Enable PAB</h2>\n<p>Before you install the PAB, you will need to enable and configure the PAB in your Account Settings. To enable the PAB, follow the steps below.</p>\n<ol>\n<li>Log in to your KnowBe4 console and navigate to your <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/226457887.html'>Account Settings</a> page. This page will look different depending on your account version.\n<ul>\n<li>Free Version: If you have a free account, log in to your console and click the <strong>Get Started</strong> button. When you click, you will be taken to the Phish Alert Enabled screen. Skip to step 4 for further instructions.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/phish_alert/getstarted_button.png'><img src='https://helpimg.s3.amazonaws.com/phish_alert/getstarted_button.png' alt=' '></a></p>\n</li>\n<li>Paid Version: If you have a paid account, log in to your console and click on your email address in the top-right corner of the screen. Then, select <strong>Account Settings.</strong>\n</li>\n</ul>\n</li>\n<li>Navigate to <strong>Account Integrations</strong> &gt; <strong>Phish Alert</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/phish_alert/AccountIntegrations.png'><img src='https://helpimg.s3.amazonaws.com/phish_alert/AccountIntegrations.png' alt=' '></a></p>\n</li>\n<li>Turn on the <strong>Enable Phish Alert</strong> setting.</li>\n<li>Click the <strong>Add Phish Alert Instance</strong> button.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>When you select the <strong>Add Phish Alert Instance</strong> button, a pop-up window will ask you to confirm if you would like to create a new instance. For more information about setting up multiple instances, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115012103388.html'>Set Up Multiple Phish Alert Button (PAB) Instances</a> article.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/phish_alert/PhishAlertInstance.png'><img src='https://helpimg.s3.amazonaws.com/phish_alert/PhishAlertInstance.png' alt=' '></a></p>\n</li>\n</ol>\n<h2 id='h_01JNS7XXPJZR03P46S452J8KNJ'>Phish Alert Settings</h2>\n<p>Configure your PAB by filling out the fields in your Account Settings. For information about these fields, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/Phish+Alert+Settings.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/Phish+Alert+Settings.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Enable Phish Alert</strong>: Turn on this setting if you would like to enable PAB for your account. If you deploy the PAB in your organization but you don't enable this setting, your organization's PAB reports will not be recorded.</li>\n<li>\n<strong>Select PAB Version</strong>: From the drop-down menu, select the version of the PAB you want to edit for this PAB instance.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Depending on the version of the PAB you select, different fields will be displayed underneath the <strong>Email Format</strong> section. For example, the <strong>Enable Microsoft 365 Defender Integration</strong> toggle will display for Microsoft PABs, and the <strong>Enable Automatic PAB Activation</strong> toggle will appear if you select the Google PAB. For additional information, you can review the corresponding PAB product manual for the selected PAB version.</div>\n</div>\n</li>\n<li>\n<strong>Set as Default: </strong>Click this button to set the current PAB version as the default option in the drop-down menu. You can set a default for each PAB instance you create. This setting only affects your account interface and does not impact deployed PAB functionality.</li>\n<li>\n<strong>Setting Name</strong>: Enter a name for your PAB instance.</li>\n<li>\n<strong>Icon</strong>: Upload your own custom icon for the PAB. If you do not upload a custom icon, the default PAB icon will be used. To learn more about the image requirements for the icon, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360021256614.html'>Change the Phish Alert Button (PAB) Icon</a> article. If you have previously installed the PAB and this is your first time adding a custom icon, you will need to reinstall the PAB for the change to occur.</li>\n<li>\n<strong>License Key</strong>: This field displays the license key associated with this PAB instance. Use the license key to install the PAB on your workstations. If you are using Google Apps with the Google Workspace Chrome extension, your license key is automatically built into your config.json file.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>A two-digit environment indicator is included at the beginning of the PAB license key to specify which environment the license key is from, such as the US, EU, CA, etc. The environment indicator is not available for the PAB for HCL Domino (formerly Lotus Domino).</div>\n</div>\n</li>\n<li>\n<strong>Email Format</strong>: Select how forwarded emails from the PAB should be formatted.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>This feature is only available for the EXE and Hybrid PABs.</div>\n</div>\n</li>\n<li>\n<strong>Send Non-Simulated Emails to:</strong> If a user reports a non-simulated email, you can send a copy of this email to specific users in your organization. To send these users a copy of these emails, enter the users' email addresses in this field. Email addresses must be separated by commas. Any simulated emails will not be forwarded.</li>\n<li>\n<strong>Add PhishER Email Address</strong>: Click this button to add the first reporting email address from your PhishER account in the <strong>Send Non-Simulated Emails to:</strong> field.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you set up an account with PhishER already enabled, the reporting email address will be automatically entered in the field. If you would like to remove this email address from the list, click the <strong>Remove PhishER Email Addresses</strong> button.</div>\n</div>\n</li>\n<li>\n<strong>Send Us a Copy</strong>: Enable this setting to send a copy of reported non-simulated phishing emails to KnowBe4 analysis. This email will include the original email header. We can use these emails to create phishing templates to use in future simulated phishing attacks. To learn more about sharing emails with us, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360024367893.html'>Share Reported Phishing Emails with KnowBe4 Using the Phish Alert Button (PAB)</a> article.</li>\n</ol>\n<h3 id='h_01JNS89STSK51NMZHMPS7QJDVJ'>PAB Specific Settings</h3>\n<p>The settings below will allow you to customize the PAB and will vary based on the PAB version you select.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Specific+Settings.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Specific+Settings.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<p><strong>Limit CRID Validation</strong>: Enable this setting to allow a reported email with any Campaign Recipient ID (CRID) header to be classified as a simulated phishing email, without additional validation checks.</p>\n<p>By default, this setting is disabled, which means the PAB will use CRID validation to detect whether an email is a simulated phishing email. CRID validation checks if an email has a valid Campaign Recipient ID (CRID) header, if it is reported for the first time within the past hour, and if it is reported from the same account where the PAB was installed.</p>\n<p>A simulated phishing email will be deleted and only shown as reported in the KSAT console instead of being forwarded to PhishER. The PAB for HCL Domino (formerly Lotus Domino) does not use CRID validation.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Enabling this setting is not recommended. However, you can enable this setting if CRID validation is causing simulated phishing emails to be reported as non-simulated phishing emails.</div>\n</div>\n</li>\n<li>\n<strong>Ignore Training Notifications: </strong>Enabling this setting will prevent the PAB from reporting any training email with a valid training notification ID (TNID). This feature is only available for the EXE, Gmail Add-on, Hybrid, and Microsoft Ribbon PABs. When your users report a training email with this setting enabled, the email will remain in their inbox, and they’ll receive the pop-up window shown below. See the <strong>Response when the user reports a training email:</strong> field in the language settings section for details on how to customize the text displayed to your users.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB/M365/EN/Ignore_Training_Notifications_Popup.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB/M365/EN/Ignore_Training_Notifications_Popup.png' alt=''> </a></p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>The TNID will remain valid for the shortest of these three durations: two weeks after a user receives the training notification email, the duration of the training enrollment plus one week, or 48 hours after a training notification is reported. Once the TNID expires, training emails will be treated as non-simulated emails when reported.</div>\n</div>\n</li>\n<li>\n<strong>Enable Microsoft 365 Defender Integration</strong>: Select this check box if you would like to send a copy of reported emails to Microsoft's <strong>Submissions</strong> page. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/17538935276051.html'>Integrate Microsoft Defender for Office 365 with the Phish Alert Button (PAB)</a>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you enable this setting but don’t enable the <strong>Allow users to leave comments and disposition</strong> setting, your users can only select the <strong>Phishing or Suspicious</strong> or <strong>Spam or Junk</strong> disposition for reported emails.</div>\n</div>\n</li>\n<li>\n<strong>Submit Reported Emails to</strong>: Enter the email address associated with your Microsoft account’s <strong>Submissions</strong> page and SecOps mailbox.</li>\n<li>\n<strong>Save a copy of reported emails</strong>: Select this check box if you would like the PAB to save a copy of reported emails in the Sent folder of the user who reported them.</li>\n<li>\n<strong>Autofill Phishing Languages with PAB Locale</strong>: If you enable this setting, the PAB will autofill your users' profiles with their preferred phishing languages if that field is blank. For more information on how to set individual user languages, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360060622513.html'>Localization Guide</a>.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>This feature is only available for the EXE, Hybrid, and Microsoft Ribbon PABs.</div>\n</div>\n</li>\n<li>\n<strong>Enable Email Forwarding</strong>: If you enable this setting, you will be able to forward emails to services that require email forwarding, such as Proofpoint. Enabling this setting will also automatically change the <strong>Email Format</strong> setting to MSG. Enter any additional forwarding email addresses in the <strong>Send Non-Simulated Emails to: </strong>field.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>This feature is only available for the EXE and Hybrid PABs.</div>\n</div>\n</li>\n<li>\n<strong>Exclude original body text from reported emails (Hybrid PAB, Gmail Add-on PAB, Microsoft Ribbon PAB, and PAB for Outlook Only)</strong>: Select this check box to exclude the body text in the copy of reported emails. The original body text will only be included in the attached EML or MSG file.</li>\n<li>\n<strong>Send email headers as TXT attachments</strong>: Select this check box if you would like to include the headers of the reported message in a text (.TXT) file attachment.</li>\n<li>\n<strong>Add the reported message's headers to the forwarded message's body:</strong> When your users report a non-simulated email, the message headers will be added to the forwarded message's body. This requires that you have a forwarding address in the <strong>Send Non-Simulated Emails to:</strong> section of your PAB settings.</li>\n<li>\n<strong>Allow users to leave comments and disposition</strong>: Enable this setting to allow your users to add comments and decide the disposition of an email when they use the PAB. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4410882366611.html'>Phish Alert Button (PAB) User Comments and Email Disposition Guide</a>.</li>\n<li>\n<strong>Disable Unknown Email Disposition</strong>: Select this check box if you would like to exclude the <strong>Unknown</strong> disposition from options your users can choose when they use the PAB.</li>\n<li>\n<strong>Default Disposition</strong>: Select a disposition option to set as the default disposition for your PAB instance. The default disposition is the option that will be displayed as selected when users click the PAB.</li>\n<li>\n<strong>Send Dispositioned Emails to</strong>: Enter the additional forwarding email addresses based on the reported email's disposition in the disposition fields below. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4410882366611.html'>Phish Alert Button (PAB) User Comments and Email Disposition Guide</a>.</li>\n</ol>\n<h3 id='h_01JNS8TQFE1BPXNWC5HWCWFW31'>Language Settings</h3>\n<p>This section of the settings will allow you to modify the language settings and messages displayed to your PAB users.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Language+Settings.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Language+Settings.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Add Language</strong>: Click this button to add additional languages to your PAB instances. This feature is only compatible with specific versions of the PAB. To see if your version of the PAB is compatible with the additional languages feature, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360053756533.html'>Phish Alert Button (PAB) Language Aware Feature Guide</a>.</li>\n<li>\n<strong>Language drop-down menu</strong>: From the drop-down menu, select a language you would like to use for the PAB instance.</li>\n<li>\n<strong>Make Default</strong>: Select this check box to set this language as the default language for your PAB instance.</li>\n<li>\n<strong>Forwarded Email Prefix</strong>: This prefix will be added before the original subject line when a non-simulated phishing email is forwarded to the recipients you set in the <strong>Send Non-Simulated Emails to:</strong> field.</li>\n<li>\n<strong>Confirmation Message</strong>: This message will be displayed to users after they click the PAB. By default, this message asks the user to confirm whether or not they want to report the email. This field has a maximum of 255 characters.</li>\n<li>\n<strong>Button Text</strong>: This is the text that will appear on the PAB in the user's email client.</li>\n<li>\n<strong>Button Group Text</strong>: This is the text that will appear under the PAB in the user's email client.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/phish_alert/PABIconText.png'><img src='https://helpimg.s3.amazonaws.com/phish_alert/PABIconText.png' alt=' '></a></p>\n</li>\n<li>\n<strong>Show a response when the user reports a non-simulated phishing email</strong>: If you enable this setting, the user will see this message when they report a non-simulated phishing email. This field has a maximum of 469 characters for the EXE PAB and 500 characters for the Hybrid PAB.</li>\n<li>\n<strong>Show a response when the user reports a phishing security test email</strong>: If you enable this setting, the user will see this message when they report a simulated phishing email. This field has a maximum of 469 characters for the EXE PAB and 500 characters for the Hybrid PAB.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>This feature is not available for the free PAB.</div>\n</div>\n</li>\n<li>\n<strong>Response Duration __ seconds</strong>: Set the length of time the email response messages appear on the screen. The maximum duration is 60 seconds.</li>\n<li>\n<strong>Response when the user reports a training email: </strong>If you enabled the <strong>Ignore Training Notifications</strong> setting, users will see this message when they report a KnowBe4 training email. This field can have a maximum of 469 characters for the EXE PAB and 500 characters for the Hybrid PAB. This setting also includes its own separate <strong>Response Duration</strong>, which is set to 10 seconds by default and has a maximum duration of 60 seconds.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>The Microsoft Ribbon PAB is not affected by response duration, and the response message will remain open until it is closed or the confirmation is clicked.</div>\n</div>\n</li>\n<li>\n<strong>Comments and Disposition Settings</strong>: Enter your own text to customize the labels and descriptions for the PAB dispositions. If you do not customize the dispositions, the default text will be used. To display the disposition descriptions to your users, turn on the toggles next to the disposition label fields. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4410882366611.html'>Phish Alert Button (PAB) User Comments and Email Disposition Guide</a>.</li>\n</ol>\n<h3 id='h_01JNS92AP77GQEDCVVY6MMV2V1'>Download and Permissions</h3>\n<p>The settings below allow you to view documentation, download the PAB manifest file, and authorize permissions.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Download+and+Permissions.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Download+and+Permissions.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Save Phish Alert Settings</strong>: Click this button to save any changes made to your PAB settings.</li>\n<li>\n<strong>View Guide</strong>: Click this button to open the product manual for the selected version of the PAB.</li>\n<li>\n<strong>Download</strong>: Click this button to download the installation, manifest, or configuration file for the selected version of the PAB. One of the following files will be downloaded:\n<ol type='a'>\n<li>PhishAlertButtonSetup.exe (<strong>EXE PAB</strong>)</li>\n<li>PhishAlertManifest.xml (<strong>PAB manifest for Microsoft products</strong>)</li>\n<li>PhishAlertManifestMSR.xml (<strong>Microsoft Ribbon Phish Alert Button</strong>)</li>\n<li>Phish_alert_configuration.json (<strong>Chrome Extension PAB config file</strong>)</li>\n</ol>\n</li>\n<li>\n<strong>Accept Microsoft Permissions to Authorize GRAPH APIs for the PAB</strong>: Click this button to open the Microsoft 365 page. Then, review and accept the permissions to authorize the PAB to use Microsoft's Graph APIs.</li>\n<li>\n<strong>Authorize NAA-SSO for GRAPH APIs:</strong> Click this button to open the Microsoft 365 page. Then, review and accept the permissions to authorize the PAB to use Microsoft's Nested App Authentication (NAA-SSO).\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you select the Gmail PAB add-on version, the following button will be displayed.<br><strong>Send Gmail PAB Add-on Magic Mail</strong>: Click this button to send activation emails to your users using Magic Mail. For more information, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360047563854.html'>Sending Activation Emails Using Magic Mail</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360047563854.html'>Gmail Phish Alert Button (PAB) Add-on Product Manual</a>.</div>\n</div>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>All settings, except <strong>Enable Phish Alert</strong> and <strong>Send Non-Simulated Emails to:</strong>, will be applied to the mail client once it has restarted. The updated settings for the <strong>Send Non-Simulated Emails to:</strong> option will be applied once a user clicks the PAB to report an email.</div>\n</div>\n</li>\n</ol>\n<h2 id='iv_01H8CHZ6DEHWQMH6V9EF7J22XX'>PAB Installation Guides</h2>\n<p>Installation of the PAB depends on the mail environment in your organization. Our PAB installation guides are listed below:</p>\n<ul>\n<li>\n<a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/14701808484627.html'>Hybrid Phish Alert Button Product Manual</a>\n<ul>\n<li>This product manual is for the hybrid PAB for Microsoft 365 and Microsoft Exchange</li>\n</ul>\n</li>\n<li><a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360047563854.html'>Gmail Phish Alert Button Add-On Product Manual</a></li>\n<li><a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/7142051893011.html'>Microsoft Outlook (EXE Version) Phish Alert Button Product Manual</a></li>\n<li><a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115004304108.html'>Google Workspace (Chrome) Phish Alert Button Product Manual</a></li>\n<li><a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/26106205842707.html'>Microsoft Ribbon Phish Alert Button Product Manual</a></li>\n</ul>\n<p>In addition to our installation guides, you can review our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500011951662.html'>Phish Alert Button (PAB) Compatibility Matrix</a> to determine which PAB is right for your organization.</p>\n<h2 id='iv_01H8CHZ6DE8H1KER71H1Z8HMTK'>Multiple PAB Instances</h2>\n<p>You can set up multiple instances of the PAB for your organization. Setting up multiple instances allows you to define unique settings for specific users, such as prompt messages or additional languages. When you add a PAB instance, you will receive an additional license key and you can customize the instance's settings.</p>\n<p>To set up multiple PAB instances, see the articles below:</p>\n<ul>\n<li>\n<a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115012103388.html'>Set Up Multiple Phish Alert Button (PAB) Instances</a>\n<ul>\n<li><a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115013625907.html'>Multiple Phish Alert Button Instances (Multi-PAB): Microsoft 365/Exchange</a></li>\n<li><a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115015961087.html'>Multiple Phish Alert Button Instances (Multi-PAB): Chrome/Google Workspace</a></li>\n</ul>\n</li>\n</ul>\n<h2 id='iv_01H8CHZ6DEXNAR717CR1T2QN1Y'>PAB Reporting</h2>\n<p>The PAB is available for both free and paid KnowBe4 accounts. The PAB offers additional information about your users' clicks based on your account type.</p>\n<ul class='js-toggles'>\n<li title='Free Account'>\n<p>If you have a free account, your console Dashboard will display a graph that tracks how many phishing emails your users have reported. You can download a CSV file of this data, which will include the date and number of times your users clicked the PAB.</p>\n</li>\n<li title='Paid Account'>\n<p>If you have a paid account, your Dashboard will display a graph that tracks how many phishing emails your users have reported. You can download a CSV file that includes the following data: the date, the number of times the PAB was used, and whether the emails were simulated or non-simulated.</p>\n<p>You can see which phishing emails a user reported in their user profile area, as well as on the <strong>Users</strong> tab of any phishing campaign in the console.</p>\n</li>\n</ul>\n<h2 id='iv_01H8CHZ6DEYY9CKHYVHGK420PM'>PAB User Activity</h2>\n<p>You can see which of your users are reporting messages with the PAB by navigating to <strong>Account Integrations</strong> &gt; <strong>Phish Alert </strong>&gt;<strong> See PAB User Activity</strong>.</p>\n<p>From your <strong>Account Settings</strong>, you can view the <strong>PAB User Activity</strong> page. This page includes data such as when your users last used the PAB and how many times they've used the PAB. To see the PAB User Activity page, follow the steps below:</p>\n<ol>\n<li>In your KSAT console, click your email address at the top-right corner of the page and select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Integrations</strong> &gt; <strong>Phish Alert</strong>.</li>\n<li>Click <strong>See PAB User Activity</strong>. Once you click this link, the page will open.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phish_alert/SeePABUserActivity.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/phish_alert/SeePABUserActivity.png' alt='See PAB User Activity'></a></p>\n</li>\n</ol>\n<p>The <strong>PAB User Activity</strong> page displays each user's email address along with their PAB instance, activity, and the globally unique identifier (GUID) for their workstation. The <strong>Latest Activity</strong> column displays the date and time when the user last used the PAB. The <strong>Activity Count</strong> column displays the total number of times the user has used the PAB.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/phish_alert/PABUserActivity.png'><img src='https://helpimg.s3.amazonaws.com/phish_alert/PABUserActivity.png' alt='PAB User Activity'></a></p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/phish_alert/getstarted_button.png",
      "alt": "This image displays a promotional banner for a security application add-in, structured into a header and body section separated by a horizontal rule.\n\n**Header Section:**\n*   **Icon:** An orange silhouette of a fishing hook (phishing symbol).\n*   **Text:** Bold, black text reads \"Free Phish Alert Button Add-in.\"\n\n**Body Section (Description and Action):**\n*   **Description Text:** Two lines of text explaining the add-in's function:\n    *   \"The Phish Alert Button add-in gives your users a safe way to forward email threats to the security team for analysis.\"\n    *   \"The email is deleted from the user's inbox to prevent future exposure.\"\n*   **Call-to-Action (CTA):** A blue rectangular button positioned on the right edge.\n*   **Button Text:** White text centered on the CTA reads \"Get Started.\"",
      "position": 1,
      "context": "step 4 for further instructions"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/phish_alert/AccountIntegrations.png",
      "alt": "This image displays a vertical navigation menu within the \"Account Settings\" section of a user interface.\n\n**Header:** The section is titled \"**Account Settings**,\" prefixed by an orange gears icon.\n\n**Navigation Structure:** The menu consists of primary links displayed in blue text, followed by a right-pointing chevron indicator (`>`), except for the expanded section.\n\n*   **Primary Links (Collapsed):**\n    *   Account Information\n    *   User Management\n    *   Phishing\n    *   Training\n*   **Expanded Primary Link:**\n    *   **Account Integrations:** This link is expanded, indicated by a blue-outlined box containing a downward chevron (`∨`).\n*   **Secondary Links (Sub-menu under Account Integrations):** The following links are indented and displayed in black text:\n    *   SAML\n    *   Phish Alert\n    *   API\n    *   PhishER\n    *   Second Chance\n\n**Annotation:** A large, solid orange arrow points from the right margin directly toward the \"**Phish Alert**\" secondary menu item.\n\n**Footer:** The bottom of the visible menu includes the centered text link, \"**Expand All**.\"",
      "position": 2,
      "context": "/li>\nNavigate to Account Integrations > Phish Alert."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/phish_alert/PhishAlertInstance.png",
      "alt": "The image displays a section of a user interface dedicated to \"Phish Alert\" configuration.\n\n**UI Elements and Text:**\n\n1.  **Title:** The primary header is \"Phish Alert.\"\n2.  **Feature Toggle:** A toggle switch, currently in the \"Enabled\" (blue) position, is labeled \"Enable Phish Alert.\"\n3.  **Activity Link:** To the right of the toggle, a blue link with an eye icon reads \"See PAB User Activity.\"\n4.  **Settings Context:** A white card structure is partially visible below the toggle, containing a blurred field followed by the text \"Settings,\" indicating an existing configuration instance.\n5.  **Call to Action (Button):** A button with a light border and blue text is labeled \"+ Add Phish Alert Instance.\" The button text is preceded by a plus sign icon.\n\n**Annotation:**\n\nAn overlaying orange directional arrow points directly toward the \"+ Add Phish Alert Instance\" button.",
      "position": 3,
      "context": "12103388.html'>Set Up Multiple Phish Alert Button (PAB) Instances article."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/Phish+Alert+Settings.png",
      "alt": "The image displays a configuration screen titled **\"Phish Alert,\"** detailing settings for a Phish Alert Button (PAB) feature.\n\n**Key UI Elements and Configuration Fields:**\n\n1.  **Enablement and Activity:** The screen features a prominent, active toggle switch (**a**) labeled \"Enable Phish Alert.\" A link, \"See PAB User Activity,\" is present adjacent to the toggle.\n2.  **PAB Version Selection:** Within the collapsible \"Settings\" panel, the user configures the PAB version via a dropdown menu labeled \"Select PAB Version.\" The selected value (**b**) is \"Hybrid PAB.\" A button (**c**) labeled \"Set as Default\" is provided, accompanied by a help icon.\n3.  **Metadata and Icon:**\n    *   An input field (**d**) is available for \"Setting Name\" (content obscured).\n    *   An \"Icon\" field allows uploading an image (\"Choose a file or drop it here...\"), with a \"Browse\" button. A placeholder icon (**e**) depicting an envelope with a fishhook is displayed.\n    *   A \"License Key\" input field (**f**) is present (content obscured).\n4.  **Email Routing and Format:**\n    *   **Email Format (g):** Radio buttons allow selection between two formats: \"EML\" (selected) and \"MSG.\"\n    *   **Routing (h):** An input field is available to specify recipients for \"Send Non-Simulated Emails to\" (content obscured), with instructions to \"Separate multiple email addresses with a comma.\"\n    *   An action link (**i**), \"Add PhishER Email Address,\" is available above the routing field.\n    *   A final toggle switch (**j**) labeled \"Send Us a Copy\" is currently disabled.",
      "position": 4,
      "context": "e screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Specific+Settings.png",
      "alt": "This image displays a set of configuration options, primarily utilizing blue ON/OFF toggles and text input fields, related to email reporting, disposition, and forwarding integration.\n\n**Configuration Toggles (Left Column):**\n\n1.  **Limit CRID Validation** (Toggle ON, Question mark icon).\n2.  **Enable Microsoft 365 Defender Integration** (Toggle ON, Question mark icon).\n3.  **Submit Reported Emails to** (Text Input Field, currently empty).\n4.  **Save a copy of reported emails** (Toggle ON, Question mark icon).\n5.  **Enable Email Forwarding** (Toggle ON).\n6.  **Send email headers as TXT attachments** (Toggle ON, Question mark icon).\n7.  **Allow users to leave comments and disposition** (Toggle ON).\n8.  **Disable Unknown Email Disposition** (Toggle OFF/Inactive).\n\n**Configuration Toggles (Right Column):**\n\n1.  **Ignore Training Notifications** (Toggle ON, Question mark icon).\n2.  **Autofill Phishing Languages with PAB Locale** (Toggle ON, Question mark icon).\n3.  **Exclude original body text from reported emails** (Toggle ON, Question mark icon).\n4.  **Add the reported message's headers to the forwarded message's body** (Toggle ON).\n\n**Default Disposition Settings:**\n\n1.  **Default Disposition** Header followed by a three-option tab selector:\n    *   **Phishing or Suspicious** (Active/Dark grey state).\n    *   **Spam or Junk** (Inactive state).\n    *   **Unknown** (Inactive state).\n\n**Dispositioned Email Forwarding:**\n\n1.  **Send Dispositioned Emails to** (Section Header). This section contains three distinct email input fields, each requiring comma-separated addresses:\n    *   **Phishing or Suspicious** (Empty input field).\n    *   **Spam or Junk** (Empty input field).\n    *   **Unknown** (Empty input field).\n\nEach input field includes the helper text: \"Separate multiple email addresses with a comma.\"",
      "position": 5,
      "context": "the PAB version you select."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB/M365/EN/Ignore_Training_Notifications_Popup.png",
      "alt": "This image displays a modal dialog overlaying an active email client interface, indicating the user attempted to report a simulated phishing attempt.\n\n**Foreground Element (Modal Dialog):**\n\n*   **Title Bar:** \"Phish Alert\"\n*   **Controls:** A standard close 'X' icon is visible in the upper right corner.\n*   **Body Text:** \"This is a training email from your organization. If you believe this is a mistake, please contact your security team.\"\n*   **Action Button:** A single, blue, active button labeled \"Ok\" is positioned in the bottom right corner of the dialog.\n\n**Background Context (Email Client UI):**\n\nThe background shows a heavily blurred email application layout (likely a web interface) with a focused task pane on the right side.\n\n*   **Task Pane Header:** Includes the text \"KnowBe4\" and a purple button labeled \"GRAPH.\"\n*   **Reporting Query:** \"Are you sure you want to report this as a phishing email?\"\n*   **Email Context:** The subject line is listed as \"Subject: Please complete your assigned training.\"\n*   **Classification Options:** A section titled \"Email Classification:\" provides two radio button choices:\n    *   The first option, **\"Phishing or Suspicious\"** (\"I think this email is suspicious.\"), is currently selected.\n    *   The second option is \"Spam or Junk\" (\"I think this email is spam.\").",
      "position": 6,
      "context": "r details on how to customize the text displayed to your users."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Language+Settings.png",
      "alt": "This interface displays configuration settings for localized text, automated responses, and user comment labels related to an email reporting mechanism.\n\n### Languages Settings\n\nThis section manages the localization of the reporting tool. The current default language is \"English (United States)\".\n\n*   **Language Selection (b, c):** A dropdown selects the language (\"English (United States)\"). A checkbox allows the language to be set as \"Make Default\" (c).\n*   **Action (a):** A link for \"Add Language\" is present in the top right corner (a).\n*   **Custom Text Fields (d, e, f, g):**\n    *   **Forwarded Email Prefix (d):** Set to `[Phish Alert]`.\n    *   **Confirmation Message (e):** Set to `Are you sure you want to report this as a phishing email?`.\n    *   **Button Text (f):** Set to `Phish Alert`.\n    *   **Button Group Text (g):** Set to `KnowBe4`.\n\n### Phishing Settings\n\nThis section configures the automated responses displayed after a user reports an email.\n\n*   **Non-Simulated Phishing Response (h):** Enabled via toggle. The response text (h) is: `Thank you for reporting this email to your security team. Because of people like you, our company is more secure!`.\n*   **Simulated Phishing Test Response (i):** Enabled via toggle. The response text (i) is: `Congratulations! The email you reported was a simulated phishing attack initiated by your company. Good job!`.\n*   **Response Duration (j):** Set to `3 seconds` for phishing security test responses.\n\n### Training Settings\n\n*   **Training Email Response (k):** The response text (k) is: `This is a training email from your organization. If you believe this is a mistake, please contact your security team.`.\n*   **Response Duration:** Set to `10 seconds`.\n\n### Comments and Disposition Settings (l)\n\nThis section defines the labels and default descriptions available for users when they comment on the reported email. Toggles are enabled to \"Display [Label] Description\" for all categories.\n\n| Category | Label Text | Description Text |\n| :--- | :--- | :--- |\n| **Phishing or Suspicious** | `Phishing or Suspicious` | `I think this email is suspicious.` |\n| **Spam or Junk** | `Spam or Junk` | `I think this email is spam.` |\n| **Unknown** | `Unknown` | `I'm not sure how to categorize this email.` |",
      "position": 7,
      "context": "isplayed to your PAB users."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/phish_alert/PABIconText.png",
      "alt": "The image depicts a security reporting user interface module, typically representing the KnowBe4 Phish Alert Button (PAB).\n\n**UI Element Details (Left Panel):**\n*   **Context:** A vertically oriented module or button with a light gray background.\n*   **Iconography:** A black line-art icon of an open envelope containing a document. This icon is overlaid by a prominent orange fishing hook, symbolizing phishing activity.\n*   **Text (Primary):** The title \"Phish Alert\" is displayed in dark gray text across two lines.\n*   **Text (Branding):** The vendor name \"KnowBe4\" is displayed beneath the title in a smaller font size.\n\n**Annotation (Right Panel):**\n*   The UI element is juxtaposed against a solid black background.\n*   A large, thick, orange curved arrow (U-shape) with arrowheads on both ends is positioned to the right, directing attention back toward the text and icon module.",
      "position": 8,
      "context": "n Group Text: This is the text that will appear under the PAB in the user's email client."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/Phish-Alert/EN/PAB+Download+and+Permissions.png",
      "alt": "This image displays a section of a technical configuration interface, likely related to phishing alert settings and Microsoft/API integrations.\n\n**UI Elements and Text (Annotated):**\n\n*   **(a) Save Button:** A primary, rectangular blue button labeled **\"Save Phish Alert Settings\"**.\n*   **Plain Text Description:** The heading **\"Microsoft Ribbon Phish Alert Button (PhishAlertManifestMSR.xml)\"** is displayed, indicating the component being configured.\n*   **(b) View Guide Link:** A hyperlink preceded by a book icon, labeled **\"View Guide\"**.\n*   **(c) Download Link:** A hyperlink preceded by a downward arrow icon, labeled **\"Download\"**.\n*   **(d) Authorization Link 1:** A blue hyperlink labeled **\"Accept Microsoft Permissions to Authorize GRAPH APIs for the PAB\"**.\n*   **(e) Authorization Link 2:** A blue hyperlink labeled **\"Authorize NAA-SSO for GRAPH APIs\"**.\n\n**Context:**\n\nThe section provides options for configuring a Phish Alert Button (PAB), including saving configuration changes, accessing documentation (View Guide), downloading a configuration file (`PhishAlertManifestMSR.xml`), and performing two separate authorization steps involving Microsoft Permissions, GRAPH APIs, and NAA-SSO (Single Sign-On).",
      "position": 9,
      "context": "thorize permissions."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/phish_alert/SeePABUserActivity.png",
      "alt": "",
      "position": 10,
      "context": "Once you click this link, the page will open."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/phish_alert/PABUserActivity.png",
      "alt": "",
      "position": 11,
      "context": "tivity Count column displays the total number of times the user has used the PAB."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "alert",
      "manual",
      "pab",
      "phish",
      "product"
    ],
    "image_count": 11
  }
}