{
  "article": {
    "id": 230054448,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/230054448.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/230054448.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 5,
    "vote_sum": -1,
    "vote_count": 15,
    "section_id": 8816697205267,
    "created_at": "2016-10-14T21:37:10Z",
    "updated_at": "2025-03-11T16:52:50Z",
    "name": "KnowBe4 Home Internet Security Awareness Course Overview",
    "title": "KnowBe4 Home Internet Security Awareness Course Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T16:52:50Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "training",
      "home course",
      "kmsat",
      "home",
      "homecourse",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>Our Home Internet Security Awareness Course is slightly different than the Security Awareness Training Courses we offer, in that it also focuses on home security. The course was designed to help protect families from social engineering attacks at home or in the office.</p>\n<div class='callout-note'><div class='callout__content'>\n<strong>Note:</strong>If you've purchased the KnowBe4 Home Internet Security Awareness Course course and you're not sure how to access it, contact your Customer Success Manager or the KnowBe4 support team and they will be able to assist you. You can submit a support ticket by <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener'>clicking here</a>.</div></div>\n<p>Below you'll find commonly-asked questions about our Home Course, as well as a sample email you can use to distribute the Home Course to your users.</p>\n\n<h2 id='h_01HS92ASTDA98VWFHZRGXZBBMW'>Home Course Email Template</h2>\n<p>Below you'll find a sample email you can send to your end users when distributing the Home Course information. Be sure to review the following text and change any text in brackets to personalize the template prior to sending.</p>\n<p><em>Hi All,</em></p>\n<p><em> We have access to a free Home Internet Security Course available for you and your family. </em><em>This video uses real-life examples to show the dangers of the internet and what you need to do to stay safe. Each section has a live demonstration showing how the \"bad guys\" take advantage of unsuspecting users, and finishes up with a “security check” quiz at the end. </em></p>\n<p><em>To get started using the Home course, click on the link below: </em><em><strong>[URL LINK]</strong> </em><em>Enter the password <strong>[XXXX]</strong> (without quotes), then click Submit. </em></p>\n<p><em>Have fun, and remember to Stop, Look, and Think! </em></p>\n<p><em>Thank you, </em></p>\n<p><em>IT</em></p>\n\n\n<h2 id='h_01HS92ASTDZB7ETFZDGSZR1JHE'>Home Course FAQ</h2>\n<p><strong>1) Question:</strong> My KnowBe4 Account Representative said they've sent me the link to the Home Course, why haven't I received it? <strong>Answer:</strong> Check for the email in your spam folder. If you do find it there, you may want to follow our <a href='https://support.knowbe4.com/hc/en-us/articles/222800347' target='_blank' rel='noopener'>Whitelisting Emails from KnowBe4 Employees (Non-Phishing/Training)</a> article to set up a mail flow rule to prevent these types of emails from going to your spam folder.</p>\n<p><strong>2) Question:</strong> I can't find the Home Course in the ModStore to preview it. How can I preview it? <strong>Answer:</strong> Use the link and the password provided by your Account Manager/Customer Success Manager to view the course.</p>\n<p><strong>3) Question:</strong> Is user progress of this training course tracked in my KnowBe4 Security Awareness Training platform? <strong>Answer:</strong> No, user progress will not be recorded for this course. Any course added to your account from the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467-ModStore' target='_blank' rel='noopener'>ModStore</a> and assigned through a <a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Content-Management' target='_blank' rel='noopener'>training campaign</a> will track user progress in your KnowBe4 platform.</p>\n<p><strong>4) Question:</strong> Who can use the Home Course?<strong>Answer:</strong> We ask that you limit providing this password to your employees, their families, and your organization's board members.</p>\n<p><strong>5) Question:</strong> Why don't we use this course as security awareness training for all employees?<strong>Answer:</strong> The Home Course is great for your employees and their family members, but we offer more comprehensive training with your KnowBe4 subscription.Contact your Customer Success Manager for more information on the training available with your subscription. </p>\n\n<p><em>Still have questions? For details such as supported browsers and the length of the Home Course, see our additional set of FAQs, <a href='https://home.knowbe4.com/home-frequently-asked-questions/' target='_blank' rel='noopener'>here</a>.</em></p>\n",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/230054448-KnowBe4-Home-Internet-Security-Awareness-Course-Overview",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "awareness",
        "course",
        "home",
        "internet",
        "overview",
        "security"
      ],
      "image_count": 0
    }
  }
}