{
  "article": {
    "id": 28682011883155,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/28682011883155.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/28682011883155.html",
    "author_id": 10164786027,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 4,
    "section_id": 4406921551379,
    "created_at": "2024-04-22T21:03:17Z",
    "updated_at": "2024-09-30T19:37:46Z",
    "name": "Student Edition Guide",
    "title": "Student Edition Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-09-30T19:37:42Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p>One of the top factors in securing your organization is empowering students to spot and navigate cybersecurity threats. Our KnowBe4 Student Edition training prepares students to navigate the digital world safely and responsibly. They will develop intelligent habits useful for your school and their future profession.</p>\n<p>For best results, we recommend running a student campaign once a semester. Use the links below to get started.</p>\n<h2 id='h_01HW5PHX82EN35F2N12428CWJW'>Finding Student Edition Training Content</h2>\n<p>Before creating a training campaign, you must select the content to include. First, find Student Edition content in the ModStore. Then, add the desired content to your account’s library.</p>\n<p><img src='https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/Browse_StudentEdition_Badges.png'></p>\n<p>If you are browsing the ModStore, look for items with the orange KnowBe4 Student Edition badge under the title. If you would like to search for Student Edition content specifically, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to the <strong>ModStore</strong> tab.</li>\n<li>On the <strong>Browse</strong> subtab, click on <strong>Additional Filters</strong>.</li>\n<li>From the Subscription Level drop-down menu, select KnowBe4 Student Edition to browse all content specific to the Student Edition add-on.</li>\n<li>If you find the content you want to use, you can hover your cursor over the image and click <strong>View Details</strong> for more information. On the item details page, you can read the full content description and view the content.</li>\n<li>To add the content to your library, click the <strong>+ Add to Library</strong> button. Once added, the content will be listed in the <strong>Library</strong> subtab beneath the <strong>ModStore</strong> tab.<br>\n<ul>\n<li>If an item shows the <strong>Already Added</strong> tag, it is already available in your library and does not have to be added.<img src='https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/SE_ItemDetails_AddToLibrary.png'>\n</li>\n</ul>\n</li>\n</ol>\n<p>Once you have added all of the Student Edition training you would like to your library, you can move on to <a href='#h_01HW5PQ0RR027PJYDV6ERGCH5G'>Creating a Student Edition Training Campaign</a>.</p>\n<h2 id='h_01HW5PQ0RR027PJYDV6ERGCH5G'>Creating a Student Edition Training Campaign</h2>\n<p>Once you have added content to your library, you can create a student training campaign. While logged in to your KSAT console, navigate to the <strong>Training</strong> tab. Then, click the <strong>+Create Training Campaign</strong> button in the top-right corner of the page.</p>\n<p><img src='https://helpimg.s3.amazonaws.com/modstore/StudentEdition_NewCampaignButton.gif' width='678' height='523'></p>\n<p>On the campaign creation screen that opens, use the list below to create a student campaign with our recommended settings.</p>\n<ol>\n<li>\n<strong>Campaign Name</strong>: Name your campaign something descriptive, such as \"Student Cybersecurity Training\".\n<ul>\n<li>This name will be seen by both admins and users completing the training.</li>\n</ul>\n</li>\n<li>\n<strong>Start Date</strong>: Select when you would like this campaign to run.</li>\n<li>\n<strong>End Date</strong>: Select Relative Duration and use the default duration of three weeks.</li>\n<li>\n<strong>Allow assignments to be completed after due date</strong>: Select this check box.</li>\n<li>\n<strong>Content</strong>: From the drop-down menu, select each of the training assignments you would like to include in this campaign.<br>\n<ul>\n<li>In this menu, you can scroll vertically and horizontally as well as sort the list by each header. You can also type a keyword into the field to filter content (click to view). <img src='https://helpimg.s3.amazonaws.com/training+course+mgmt/ContentDrop-DownMenu.gif'>\n</li>\n<li>Once you have selected the desired content, click out of the menu to view your content list. To reorder this list, click and drag the titles you want to move.</li>\n</ul>\n</li>\n<li>\n<strong>Enable Content Survey</strong>: We recommend selecting this check box so that users will be prompted to take a survey after each assignment they complete. This setting is optional, but enabling surveys will help you keep in touch with users and see the effectiveness of your training strategy.</li>\n<li>\n<strong>Track Scores</strong>: Select this check box. This option saves each of the user's scores for later review.</li>\n<li>\n<strong>Enroll Groups</strong>: Select <strong>Specific User</strong>. Then, select your student user group from the drop-down menu to enroll in this campaign. For more information about managing users and user groups, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974-User-Profile-Guide'>User Profile Guide</a>.</li>\n<li>\n<strong>Enable automatic enrollment for new users</strong>: Select this check box. This option ensures that any users who are added to the selected groups at a later date will be enrolled in this training. </li>\n<li>For more information about managing users, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974-User-Profile-Guide'>User Profile Guide</a>.</li>\n<li>\n<strong>Enable progress reset for remedial training</strong>: This option is only recommended for remedial training campaigns. So, be sure that this check box is not selected.</li>\n</ol>\n<h3 id='h_01HW62QN544PJ8WAXANQP87E4V'>Notifications</h3>\n<p>We recommend creating notifications to welcome enrolled users and to remind them of the upcoming due date.<br>To create a welcome notification, follow the steps below: <img src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_WelcomeNotif.png' width='501' height='313'></p>\n<ol>\n<li style='list-style-type: none;'>\n<ol>\n<li>Click the <strong>+Add Notification</strong> button.</li>\n<li>From the <strong>Notification Type</strong> drop-down menu, select <strong>Welcome</strong>.</li>\n<li>Select each check box next to <strong>User</strong>, <strong>Manager</strong>, and <strong>Admin</strong>.</li>\n<li>Keep the default templates selected in the drop-down menus next to each recipient type.</li>\n<li>Click the <strong>Save</strong> button.</li>\n</ol>\n</li>\n</ol>\n<h3 id='h_01HW62RHTTCXVCHPVW0WDQ17QR'>Due Date Reminder</h3>\n<p>To create a due date reminder, follow the steps below: <img src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_DueDateNotif.png' width='501' height='421'></p>\n<ol>\n<li>Click the <strong>+Add Notification</strong> button.</li>\n<li>From the <strong>Notification Type</strong> drop-down menu, select <strong>Remind Before Due Date</strong>.</li>\n<li>Keep the default number of days before the due date.</li>\n<li>Check each check box next to <strong>User</strong>, <strong>Manager</strong>, and <strong>Admin</strong>.</li>\n<li>Keep the default templates selected in the drop-down menus next to each recipient type.</li>\n<li>Click the <strong>Save</strong> button.</li>\n</ol>\n<p>Review your selected settings. When you are satisfied with the settings, click the <strong>Create Campaign</strong> button.</p>\n<p>After creating the campaign, users will be enrolled in this training on the start date. Once the campaign has started, you can move on to <a href='#h_01HW5ZRWW0NSHHC2880WH44EEZ'>Monitoring a Student Training Campaign</a>.</p>\n<h2 id='h_01HW5ZRWW0NSHHC2880WH44EEZ'>Monitoring a Student Training Campaign</h2>\n<p>Follow the steps below to check your users’ training progress, scores, and other campaign metrics.</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to the <strong>Training</strong> tab.</li>\n<li>On the <strong>Campaigns</strong> subtab, find the student training campaign that you created. Click on the campaign name.</li>\n<li>The campaign’s <strong>Overview</strong> subtab will display. On this tab, you will see a summary of the campaign, including a graph of users who have completed all of the content, the status, start date, relative duration, number of users, and more.<img src='https://helpimg.s3.amazonaws.com/modstore/StudentEdition_CampaignOverview.png' width='601' height='349'>\n</li>\n<li>Click on the <strong>Users</strong> subtab to view user progress for the entire campaign.<img src='https://helpimg.s3.amazonaws.com/modstore/StudentEdition_UserProgress.png' width='600' height='347'>\n<ul>\n<li>This page is organized by subtabs, starting with All Users, then sorted by completion status.</li>\n<li>The table is sorted alphabetically by user name. Under each user is a list of their enrolled content. To the left of the content name, you can see if the training was started, if and when it was completed, the user’s score for that module, and their current training status.</li>\n<li>To find a specific user, enter their name or email address in the Search field.</li>\n</ul>\n</li>\n</ol>\n<p>At any point during the campaign, you can download a spreadsheet of the user's progress. On the <strong>Users</strong> subtab of the campaign, click the <strong>Generate CSV</strong> button.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/28682011883155-Student-Edition-Guide",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/Browse_StudentEdition_Badges.png",
        "alt": "This image displays a horizontal row of five content cards, characteristic of a resource library interface, likely for security awareness training materials (KnowBe4 Student Edition).\n\n**Overall Structure:**\nEach card features a visual thumbnail (image or graphic) in the upper section and textual metadata and titles in the lower section. All five cards share the same status indicator: a teal horizontal bar separating the thumbnail and text, labeled \"Already Added\" with a preceding checkmark icon.\n\n**Common Metadata Elements:**\nBelow the main title, all cards include a small orange pill tag labeled \"KnowBe4 Student Edition\" with a graduation cap icon. The bottom line of each card lists the content format and includes a globe icon followed by the numeral \"1,\" indicating associated language or version count.\n\n**Card Details (Left to Right):**\n\n1.  **Title:** Your Role as a Student: Internet Security and You\n    *   **Visual:** A smiling woman working on a laptop, overlaid with a dark blue circle containing a white shielded laptop icon.\n    *   **Format:** Training Module\n2.  **Title:** Students want to know: What is Social Engineering?\n    *   **Visual:** A distressed young woman viewing a smartphone; a red background panel features three white icons: a fishing hook, footprints, and a telephone handset.\n    *   **Format:** Newsletters and Documents\n3.  **Title:** Students' Top 5 Security Awareness Fundamentals\n    *   **Visual:** A light blue background hosting a black rectangle with a thin red bar above it, displaying a white upward arrow icon and the number \"5\" (↑ 5).\n    *   **Format:** Training Module\n4.  **Title:** An Introduction to Social Engineering Red Flags for Students\n    *   **Visual:** Two students viewing a screen; central circular overlay features a white skull and crossbones flag set against a dark red background patterned with binary code.\n    *   **Format:** Training Module\n5.  **Title:** Security Culture: Students' Responsibilities\n    *   **Visual:** Two students working on a computer; the lower right corner features an orange and white diagonal pattern containing three small humanoid icons (two orange, one dark).\n    *   **Format:** Training Module",
        "position": 1,
        "context": "Then, add the desired content to your account’s library."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/SE_ItemDetails_AddToLibrary.png",
        "alt": "This image depicts a detailed product page for an educational training module, structured into contextual metadata, user actions, and a content preview pane.\n\n**1. Contextual Metadata and Details:**\nThe module is titled **\"Your Role as a Student: Internet Security and You\"** and categorized as a **\"Training Module.\"** Key metadata includes a duration of **17 minutes**, an initial publication date of **September 2023**, and a last-updated date of **February 2024.**\n\nTags identifying content properties are prominently displayed in colored \"pills\": **Brandable Content** (orange), **KnowBe4 Student Edition** (amber), and **1 Language** (amber).\n\nA brief description outlines the module's objective: helping students identify common cyber threats. The content is attributed **By KnowBe4**.\n\n**2. User Interface and Action Controls (Left Panel):**\nThe left column displays primary user interaction elements:\n*   A blue button labeled **\"View\"** with a dropdown caret.\n*   A green/teal status button indicating the content is already in the user's library: **\"✓ Already Added.\"**\n*   A link with an external icon: **\"Open in Content Manager.\"**\n\n**3. Content Preview (Media Viewer):**\nA rectangular media viewer dominates the right side, showing a screenshot or video frame from the training material.\n\n*   **Slide Content:** The frame illustrates identifying malicious communication, with overlay text reading **\"Identifying a Phishing Email\"** and bullet points: **\"Grammatical errors\"** and **\"Misspelled words.\"**\n*   **Embedded Element:** A rendered laptop screen displays a simulated email with the subject line **\"URGENT!\"** and content regarding updating a **\"financial aide system\"** to receive a refund. This fraudulent text is highlighted in a magenta box.\n*   **Player Controls:** A standard video playback bar is present at the bottom, including play/pause, volume, timeline, time elapsed (`-0:28`), playback speed (`1x`), and a fullscreen toggle. A link below the bar reads **\"Show Video Transcript.\"**\n*   **Navigation:** Small navigational arrows (chevrons) are visible both above and flanking the media viewer for iterating through content or slides.",
        "position": 2,
        "context": "subtab beneath the ModStore tab.\n\nIf an item shows the Already Added tag, it is already available in"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/modstore/StudentEdition_NewCampaignButton.gif",
        "alt": "This image displays a web application interface, specifically the **ModStore** section.\n\n**Header Navigation:**\nThe top navigation bar features multiple modules: `DASHBOARD`, `PHISHING` (with a dropdown), `TRAINING`, `USERS`, `ASAP`, `PHYSICAL TESTS` (with a dropdown), `MODSTORE` (highlighted in blue, indicating the current selection), and `REPORTS`.\n\n**ModStore Section:**\nBelow the main header, a secondary navigation bar specific to ModStore is visible, including tabs: `Browse` (currently active, marked by a blue underline), `Library`, `Brandable Content`, `Content Manager`, and `Uploaded Content`. The section is identified by the **ModStore** logo and text.\n\n**Featured Content Carousel:**\nA large carousel occupies the central area, showcasing featured content.\n*   **Visuals:** The current slide features a professional image of a woman in business attire against a blurred office background. Navigation arrows (chevrons) are present on the left and right edges.\n*   **Text Overlay:** Text overlays on the left side include:\n    *   A small label: `Featured Content`\n    *   Large title: `PERSPECTIVES`\n    *   Subtitle: `VOL. 2 - OUT NOW`\n    *   Metadata: `Training Module | 6 minutes | December 2023`\n    *   Action Button: `View Details`\n\n**Filter and Search Area:**\nBelow the carousel, a filtering section is displayed with three primary inputs:\n1.  **Content Types:** A dropdown menu, currently set to `All`.\n2.  **Topics:** A dropdown menu, currently set to `All`.\n3.  **Search:** A text input field labeled `Search`, accompanied by a magnifying glass icon for execution.",
        "position": 3,
        "context": "Then, click the +Create Training Campaign button in the top-right corner of the page."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/training+course+mgmt/ContentDrop-DownMenu.gif",
        "alt": "This image displays a segment of a web application configuration interface, presenting various options for managing content access, surveys, tracking, and user enrollment groups.\n\n**UI Elements and Configuration Settings:**\n\n1.  **Content Selection:**\n    *   Label: \"Content\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more items from the list...\"\n\n2.  **Content Survey Options:**\n    *   Checkbox (Checked): \"Enable Content Survey\" (Followed by an information/help icon: \"?\")\n    *   Nested Checkbox (Unchecked, within a shaded/highlighted background box): \"Allow users to leave comments\"\n\n3.  **Tracking Option:**\n    *   Checkbox (Unchecked): \"Track Scores\" (Followed by an information/help icon: \"?\")\n\n4.  **Enrollment Group Selection:**\n    *   Label (Partially Visible): \"...roll Groups\"\n    *   Input Type: Segmented button control with two options:\n        *   \"All Users\" (Active/Unselected style)\n        *   \"Specific Groups\" (Selected/Dark Gray style)\n    *   Information/help icon (\"?\") follows the segmented control.\n    *   Below the segmented control is a Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\" (This input field is relevant only when \"Specific Groups\" is selected).\n\n5.  **Automatic Enrollment Options:**\n    *   Checkbox (Checked): \"Enable automatic enrollment for new users\" (Followed by an information/help icon: \"?\")\n    *   Nested Checkbox (Unchecked, within a shaded/highlighted background box): \"Enable progress reset for remedial training\" (Followed by an information/help icon: \"?\")\n\n6.  **Additional Group Assignments (Partially Visible):**\n    *   Label (Partially Visible): \"...d Users To\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\"\n\n7.  **Completion Assignments (Partially Visible):**\n    *   Label (Partially Visible): \"...Completed\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\"\n\n**Contextual Details:**\n*   The interface utilizes checkboxes, segmented controls, and dropdowns for configuration.\n*   The use of shaded background boxes indicates dependent or secondary options that are enabled by the primary checkbox above them (e.g., \"Allow users to leave comments\" is dependent on \"Enable Content Survey\").\n*   A mouse cursor is visible in the upper right quadrant, pointing towards the area above the \"Allow users to leave comments\" box.\n*   Question mark icons (\"?\") are used extensively to indicate the availability of tooltips or supplementary help information for specific settings.",
        "position": 4,
        "context": "You can also type a keyword into the field to filter content (click to view)."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_WelcomeNotif.png",
        "alt": "The screen displays a configuration form titled \"Add Automatic Training Notifications.\"\n\n**Configuration Fields:**\n\n1.  **Notification Type:** A required field utilizing a dropdown selector, currently displaying the default value \"Welcome.\"\n\n**Recipient and Template Selection:**\n\nA section titled \"Select Recipients and Templates\" presents three recipient groups, each enabled via a checked box and associated with a template dropdown selector and a help icon (question mark):\n\n| Recipient | Checkbox Status | Template Selection (Dropdown) | Action Icon |\n| :-------- | :-------------- | :---------------------------- | :---------- |\n| **User**  | Checked         | You've been enrolled in a training campaign (Fro...) | View (Eye Icon) |\n| **Manager** | Checked         | Employees Enrolled (Manager) (From KnowBe4) | View (Eye Icon) |\n| **Admin**   | Checked         | Users Enrolled (Admin) (From KnowBe4) | View (Eye Icon) |\n\n**Additional Actions:**\n\nA blue hyperlink is present beneath the recipient list: \"Manage Training Notification Templates.\"\n\n**Save Actions:**\n\nThe interface concludes with two action buttons located at the bottom left:\n*   **Save** (Primary, Blue)\n*   **Cancel** (Secondary, Gray)",
        "position": 5,
        "context": "NQP87E4V'>Notifications\nWe recommend creating notifications to welcome enrolled users and to remind "
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_DueDateNotif.png",
        "alt": "This image displays a configuration screen titled \"Add Automatic Training Notifications.\"\n\n**Notification Settings:**\n\n1.  **Notification Type:** A dropdown menu is present, currently set to **\"Remind Before Due Date.\"**\n2.  **Informational Note:** A blue-tinted box contains the text: **\"Note: Reminder notifications are sent at the beginning of business hours as specified under Account Settings.\"**\n3.  **Timing Configuration:** A field labeled **\"Send Reminder\"** precedes an input box containing the value **\"5\"**, followed by the text **\"days before due date\"** and a help icon (question mark inside a circle).\n\n**Recipient and Template Selection:**\n\n1.  The section is headed **\"Select Recipients and Templates.\"**\n2.  Three recipient types are listed, each with a checked checkbox and a help icon:\n    *   **User:** Assigned the template **\"Please complete your assigned training (From Kn...\"**\n    *   **Manager:** Assigned the template **\"Employees Incomplete (Manager) (From KnowBe4)\"**\n    *   **Admin:** Assigned the template **\"Users Incomplete (Admin) (From KnowBe4)\"**\n3.  Each template assignment uses a dropdown menu.\n4.  To the right of each dropdown is a blue eye icon, indicating a preview option.\n5.  A hyperlinked option, **\"Manage Training Notification Templates,\"** appears below the templates.\n\n**Action Buttons:**\n\nAt the bottom left, two action buttons are visible: a primary **\"Save\"** button (blue) and a secondary **\"Cancel\"** button (gray).",
        "position": 6,
        "context": "nt type.\nClick the Save button.\n\n\n\nDue Date Reminder\nTo create a due date reminder, follow the steps"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/modstore/StudentEdition_CampaignOverview.png",
        "alt": "This screen displays the **Overview** dashboard for the training campaign titled \"**Student Training**\" targeting the group \"**All Users**.\"\n\n**UI Structure and Navigation:**\n\n*   **Header:** The main title is \"Student Training.\" A navigation link, \"**Back to Training**,\" is in the top right corner.\n*   **Tabs:** Two navigation tabs are present: \"**Overview**\" (active) and \"**Users**\" (inactive).\n*   **Action Button:** A green action button labeled \"**Notify Users**\" (with an envelope icon) is positioned next to the tabs.\n\n**Campaign Summary (Right Column):**\n\nThis section provides key metrics for the entire campaign:\n\n*   **Completion Status:** A doughnut chart visually represents overall progress, showing \"**29% Completed All Content**.\"\n*   **Details:**\n    *   **Status:** \"**In Progress**\" (highlighted in green).\n    *   **Start Date:** 05/06/2024, 9:00 AM.\n    *   **Relative Duration:** 3 weeks.\n    *   **Users:** 242.\n\n**Campaign Content (Left Column, Top):**\n\nThis section lists individual assignments and their completion rates:\n\n*   **Assignment 1:** \"**Students’ Top 5 Security Awareness Fundamentals**.\" Completion is **39%**, displayed with a progress bar. An associated button is labeled \"**User Progress**.\"\n*   **Assignment 2:** \"**Security Culture: Students’ Responsibilities**.\" Completion is **49%**, displayed with a progress bar. An associated button is labeled \"**User Progress**.\"\n\n**User Completion Activity (Left Column, Bottom):**\n\nThis area displays historical completion data via a line chart.\n\n*   **Metric:** \"**Number of Users who have not completed their assignments**.\"\n*   **Chart Scale:** The Y-axis ranges from 100 to 200, showing the current outstanding user count near the 170 level.",
        "position": 7,
        "context": "On this tab, you will see a summary of the campaign, including a graph of users who have completed a"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/modstore/StudentEdition_UserProgress.png",
        "alt": "This image is a screenshot of a technical user interface displaying **user enrollment and progress data**, likely from a Learning Management System (LMS) or training administration portal.\n\n**Header and Navigation:**\n*   Main tabs are visible: \"Overview\" (inactive) and **\"Users\" (active)**.\n\n**Metrics Dashboard (Statistics Bar):**\nA segmented bar graph displays enrollment status metrics:\n1.  **All Users:** 242 (Dark Grey, Active filter indicated by pointer).\n2.  **Incomplete:** 70.2%, 170 (Light Blue/Cyan).\n3.  **Not Started:** 11.6%, 28 (Light Blue/Cyan).\n4.  **In Progress:** 70.2%, 172 (Red).\n5.  **Completed:** 29.8%, 72 (Green).\n6.  **Past Due:** 0.4%, 1 (Red).\n\n**Control Elements:**\n*   **Search Bar:** Labeled \"Search for users by name or email,\" accompanied by a magnifying glass icon for submission.\n*   **Action Buttons (Right-aligned):**\n    *   **Bulk Update:** Text link with a refresh/circular arrow icon.\n    *   **Download CSV:** Green button with a download icon.\n    *   **Actions:** Blue dropdown button with a gear/cog icon.\n\n**Data Table:**\nThe main area is a detailed data table listing user performance across assigned content.\n\n**Table Columns:**\n1.  (Checkbox): For multi-selection actions.\n2.  **Content Name:** Contains both user identifiers and course titles.\n3.  **Enrollment Date:** Date of assignment.\n4.  **Content Started:** Indicates if the content was accessed (check mark or blank).\n5.  **Time Spent:** Duration recorded for the content.\n6.  **Time Remaining:** (Currently blank/hyphenated).\n7.  **Score:** (Currently blank/hyphenated).\n8.  **Status:** Current completion state.\n\n**Key Data Rows (Segmented by User):**\n\n*   **User 1 Header:** **BarryGoode@YourDomain.com** (Linked email) followed by a small person icon and an asterisk.\n    *   **Row 1.1:** Content: Graduation Cap icon + \"Students’ Top 5 Security Awareness Fundamentals.\" Enrollment Date: 05/06/2024. Started: Check mark. Time Spent: 15:23. Status: Green \"Completed\" badge with a trophy icon.\n    *   **Row 1.2:** Content: Graduation Cap icon + \"Security Culture: Students’ Responsibilities.\" Enrollment Date: 05/06/2024. Started: Check mark. Time Spent: 12:36. Status: Green \"Completed\" badge with a trophy icon.\n\n*   **User 2 Header:** **MarshaMellow@YourDomain.com** (Linked email) followed by a small person icon and an asterisk.\n    *   **Row 2.1:** Content: Graduation Cap icon + \"Students’ Top 5 Security Awareness Fundamentals.\" Enrollment Date: 05/06/2024. Started: Check mark. Time Spent: 13:11. Status: Green \"Completed\" badge with a trophy icon.\n    *   **Row 2.2:** Content: Graduation Cap icon + \"Security Culture: Students’ Responsibilities.\" Enrollment Date: 05/06/2024. Started: Check mark. Time Spent: 14:03. Status: Green \"Completed\" badge with a trophy icon.",
        "position": 8,
        "context": "s://helpimg.s3.amazonaws.com/modstore/StudentEdition_CampaignOverview.png' width='601' height='349'>"
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "edition",
        "student"
      ],
      "image_count": 8
    }
  }
}