{
  "id": 31935234273939,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/31935234273939.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/31935234273939.html",
  "author_id": 10164786027,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 1,
  "vote_sum": 0,
  "vote_count": 6,
  "section_id": 31157449158803,
  "created_at": "2024-08-01T20:53:17Z",
  "updated_at": "2025-10-29T17:05:10Z",
  "name": "AIDA Automated Training Guide",
  "title": "AIDA Automated Training Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-10-15T12:12:06Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [
    "01J4M3VRZ7JRWMDQV0RYJXAZ93"
  ],
  "label_names": [
    "localized",
    "AIDA",
    "AIDA training"
  ],
  "body": "<p>The AIDA Automated Training agent enables you to automatically assign personalized training to your learners based on their Risk Score, phishing failures, training history, and content preferences. This article explains how to configure and manage AIDA Automated Training options for your users. For more information, view our <a href='https://support.knowbe4.com/hc/en-us/articles/35378649680403-Video-AIDA-Automated-Training'>AIDA Automated Training</a> video.</p>\n<p>AIDA is available on the KnowBe4 console as an add-on to your Diamond-level subscription.</p>\n<h2 id='h_01J47VJH8DA530NM26C2B03279'>Creating Remedial Training</h2>\n<p>AIDA Remedial Training is a feature of Automated Training that assigns targeted training to users who have failed phishing tests. The system selects relevant and effective content for each user based on a user’s phishing test results and Risk Score. Remedial training sessions are typically brief, lasting less than five minutes.</p>\n<p>To access AIDA training, log in to your KnowBe4 console and click the <strong>Training</strong> tab. Then click the <strong>AIDA Training</strong> subtab to see the <strong>AIDA Training</strong> page.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_subtab_pre_setup4.png'><img src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_subtab_pre_setup4.png' width='686' height='339'></a></p>\n<p>Click <strong>Configure Training</strong> to open the remedial training settings page.</p>\n<h3 id='h_01J6AS2PX42T987GA34MBTJ308'>Test Mode</h3>\n<p>The default setting you will see for AIDA Remedial Training is Test Mode. This mode lets you preview AIDA's training recommendations without automatically assigning courses to users. It shows you what would have been assigned if remedial training had been enabled.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_configure_test_mode4.png.png'><img src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_configure_test_mode4.png'></a></p>\n<p>You will see an example of missed training opportunities since the previous week, and you can click <strong>View Report</strong> to see a sample of training results. See the <a href='#h_01J47W1EFJBER60EF439HHSHSG'>Reviewing AIDA Remedial Training Results</a> section for an example of training results.</p>\n<h3 id='h_01J6AS4YN2JS53K8BA7TPYK4ZR'>Configuring Remedial Training</h3>\n<p>If you are satisfied with AIDA’s recommendations, you can use the default settings or configure the options to suit your needs. Clicking the <strong>Activate Remedial Training</strong> button at the bottom of the page will take you out of Test Mode.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important: </strong>The module language will match the language settings of the user’s profile.</div>\n</div>\n<p>For more information about the options, see the list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_configure8.png'><img src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_configure8.png' width='686' height='339'></a></p>\n<ol type='a'>\n<li>\n<strong>Enroll Users</strong>: Select the user groups you would like to enroll:\n<ul>\n<li>\n<strong>All Users</strong>: All users in your organization will be assigned remedial training if they fail phishing simulations.</li>\n<li>\n<strong>All Users Except Specific Groups</strong>: All users except selected groups will be assigned remedial training for failing phishing simulations. If you make this selection, the <strong>Groups to Exclude</strong> drop-down menu will appear. Select the user groups to exclude from the automated remedial training.\n<div class='callout-remember'>\n<div>\n<strong>Important: </strong>You can click <strong>View Groups</strong> to go to the <strong>Manage Groups</strong> page to view, edit, or add a group.</div>\n</div>\n</li>\n</ul>\n</li>\n<li>\n<strong>Enroll users after</strong>: Set how many phishing simulations users must fail before being enrolled in remedial training.</li>\n<li>\n<strong>Time to Complete</strong>: Select the number of days, weeks, or months users have to complete their assigned training.</li>\n<li>\n<strong>Allow assignments to be completed after due date</strong>: Enable this toggle to allow users to complete their assigned training after the selected due date.</li>\n<li>\n<strong>Survey users about training content after completion</strong>: Enable this toggle to provide users with a survey after they have completed their training.</li>\n<li>\n<strong>Track user scores for applicable content</strong>: Enable this toggle to track scores.</li>\n<li>\n<strong>Enable Knowledge Refreshers</strong>: Select this checkbox to enable Knowledge Refreshers in the Learner Experience. See <a href='https://support.knowbe4.com/hc/en-us/articles/33016697488787-AIDA-Knowledge-Refresher-Guide#h_01J7P7Y7JZ64M22TQ9PTB8S3NQ'>Accessing Knowledge Refreshers in the Learner Experience</a> for more information.</li>\n<li>\n<strong>+Add Notification</strong>: Click this button to add a notification to your training. See the <a href='#h_01J47VW7Q8N6EBQEKHB6ZKHRFR'>Adding a Notification</a> section below for more information.</li>\n</ol>\n<p>You can adjust any of the base settings, then click <strong>Activate Remedial Training</strong> to finalize and save the configuration.</p>\n<h2 id='h_01J47VQK2125KZYGCSAHK3J5E8'>Managing and Editing Remedial Training</h2>\n<p>To manage AIDA remedial training, log in to your KnowBe4 console and click the <strong>Training</strong> tab. Click the <strong>AIDA Training</strong> subtab to see the AIDA Training page.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_subtab_post_setup2.png'><img src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_subtab_post_setup2.png'></a></p>\n<p>Click <strong>Edit Training</strong> to open the <strong>Remedial: Phishing Failures</strong> settings page. To learn more about the options in this section, see below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_manage_and_edit3.png'><img src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_manage_and_edit3.png'></a></p>\n<p>To learn more about the options in this section, see below:</p>\n<ol type='a'>\n<li>\n<strong>Enroll Users</strong>: Select the user groups you would like to enroll:\n<ul>\n<li>\n<strong>All Users</strong>: All users in your organization will be assigned remedial training if they fail phishing simulations.</li>\n<li>\n<strong>All Users Except Specific Groups</strong>: All users except selected groups will be assigned remedial training for failing phishing simulations. If you make this selection, the Groups to Exclude drop-down menu will appear. Select the user groups to exclude from the automated remedial training.\n<div class='callout-remember'>\n<div>\n<strong>Important: </strong>You can click <strong>View Groups</strong> to go to the <strong>Manage Groups</strong> page to view, edit, or add a group.</div>\n</div>\n</li>\n</ul>\n</li>\n<li>\n<strong>Enroll users after</strong>: Set how many phishing simulations users must fail before being enrolled in remedial training.</li>\n<li>\n<strong>Time to Complete</strong>: Select the number of days, weeks, or months users have to complete their assigned training.</li>\n<li>\n<strong>Allow assignments to be completed after due date</strong>: Enable this toggle to allow users to complete their assigned training after the selected due date.</li>\n<li>\n<strong>Survey users about training content after completion</strong>: Enable this toggle to provide users with a survey after they have completed their training.</li>\n<li>\n<strong>Track user scores for applicable content</strong>: Enable this toggle to track scores.</li>\n<li>\n<strong>Enable Knowledge Refreshers</strong>: Select this checkbox to enable Knowledge refreshers in the Learner Experience. See Accessing Knowledge Refreshers in the Learner Experience for more information.</li>\n<li>\n<strong>Time between assignment completion and Knowledge Refresher</strong>: Select the number of days between when a user completes a training module and when the knowledge refresher for that module is available.</li>\n<li>\n<strong>Notify Users when new Knowledge Refreshers are available</strong>: Select this checkbox to notify users when knowledge refreshers are available in their console.</li>\n<li>\n<strong>+Add Notification</strong>: Click this button to add a notification to your training. See the <a href='#h_01J47VW7Q8N6EBQEKHB6ZKHRFR'>Adding a Notification</a> section below for more information.</li>\n<li>\n<strong>Save Changes</strong>: Click this button to save any changes you have made to the remedial training campaign.</li>\n<li>\n<strong>Deactivate Training</strong>: Click this button to deactivate the remedial training campaign.</li>\n</ol>\n<h2 id='h_01J47VW7Q8N6EBQEKHB6ZKHRFR'>Adding a Notification</h2>\n<p>You can set up automated notifications while creating or editing a new remedial training. To add a notification for your remedial training, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 console and click the <strong>Training</strong> tab.</li>\n<li>Click the <strong>AIDA Training</strong> subtab to see the <strong>AIDA Training</strong> page.</li>\n<li>Click <strong>Edit Training</strong> to open the <strong>Remedial: Phishing Failures</strong> settings page.</li>\n<li>Click <strong>+Add Notification</strong>.</li>\n</ol>\n<p>See below for an overview of the notification options. For more details on this section, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115010848868-Training-Campaign-Notifications-Overview'>Training Campaign Notifications Overview</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_notification.png'><img src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_notification.png'></a></p>\n<ol type='a'>\n<li>\n<strong>Notification Type</strong>: From this drop-down menu, select when the notification will be sent. You can select from the following options: Welcome, Remind After Enrollment, Remind Before Due Date, Campaign Completion, or Past Due.</li>\n<li>\n<strong>Select Recipients and Templates</strong>: Select the appropriate check box to send notifications to your desired recipients. You can select from the following options: User, Manager, Admin, or a combination of these three options.</li>\n<li>\n<strong>Select Template</strong>: From the drop-down menu, select which notification template to send to the recipient type. To preview the selected template, click the eye icon on the right side of the field.<br><strong>Note</strong>: If you have enabled password-less logins in your account settings, be sure to select the training notifications labeled \"(Password-less).”</li>\n<li>\n<strong>Manage Training Notification Templates</strong>: Click this link to view available notification templates in a new window. We provide several system email templates for you to choose from. You can click this option to customize our notifications or create your own notifications.</li>\n</ol>\n<p>When you are satisfied with your notification selections, click the Save button. To add another notification, click the <strong>+Add Notification</strong> button again.</p>\n<h2 id='h_01J47W1EFJBER60EF439HHSHSG'>Reviewing AIDA Remedial Training Results</h2>\n<p>From the <strong>AIDA Training</strong> subtab, click the <strong>View Report</strong> button to open a summary of the remedial training results. The report displays detailed information for remedial training assigned by AIDA for users who failed phishing tests.</p>\n<p>For this report, you can view the graph to monitor the number of remedial training modules that have been assigned versus the number of remedial training modules that have been completed. To view the exact numbers for each date on the graph, you can hover your mouse over the dots.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_results_overview5.png'><img src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_results_overview5.png'></a></p>\n<p>To learn more about the options in this section, see below:</p>\n<ol type='a'>\n<li>\n<strong>Survey Results</strong>: This subtab will only display if you have enabled content surveys on the remedial training settings page. See the Survey Results section of this article for more information.</li>\n<li>\n<strong>Include Archived Users</strong>: Select this check box to include archived user data in the report.</li>\n<li>\n<strong>Edit Training</strong>: Click this button to go to the Remedial: Phishing Failures settings page.</li>\n<li>\n<strong>Filters</strong>: The <strong>Content Name</strong>, <strong>User Groups</strong>, and <strong>Training Status</strong> filters are enabled by default. Click the <strong>Add Filter</strong> button to enable additional filters. Select one of the following filter options.\n<ul>\n<li>\n<strong>Content Name</strong>: From this drop-down menu, select which results to display: all content assigned to users or a specific module. The default selection is <strong>All</strong>.</li>\n<li>\n<strong>User Groups</strong>: From this drop-down menu, select which results to display: all user groups or specific user groups. The default selection is <strong>All</strong>.</li>\n<li>\n<strong>Training Status</strong>: From this drop-down menu, select which results to display: all training status types or modules that are not started, in progress, completed, or past due. The default selection is <strong>All</strong>.</li>\n<li>\n<strong>Knowledge Refresher</strong>: From this drop-down menu, select which results to display: all knowledge refresher statuses, ones that are completed, or ones that are still incomplete. The default selection is <strong>All</strong>.</li>\n<li>\n<strong>Search User</strong>: From this drop-down menu, select which user’s results to display.</li>\n</ul>\n</li>\n<li>\n<strong>Timeframe</strong>: Use this drop-down menu to change the time period for data displayed in the chart.</li>\n<li>\n<strong>Arrow icon</strong>: Click this icon in the column headers to sort the results in the table.</li>\n<li>\n<strong>Phishing Failure Details: </strong>Click the <strong>arrow</strong> next to a user to see the reason the training was assigned and which phishing template the user failed.</li>\n<li>\n<strong>Generate CSV</strong>: Click this button to generate a CSV file version of the report table.</li>\n<li>\n<strong>Actions</strong>: To enable the Actions button, select one or more check boxes next to the user name. Then, select one of the following actions:\n<ul>\n<li>Send Notification: Manually send the user a notification regarding the assigned content.</li>\n<li>Mark as Completed: Mark the user's assigned content as completed.</li>\n<li>Reset Progress: Reset any progress the user made on the assigned content.</li>\n<li>Remove Assignment: Remove the assigned remedial training module for the user.</li>\n</ul>\n</li>\n<li>\n<strong>Manage Columns</strong>: Click this text to display a drop-down menu that contains a list of available columns. From the drop-down menu, you can deselect the default columns that are displayed in the table.</li>\n</ol>\n<h2 id='h_01J47W69TV34MKM9HGX2QX5G69'>Survey Results</h2>\n<p>From this subtab, you'll see the average survey results and the number of completed surveys for each piece of content. You can download these results as a CSV file by clicking the <strong>Generate CSV</strong> button in the top-right corner of the page. If you have allowed users to leave comments, these comments will be included in the CSV file as well.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_results_survey2.png'><img src='https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_results_survey2.png'></a></p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/31935234273939-AIDA-Automated-Training-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_subtab_pre_setup4.png",
      "alt": "This image displays the administrative interface for \"AIDA Training,\" focused on configuration and reporting for security training modules.\n\n**UI Context and Navigation:**\nThe primary navigation bar contains five tabs: **AIDA Training** (active), **Campaigns**, **Notification Templates**, **Policies**, and **Reports**.\n\n**Main Content Area (Two-Column Layout):**\n\n**Left Pane (Remedial Training Module Details):**\nThis section is titled **Remedial Training** and features a specific module titled **Phishing Failures**, accompanied by a red fishing hook icon.\n\n*   **Status:** A status tag labeled **Disabled** (red background) is visible in the upper right corner of the module card.\n*   **Metrics:** The module tracks two key statistics: **399 Assignments** and **8 Completions**.\n*   **Action Buttons:** Two actions are available:\n    1.  **View Report** (Primary button, solid red/orange).\n    2.  **Configure Training** (Secondary button, white with outline).\n\n**Right Pane (Placeholder/Empty State):**\nThis pane indicates the availability of future content. It is bordered by a dashed line and features a large, light gray lightbulb icon. The text reads: **Check back soon for more AIDA training options!**",
      "position": 1,
      "context": "subtab to see the AIDA Training page."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_configure_test_mode4.png",
      "alt": "The image displays a configuration screen titled \"**AIDA Configure Training**.\" A navigation link labeled \"**← Back to Training**\" is present in the top right corner.\n\nA prominent, horizontal warning/information banner, fading from deep red to orange, contains the instructional text: \"Click **View Report** to see what remedial training AIDA would assign if enabled.\" A red action button labeled \"**View Report**\" (accompanied by an external link icon) is located at the right end of the banner.\n\nThe context of the configuration is defined by the heading \"**Remedial: Phishing Failures**.\"\n\nThe \"**Enroll Users**\" section uses a two-option toggle selector:\n1. \"**All Users**\" (Currently unselected/inactive state).\n2. \"**All Users Except Specific Groups**\" (Currently selected/active state, indicated by a dark grey background).\n\nFollowing the enrollment selector, a field labeled \"**Groups to Exclude**\" is partially visible, adjacent to a link titled \"**View Groups**\" (accompanied by an external link icon).",
      "position": 2,
      "context": "have been assigned if remedial training had been enabled."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_configure8.png",
      "alt": "This screenshot displays the **AIDA Configure Training** interface, used to set parameters for automated remedial training, specifically targeting **Phishing Failures**.\n\n**Contextual Header and Preview:**\nThe page includes a prominent orange banner instructing the user to \"Click **View Report** to see what remedial training AIDA would assign if enabled.\" A corresponding **View Report** button is located on the right.\n\n**Remedial Configuration Parameters:**\n1.  **Enroll Users (a):** The enrollment scope is defined by toggle buttons, with \"**All Users Except Specific Groups**\" currently selected. A dropdown menu labeled \"Groups to Exclude\" and a \"View Groups\" hyperlink are visible below this selection.\n2.  **Enroll Users After (b):** The trigger condition is configured using a stepper control, set to **1** Phishing Failure.\n3.  **Time to Complete (c):** The deadline is set using a stepper control for quantity and a dropdown for the time unit, currently set to **2 Weeks**.\n4.  **Options (d, e, f):** Three operational checkboxes are enabled:\n    *   (d) Allow assignments to be completed after due date.\n    *   (e) Survey users about training content after completion.\n    *   (f) Track user scores for applicable content.\n\n**Knowledge Refreshers (AIDA):**\nThis section describes the automated creation of quizzes. A single, unchecked checkbox labeled **Enable Knowledge Refreshers (g)** controls this feature.\n\n**Notifications:**\nA dedicated section provides an **+ Add Notification (h)** button, used for defining user communication settings.\n\n**Action Button:**\nThe configuration is finalized by an orange-red button at the bottom labeled **Activate Remedial Training**.",
      "position": 3,
      "context": ">\n\nFor more information about the options, see the list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_subtab_post_setup2.png",
      "alt": "This image displays the **AIDA Training** web dashboard interface, focusing on active training modules and available options.\n\n**UI Structure and Navigation:**\n\n1.  **Header:** Displays the brand name \"AIDA Training\" (including a lightbulb icon stylized as the 'I').\n2.  **Primary Navigation:** A persistent tabbed navigation bar is present below the header. The tabs include: **AIDA Training** (currently selected/active), **Campaigns**, **Notification Templates**, **Policies**, and **Reports**.\n\n**Content Area (Active Modules):**\n\nThe main content area is structured into distinct cards. The leftmost card details an active training assignment:\n\n*   **Card Title/Type:** \"Remedial Training.\"\n*   **Status Indicator:** An orange pill label in the top right corner indicates the status as **Active**.\n*   **Training Module:** Titled **\"Phishing Failures,\"** accompanied by a stylized orange fishing hook icon.\n*   **Metrics:** Two key metrics are listed below the title: **7 Assignments** and **0 Completions**.\n*   **Call-to-Action Buttons (CTAs):**\n    *   A solid red/orange button labeled **View Report**.\n    *   A white outlined button labeled **Edit Training**.\n\n**Content Area (Empty State):**\n\nThe right side of the main content area shows a placeholder for additional modules, delineated by a light gray dashed outline:\n\n*   **Icon:** A central, light gray lightbulb icon is displayed.\n*   **Contextual Text:** The message **\"Check back soon for more AIDA training options!\"** indicates an empty state awaiting new content or user configuration.",
      "position": 4,
      "context": "ng>AIDA Training subtab to see the AIDA Training page."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_manage_and_edit3.png",
      "alt": "This document describes the configuration interface for the \"AIDA Configure Training\" page, specifically for the \"Remedial: Phishing Failures\" program, which is currently labeled **Active**.\n\n### Remedial Training Configuration\n\nThis section defines enrollment criteria and completion requirements:\n\n*   **Enroll Users (a):** Defines the target group. **All Users** is currently selected. The alternative option is \"All Users Except Specific Groups.\"\n*   **Enroll Users After (b):** Sets the threshold trigger for enrollment. Currently set to **2** instances of \"Phishing Failures.\"\n*   **Time to Complete (c):** Sets the deadline. Currently set to **2 Weeks**.\n*   **Settings Checkboxes:**\n    *   **(d)** Allow assignments to be completed after due date (Checked).\n    *   **(e)** Survey users about training content after completion (Checked).\n    *   **(f)** Track user scores for applicable content (Checked).\n\n### Knowledge Refreshers\n\nThis section configures automated short quizzes (AIDA-labeled):\n\n*   **(g)** **Enable Knowledge Refreshers** (Checked).\n*   **(h)** **Time between assignment completion and Knowledge Refresher:** **3 Days** is currently selected (options include 7 Days, 14 Days, 30 Days).\n*   **(i)** **Notify users when new Knowledge Refreshers are available** (Checked).\n\n### Notifications\n\nThis section lists and allows management of user and admin communications:\n\n*   **(j)** **+ Add Notification** button (green).\n*   **Defined Notifications List:**\n    *   **Remind After Enrollment:** Notifies User, Manager, Admin 5 days after enrollment via **Email**.\n    *   **Welcome:** Notifies User, Admin via **Email**.\n    *   **Welcome:** Notifies User via **Google Chat**.\n    *   **Welcome:** Notifies User via **Microsoft Teams**.\n    *   **Welcome:** Notifies User via **Slack**.\n    *   **Training Completion:** Notifies User via **Microsoft Teams**.\n    *   **Training Completion:** Notifies User via **Slack**.\n*   Each notification entry includes **Edit** (blue pencil icon) and **Delete** (red trash icon) controls.\n\n### Actions\n\nThe bottom of the interface contains two primary action buttons:\n\n*   **(k)** **Save Changes** (Primary, orange/red button).\n*   **(l)** **Deactivate Training** (Secondary button).",
      "position": 5,
      "context": "To learn more about the options in this section, see below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_notification.png",
      "alt": "The image displays a user interface form titled **\"Add Automatic Training Notifications\"**. The form is structured into sections for defining notification parameters.\n\n1.  **Notification Type (Label 'a'):** The first section contains a required selection field labeled **\"Notification Type\"**. The currently selected value is **\"Welcome\"** via a dropdown menu.\n\n2.  **Recipients and Templates:** A sub-section titled **\"Select Recipients and Templates\"** follows, presenting three rows corresponding to recipient roles. Each role includes a checkbox, a template selection dropdown, and a preview (eye) icon.\n\n    *   **User Role (Label 'b'):** The **\"User\"** checkbox is selected.\n    *   **User Template (Label 'c'):** The associated dropdown field is active, displaying the template: **\"You've been enrolled in a training campaign (From KnowBe4)\"**.\n    *   **Manager Role:** The **\"Manager\"** checkbox is unselected. The associated template dropdown displays: **\"Employees Enrolled (Manager) (From KnowBe4)\"**.\n    *   **Admin Role:** The **\"Admin\"** checkbox is unselected. The associated template dropdown displays: **\"Users Enrolled (Admin) (From KnowBe4)\"**.\n\n3.  **Template Management (Label 'd'):** A hyperlink labeled **\"Manage Training Notification Templates\"** is located beneath the recipient rows, allowing access to template administration.\n\n4.  **Action Buttons:** At the bottom left, standard action buttons are presented:\n    *   **\"Save\"** (Primary blue button).\n    *   **\"Cancel\"** (Secondary gray button).",
      "position": 6,
      "context": "tions-Overview'>Training Campaign Notifications Overview article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_results_overview5.png",
      "alt": "This image displays the \"Overview\" section of the **AIDA Training Report** for a remedial training titled **\"Phishing Failures Summary,\"** which is currently \"Active.\"\n\n**Header and Administration (a, b, c):**\nNavigation tabs include \"Overview\" and \"Survey Results\" (a). Administrative controls on the right feature a checkbox to \"Include Archived Users\" (b) and an \"Edit Training\" button (c).\n\n**Filtering and Timeframe (d, e):**\nThe filter panel (d) allows filtering by \"Content Name,\" \"User Groups,\" and \"Training Status,\" all currently set to \"All.\" The \"Timeframe\" section (e) is configured for \"Enrolled On Date Range,\" preset to \"Last 90 Days.\" Filters are applied using the \"Apply Changes\" button.\n\n**Training Overview:**\nKey performance indicators show quantitative metrics: **127 Failures**, **66 Training Assignments**, **2 Training Completions**, and **23 Users Enrolled**.\n\n**Remedial Training Activity:**\nA time-series graph plots \"Total Assignments vs. Total Completions,\" demonstrating a large spike in \"Training Assigned\" around January 20th. A sidebar titled \"Users with Most Assignments\" lists specific user emails and the corresponding number of assigned modules.\n\n**User Training Summary (f, g, h, i, j):**\nThis detail table displays user assignment data. Actions available are \"Generate CSV\" (h) and an \"Actions\" dropdown (i). The table is configurable via \"Manage Columns\" (j). Columns include \"User\" (f), \"Phishing Attack Vector,\" \"Content Name,\" \"Assigned Date,\" and \"Status\" (e.g., \"Not Started\").\n\nExpanding a user row reveals \"Phishing Failure Details\" (g). For the first entry, details include the reason for assignment (addressing challenges in **clicking unverified links**), \"Failed Template: CEO Fraud: Urgent Request,\" and \"Landing Page: 404 Error Page.\"",
      "position": 7,
      "context": "each date on the graph, you can hover your mouse over the dots."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/aida/RemedialTraining/AIDA_training_results_survey2.png",
      "alt": "A technical manual description of the image:\n\nThis screenshot displays the **\"AIDA Training Report\"** interface, specifically the **\"Survey Results\"** tab.\n\n**Header and Navigation:**\n*   The top left features the **AIDA** logo and the title **\"Training Report.\"**\n*   The top right contains a hyperlink: **\"← Back to Training.\"**\n*   Primary navigation tabs below the title show **\"Overview\"** and the active tab, **\"Survey Results.\"**\n\n**Report Content and Functionality:**\n*   The main report section is titled **\"Survey Results.\"**\n*   A functional button, **\"Generate CSV\"** (accompanied by a download icon), is positioned in the top right of the report area.\n*   The content is presented in a tabular format detailing multiple training modules.\n\n**Table Structure:**\nThe table includes five columns with the following headers:\n1.  **Content Title**\n2.  **Responses**\n3.  **Helpfulness of Content**\n4.  **Length of Content**\n5.  **Presentation of Content**\n\n**Data Representation (Sample Rows):**\nEach row under the **\"Content Title\"** column provides three lines of detail: Title, Duration, and Style. All metric columns (**Responses, Helpfulness, Length, Presentation**) currently display the value **\"0.\"**\n\nSample content titles and details include:\n*   **\"2019 Danger Zone\"** (Duration: 5 minutes, Style: Game)\n*   **\"Defining Types of Sensitive Information\"** (Duration: 8 minutes, Style: Training Module)\n*   **\"How to Stay Safe for the Holidays\"** (Duration: 3 minutes, Style: Video Module)\n*   **\"PCI Simplified\"** (Duration: 40 minutes, Style: Training Module)",
      "position": 8,
      "context": "comments, these comments will be included in the CSV file as well."
    }
  ],
  "metadata": {
    "category": "AIDA",
    "section": "AIDA Training",
    "topics": [
      "aida",
      "automated",
      "training"
    ],
    "image_count": 8
  }
}