{
  "article": {
    "id": 360009419893,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360009419893.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360009419893.html",
    "author_id": 360322304667,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 3,
    "vote_sum": 1,
    "vote_count": 7,
    "section_id": 26420669305107,
    "created_at": "2018-09-17T14:28:16Z",
    "updated_at": "2025-11-14T19:53:09Z",
    "name": "Branded Landing Pages, Training Notifications, and Email Templates Guide",
    "title": "Branded Landing Pages, Training Notifications, and Email Templates Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-14T19:53:08Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "training",
      "logo",
      "company logo",
      "branded",
      "branded landing page",
      "branded template",
      "branded training notification",
      "company URL",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>In the KSAT console, we have system landing pages, training notifications, and phishing email templates with a built-in placeholder used to display your company logo. Branded landing pages and email templates are indicated with a (Branded) label in their titles, and training notifications are labeled with (Logo) in their titles.</p>\n<p>In order for your company logo to display in our built-in phishing templates, landing pages, and training notifications, you must add a publicly available URL of your company logo to your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a>. Visit our <a href='https://support.knowbe4.com/hc/en-us/articles/115004742808-How-Do-I-Add-My-Company-Logo-and-URL-to-the-Console-'>How Do I Add My Company Logo and URL to the Console?</a> article for more information.</p>\n<h2 id='h_01GSR6NSGV1AG3WR6X5F1B3BTQ'>Creating Branded Landing Pages, Training Notifications, and Email Templates</h2>\n<p>To create your own branded landing page, training notification, or email template, you can use built-in placeholders inside the What You See Is What You Get (WYSIWYG) editor. Read the sections below to learn more about incorporating your company logo and brand color with these placeholders.</p>\n<h2 id='h_01GSR72KD27KPN7WD1X3MDYVW0'>Incorporating Your Company Logo</h2>\n<p>You can incorporate your company logo by adding the <strong>Company Logo URL</strong> placeholder. This will add a placeholder that will automatically populate your company logo into the specific landing page, training notification, or email template you are creating.</p>\n<p>To incorporate your company logo, follow the steps below:</p>\n<ol>\n<li>Ensure you've added your company logo URL to your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a>.</li>\n<li>Navigate to the desired landing page, notification, or template and click its name.</li>\n<li>In the WYSIWYG editor, click on the <strong>Placeholder</strong> drop-down menu.</li>\n<li>Select the <strong>Company Logo URL </strong>placeholder.</li>\n<li>After adding the placeholder, Click <strong>Save</strong>.</li>\n<li>Enable the <strong>Show Remote Images</strong> option when you preview your template to make sure your logo is displaying correctly.</li>\n</ol>\n<h2 id='h_01GSR7309VSJAHH3VH3Q8VMN1T'>Incorporating Your Brand Color</h2>\n<p>In any saved landing page, training notification, or email template, you can replace any color with your organization's unique brand color by using the [[brand_color]] placeholder within the source code. This placeholder automatically populates the hex code of your organization's brand color, as it was set in <a href='https://support.knowbe4.com/hc/en-us/articles/115004742808-#COLOR'>Account Settings</a>. Follow the steps below to use this feature.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong> This placeholder should only be used within the source code of a landing page, notification, or template.</div>\n</div>\n<ol>\n<li>Ensure a brand color has been set in your <strong>Account Settings</strong>.</li>\n<li><span>Navigate to the desired landing page, notification, or template and click its name.</span></li>\n<li>From the WYSIWYG editor, click on the <strong>Source</strong> button.</li>\n<li>Find the RGB or HEX color you would like to change.</li>\n<li>Replace the color code with the [[brand_color]] placeholder. Because you cannot access the WYSIWYG menu from the source view, we recommend typing this placeholder manually or copying and pasting it into the source code.</li>\n<li>After adding your brand color, click <strong>Save</strong>.</li>\n</ol>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FAQ/BrandColorPlaceholder.gif'><img src='https://helpimg.s3.amazonaws.com/FAQ/BrandColorPlaceholder.gif' alt=' ' width='847' height='334'></a></p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360009419893-Branded-Landing-Pages-Training-Notifications-and-Email-Templates-Guide",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/FAQ/BrandColorPlaceholder.gif",
        "alt": "The image displays a formal, text-based digital notification, likely an excerpt from an email or internal web portal, concerning an annual Expense Reimbursement certification and compliance requirement.\n\n**Textual Content:**\n1.  **Header:** Bold text reads \"Greetings,\".\n2.  **Body Text:** Policy text informs the recipient of an \"Expense Reimbursement certification\" that occurs annually. It details eligibility, highlighting the capitalized phrase \"EMPLOYEE EXPENSE REIMBURSEMENT.\"\n3.  **Call to Action (Pre-CTA Text):** The final line of instruction reads: \"Kindly CLICK BELOW to review and approve the compliance section so we can proceed.\"\n\n**UI Elements:**\n1.  **Button:** A primary, centralized Call to Action (CTA) button is rendered with a dark blue background and slightly rounded corners.\n2.  **Button Label:** The text within the button is white, all capital letters, and reads: \"CLICK HERE TO REVIEW.\"\n3.  **User Indicator:** A standard black, angled mouse pointer (cursor icon) is visible to the immediate right of the CTA button, indicating readiness for user interaction.\n\n**Context:** The document requires the user to click the interactive element to proceed with reviewing and approving a mandated compliance section.",
        "position": 1,
        "context": "the source code.\nAfter adding your brand color, click Save."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "and",
        "branded",
        "landing",
        "notifications",
        "pages",
        "templates",
        "training"
      ],
      "image_count": 1
    }
  }
}