{
  "id": 360035204974,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360035204974.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360035204974.html",
  "author_id": 368027116814,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 9,
  "vote_sum": 70,
  "vote_count": 100,
  "section_id": 20415393797011,
  "created_at": "2019-09-11T20:45:14Z",
  "updated_at": "2025-04-07T18:29:26Z",
  "name": "Learner Support: Manage Your Password",
  "title": "Learner Support: Manage Your Password",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T17:23:13Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "browser",
    "Dashboard",
    "bandwidth",
    "Learner Dashboard",
    "support ticket",
    "localized",
    "IE_banner"
  ],
  "body": "<p>In this article, you'll learn how to manage passwords for your KSAT account and Learner Experience (LX).</p>\n<h2 id='h_01HS92QZZ2TMCT22JK17D58VKR'>Resetting Your Password</h2>\n<p>To reset your password, click the <strong>Forgot your password?</strong> link on the login page. You could also use our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360043196354.html' target='_self'>KnowBe4's Training Instances</a> article to find a direct link to the <strong>Reset Password</strong> page.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FAQ/01%20reset%20password%20box.png'><img src='https://helpimg.s3.amazonaws.com/FAQ/01%20reset%20password%20box.png' width='430' height='353' alt=' '></a></p>\n\n<p>Then, enter the email address associated with your organization and click <strong>Send me reset password instructions</strong>. The password reset confirmation and instructions will be emailed to that email address.</p>\n<p>If you receive an error that says \"This account is not yet confirmed,\" you will need to click the activation link in the activation email in order to confirm your account and set your password. If you didn't receive this email, click the <strong>Didn't receive confirmation instructions?</strong> button.</p>\n<p>Otherwise, you will receive an email to the email address you entered, which will provide you a link to click on to set your new password. New password links will be active for approximately six hours.</p>\n<h2 id='h_01HS92QZZ2R52945BESDWKGXHZ'>Never Received Reset Password Instructions</h2>\n<p>If you're an existing user who has previously logged in, please ensure you are entering the correct email address. The email address you are using should be the one that you use with your organization (with your organization's domain) rather than a personal email address. If you are certain you entered the correct email address, check your Junk or Spam folder. If you still do not see the email, contact your supervisor or IT team for assistance.</p>\n<p>If you're a new user and you've never logged in before, click the <strong>Didn't receive confirmation instructions?</strong> button. On the page that opens, enter your work email address and click <strong>Resend confirmation instructions</strong>.</p>\n<h2 id='h_01HS92QZZ2T3BK91TZSRRJFCAW'>Never Received Confirmation Instructions</h2>\n<p>If you're a new user and you've never logged in before, click the <strong>Didn't receive confirmation instructions?</strong> button. On the page that opens, enter your work email address and click <strong>Resend confirmation instructions</strong>.</p>\n<p>Once you click <strong>Resend confirmation instructions</strong>, you will receive a new confirmation email with an activation link to confirm your account and set up your password.</p>\n<p>If problems persist, please reach out to your supervisor, your organization's IT administrator, or the <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_self'>KnowBe4 support</a> team for assistance.</p>\n<h2 id='h_01HS92QZZ238NNBMTAY169G04R'>Getting a Warning When Resetting My Password</h2>\n<p>If you receive an error that says “Reset password token is invalid\" while trying to reset your password, this error could occur for a few reasons. Select the scenario that best applies to you:</p>\n<ul class='js-toggles' role='list'>\n<li title='I requested a password reset email more than once.'>\n<p>If you request a password reset email and you do not receive this email within a few minutes, it may be in your Junk or Spam folder.</p>\n<p>If you've requested a password reset email more than once before, you must be sure to use the link from the most recent email.</p>\n</li>\n<li title='I requested a password reset email more than six hours ago.'>\n<p>When you request an email to reset your password, the link found in this email is only valid for six hours from the request.</p>\n<p>If you're receiving the \"Reset password token is invalid\" error and it's been over more than six hours since you've requested your password to be reset, please request a new password reset email. For instructions, see the <a href='#h_01HS92QZZ2TMCT22JK17D58VKR'>Resetting Your Password</a> section of this article.</p>\n</li>\n<li title='I am using the Safari browser to access my account/reset my password.'>\n<p>If you're attempting to reset your password in Safari using the password reset email you've received from KnowBe4, you may receive an error that says, \"Reset password token is invalid.\"</p>\n<p>This error can be caused by Safari's password-storing feature. If you've used this feature to store your KnowBe4 password, follow the steps below to delete this password entry.</p>\n<ol role='list'>\n<li>From your Safari browser's menu bar (at the top of your monitor's screen on Mac operating systems) select <strong>Safari</strong> then <strong>Preferences...</strong> from the drop-down menu. \n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/FAQ/passwordtokeninvaliderror_02.png'><img src='https://s3.amazonaws.com/helpimg/FAQ/passwordtokeninvaliderror_02.png' alt=' '></a>\n</li>\n<li>Select the <strong>Passwords</strong> tab from the <strong>Preferences</strong> menu.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>You may need to enter your account's login password to access your password entries.</div>\n</div>\n</li>\n<li>Select the password entry for training.knowbe4.com, then click the <strong>Remove</strong> button at the bottom-right corner, as shown below.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/FAQ/passwordtokeninvaliderror_03.png'><img src='https://s3.amazonaws.com/helpimg/FAQ/passwordtokeninvaliderror_03.png' alt=' '></a>\n</li>\n<li>Now, use the link in the password reset email you've received in your inbox to reset your account's password.  </li>\n</ol>\n</li>\n<li title='I am experiencing a different issue.'>\n<p>Can't find a helpful solution? <a href='https://support.knowbe4.com/hc/en-us/requests/new'>Contact our support team</a> and we will assist you.</p>\n</li>\n</ul>\n<h2 id='h_01HS92QZZ3CKTD52KWAT2A6GKX'>Can't Log In After Being Assigned Training </h2>\n<p>There are a few reasons this error may occur. Select the scenario that best applies to you:</p>\n<ul class='js-toggles' role='list'>\n<li title='I was notified via email about my assigned training and clicked a link in that email to log in.'>\n<p>The first time you click the link in your training notification, you will be emailed an activation link to confirm your account and set your password for training.</p>\n<p>Occasionally, you will be set up with a password by your IT administrator or supervisor. You should still be able to reset your password if you forget your assigned password, though. For instructions on how to reset your password, see the <a href='#h_01HS92QZZ2TMCT22JK17D58VKR'>Resetting Your Password</a> section of this article.</p>\n</li>\n<li title='I have already confirmed my account but I need to reset my password.'>\n<p>For instructions on resetting your password, please see the <a href='#h_01HS92QZZ2TMCT22JK17D58VKR'>Resetting Your Password</a> section of this article.</p>\n</li>\n<li title='I am able to log in, but I can't see any of my training assignments.'>\n<p>Contact your supervisor or IT team. It is possible that the campaign you were enrolled in has ended, or that your organization signed you up for training using a different email address.</p>\n</li>\n<li title='I'm locked out of my account.'>\n<p>Your account will be locked for one hour after you enter your password incorrectly 10 times. To unlock your account before an hour has passed, you will need to reset your password. To reset your password, click the <strong>Forgot your password?</strong> link on the login page. You can also use our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360043196354.html' target='_self'>KnowBe4's Training Instances</a> article to find a direct link to your <strong>Reset Password</strong> page.</p>\n</li>\n</ul>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360035204974-Learner-Support-Manage-Your-Password",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/FAQ/01%20reset%20password%20box.png",
      "alt": "This image displays a **Password Recovery Interface** screen designed for user authentication flow.\n\n**Context:** The screen facilitates the retrieval or reset of a user's password.\n\n**UI Elements and Content:**\n\n1.  **Primary Heading:** Centered text displaying the purpose: \"Forgot your password?\".\n2.  **Input Control:** A horizontal text input field placeholder labeled: \"Enter your work email\".\n3.  **Primary Call-to-Action (CTA):** A prominent, solid blue button containing the text: \"Send me reset password instructions\".\n4.  **Navigation Link (Secondary CTA 1):** A light gray button container with a blue text link: \"Log In\". This redirects the user to the standard login screen.\n5.  **Support Link (Secondary CTA 2):** A light gray button container with blue text providing troubleshooting assistance: \"Didn't receive confirmation instructions?\".",
      "position": 1,
      "context": "ining Instances article to find a direct link to the Reset Password page."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/FAQ/passwordtokeninvaliderror_02.png",
      "alt": "The image displays the active application dropdown menu for the \"Safari\" web browser within the macOS operating system environment.\n\n**Context:** The menu is accessed from the top-level Menu Bar, where \"Safari\" is the selected menu item.\n\n**UI Elements and Text:** The dark gray context menu lists multiple configuration and control options:\n\n| Menu Item | Ellipsis/Sub-menu | Keyboard Shortcut | Status/Context |\n| :--- | :--- | :--- | :--- |\n| About Safari | No | None | Standard information dialog |\n| Safari Extensions | Yes (`...`) | None | Opens configuration dialog |\n| **Preferences** | Yes (`...`) | `⌘,` (Command-Comma) | **Actively highlighted/focused.** Opens settings panel. |\n| Settings for This Website | Yes (`...`) | None | Context-specific configuration |\n| Clear History | Yes (`...`) | None | Session data management |\n| Services | Yes (`▶`) | None | Sub-menu indicator |\n| Hide Safari | No | `⌘H` | Enabled, but grayed out/inactive in this shot |\n| Hide Others | No | `⌥⌘H` (Option-Command-H) | Visibility control |\n| Show All | No | None | Visibility control |\n| Quit Safari | No | `⌘Q` (Command-Q) | Terminates the application |\n\n**Focus Point:** The menu item \"Preferences...\" is distinctly highlighted by a selection background (blue-purple, with an additional orange visual focus indicator applied over it). The corresponding keyboard shortcut `⌘,` is displayed to the right.",
      "position": 2,
      "context": "elect Safari then Preferences... from the drop-down menu."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/FAQ/passwordtokeninvaliderror_03.png",
      "alt": "This image displays a configuration window titled \"Passwords\" in a macOS-style application (likely Safari Preferences).\n\n**Window Structure and Tabs:**\n\nThe window features a horizontal toolbar containing multiple preference panes (tabs) represented by icons and text: \"General,\" \"Tabs,\" \"AutoFill,\" **\"Passwords\" (currently selected and highlighted with a key icon)**, \"Search,\" \"Security,\" \"Privacy,\" \"Websites,\" \"Extensions,\" and \"Advanced.\"\n\n**Password Management Area:**\n\n1.  **Search Bar:** A standard search field labeled \"Search\" is located in the top-right corner, above the password list.\n2.  **Checkbox:** A checkbox is enabled and labeled: \"AutoFill user names and passwords.\"\n3.  **Password List (Table View):** A list displays saved credentials with three primary columns: \"Website,\" \"User Name,\" and \"Password.\"\n    *   **Selected Entry:** A specific entry is highlighted in green, indicating selection. The visible text for the website is **\"training.knowbe4.com.\"** (User Name and Password fields are censored/blurred).\n    *   **Unselected Entry:** A partially visible unselected entry below the first shows placeholder text (e.g., \"address,\" \"user name,\" \"password\").\n\n**Action Buttons:**\n\nAt the bottom right of the window, there are action buttons:\n*   \"Add\" (disabled or grayed out).\n*   **\"Remove\" (highlighted by an orange circle in the image and currently enabled for interaction).**",
      "position": 3,
      "context": "m, then click the Remove button at the bottom-right corner, as shown below."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "learner",
      "manage",
      "password",
      "support",
      "your"
    ],
    "image_count": 3
  }
}