{
  "id": 360060622513,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360060622513.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360060622513.html",
  "author_id": 403968826754,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 9,
  "vote_sum": 16,
  "vote_count": 20,
  "section_id": 26414741016851,
  "created_at": "2020-12-11T14:46:56Z",
  "updated_at": "2025-05-27T14:59:35Z",
  "name": "Localization Guide",
  "title": "Localization Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-05-27T13:37:28Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "LOCATION",
    "CLICKERS",
    "AR",
    "Dashboard",
    "ADI",
    "Custom Courses",
    "Learner Dashboard",
    "LX",
    "Console Feature",
    "Customer supplied content",
    "localizing",
    "IE_banner"
  ],
  "body": "<p>Localization improves your users’ experience with translated training content, phishing templates, notifications, and more. We offer a number of localized features in over 34 languages. For a full list of supported languages and their availability within the console, see our <a href='https://www.knowbe4.com/security-awareness-training-languages'>Multi-Language Support and Localization</a> page.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Because localization is not fully supported for each language, you must set default languages for the account. Content, notifications, and features will be localized when the user’s preferred language is available. If a user’s language is not available, the account’s default language will be used.</div>\n</div>\n<p>Read the sections below to learn more about our localized features, what can be localized, and how to set up localization for your users. Alternatively, you can watch our <a href='https://support.knowbe4.com/hc/en-us/articles/4415781704851'>Language Settings</a> video.</p>\n<h2 id='h_01JQY8XFCWR3PY4P516T4JB5ZK'>What Language Settings Are Available?</h2>\n<p>There are three types of language settings available:</p>\n<ul>\n<li><a href='#training_language'>Training Language </a></li>\n<li><a href='#phishing_language'>Phishing Language </a></li>\n<li><a href='#admin_console'>Admin Console Language </a></li>\n</ul>\n<p>Each of these settings can be updated for each user. You can also select a default language for each setting at the account level. When a user’s preferred language is unavailable, the account’s default language will be used instead.</p>\n<h3 id='training_language'>Training Language</h3>\n<p>Users can set their <strong>Training Language</strong> in the Learner Experience, as outlined in our <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634#LOCALIZE'>Learner Experience (LX) Guide</a>. You can also update this setting on the <a href='#user_language'>user's profile</a>.</p>\n<p>The <strong>Training Language</strong> applies to the following:</p>\n<ul>\n<li>The Learner Experience, including training content when a localized version is available.</li>\n<li>User Notifications from the KnowBe4 console, such as welcome emails and password reset notifications.</li>\n<li>Training notifications, when <a href='#localized_notifications'>Localized Training Notifications</a> are enabled in <strong>Account Settings</strong>.</li>\n</ul>\n<h3 id='phishing_language'>Phishing Language</h3>\n<p>To keep phishing security tests fair and effective, users cannot set their own <strong>Phishing Language</strong>. You can update this setting on the <a href='#user_language'>user's profile</a> or by <a href='#bulk_update'>bulk updating</a> using a CSV file. The phishing language will be applied to emails sent from a <a href='#localized_campaign'>localized phishing campaign</a>.</p>\n<p>If your account uses the <strong>Office Add-in</strong> Phish Alert Button, you can autofill phishing languages based on the users’ PAB locales. This feature only impacts users who do not already have a phishing language set. Follow the steps below to enable this option:</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>Phishing languages will autofill once a user uses the Phish Alert Button after the feature has been enabled.</div>\n</div>\n<ol>\n<li>From your KnowBe4 console, click your email address in the top right corner and select <strong>Account Settings</strong>.</li>\n<li>In the Account Integrations section, navigate to the <strong>Phish Alert</strong> settings.</li>\n<li>Under <strong>Office Add-in Settings</strong>, check the box labeled <strong>Autofill Phishing Languages with PAB Locale</strong>.</li>\n<li>Click the <strong>Save Changes</strong> button at the bottom of the page.</li>\n</ol>\n<p>Once you have set a default language and updated your users' language settings, you can <a href='#phishing_campaign'>create a localized phishing campaign</a>.</p>\n<h3 id='admin_console'>Admin Console Language</h3>\n<p>The KnowBe4 admin console can be viewed in the following languages:</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>The <strong>Reporting</strong> tab of your console is localized, except for reports generated as a CSV file. Reports generated as CSV files will not display in the language set for your account. Reports generated as a PDF file will be localized.</div>\n</div>\n<ul>\n<li>English (United States)</li>\n<li>English (Great Britain)</li>\n<li>Japanese</li>\n<li>Portuguese (Brazil)</li>\n<li>German</li>\n<li>French (Europe)</li>\n<li>French (Canada)</li>\n<li>Chinese (Mandarin) - Simplified</li>\n<li>Spanish (Europe)</li>\n<li>Spanish (Latin America)</li>\n<li>Italian</li>\n</ul>\n<p>Admins can set their <strong>Admin Console Language</strong> by following the steps below:</p>\n<ol>\n<li>Log in to the KnowBe4 admin console.</li>\n<li>Click your email address in the top-right corner.</li>\n<li>Click the language at the bottom of the drop-down menu.</li>\n<li>Select your desired language and click Confirm.</li>\n</ol>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Localization/SetMyConsoleLanguage.gif'> <img src='https://helpimg.s3.amazonaws.com/KMSAT/Localization/SetMyConsoleLanguage.gif' alt=''> </a></p>\n<p>If an admin has not set their admin console language, you can update this setting on the <a href='#user_language'>user's profile</a>.</p>\n<p>Once an admin has set their <strong>Admin Console Language</strong>, this language will be applied to most of their KnowBe4 console and admin notifications they receive, such as bulk change results or import notifications.</p>\n<p>Localization is an ongoing improvement, so there may be some parts of the console that have not been localized. Parts of the admin console that are not localized will be displayed in English (United States) and a localized banner will display to notify the admin. If you have questions about what elements of the admin console are localized, please <a href='https://support.knowbe4.com/hc/en-us/requests/new'>contact support</a>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Once a user’s Admin Console Language has been set, the language cannot be changed by another admin.</div>\n</div>\n<h2 id='h_01JQY8XFCWKN9DX5DC0ZJ36WR8'>Set Your Language Settings</h2>\n<p>This section outlines how to set <a href='#default_language'>default languages</a> for your account, update <a href='#user_language'>individual user</a> languages, <a href='#bulk_update'>bulk update</a> phishing languages, and enable localized <a href='#localized_notifications'>training notifications</a>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Because localization is not fully supported for each language, you must set default languages for the account. Content, notifications, and features will be localized when the user’s preferred language is available. If a user’s language is not available, the account’s default language will be used.</div>\n</div>\n<h3 id='default_language'>Set the Default Languages</h3>\n<p>To set your account’s default <strong>Training Language</strong>, follow the steps below:</p>\n<ol>\n<li>From your KnowBe4 console, click your email address in the top right corner and select <strong>Account Settings</strong>.</li>\n<li>Navigate to the <strong>Learner Experience</strong> section of your settings.</li>\n<li>From the <strong>Default Training Language</strong> drop-down menu, select a language for your organization’s account.\n<ul>\n<li>If you plan to use <a href='#localized_notifications'>Localized Training Notifications</a>, we recommend enabling that setting now. Below the default training language drop-down menu, select the <strong>Enable Localized Training Notifications</strong> check box.</li>\n</ul>\n</li>\n<li>Click the <strong>Save Changes</strong> button at the bottom of the page.</li>\n</ol>\n<p>To set your account’s default <strong>Phishing Language</strong>, follow the steps below:</p>\n<ol>\n<li>From your KnowBe4 console, click your email address in the top right corner and select <strong>Account Settings</strong>.</li>\n<li>Navigate to the <strong>Phishing section</strong> of your settings.</li>\n<li>From the <strong>Default Phishing Language</strong> drop-down menu, select a language for your organization’s account.</li>\n<li>Click the <strong>Save Changes</strong> button at the bottom of the page.</li>\n</ol>\n<p>To set your account’s default <strong>Admin Console Language</strong>, follow the steps below:</p>\n<ol>\n<li>From your KnowBe4 console, click your email address in the top right corner and select <strong>Account Settings</strong>.</li>\n<li>Navigate to the <strong>Organization Information</strong> section of your settings.</li>\n<li>From the <strong>Default Admin Console Language</strong> drop-down menu, select a language for your organization’s account.</li>\n<li>Click the <strong>Save Changes</strong> button at the bottom of the page.</li>\n</ol>\n<h3 id='user_language'>Set Individual User Languages</h3>\n<p>To manually update an individual user’s preferred languages, follow the steps below:</p>\n<ol>\n<li>From your KnowBe4 console, go to the <strong>Users</strong> tab.</li>\n<li>From the user list, click any user's name or email to access their profile.</li>\n<li>Click the <strong>User Information</strong> tab.</li>\n<li>\n<p>Find the <strong>User Languages</strong> section, to the right.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Localization/UserLanguages.png'> <img src='https://helpimg.s3.amazonaws.com/KMSAT/Localization/UserLanguages.png' alt=''> </a></p>\n</li>\n<li>If the user’s <strong>Admin Console Language</strong> has not been set, you can select a language from the <strong>Admin Console</strong> drop-down menu.</li>\n<li>To set the <strong>Phishing Language</strong>, select the preferred language from the <strong>Phishing</strong> drop-down menu.</li>\n<li>\n<p>To set the <strong>Training Language</strong>, select the preferred language from the <strong>Training</strong> drop-down menu.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>The user may have already selected their preferred training language in their Learner Experience. We recommend that you only change a user's training language if the user requests that you change it for them.</div>\n</div>\n</li>\n</ol>\n<h3 id='h_01JQY8XFCW0FCD8ABRHBS1SVD1'>User Provisioning - Sync User Phishing and Training Languages</h3>\n<p>You can sync your user phishing and training languages using either ADI or SCIM user provisioning.</p>\n<ul>\n<li>If a user has already set their training language in the Learner Experience (LX), then the training language field won't be changed from a provisioning sync.</li>\n<li>For more information on syncing using ADI, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360015798533-Edit-Your-CONF-File-for-Active-Directory-Integration-ADI#h_01HQNP60G14SW966W3QJHG37NJ'>Syncing Other User Information</a> section of our Edit Your CONF File for Active Directory Integration (ADI) article.</li>\n<li>For more information on syncing using SCIM, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374-SCIM-Configuration-Guide'>SCIM Configuration Guide</a>.</li>\n</ul>\n<h3 id='bulk_update'>Bulk Update Phishing Languages</h3>\n<p>If you are importing users for the first time, create your CSV file as outlined in our <a href='https://support.knowbe4.com/hc/en-us/articles/204873347'>Import Users with a CSV File</a> article, and be sure to include the <strong>Phishing Language</strong> column.</p>\n<p>To bulk update the <strong>Phishing Language</strong> of existing users, follow the steps below:</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>The training language won’t update if the language is already set before the import.</div>\n</div>\n<ol>\n<li>From your KnowBe4 console, go to the <strong>Users</strong> tab.</li>\n<li>From the header of the <strong>Users</strong> list, click the green <strong>Generate CSV</strong> link.\n<ul>\n<li>The generated CSV file will include all of your users and their profile information.</li>\n</ul>\n</li>\n<li>\n<p>Open the CSV file and delete all columns except for <strong>Email</strong> and <strong>Phishing Language</strong>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>This step helps to prevent unintentionally changing or deleting user information.</div>\n</div>\n</li>\n<li>Refer to our <a href='#h_01JQY8FTMV9TFYNMDACM7D9HN4'>Supported Language Codes</a> list and enter the preferred language for the desired users in the corresponding columns.</li>\n<li>Save the CSV file.\n<ul>\n<li>If you are using Excel, CSVs must be saved in the CSV UTF-8 format.</li>\n</ul>\n</li>\n<li>In the KnowBe4 console, navigate to <strong>Users</strong>, then <strong>Import Users</strong>, and click <strong>CSV Import</strong>.</li>\n<li>Click the <strong>Browse</strong> button and select your CSV file.</li>\n<li>Choose your notification settings.</li>\n<li>Click <strong>Import Users</strong> at the bottom of the page.</li>\n</ol>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>Any update errors will be listed in an email that is sent to the admins selected in <strong>Step 7</strong>. If you see the error, \"Language settings training locale is not included in the list\" this means the language code that was entered is not supported. Please check for typos, review our <a href='#h_01JQY8FTMV9TFYNMDACM7D9HN4'>Supported Language Codes list</a>, and try again. For further assistance, <a href='https://support.knowbe4.com/hc/en-us/requests/new'>contact support</a>.</div>\n</div>\n<h3 id='localized_notifications'>Localized Training Notifications</h3>\n<p>Follow the steps below to enable <strong>Localized Training Notifications</strong>:</p>\n<ol>\n<li>From your KnowBe4 console, click your email address in the top right corner and select <strong>Account Settings</strong>.</li>\n<li>Navigate to the <strong>Learner Experience</strong> section of your settings.</li>\n<li>Click the <strong>Enable Localized Training Notifications</strong> checkbox.\n<ul>\n<li>This option can only be enabled after setting a default training language for your account.</li>\n</ul>\n</li>\n<li>Click the <strong>Save Changes</strong> button at the bottom of the page.</li>\n</ol>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Localization is only available for system templates. Templates in your <strong>My Templates</strong> categories will only display in the language they are written in.</div>\n</div>\n<h2 id='h_01JQY8XFCWWGPA0QGZSHG5RZ6S'>Create a Localized Phishing Campaign</h2>\n<p>Once you have set a default language and updated your users' language settings, follow the steps below to create a <strong>Localized Phishing Campaign</strong>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Before you can create a localized phishing campaign, your account will need to have a default phishing language. For more information, see the <a href='#default_language'>Set the Default Languages</a> section of this article.</div>\n</div>\n<ol>\n<li>From your KnowBe4 console, go to the <strong>Phishing</strong> tab, and click <strong>Create Phishing Campaign</strong> in the top right corner.</li>\n<li>Customize the campaign settings to your liking. Review our <a href='https://support.knowbe4.com/hc/en-us/articles/204239938'>Create and Manage Phishing Campaigns</a> article for more information.</li>\n<li>From the <strong>Template Topics</strong> drop-down menu, select the phishing template topics you want to use. You can select one or more phishing template topics.\n<ul>\n<li>\n<strong>Set Template Language</strong>: Use this check box to select the languages you want to use in this phishing campaign. If multiple languages are selected, users will receive templates in any of the selected languages. This setting will override the account’s default phishing language and the language set in the user’s profile. When this check box is selected, the <strong>Language Override Selection</strong> drop-down menu will appear. You can select a maximum of five languages.</li>\n</ul>\n</li>\n<li>Select a <strong>Template Selection</strong> option. Choose from <strong>Full Random</strong>, which includes a random email to each user; <strong>Random</strong>, which includes the same random email to all users; <strong>Specific Template</strong>, which lets you choose one template; or <strong>AI Selected</strong>, <span style='font-weight: var(--font-bold); font-style: italic;'>powered by AIDA</span>, which is for Diamond-level customers only. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500003848062-Automated-Template-Selection-Overview'>Automated Template Selection Overview</a>.\n<ul>\n<li>Localized campaigns set to <strong>Full Random</strong> or <strong>AIDA Selected</strong> will send each user a different template that has been localized in either their preferred language or the account's default language.</li>\n<li>\n<p>Localized campaigns set to<strong> Random</strong> will send the same template to all users in their preferred language or in the account's default language. In recurring campaigns, this feature remembers the last five emails sent and selects a different template for subsequent tests.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>If the templates selected for the campaign are unavailable in both the user's language and the account's default language, the user will not receive a phishing security test.</div>\n</div>\n</li>\n</ul>\n</li>\n<li>When you’re satisfied with your settings, click <strong>Create Campaign</strong>.</li>\n</ol>\n<h2 id='h_01JQY8FTMV9TFYNMDACM7D9HN4'>Localized Landing Pages</h2>\n<p>We also offer Localized Landing Pages, so that users who click a phishing test link can view the page in their preferred language. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360013207193'>Use and Customize Localized Landing Pages</a> article for more information about localized landing pages.</p>\n<h2 id='h_01JQY8XFCW5N6V9VZ8C1ZSRKHM'>Supported Language Codes</h2>\n<p>When setting up localization for your users, be sure to use the language codes listed in the table below. It’s important to follow the format of supported languages, paying attention to both the specific uppercase and lowercase letters. For a full list of supported languages and their availability within the console, see our <a href='https://www.knowbe4.com/security-awareness-training-languages'>Multi-Language Support and Localization page</a>.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>These region-specific languages are supported for both user phishing and training.</div>\n</div>\n<table style='table-layout: auto;'>\n<thead>\n<tr>\n<th scope='col'>Language Code</th>\n<th scope='col'>English Display Name</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>ar-mod</td>\n<td>Arabic</td>\n</tr>\n<tr>\n<td>zh-hk</td>\n<td>Chinese (Cantonese) - Traditional</td>\n</tr>\n<tr>\n<td>zh-cn</td>\n<td>Chinese (Mandarin) - Simplified</td>\n</tr>\n<tr>\n<td>zh-tw</td>\n<td>Chinese (Mandarin) - Traditional</td>\n</tr>\n<tr>\n<td>cs-cz</td>\n<td>Czech</td>\n</tr>\n<tr>\n<td>da-dk</td>\n<td>Danish</td>\n</tr>\n<tr>\n<td>nl-nl</td>\n<td>Dutch</td>\n</tr>\n<tr>\n<td>en-au</td>\n<td>English (Australia)</td>\n</tr>\n<tr>\n<td>en-gb</td>\n<td>English (Great Britain)</td>\n</tr>\n<tr>\n<td>en-us</td>\n<td>English (United States)</td>\n</tr>\n<tr>\n<td>fi-fi</td>\n<td>Finnish</td>\n</tr>\n<tr>\n<td>fr-ca</td>\n<td>French (Canada)</td>\n</tr>\n<tr>\n<td>fr-fr</td>\n<td>French (Europe)</td>\n</tr>\n<tr>\n<td>de-de</td>\n<td>German (Germany)</td>\n</tr>\n<tr>\n<td>he-il</td>\n<td>Hebrew</td>\n</tr>\n<tr>\n<td>hi-in</td>\n<td>Hindi</td>\n</tr>\n<tr>\n<td>hu-hu</td>\n<td>Hungarian</td>\n</tr>\n<tr>\n<td>id-id</td>\n<td>Indonesian</td>\n</tr>\n<tr>\n<td>it-it</td>\n<td>Italian</td>\n</tr>\n<tr>\n<td>ja-jp</td>\n<td>Japanese</td>\n</tr>\n<tr>\n<td>ko-kr</td>\n<td>Korean</td>\n</tr>\n<tr>\n<td>ms-my</td>\n<td>Malay</td>\n</tr>\n<tr>\n<td>nb-no</td>\n<td>Norwegian</td>\n</tr>\n<tr>\n<td>pl-pl</td>\n<td>Polish</td>\n</tr>\n<tr>\n<td>pt-br</td>\n<td>Portuguese (Brazil)</td>\n</tr>\n<tr>\n<td>pt-pt</td>\n<td>Portuguese (Europe)</td>\n</tr>\n<tr>\n<td>ro-ro</td>\n<td>Romanian</td>\n</tr>\n<tr>\n<td>ru-ru</td>\n<td>Russian</td>\n</tr>\n<tr>\n<td>es-es</td>\n<td>Spanish (Europe)</td>\n</tr>\n<tr>\n<td>es-419</td>\n<td>Spanish (Latin America)</td>\n</tr>\n<tr>\n<td>sv-se</td>\n<td>Swedish</td>\n</tr>\n<tr>\n<td>th-th</td>\n<td>Thai</td>\n</tr>\n<tr>\n<td>tr-tr</td>\n<td>Turkish</td>\n</tr>\n<tr>\n<td>uk-ua</td>\n<td>Ukrainian</td>\n</tr>\n<tr>\n<td>vi-vn</td>\n<td>Vietnamese</td>\n</tr>\n</tbody>\n</table>\n<p>We’ve also included additional region-specific phishing languages when you create a phishing campaign for better localization support.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>These region-specific languages are only supported for account phishing language and user phishing language settings. They are not supported for any training language settings.</div>\n</div>\n<table style='table-layout: auto;'>\n<thead>\n<tr>\n<th scope='col'>Language Code</th>\n<th scope='col'>English Display Name</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>sq-al</td>\n<td>Albanian</td>\n</tr>\n<tr>\n<td>ar-sa</td>\n<td>Arabic (Saudi Arabia)</td>\n</tr>\n<tr>\n<td>bg-bg</td>\n<td>Bulgarian</td>\n</tr>\n<tr>\n<td>my-mm</td>\n<td>Burmese</td>\n</tr>\n<tr>\n<td>hr-hr</td>\n<td>Croatian</td>\n</tr>\n<tr>\n<td>nl-be</td>\n<td>Dutch (Belgium)</td>\n</tr>\n<tr>\n<td>en-at</td>\n<td>English (Austria)</td>\n</tr>\n<tr>\n<td>en-ca</td>\n<td>English (Canada)</td>\n</tr>\n<tr>\n<td>en-in</td>\n<td>English (India)</td>\n</tr>\n<tr>\n<td>en-ie</td>\n<td>English (Ireland)</td>\n</tr>\n<tr>\n<td>en-my</td>\n<td>English (Malaysia)</td>\n</tr>\n<tr>\n<td>en-nz</td>\n<td>English (New Zealand)</td>\n</tr>\n<tr>\n<td>en-sg</td>\n<td>English (Singapore)</td>\n</tr>\n<tr>\n<td>en-za</td>\n<td>English (South Africa)</td>\n</tr>\n<tr>\n<td>et-ee</td>\n<td>Estonian</td>\n</tr>\n<tr>\n<td>fr-be</td>\n<td>French (Belgium)</td>\n</tr>\n<tr>\n<td>fr-ch</td>\n<td>French (Switzerland)</td>\n</tr>\n<tr>\n<td>de-at</td>\n<td>German (Austria)</td>\n</tr>\n<tr>\n<td>de-ch</td>\n<td>German (Switzerland)</td>\n</tr>\n<tr>\n<td>el-gr</td>\n<td>Greek</td>\n</tr>\n<tr>\n<td>hi-in</td>\n<td>Hindi (India)</td>\n</tr>\n<tr>\n<td>is-is</td>\n<td>Icelandic</td>\n</tr>\n<tr>\n<td>lv-lv</td>\n<td>Latvian</td>\n</tr>\n<tr>\n<td>lt-lt</td>\n<td>Lithuanian</td>\n</tr>\n<tr>\n<td>ms-my</td>\n<td>Malay (Malaysia)</td>\n</tr>\n<tr>\n<td>sr-latn-rs</td>\n<td>Serbian (Latin)</td>\n</tr>\n<tr>\n<td>sk-sk</td>\n<td>Slovak</td>\n</tr>\n<tr>\n<td>sl-si</td>\n<td>Slovenian (Slovenia)</td>\n</tr>\n<tr>\n<td>es-ar</td>\n<td>Spanish (Argentina)</td>\n</tr>\n<tr>\n<td>es-cl</td>\n<td>Spanish (Chile)</td>\n</tr>\n<tr>\n<td>es-co</td>\n<td>Spanish (Colombia)</td>\n</tr>\n<tr>\n<td>es-mx</td>\n<td>Spanish (Mexico)</td>\n</tr>\n<tr>\n<td>sw-ke</td>\n<td>Swahili</td>\n</tr>\n</tbody>\n</table>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360060622513-Localization-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Localization/SetMyConsoleLanguage.gif",
      "alt": "This image displays the KnowBe4 administrator dashboard interface, focusing on the \"Organization's Risk Score\" panel.\n\n**Header and Navigation:**\nThe top bar features the \"KnowBe4\" logo and tagline (\"Human error. Conquered.\"). The primary navigation menu includes (left to right, with \"DASHBOARD\" highlighted): PHISHING, TRAINING, SECURITYCOACH, VISHING, USERS, ASAP, PHYSICAL TESTS (dropdown), SECOND CHANCE, MODSTORE, REPORTS, and PASSWORDIQ. The user context is displayed on the top right as \"qa-admin@kb4u-demo.com.\" A grid-layout icon is present near the top right corner for display options.\n\n**Dashboard Content:**\nThe page title is \"Dashboard.\" The central element is a panel titled **\"Organization's Risk Score.\"**\n\n1.  **Risk Score History (Line Graph):** This section displays the \"Organization's combined Risk Score for all users\" over time (March '23 to August '23). The Y-axis (Risk Score) ranges from 0 to 100, segmented at 25, 50, and 75. The data plot shows a stable Risk Score fluctuating around the 25–30 level.\n\n2.  **Current Risk Score (Gauge Indicator):** A color-coded, semi-circular gauge displays the current score. The gauge is segmented into zones: Green (low risk, 0-20), Yellow (moderate risk, 20-40), Orange (higher risk, 40-60), and Red (highest risk, 60-100). The needle indicates a numerical score of **30**, placing the organization in the Yellow (moderate risk) category.\n\n3.  **Guidance Text:** Below the gauge, the text reads: \"See our Virtual Risk Officer (VRO) Guide for details about how Risk Scores are calculated.\"\n\nA subsequent panel title, \"Phishing,\" is partially visible at the bottom of the screen, indicating additional dashboard content below the fold. An orange circular floating button, likely a refresh or help icon, is visible in the bottom right corner.",
      "position": 1,
      "context": "op-down menu.\nSelect your desired language and click Confirm."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Localization/UserLanguages.png",
      "alt": "This UI section is titled **User Languages** (H2 style, separated by a horizontal rule). It presents three configuration options for selecting language settings, each utilizing a labeled dropdown menu and accompanied by a circular information icon (**?**).\n\nThe configuration fields are:\n\n1.  **Admin Console:** Dropdown menu currently showing the placeholder text **Select option**.\n2.  **Phishing:** Dropdown menu currently showing the placeholder text **Select option**.\n3.  **Training:** Dropdown menu currently showing the active selection **English (United States)**.\n\nAll three settings are stacked vertically, with their associated selection boxes aligned to the right. The dropdown menus include a visible downward-pointing chevron.",
      "position": 2,
      "context": "g> tab.\n\nFind the User Languages section, to the right."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "localization"
    ],
    "image_count": 2
  }
}