{
  "article": {
    "id": 360035472113,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360035472113.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360035472113.html",
    "author_id": 10164786027,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 5,
    "vote_count": 9,
    "section_id": 26428411265939,
    "created_at": "2019-09-06T21:44:10Z",
    "updated_at": "2025-08-19T20:29:06Z",
    "name": "Use Cases for Placeholders",
    "title": "Use Cases for Placeholders",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-06-18T17:21:56Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [
      "01J8MWKY24ZPNAN8T1GRS31VGN"
    ],
    "label_names": [
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>Our placeholders feature lets you create highly customizable and dynamic phishing templates. The placeholders are useful for creating a phishing template that is sure to get your users to click a link or open an attachment.</p>\n<p>In this article, we have compiled a few fun examples of how our placeholders can be used in your phishing templates. If you would like a full list of our placeholders and how they can be used, visit our article <a href='https://support.knowbe4.com/hc/en-us/articles/204949707-How-To-Use-Placeholders'>here</a>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Some of the placeholders mentioned in this article require account and user information to be filled in before using the placeholder. Using an empty placeholder will result in a blank space where the placeholder should be.</div>\n</div>\n<div class='js-tabs'>\n<div title='Account Information'>\n<p>The following examples illustrate how company-specific information can be used to customize phishing templates if the fields are completed in the Account Owner's Account Settings:</p>\n<ul>\n<li>\n<strong>[[street_address_1]]:</strong> \"A new restaurant is opening near you! <strong>2002 Cyberchasers Lane</strong> Click here to check out their menu.\"</li>\n<li>\n<strong>[[city]] [[state]]:</strong> \"Breaking news: Mayor of <strong>Galaga, Arizona</strong> has been fired due to being in the center of a local college admission scandal.\"</li>\n<li>\n<strong>[[zip_code]]:</strong> \"New zoning regulations are being put in place and your zip code, <strong>102590,</strong> is affected. Click here to see the new regulations.</li>\n</ul>\n</div>\n<div title='User Information'>\n<p>The following examples illustrate how user-specific information can be used to customize phishing templates. The information must be completed in the user profile prior to use.</p>\n<ul>\n<li>\n<strong>[[first_name]]:</strong> \"Congratulations <strong>Silas</strong>! You have won an all-inclusive resort stay for two on the beautiful island of Jamaica. Click here to redeem your prize before time runs out.\"</li>\n<li>\n<strong>[[last_name]]: </strong>\"As part of our newest promotion, Spirit Airlines is giving discounted plane tickets to people with the last name, <strong>Schrute</strong>.\"</li>\n<li>\n<strong>[[job_title]]: </strong>\"We are excited to inform you that the following position, <strong>Chief Chatter</strong>, will be relocating to our newest location in Philadelphia, Pennsylvania!\"</li>\n<li>\n<strong>[[phone_number]]: </strong>\"Your phone number, <strong>281-330-8004</strong>, was found on the following website along with other private information. To remove your information from this website, click here.\"</li>\n<li>\n<strong>[[location]]: </strong>\"User 352954 is asking you to verify your location. Is the following location correct? <strong>123 Sesame Street</strong>.\"</li>\n<li>\n<strong>[[division]]: </strong>\"Due to recent budget cuts, the following departments will be liquidated within the next month: <strong>Food Science</strong>. If you have any questions, please reach out to your manager or HR.\"</li>\n<li>\n<strong>[[manager_name]]: </strong>\"Your manager, <strong>Michael Uzumaki</strong>, told me to reach out to you about the due date of this project. I need it to be moved up a couple of days before the original due date.\"</li>\n<li>\n<strong>[[manager_email]]: </strong>\"The following email has sent you a document on Google Drive: <strong>ErikN2beinBP2@gmail.com</strong>\"</li>\n</ul>\n</div>\n<div title='Miscellaneous Placeholders'>\n<p>The following examples illustrate how our miscellaneous placeholders can be used to create time-sensitive templates or add a shock value to the template.</p>\n<ul>\n<li>\n<strong>[[random_number_1]]: </strong>\"You have <strong>5</strong> new email(s) that need your immediate attention.\"</li>\n<li>\n<strong>[[random_number_2]]: </strong>\"Buy up to <strong>65</strong> in raffle tickets for the chance to win a 65\" flatscreen TV! See your manager for more information.\"</li>\n<li>\n<strong>[[random_number_3]]: </strong>\"You currently have an outstanding balance of <strong>$509</strong> on your account. Please pay the balance by the end of the day to stop your account from being deactivated.\"</li>\n<li>\n<strong>[[current_date_0]]: </strong>\"Please make sure that all of your work is done no later than <strong>9/24/2019</strong> at 11:59 pm.\"</li>\n<li>\n<strong>[[current_date_10]]: </strong>\"Our email system will experience an update on <strong>10/4/2019</strong>. It will be down for approximately 30 minutes.\"</li>\n<li>\n<strong>[[callback_phishing_phone_number]]: </strong>\"On the off chance you might want to change/drop the subscription, contact the Customer Service Center at: <strong>727-345-6789\"</strong>\n</li>\n<li>\n<strong>[[callback_phishing_code]]: </strong>\"Please have your personal support code ready to reference your account. <strong>123456</strong>”</li>\n</ul>\n</div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360035472113-Use-Cases-for-Placeholders",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "cases",
        "for",
        "placeholders",
        "use"
      ],
      "image_count": 0
    }
  }
}