{
  "article": {
    "id": 360001696627,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360001696627.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360001696627.html",
    "author_id": 360322304667,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 98,
    "vote_count": 116,
    "section_id": 4410339705875,
    "created_at": "2018-07-10T16:10:09Z",
    "updated_at": "2025-03-11T17:07:39Z",
    "name": "Phish Alert Button (PAB) in Gmail for Google Chrome Guide",
    "title": "Phish Alert Button (PAB) in Gmail for Google Chrome Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:07:39Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "phish alert",
      "pab",
      "phish alert button",
      "gsuite",
      "g suite",
      "end users",
      "gpab",
      "localized",
      "answerbot",
      "answerbot_enduser"
    ],
    "body": "<p>Your organization may have recently installed the Phish Alert Button (PAB) in your Google Chrome browser. Learn how this tool works and how you can use it to help keep your organization safe from malicious phishing emails.</p>\n<h2 id='h_01HGH6EYGBH8R487KKADMK4W4K'>When Do I Use the PAB?</h2>\n<p>Click the PAB if you believe you have received a phishing email or any potentially dangerous email. Any emails you report using the PAB will be automatically deleted from your inbox. The emails you report will also be forwarded to a designated contact in your organization for analysis.</p>\n<p>The PAB should only be used to report emails you believe to have malicious intent. If you are receiving spam or marketing emails, you should not use the PAB to report these emails. You can delete these types of emails or add the sender or sender's email domain to a block list.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>The steps for blocking an email sender vary based on your email client. Contact your supervisor or IT team with any questions.</div>\n</div>\n<h2 id='h_01HGH6EYGBEQ68CRVFE0GVK7DC'>How Do I Use the PAB?</h2>\n<p>Once the PAB add-in is installed, you will be prompted with a message to allow the KnowBe4 PAB application during your next Google Chrome restart. Click the <strong>Allow</strong> button on this message.</p>\n<p>After allowing the PAB application, you will see the PAB as an orange fish hook icon in Gmail. You can use the fish hook icon to report any email as a phishing email, but you cannot use the PAB to report multiple emails at once. Each potential phishing email should be reported individually. However, if an email has multiple emails associated with it, all of the associated emails will be reported when you report the first email.<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/phish_alert/PAB%20Allow.png'><img src='https://s3.amazonaws.com/helpimg/phish_alert/PAB%20Allow.png' alt=' '></a></p>\n<div class='was-callout-note callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>In order to report potential phishing emails using the Google Chrome PAB extension, you must be logged in to Google Chrome and your Gmail account.</div>\n</div>\n<p>There are three different ways to report an email as a phishing email:</p>\n<ol role='list'>\n<li>Click the <strong>fish hook</strong> icon at the top of an email. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Email_PAB.png'><img src='https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Email_PAB.png' alt=' '></a>\n</li>\n<li>Select the check box next to an email in the inbox. Then, click the <strong>fish hook</strong> icon in the inbox toolbar.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Inbox_SelectedMessage_PAB.png'><img src='https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Inbox_SelectedMessage_PAB.png' alt=' '></a>\n</li>\n<li>Click the vertical <strong>ellipsis</strong> icon in the upper right corner of an email. From the drop-down menu that opens, click <strong>Phish Alert</strong>.</li>\n</ol>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>The <strong>Report phishing</strong> option reports the email to Google but does not forward it to the email address designated by your organization.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Email_Ellipsis_PAB.png'><img src='https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Email_Ellipsis_PAB.png' alt=' '></a></p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>By using any one of the three options, the email you report will be forwarded to an email address designated by your organization and then deleted from your inbox. If you report an email in error, then you can retrieve the email from your Trash folder or your Deleted Items folder.</div>\n</div>\n<h2 id='h_01HGH6EYGBN591PP2S7BHR29W0'>Why Should I Use the PAB?</h2>\n<p>By reporting emails, you help your organization stay safe. Reported emails are sent to your organization for analysis, so your organization will know which phishing attacks are reaching employees' inboxes. Once your organization is aware of possible vulnerabilities, it can better defend against them. You are an important part of the process of keeping your organization safe. Stop, look, and think!</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360001696627-Phish-Alert-Button-PAB-in-Gmail-for-Google-Chrome-Guide",
    "images": [
      {
        "url": "https://s3.amazonaws.com/helpimg/phish_alert/PAB%20Allow.png",
        "alt": "This image displays a standard Google OAuth permissions screen requesting user authorization for a third-party application.\n\n**Branding and Context:**\nThe interface features the Google logo in the top left corner, centered on a white background.\n\n**Application Identity and Request:**\nThe application, identified as **\"KnowBe4 Phish Alert,\"** is centered below two application-specific icons (a user silhouette and an envelope with a fishing hook). The prompt reads: \"KnowBe4 Phish Alert would like to:\"\n\n**Requested Permissions (Scopes):**\nTwo specific permissions are listed, each accompanied by a service icon (Gmail/Google) and an information icon (i):\n\n1.  **View and modify but not delete your email** (Associated with the red Gmail icon).\n2.  **Send email on your behalf** (Associated with the blue Google 'g' icon).\n\n**Disclosure and Footer:**\nA mandatory disclosure statement precedes the action buttons, detailing data usage: \"By clicking Allow, you allow this app and Google to use your information in accordance with their respective privacy policies. You can change this and other Account Permissions at any time.\" Links are provided for \"privacy policies\" and \"Account Permissions.\"\n\n**Action Buttons:**\nThe user is presented with two options in the lower right corner:\n1.  **Deny** (Secondary button, grey border).\n2.  **Allow** (Primary action button, solid blue highlight).",
        "position": 1,
        "context": "ils associated with it, all of the associated emails will be reported when you report the first emai"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Email_PAB.png",
        "alt": "This image displays the upper toolbar and initial content of a web application interface, likely an email or messaging client.\n\n**UI Elements (Toolbar, Left to Right):**\nThe top row features a horizontal action toolbar containing the following operational icons: Back Arrow, Archive (Down Arrow into Box), Report (Exclamation Point), Delete (Trash Can), Mark as Unread (Envelope with Dot), Snooze (Clock), Mark Complete (Checkmark with Plus), Move to Folder (Folder with Plus), and an Overflow Menu (Vertical Ellipsis).\n\n**Highlighted Element:**\nThe final actionable icon before the Overflow Menu is highlighted by a thick orange square outline. The icon itself is a stylized orange **Fishing Hook**.\n\n**Content and Context:**\nDirectly below the toolbar, the content pane shows the beginning of a message or document. The visible text is the subject line: \"Tips for using your new inbox.\" A gray pill-shaped tag, labeled \"Inbox x\" (indicating a category label or tab closure), follows the subject line.",
        "position": 2,
        "context": "il:\n\nClick the fish hook icon at the top of an email."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Inbox_SelectedMessage_PAB.png",
        "alt": "This image captures a section of an email client interface, displaying message filtering options, a contextual action bar, and a partial list of emails.\n\n**UI Elements and Context:**\n\n1.  **Filtering Toolbar:** The top row contains four active dropdown selectors: `From`, `Any time`, `Has attachment`, and `To`. To the right is a blue hyperlink labeled `Advanced search`.\n2.  **Contextual Action Bar:** A set of icons is displayed below the filters, indicating available actions for selected messages. Icons present include (from left): Deselect, More Actions (dropdown arrow), Not Spam/Block, Report Spam, Delete, Mark as Unread, Snooze, Move to, and Label.\n3.  **Highlighted Element (Phishing Indicator):** An icon resembling an orange **fishing hook** is prominently featured in the action bar and surrounded by a solid orange square bounding box, visually indicating focus or interaction with this specific control. This icon typically represents a **Report Phishing/Security Threat** function.\n4.  **Email List:** Three emails are visible below the action bar.\n    *   **Selected Message:** The first email is highlighted in light blue, showing a checked checkbox. The sender is `do-not-reply`, and it is labeled `Inbox`. The subject line begins `KnowBe4 Security Tips - How Bad Guys Bypass Your Email S...` (truncated).\n    *   **Subsequent Messages:** Two unselected messages follow, originating from `The Google Workspac...` and `The G Suite Team`, both labeled `Inbox`.",
        "position": 3,
        "context": "Then, click the fish hook icon in the inbox toolbar."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PAB/Chrome/EN/Chrome_Email_Ellipsis_PAB.png",
        "alt": "The image displays a desktop webmail client (Gmail) viewing an open email message.\n\n**Message Details:**\nThe email is dated \"Thu, May 4, 7:36 AM,\" has the subject \"Welcome to Chrome Browser Cloud Management!\", and is sent from \"The Google Chrome Team\" `<chrome-noreply@google.com>`. The body content discusses the addition of a \"Chrome Browser Cloud Management subscription... at no cost,\" and directs the user to the \"Google Admin console.\"\n\n**UI Interaction and Focus Element:**\nAn active context menu, opened from the \"More options\" icon in the message header, is visible on the right side of the screen. This menu lists standard options including:\n\n*   Reply\n*   Forward\n*   Filter messages like this\n*   Print\n*   Delete this message\n*   Block \"The Google Chrome Team\"\n*   Report spam\n*   Report phishing\n*   Show original\n*   Translate message\n*   Download message\n*   Mark unread from here\n\nThe final option in the menu, clearly marked by an orange pointer arrow, is the security-specific function: **Phish Alert**. This element is identified by a fishing hook icon and the accompanying text.",
        "position": 4,
        "context": "not forward it to the email address designated by your organization."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "alert",
        "chrome",
        "for",
        "gmail",
        "google",
        "pab",
        "phish"
      ],
      "image_count": 4
    }
  }
}