{
  "id": 360024073373,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360024073373.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360024073373.html",
  "author_id": 368027116814,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 14,
  "vote_count": 18,
  "section_id": 26266430305299,
  "created_at": "2019-05-31T13:15:24Z",
  "updated_at": "2025-07-22T09:34:32Z",
  "name": "Create a Branded Training Certificate",
  "title": "Create a Branded Training Certificate",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-07-11T20:54:11Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "training",
    "localized",
    "answerbot",
    "answerbot_kmsat",
    "answerbot_enduser"
  ],
  "body": "<p>When your users complete their assigned training content, they will have the option to download a training certificate. You can customize these training certificates by creating and uploading custom background images that match your organization's brand, such as an image with your organization’s brand colors and logo. By branding your training certificates, you can provide your users with a familiar learning experience.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>You can also use our Brandable Content feature in the ModStore to customize your users’ training content. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360047284433.html'>Brandable Content</a> article.</div>\n</div>\n<h2 id='iv_01H84GAE29JXW0FXHBZQMY7YJG'>Creating Branded Certificates</h2>\n<p>To create a branded certificate, you can use one of our templates or create your own certificate. You can customize elements on the certificate by adding your organization's logo, choosing specific font colors, and adding a background image.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>You will not be able to change the font size, color, or position for the text that is automatically generated from your KSAT console. This text includes the user's first name and last name, the training course name, the expected duration of the course, the date when the training was completed, and confirmation that the user accepted a policy if applicable.</div>\n</div>\n<p>To create your branded certificate, follow the steps below:</p>\n<ol>\n<li>Download one of our certificate templates from the <a href='#h_01G4ZGW89XD70K76294BNW3XF2'>Certificate Templates</a> section below or create your own template. Please note that your template must meet the requirements listed in step 3 below.</li>\n<li>Customize the template. When you customize the template, make sure to include the following elements:\n<ul>\n<li>A heading, such as \"Certificate of Achievement\".</li>\n<li>A black line where the user's name will be added.</li>\n<li>Additional text, such as \"has successfully completed\".</li>\n</ul>\n<div class='callout-warning'>\n<div class='callout__content'>\n<strong>Important:</strong>The elements in our templates align with text that is automatically generated from your KSAT console, such as the user’s name. If you change the location of these elements in our templates, the elements may not align with the text.</div>\n</div>\n</li>\n<li>Before you upload your certificate, make sure that your certificate meets the following specifications:\n<ul>\n<li>The certificate must be saved as either a PNG or JPEG file. If you save your certificate as a PNG file, you will need to save the file as <a href='https://www.creitive.com/global/blog/which-image-file-format-to-choose#:~:text=A%20non%2Dinterlaced%20image%20is,quality%2C%20pixelated%2C%20or%20blurred.' target='_blank' rel='noopener'>non-interlaced</a>.</li>\n<li>The certificate's dimensions must be 2200 x 1700 pixels.</li>\n<li>The file size should be no larger than 5 MB.</li>\n</ul>\n</li>\n</ol>\n<p>After you create your branded certificate, follow the steps in the <a href='#h_01G4ZFR82ZZM5AB79E19PZGFX2'>Uploading Branded Certificates</a> section of this article.</p>\n<h2 id='iv_h_01G4ZGW89XD70K76294BNW3XF2'>Certificate Templates</h2>\n<p>We offer four templates that you can use to help you create a branded certificate. You can download any of these templates and modify them however you would like.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>The elements in our templates align with automatically generated text, such as the user’s name. If you change the location of these elements in our templates, the elements may not align with the text.</div>\n</div>\n<p>We offer templates for PNG files, PDF files, Apple Keynote, and Microsoft PowerPoint. For more information about our templates and to learn about our recommended use cases for each template, see the sections below.</p>\n<h3 id='iv_01H84GAE29PT5S8EP3DX06EXK7'>Plain PNG Template</h3>\n<p>We recommend that you use this template if you would like to create a branded certificate but don't have access to design programs such as Adobe Photoshop. This template is quick and easy to edit.</p>\n<p>To customize this template, follow the steps below:</p>\n<ol>\n<li>\n<a href='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/png_certificate_template.png' target='_blank' rel='noopener'>Click here</a> to download the template as a PNG file.</li>\n<li>Open the file in an image editor.</li>\n<li>Customize the template in the image editor.</li>\n</ol>\n<p>For an example of a PNG file template, see the image below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/png_certificate_template_sample.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/png_certificate_template_sample.png' alt='KnowBe4 Certificate of Achievement'></a></p>\n<h3 id='iv_01H84GAE29FA72Z0GDNHAWKZ5Q'>PDF Template</h3>\n<p>We recommend that you use this template if you have access to design programs and you would like to make more advanced changes to your certificate.</p>\n<p>To customize this template, follow the steps below:</p>\n<ol>\n<li>\n<a href='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/pdf_certificate_template.pdf' target='_blank' rel='noopener'>Click here</a> to download the template as a PDF file.</li>\n<li>Open the file in a design program, such as Adobe Photoshop.</li>\n<li>\n<p>Customize the template in the design program. The pink boxes in the file show you where generated text, such as the user's name, will be displayed. Delete these boxes before you save the file as a PNG file or a JPEG file.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+campaigns/trainingcertificates_pdfbox2.png'><img src='https://helpimg.s3.amazonaws.com/training+campaigns/trainingcertificates_pdfbox2.png' alt=' '></a></p>\n</li>\n<li>After you have customized the template, save the file as a PNG or JPEG file.</li>\n</ol>\n<p>For an example of a PDF file template, see the image below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/pdf_certificate_template_sample.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/pdf_certificate_template_sample.png' alt=' '></a></p>\n<h3 id='iv_01H84GAE29QMWFTBB72Q7BZYJ6'>Apple Keynote Template</h3>\n<p>If you use Apple Keynote, you can use this template to add your company logo to the certificate. To customize this template, follow the steps below:</p>\n<ol>\n<li>\n<a href='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/keynote_template.key' target='_blank' rel='noopener'>Click here</a> to download the template file.</li>\n<li>Open the file in Keynote.</li>\n<li>Customize the template. Please note that you can't change the font size, color, or positioning of the automatically generated text.</li>\n<li>After you've customized the template, convert the file to a PNG file by clicking <strong>File</strong> &gt; <strong>Export To</strong> &gt; <strong>Image</strong>. Then, select <strong>PNG</strong>.</li>\n</ol>\n<p>For an example of an Apple Keynote template, see the image below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/keynote_template_samplev2.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/keynote_template_samplev2.png' alt=' '></a></p>\n<h3 id='iv_01H84GAE290KQ6YZPSR9K07T9V'>Microsoft PowerPoint Template</h3>\n<p>If you use Microsoft PowerPoint, you can use this template to add your company logo to the certificate.</p>\n<p>To customize this template, follow the steps below:</p>\n<ol>\n<li>\n<a href='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/powerpoint_template.pptx' target='_blank' rel='noopener'>Click here</a> to download the template file.</li>\n<li>Open the file in Microsoft PowerPoint.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>This template is a Microsoft PowerPoint file. However, you can also edit this file in other presentation programs.</div>\n</div>\n</li>\n<li>Customize the template. Please note that you can't change the font size, color, or positioning of the automatically generated text.</li>\n<li>After you've customized the template, convert the file to a PNG file or a JPEG file by clicking <strong>File</strong> &gt; <strong>Export</strong>. Then, change the file type to PNG or JPEG.</li>\n</ol>\n<p>For an example of a Microsoft PowerPoint template, see the image below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/powerpoint_template_sampleV2.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/powerpoint_template_sampleV2.png' alt=' '></a></p>\n<h2 id='iv_h_01G4ZFR82ZZM5AB79E19PZGFX2'>Uploading Branded Certificates </h2>\n<p>Once you've created your branded certificate, you can upload it to your KSAT console.</p>\n<p>To upload your branded certificate, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Click on your email address at the top-right corner of the page and select <strong>Account Settings</strong>.</li>\n<li>From the menu on the left side of the page, navigate to <strong>Account Information</strong> &gt; <strong>Branding</strong>.</li>\n<li>Under <strong>Upload Branded Certificate</strong>, click <strong>Choose File</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/brandedcertificate.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/brandedcertificate.png' alt=' '></a></p>\n</li>\n<li>In the pop-up window that opens, select the file for your branded certificate.</li>\n<li>Click <strong>Save Changes</strong> at the bottom of the page.</li>\n</ol>\n<p>You can preview your certificate at any time by clicking <strong>Preview Current Certificate</strong>.</p>\n<h2 id='iv_h_01G4ZFR02X7VPXTPCY7FF6AHZW'>Removing Branded Certificates</h2>\n<p>If at any time you want to remove your branded certificate, you can do so from your <strong>Account Settings</strong> page. To remove a branded certificate, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Click your email address at the top-right corner of the page and select <strong>Account Settings</strong>.</li>\n<li>From the menu on the left side of the page, navigate to <strong>Account Information</strong> &gt; <strong>Branding</strong>.</li>\n<li>Under the <strong>Upload Branded Certificate</strong> section, click <strong>Remove</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/removecertificate.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/removecertificate.png' alt=' '></a></p>\n</li>\n<li>Click<strong> Save Changes</strong> at the bottom of the <strong>Account Settings</strong> page.</li>\n</ol>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360024073373-Create-a-Branded-Training-Certificate",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/png_certificate_template_sample.png",
      "alt": "",
      "position": 1,
      "context": "ample of a PNG file template, see the image below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/training+campaigns/trainingcertificates_pdfbox2.png",
      "alt": "This image is a digital template for a \"CERTIFICATE OF ACHIEVEMENT,\" designed for dynamic content population and editing.\n\n**Document Structure and Branding:**\n1.  **Header:** The top center features a circular, orange medallion icon depicting a stylized trophy (with a star) surrounded by a laurel wreath, signifying achievement.\n2.  **Title:** The document title, in large orange capital letters, is \"CERTIFICATE OF ACHIEVEMENT.\"\n3.  **Security Features:** The document perimeter includes a thick gray border. All four corners feature security elements: stylized gray quarter-circle overlays with a central dark gray padlock icon, set against a subtle, light gray wavy background pattern (guilloche).\n\n**UI Elements and Data Fields (Interactive/Editable Content):**\n\nThe template uses distinct magenta-bordered input fields to indicate editable content, each paired with a \"DELETE\" control button.\n\n1.  **Recipient Field:** Introduced by the gray static text \"PRESENTED TO.\"\n    *   **Placeholder Text:** \"Name and Surname\" (magenta).\n    *   **Control:** A magenta button labeled \"DELETE.\"\n\n2.  **Context Field:** Introduced by the gray static text \"FOR THE SUCCESSFUL COMPLETION OF.\"\n    *   **Placeholder Text:** \"Course Name\" (magenta).\n    *   **Control:** A magenta button labeled \"DELETE.\"\n\n3.  **Metadata Fields (Two smaller fields):**\n    *   **Field 1 (Duration):** Placeholder text \"Duration\" (magenta), associated with a \"DELETE\" control button.\n    *   **Field 2 (Date):** Placeholder text \"Date\" (magenta), associated with a \"DELETE\" control button.\n\n**Context:** This visual representation functions as a UI editor preview, displaying dynamic input fields and their corresponding deletion controls within a structured, formal document layout.",
      "position": 2,
      "context": "ete these boxes before you save the file as a PNG file or a JPEG file."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/pdf_certificate_template_sample.png",
      "alt": "A technical description of the image:\n\nThis is a digital template for an achievement certificate, featuring a white background with a subtle, light-gray guilloché pattern of horizontal waves covering the interior field.\n\n**Borders and Graphics:**\nThe template uses a thin gray border. Each of the four corners features a decorative, rounded gray graphical element containing a small padlock icon, suggesting authenticity or security features typical of formal documents.\n\nA large, circular, textured seal graphic, colored vibrant orange (or dark salmon), is centered at the top. This seal contains an outline icon of a trophy cup topped with a star, surrounded by laurel branches.\n\n**Text and Layout (Top to Bottom):**\n1.  **Main Title:** The primary text, centered and displayed in a large, bold, orange, sans-serif font, reads: **\"CERTIFICATE OF ACHIEVEMENT\"**.\n2.  **Recipient Introduction:** Centered beneath the main title is the smaller, thin, gray text: \"PRESENTED TO\".\n3.  **Name Placeholder:** A centered horizontal line serves as a placeholder for the recipient's name.\n4.  **Completion Context:** Below the name line, centered in small, thin, gray text, is the phrase: \"FOR THE SUCCESSFUL COMPLETION OF\".\n5.  **Course/Program Placeholder:** A second, similar horizontal line is provided for specifying the activity or program.",
      "position": 3,
      "context": "ample of a PDF file template, see the image below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/keynote_template_samplev2.png",
      "alt": "This image displays a template for a digital certificate of achievement, characterized by a centered, structured layout on a white background.\n\n**Header and Branding:**\n*   **Logo:** Centered near the top is the company logo, \"KnowBe4,\" rendered primarily in orange, with the accompanying tagline below: \"Human error. Conquered.\"\n*   **Iconography:** Positioned to the right of the logo is a small, stylized illustration of a dark blue laptop displaying data lines on its screen, indicating digital completion or training.\n\n**Core Content:**\n*   **Title:** The central element is the large, bold, dark gray text reading: \"Certificate of Achievement.\"\n\n**Structure and Placeholders:**\n*   **Separator:** A thin, horizontal gray line is positioned below the main title, acting as a visual separator and implicit placeholder for variable data (e.g., the recipient's name).\n*   **Conditional Text:** Below the separator line, smaller, centered text continues the achievement statement: \"has successfully completed.\" (This text confirms the function of the preceding line as a required input field for the recipient's identity.)",
      "position": 4,
      "context": "ample of an Apple Keynote template, see the image below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/powerpoint_template_sampleV2.png",
      "alt": "This image displays a high-level template for a digital achievement certificate, centered on a white background with a subtle gray double-line border.\n\n**Header and Branding:**\nThe top-center features the corporate branding: The KnowBe4 logo, rendered in orange and black, is accompanied by the tagline \"Human error. Conquered.\" A small, stylized icon depicting a laptop screen with data visualizations is positioned immediately to the right of the logo.\n\n**Primary Content:**\nThe central focus is the title, displayed in large, bold, dark gray font: \"Certificate of Achievement.\"\n\n**Input and Transitional Elements:**\nBelow the main title is a long, horizontal thin gray line, functioning as a mandatory data field or placeholder for the recipient's name. Directly below this placeholder line, the centered text \"has successfully completed\" acts as transitional language leading into the subsequent, currently blank, field for the specific course name.",
      "position": 5,
      "context": "a Microsoft PowerPoint template, see the image below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/brandedcertificate.png",
      "alt": "This image displays a UI configuration panel titled **\"Branding\"**. The interface consists of several input fields and actions for customizing brand elements.\n\n1.  **\"Company Logo URL\"**: An empty text input field is provided, accompanied by a help icon (question mark inside a circle).\n2.  **\"Company Logo\"**: This section includes a help icon and a blue button labeled **\"Manage\"**.\n3.  **\"Brand Color\"**: This section includes a help icon, a color swatch displaying orange (`#f26421`), and a corresponding text input field showing the hex code `#f26421`.\n4.  **\"Upload Branded Certificate\"**: This section is highlighted by an orange rectangular border. It includes a help icon and a file upload control comprising a read-only text box displaying **\"No file chosen\"** and a gray button labeled **\"Choose File\"**.\n\nBelow the main input fields, two blue hyperlink actions are present:\n\n*   **\"Preview Current Certificate\"** (preceded by an eye icon).\n*   **\"View Our Branded Certificates Guide\"** (preceded by a book/guide icon).\n\nThe overall design is clean, using a white background and standard gray text for labels.",
      "position": 6,
      "context": "d Branded Certificate, click Choose File."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Certificates/removecertificate.png",
      "alt": "This image displays a UI configuration panel titled \"Branding,\" dedicated to customizing corporate visual elements.\n\n**UI Elements and Configuration Fields:**\n\n1.  **Company Logo URL:** A text input field for external URL linking, currently empty. Includes a context help icon (?).\n2.  **Company Logo:** Associated with a primary action button labeled \"Manage.\" Includes a context help icon (?).\n3.  **Brand Color:** Displays a successful configuration. It features a color swatch showing the color orange, next to a text input field containing the hexadecimal code `#f26421`. Includes a context help icon (?).\n4.  **Upload Branded Certificate:** This section displays the current state of an uploaded asset.\n    *   **Preview:** A small thumbnail preview of the certificate template is visible.\n    *   **Removal Button:** A highlighted red button labeled \"Remove\" (with a trash can icon) indicates the option to delete the current upload.\n    *   **File Status:** The previously uploaded file is identified as `png_certificate_template_sample`.\n    *   **Upload Control:** A passive button labeled \"Choose File\" is available for selecting a replacement file. Includes a context help icon (?).\n\n**Navigation and Actions (Footer):**\n\nTwo supplementary action links are present below the configuration fields:\n*   \"Preview Current Certificate\" (linked with a view/checkmark icon).\n*   \"View Our Branded Certificates Guide\" (linked with a booklet icon).",
      "position": 7,
      "context": "Branded Certificate section, click Remove."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "branded",
      "certificate",
      "training"
    ],
    "image_count": 7
  }
}