{
  "id": 360021582594,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360021582594.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360021582594.html",
  "author_id": 21027160967,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 2,
  "vote_count": 2,
  "section_id": 8746226512787,
  "created_at": "2019-04-16T21:26:51Z",
  "updated_at": "2025-03-11T17:20:02Z",
  "name": "How to Create and Configure Questionnaires",
  "title": "How to Create and Configure Questionnaires",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T17:20:02Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "Vendor Risk Management",
    "KCM Vendor",
    "Vendor Module",
    "Vendor Questionnaires",
    "Vendor Assessments",
    "answerbot_kcmgrc"
  ],
  "body": "<p>In the KCM GRC Vendor Risk Management module, you can centralize your third-party risk management processes. You can use questionnaires to determine the level of risk that vendors and third parties pose for your organization. Questionnaires can help you learn about the vendor or third party and the amount of data they will need to access.</p>\n<p>Before you can send questionnaires to your users, you will need to create and configure the questionnaires in your platform. To create a questionnaire, you can add questions from our questionnaire templates or add your own custom questions. </p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> As a best practice, we recommend that you create questionnaires as the first step of onboarding in the Vendor Risk Management module. For the full list of recommended steps for working in this module, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021083194' target='_blank' rel='noopener'>Vendor Risk Management Module Guide</a>.</div>\n</div>\n<p>See the sections below to learn how to create, configure, finalize, and clone questionnaire assessments. </p>\n\n<h2 id='h_01HVVY2G0E3FTC1PM9VJJMN9MV'>What Type of Questionnaire Should I Create?</h2>\n<p>As part of your vendor or third-party risk management program, you will need to identify the types of questionnaires you want to create. You should base your questionnaires on the requirements your organization needs to meet, the frameworks your organization needs to follow, and the types of data your vendors may need to access. </p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> The data that your vendors will have access to will affect the level of risk that working with the vendors will pose for your organization. For example, an IT contractor who has more access to your organization’s data would likely pose a higher level of risk than an organization that you lease printers from.</div>\n</div>\n<p>If you need help deciding which questionnaire template to use, Standardized Information Gathering (SIG) questionnaires are more general than Consensus Assessments Initiative Questionnaires (CAIQ). CAIQ questionnaires are more specific for vendors that offer cloud services. The Full versions of these questionnaires cover a wider range of topics than the Lite versions of questionnaires. If you think that the level of risk associated with a vendor will be low, you may determine that you only need to use the Lite version. However, if you think that the level of risk associated with a vendor will be moderate or high, you may determine that you need to use a Full version. If you're unsure what types of data the organization will need to access and can't predict the level of risk associated with the vendor, the Full version of a questionnaire may help you gain a more comprehensive understanding than the Lite version.</p>\n\n<h2 id='h_01HVVY2G0E0HQHT1E9JAG9WKCB'>Creating Questionnaires</h2>\n<p>After you have decided what type of questionnaire to create, you can create your questionnaire from the <strong>Questionnaires</strong> tab of your platform.</p>\n<p>To create a questionnaire, follow the steps below:</p>\n<ol role='list'>\n<li>From your navigation panel, navigate to <strong>Vendor Management</strong> &gt; <strong>Questionnaires</strong>.</li>\n<li>Click the <strong>Create New Questionnaire</strong> button at the top-right corner of the page.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_CreateButton.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_CreateButton.png' width='408' height='274' alt=' '></a>\n</li>\n<li>Fill out the fields on the <strong>New Questionnaire</strong> page. For more information, see the list below:\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>We recommend that you avoid including the &lt; and &gt; special characters in these fields.</div>\n</div>\n\n<ol role='list' type='a'>\n<li>\n<strong>Name: </strong>Enter a name for your questionnaire. This name will display in the email notification that the vendor will receive when you send them the questionnaire. The name will also display in the <strong>Vendor Portal</strong> when the vendor logs in to KCM GRC. </li>\n<li>\n<strong>Description:</strong> Enter a description for your questionnaire. The description will only be visible to Vendor Administrators and Account Administrators. </li>\n<li>\n<strong>Type:</strong> Select <strong>Public</strong> for external vendors or <strong>Internal</strong> for internal vendors.</li>\n</ol>\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Details.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Details.png' alt=' '></a>\n</li>\n<li>Click the <strong>Next</strong> button.</li>\n<li>Add questions to your questionnaire by using our questionnaire templates or by adding custom questions. For more information, see the related articles listed below:\n<ul role='list'>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/6178225578259' target='_self'>How to Add and Configure Questions from Questionnaire Templates</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/6163892028563' target='_self'>How to Create and Configure Custom Questions in a Questionnaire</a></li>\n</ul>\n</li>\n<li>Configure the questions in your questionnaire. Depending on whether the questions are from questionnaire templates or are custom questions, see the articles listed below:\n<ul role='list'>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/6178225578259' target='_self'>How to Add and Configure Questions from Questionnaire Templates</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/6163892028563' target='_self'>How to Create and Configure Custom Questions in a Questionnaire</a></li>\n</ul>\n</li>\n</ol>\n\n<h2 id='h_01HVVY2G0ETHASFWM6CZFQ6A3H'>Sorting Questions</h2>\n<p>When you create a questionnaire, the questions will automatically be listed in the order you add them to the questionnaire. Before you mark your questionnaire as <strong>Reviewed</strong>, you can sort the questions in any order that you would like.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> You can view the position of each question in the <strong>Adjust Question Order</strong> field.</div>\n</div>\n<p>To sort the questions in a questionnaire, follow the steps below:</p>\n<ol role='list'>\n<li>From the questionnaire builder, navigate to the question that you would like to move.</li>\n<li>Click the <strong>Adjust Question Order</strong> field next to the question.</li>\n<li>Either click the <strong>arrow</strong> buttons or enter a number into the field to specify the new position of the question.\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important: </strong>If you are using Microsoft Edge, the <strong>arrow</strong> buttons will not display in this field. Therefore, you will need to click the field and enter a number instead of using the <strong>arrow</strong> buttons.</div>\n</div>\n\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Sorting_PressEntertosave.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Sorting_PressEntertosave.png' alt=' '></a>\n</li>\n<li>Press the <strong>Enter</strong> key on your keyboard to save the new position. When you click this button, the question will automatically be moved to the new position.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> The question that was previously in that position will automatically be moved to the following position. For example, if question A is in the 7th position and you move question B to the 7th position, question A will be moved to the 8th position.</div>\n</div>\n</li>\n</ol>\n\n<h2 id='h_01HVVY2G0EYJTVD54YV4YAA4ND'>Reviewing and Finalizing Questionnaires</h2>\n<p>As a final step before you can send a questionnaire to vendors, a Vendor Administrator or an Account Administrator will need to mark the questionnaire as <strong>Reviewed</strong>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> Before completing these steps, make sure that you do not need to make any changes to your questionnaire. After a questionnaire is marked as <strong>Reviewed</strong>, you will not be able to change it.</div>\n</div>\n<p>To review and finalize a questionnaire, follow the steps below:</p>\n<ol role='list'>\n<li>From your navigation panel, navigate to <strong>Vendor Management</strong> &gt; <strong>Questionnaires</strong>.</li>\n<li>From the <strong>Name </strong>column, select the questionnaire that you would like to review.</li>\n<li>In the <strong>Questionnaire Versions</strong> section of the page, click the <strong>Review</strong> button. \n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_ReviewButton.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_ReviewButton.png' alt=' '></a>\n</li>\n<li>Navigate through the questions in the questionnaire by selecting each of the question sets on the left side of the page. If the questionnaire contains questions from a questionnaire template, click the arrows next to the name of the questionnaire template to expand the list of sections that are in the template.</li>\n<li>Review the questions and the points that are assigned to each question. \n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> As an alternative to reviewing the questions from the <strong>Update Questionnaire</strong> page, you can click the <strong>Preview</strong> button to view the template from a similar perspective to how the vendor will see the questionnaire.</div>\n</div>\n</li>\n<li>After you review all of the questions, click the <strong>Mark as Reviewed</strong> button in the top-right corner of the page. When you click this button, the questionnaire will be in the <strong>Reviewed</strong> status.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_MarkasReviewedButton.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_MarkasReviewedButton.png' alt=' '></a>\n</li>\n</ol>\n<p>Now, you can send the questionnaire to your vendors. To learn how to send the questionnaire, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360038671833' target='_self'>How to Send Questionnaires to Vendors</a> article.</p>\n\n<h2 id='h_01HVVY2G0E8CHSRADE5T70MFZ6'>Cloning Questionnaires</h2>\n<p>Once a questionnaire is marked as <strong>Configured</strong>, you can clone the questionnaire to make a duplicate copy. You can then modify the cloned questionnaire as needed.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> When you clone a questionnaire, the cloned questions will still be associated with the original questionnaire. After you mark the original questionnaire as <strong>Reviewed</strong>, you will not be able to edit the questions in the cloned questionnaire.</div>\n</div>\n<p>To clone a questionnaire, follow the steps below:</p>\n<ol role='list'>\n<li>From your navigation panel, navigate to <strong>Vendor Management</strong> &gt; <strong>Questionnaires</strong>.</li>\n<li>From the <strong>Name</strong> column, select the questionnaire that you would like to clone.</li>\n<li>In the <strong>Questionnaire Version</strong><strong>s</strong> section of the page, click the <strong>Clone</strong> button. \n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Clonebutton.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Clonebutton.png' alt=' '></a>\n</li>\n<li>In the confirmation window that opens, click the <strong>Yes</strong> button to clone the questionnaire. When you click this button, the <strong>Update Questionnaire</strong> page of the cloned questionnaire will open.\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip: </strong>The cloned questionnaire will have the same name as the original version with \"-Cloned\" added at the end. If you would like, you can change the name of the cloned questionnaire in the <strong>Name</strong> field.</div>\n</div>\n</li>\n</ol>\n<p>From the <strong>Update Questionnaire</strong> page, you can edit questions, change the number of points assigned to questions, and add additional questions to your questionnaire.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360021582594-How-to-Create-and-Configure-Questionnaires",
  "images": [
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_CreateButton.png",
      "alt": "This image displays a segment of a web application interface, focusing on action buttons and header navigation.\n\n**Header Navigation:**\nThe top navigation bar includes links with associated icons for:\n1.  **Support** (Globe/Mesh Icon)\n2.  **Settings** (Gear Icon)\n3.  A user profile icon followed by partially obscured user identification information.\n\n**Action Panel:**\nA content panel, delineated by a blue border, contains two primary action buttons:\n1.  **Primary Button:** A teal/blue rectangular button labeled \"Create New Questionnaire.\"\n2.  **Secondary Button:** A similar blue button immediately to the right, labeled \"Back.\"\n\n**Page Controls:**\nIn the lower right corner, page configuration controls are visible:\n*   A text label reading \"Page Size:\"\n*   A numeric input field displaying the current value \"20,\" accompanied by vertical spinner controls for value adjustment.\n\n**Instructional Overlay:**\nA solid, thick orange arrow overlays the interface, pointing specifically to the \"Create New Questionnaire\" button, indicating it as the target of the current operation or instruction.",
      "position": 1,
      "context": "aire button at the top-right corner of the page."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Details.png",
      "alt": "This image displays the initial screen for creating a new digital asset titled **\"New Questionnaire.\"** This section is labeled **\"Details,\"** indicated by a section heading and a blue demarcation bar.\n\nThe screen contains three required input fields for defining the asset's attributes:\n\n1.  **Name \\***: A single-line text field populated with the string **\"CAIQ Full Questionnaire 2019.\"**\n2.  **Type**: A dropdown menu currently set to the value **\"Public.\"**\n3.  **Description \\***: A multi-line text area (textarea) populated with the string **\"CAIQ Full Questionnaire 2019.\"**\n\nNavigation controls are located in the upper right corner: a gray **\"Back\"** button and a primary action, green **\"Next\"** button. The \"Next\" button is circled, indicating the designated user action for proceeding to the subsequent step in the creation process.",
      "position": 2,
      "context": "or Internal for internal vendors."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Sorting_PressEntertosave.png",
      "alt": "This image depicts a single questionnaire item within a user interface, featuring a question prompt, an active data input field, and associated editing controls.\n\n**Question Prompt:**\nThe element is introduced by the text: \"How long has your organization been in operation?\"\n\n**Active Input Area (Highlighted):**\nThe primary input area is enclosed in a prominent orange-red bounding box, indicating current focus or edit mode. It contains:\n1.  **Numerical Input:** A field displaying the value \"1,\" equipped with spinner arrows for incrementing or decrementing the value.\n2.  **Cancel Control:** A white button immediately adjacent to the input field, marked with a slashed circle icon (denoting Cancel or Dismiss changes).\n\n**Action Tooltip:**\nA black, rectangular tooltip is positioned above the input field, containing the instruction text in white: \"Press the Enter key to save.\"\n\n**Ancillary Controls and Metadata (Right Rail):**\nThe right side of the element contains persistent control options:\n1.  **Edit Button:** A small button displaying a pencil icon.\n2.  **Delete Button:** A red button displaying a trash can icon.\n3.  **Tags/Labels:** Two categorical tags are present: a light blue tag labeled \"Free Form Text\" and a dark green tag labeled \"Informational.\"",
      "position": 3,
      "context": "arrow buttons."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_ReviewButton.png",
      "alt": "This interface displays the **Questionnaire Versions** configuration page, featuring a data table summarizing existing questionnaire drafts.\n\n**UI Elements and Content:**\n1.  **Title:** \"Questionnaire Versions.\"\n2.  **Search Function:** A text input field placeholder reads \"Search Versions...\"\n3.  **Data Table Structure:** The table includes columns labeled **Name**, **Date Created**, and **Status**.\n4.  **Data Record (One Entry):**\n    *   **Name:** \"Pre-Assessment (External)\"\n    *   **Date Created:** \"November 7, 2019\"\n    *   **Status:** A blue status tag labeled \"Configured.\"\n    *   **Action Button (Highlighted):** A clickable button labeled **Review**, preceded by a gear/cog icon, appears in the final column. This element is emphasized by an orange circular highlight.\n5.  **Summary:** The record count below the table states, \"One record.\"",
      "position": 4,
      "context": "n of the page, click the Review button."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_MarkasReviewedButton.png",
      "alt": "A cropped screenshot displaying a section of a web application's interface, featuring two standard UI buttons positioned near the top right of a content area.\n\n1.  **Context:** The elements are set against a white background, suggesting a modal, document editor, or workflow view. A thin horizontal blue line is visible at the very top, indicating the boundary of a header or navigation bar.\n2.  **Button 1 (Left):** A standard light gray rectangular button labeled \"Preview\" in dark gray text.\n3.  **Button 2 (Right, Focused):** A standard light gray rectangular button labeled **\"Mark as Reviewed\"** in dark gray text. This button is visually highlighted by a thick, hand-drawn orange elliptical outline, indicating it is the target of the instruction or focus of the image.\n4.  **Action:** The image documents the presence and location of the \"Preview\" and \"Mark as Reviewed\" action buttons within a digital workflow interface.",
      "position": 5,
      "context": "will be in the Reviewed status."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_Create_Questionnaires/VendorQuest_Clonebutton.png",
      "alt": "The image displays a section of a web application titled **\"Questionnaire Versions.\"**\n\n**UI Context and Data Table:**\nThe screen features a search input field labeled \"Search Versions...\" and a data table summarizing questionnaire records. The table columns are **Name**, **Date Created**, and **Status**.\n\n**Record Details:**\nA single record is listed:\n*   **Name:** Informational Introduction and CAIQ (2019)\n*   **Date Created:** November 8, 2019\n*   **Status:** Displayed in a blue tag labeled \"Configured.\"\n\n**Actions and Highlighted Element:**\nInline action buttons are present for the record:\n1.  A button labeled **Review** (preceded by a gear icon).\n2.  A button labeled **Clone** (preceded by a duplication icon). This button is highlighted by an orange ellipse, indicating it is the focus of the instruction.\n3.  A button labeled **Export** (preceded by an export/arrow icon).\n\nThe footer confirms the table content with the text **\"One record.\"**",
      "position": 6,
      "context": "ion of the page, click the Clone button."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "configure",
      "questionnaires"
    ],
    "image_count": 6
  }
}