{
  "id": 360045245034,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360045245034.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360045245034.html",
  "author_id": 21027160967,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 3,
  "vote_sum": 3,
  "vote_count": 3,
  "section_id": 8745355339283,
  "created_at": "2020-03-27T17:24:12Z",
  "updated_at": "2025-03-11T17:27:55Z",
  "name": "How to Create Custom Templates for Scopes",
  "title": "How to Create Custom Templates for Scopes",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T17:27:55Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "KCM Compliance",
    "answerbot_kcmgrc"
  ],
  "body": "<p>In KCM GRC, a <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115016129608.html' target='_self'>template</a> holds a set of <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115016129608.html' target='_self'>requirements</a> that you can work toward under a <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115016129608.html' target='_self'>scope</a>. To help you meet your compliance objectives, we offer a variety of managed templates that you can use in your platform. We are continually adding new templates to KCM GRC based on the number of requests that we receive. For a current list of all managed templates that we offer, please see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360022753993.html' target='_self'>Managed Templates</a> article. </p>\n<p>If your organization needs to work toward a scope that we do not offer as a managed template, you can create a custom template for your platform. You can add requirements to the custom template by importing requirements in bulk, mapping existing requirements, or creating requirements one-by-one. Then, you can convert the custom template into a scope and begin working toward its scoped requirements. </p>\n<p>Please see the sections below to learn how to create a custom template, prepare a set of requirements, and add requirements to the custom template.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> If you have already created a template and added requirements to it, refer to our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360046703714.html' target='_self'>How to Convert a Template to a Scope</a> article to learn how to convert the template to a scope.</div>\n</div>\n<h2 id='h_01J82M61AV1RK14N0RQNV94QQH'>Creating a Custom Template</h2>\n<p>First, create a custom template by following the instructions below. </p>\n<ol role='list'>\n<li>From the navigation panel, select <strong>Compliance</strong> &gt; <strong>Templates</strong>.</li>\n<li>Click the <strong>Create</strong> button in the top-right area of the page.</li>\n<li>In the <strong>Create Template </strong>window, add details to your template by following the instructions below. \n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>We recommend that you avoid including the &lt; and &gt; special characters in these fields. </div>\n</div>\n<ol role='list' type='a'>\n<li>\n<strong>Name:</strong> Enter a name for the custom template. The name should either represent the type of requirements that you will add to the template or the objective of meeting the requirements in the template.</li>\n<li>\n<strong>Version:</strong> Enter the template's version or revision number. This information is for your own reference.</li>\n<li>\n<strong>Tag(s):</strong> (Optional) If you'd like, add one or more tags to group similar templates in your platform.\n<ul role='list'>\n<li>To create a new tag, type one or more words into the field, and press Enter on your keyboard. Tags have a maximum of 25 characters, including spaces.</li>\n<li>To select an existing tag, select a tag from the drop-down menu.</li>\n</ul>\n</li>\n</ol>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_CreateTemplate.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_CreateTemplate.png' alt=' '></a>\n</li>\n<li>Click <strong>Create</strong> to save your new template.</li>\n</ol>\n<p>Once you've created a template, the next step is to add requirements. See the sections below to learn about requirements and the methods that you can use to add requirements to a template.</p>\n<p><a name='IDENTIFYING'></a></p>\n<h2 id='h_01J82M61AWFYXFFNBHZDN677W4'>Identifying Actionable Requirements</h2>\n<p>As a best practice, the requirements that you add to your template should all be actionable. Actionable requirements include an action that your organization must perform to meet an objective. Often, actionable requirements clearly state what you need to do to comply with a regulation or standard. Requirements that are not actionable do not prompt your organization to perform a specific action. Many requirements that are not actionable only involve other parts of the document, such as other requirements or chapters. By only adding actionable requirements, your organization will be able to focus on the objectives that you are working to meet. </p>\n<p>Please see the table below for examples of requirements that are actionable and requirements that are not actionable.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>These examples are from our HIPAA Privacy and Breach v1.0 managed template.</div>\n</div>\n<table>\n<tbody>\n<tr>\n<td class=''><strong>Actionable</strong></td>\n<td class=''><strong>Not Actionable</strong></td>\n</tr>\n<tr>\n<td>\n<p><strong>164.508 (c)(4) Authorization - Copy to the Individual</strong></p>\n<p>If a covered entity seeks an authorization from an individual for a use or disclosure of protected health information, the covered entity must provide the individual with a copy of the signed authorization.</p>\n<p><strong>Explanation</strong>: This requirement clearly tells you what you need to do to comply with the regulation. The action is to give a copy of the signed authorization to the person who authorized the disclosure.</p>\n</td>\n<td>\n<p><strong> 164.414 (a) Administrative Requirements and Burden of Proof</strong></p>\n<p>A covered entity is required to comply with theadministrative requirements of 164.530(b), (d), (e), (g), (h), (i), and (j) with respect to the requirements of this subpart.</p>\n<p><strong>Explanation</strong>: The only action in this requirement applies to other requirements in the document. This requirement does not clearly tell you what to do to comply with a regulation.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>164.404 (a)(1) Breach Notification to Individuals - Notification</strong></p>\n<p>A covered entity shall, following the discovery of a breach of unsecured protected health information, notify each individual whose unsecured protected health information has been, or is reasonably believed by the covered entity to have been, accessed, acquired, used, or disclosed as a result of such breach.</p>\n<p><strong>Explanation</strong>: This requirement clearly tells you what you need to do to comply with the regulation. The action is to notify individuals that their information was involved in a data breach. </p>\n</td>\n<td>\n<p><strong>164.502 (g)(1) Personal Representatives</strong></p>\n<p>As specified in this paragraph, a covered entity must, except as provided in paragraphs (g)(3) and (g)(5) of this section, treat a personal representative as the individual for purposes of this subchapter.</p>\n<p><strong>Explanation</strong>: The only action in this requirement applies to the subchapter of the document. This requirement does not clearly tell you what to do to comply with a regulation. </p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>164.502 (a)(4) Business Associates: Required Uses and Disclosures</strong></p>\n<p>A business associate is required to disclose protected health information:(i) When required by the Secretary under subpart C of part 160 of this subchapter to investigate or determine the business associate's compliance with this subchapter.(ii) To the covered entity, individual, or individual's designee, as necessary to satisfy a covered entity's obligations under 164.524(c)(2)(ii) and (3)(ii) with respect to an individual's request for an electronic copy of protected health information.</p>\n<p><strong>Explanation</strong>: This requirement clearly tells you what you need to do to comply with the regulation. The action is to disclose protected health information in the two situations that are listed in (i) and (ii). </p>\n</td>\n<td>\n<p><strong>164.502 (b)(2) Minimum Necessary Does Not Apply</strong></p>\n<p>This requirement does not apply to:(i) Disclosures to or requests by a health care provider for treatment; (ii) Uses or disclosures made to the individual, as permitted under paragraph (a)(1)(i) of this section or as required by paragraph (a)(2)(i) of this section;(iii) Uses or disclosures made pursuant to an authorization under 164.508; (iv) Disclosures made to the Secretary in accordance with subpart C of part 160 of this subchapter; (v) Uses or disclosures that are required by law, asdescribed by 164.512(a); and (vi) Uses or disclosures that are required for compliance with applicable requirements of this subchapter.<strong>Explanation</strong>: The requirement only applies to the document and does not include an action. This requirement does not clearly tell you what to do to comply with a regulation.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p><a name='IMPORT_BULK'></a></p>\n<h2 id='h_01J82M61AW50QB4R1JDC2725AF'>Importing Requirements in Bulk</h2>\n<p>Importing your requirements in bulk is the most efficient way to add requirements to a template. We recommend that you import your requirements in bulk if your requirements directly come from an existing regulation or framework.</p>\n<p>See the subsections below to learn how to prepare a spreadsheet of requirements and import the spreadsheet into your platform. <a name='PREPARING'></a></p>\n<h3 id='h_01J82M61AW0SHNRVRCXBBE0FB4'>Preparing a Spreadsheet of Requirements</h3>\n<p>After you create your custom template, you can prepare a spreadsheet of requirements.</p>\n<p>To prepare your spreadsheet, follow the steps below.</p>\n<ol role='list'>\n<li>Open a spreadsheet in your preferred spreadsheet program, such as Microsoft Excel.</li>\n<li>In the spreadsheet, use the header line below. \n<pre>primary_id,sub_id,name,description</pre>\n</li>\n<li>In a separate window, open the regulation or framework that your template is based on. </li>\n<li>In the regulation or framework, identify an actionable requirement in the regulation or framework. To learn how to differentiate between requirements that are actionable and requirements that are not actionable, see the <a href='#IDENTIFYING' target='_self'>Identifying Actionable Requirements</a> section above.</li>\n<li>By using the table below, enter the requirement's information into the spreadsheet.\n<table>\n<tbody>\n<tr>\n<td class=''><strong>Header</strong></td>\n<td class=''><strong>Description </strong></td>\n<td class=''><strong>Character Limit</strong></td>\n</tr>\n<tr>\n<td>primary_id</td>\n<td>Enter a <strong>Primary ID</strong> for the requirement. To learn about the <strong>Primary ID</strong>, see the <a href='#ID' target='_self'>Using the Primary ID and Sub ID Fields</a> section below. </td>\n<td>1-20 characters</td>\n</tr>\n<tr>\n<td>sub_id</td>\n<td>Enter a <strong>Sub ID</strong> for the requirement. To learn about the <strong>Sub ID</strong>, see the <a href='#ID' target='_self'>Using the Primary ID and Sub ID Fields</a> section below. </td>\n<td>1-20 characters</td>\n</tr>\n<tr>\n<td>name</td>\n<td>Enter a name that you can use to identify the requirement. </td>\n<td> 1-255 characters</td>\n</tr>\n<tr>\n<td>description</td>\n<td>Enter a requirement description. This description can include objectives, processes, or procedures that your organization must implement and document to meet the requirement.</td>\n<td> 1-65,535 characters </td>\n</tr>\n</tbody>\n</table>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>We recommend that you avoid including the &lt; and &gt; special characters in your spreadsheet. When you import the CSV file into your platform, these special characters can cause fields to import unsuccessfully.</div>\n</div>\n</li>\n<li>Repeat step 4 and step 5 until you have entered all actionable requirements into the spreadsheet.  \n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>When you import a CSV file into your platform, KCM GRC automatically removes duplicate entries. For example, if you enter two requirements with the same <strong>Primary ID</strong>, <strong>Sub ID</strong>, <strong>name</strong>, and <strong>description</strong>, only one of the requirements will import.</div>\n</div>\n</li>\n<li>Save the spreadsheet as a CSV file. \n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> If you are using Microsoft Excel for your spreadsheet, you must save your CSV file in the CSV UTF-8 (Comma-delimited) format.</div>\n</div>\n</li>\n</ol>\n<p><a name='ID'></a></p>\n<h3 id='h_01J82M61AWNSV699VY3TTX2MHC'>Using the Primary ID and Sub ID Fields</h3>\n<p>In the<strong> Primary ID</strong> and <strong>Sub ID</strong> fields, you can enter the <strong>Primary ID</strong> and <strong>Sub ID</strong> for each requirement. Then, when you add requirements to a template, the characters you entered into the <strong>Primary ID</strong> and <strong>Sub ID</strong> fields will combine to create the requirement's <strong>Requirement ID</strong>. For example, if your <strong>Primary ID</strong> is \"a\" and your <strong>Sub ID</strong> is \"1\", the <strong>Requirement ID</strong> would be \"a.1\".</p>\n<p>Requirements are ordered by their <strong>Requirement IDs</strong> in templates and in the scopes that are converted from templates. KCM GRC uses natural sort order to sort requirements by <strong>Requirement ID</strong>. By using this method, <strong>Requirement IDs</strong> are sorted in alphabetical and numerical order, and numbers with multiple digits are considered as one number. For example, a requirement with <strong>Requirement ID</strong> \"a.3\" would appear before a requirement with <strong>Requirement ID</strong> \"a.20.\" You can select a separator, including as a comma, hyphen, period, or space, when you import or add requirements into your platform.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> You can use numbers, letters, and special characters in the <strong>Primary ID</strong> and <strong>Sub ID</strong> fields. When we create KCM GRC's managed templates, we use the <strong>Primary ID</strong> and <strong>Sub ID</strong> to reference the section and subsection that the requirement is located in, within the framework. </div>\n</div>\n<p><a name='IMPORTING'></a></p>\n<h3 id='h_01J82M61AWR9PHKKCDSSXKMVYV'>Importing the Spreadsheet into KCM GRC</h3>\n<p>After you save your spreadsheet, follow the steps below to import your requirements into KCM GRC.</p>\n<ol role='list'>\n<li>From the <strong>Template Requirements</strong> section of the template page, click the <strong>Import</strong> button. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/TemplateRequirements_Importbutton.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/TemplateRequirements_Importbutton.png' alt=' '></a>\n</li>\n<li>From the <strong>Import Requirement CSV</strong> window, click the <strong>Click to Upload</strong> button.</li>\n<li>Select the CSV file that contains your requirements.</li>\n<li>(Optional) In the preview of requirements that will be imported, click the trash can icon to remove any requirements from the import. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM_CustomTemplates/KCM_Requirements_Delete+and+Select+Separator.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM_CustomTemplates/KCM_Requirements_Delete+and+Select+Separator.png' alt=' '></a>\n</li>\n<li>(Optional) Use the <strong>ID Separator</strong> menu to select a character that the system will place between the <strong>Primary ID</strong> and <strong>Sub ID</strong> for each of your requirements. This is a visual preference. If you do not make a selection, the default ID separator will be used, as described below.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> If your <strong>Primary ID</strong> and <strong>Sub ID</strong> only contain numbers, the default separator will be a period (.). If your <strong>Primary ID</strong> and <strong>Sub ID</strong> contain numbers and letters, the default separator will be a space ( ).</div>\n</div>\n</li>\n<li>Click the <strong>Add Requirements</strong> button to import the requirements into your template.</li>\n</ol>\n<p>Once you have added all of the necessary requirements to this template, you can convert it to a scope. See our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360046703714.html' target='_self'>How to Convert a Template to a Scope</a> article for instructions. <a name='MapExisting'></a></p>\n<p><a name='MAPPING'></a></p>\n<h2 id='h_01J82M61AW3976XXMY3TM9FMM0'>Mapping Existing Requirements</h2>\n<p>You can map requirements that already exist in your account to your template. This includes requirements that you've added from the <strong>View All Requirements</strong> page, requirements that you've added to other custom templates, and requirements in <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360022753993.html' target='_self'>managed templates</a>.</p>\n<p>Follow the steps below to map requirements to your template.</p>\n<ol role='list'>\n<li>From the <strong>Template Requirements</strong> area of the template page, click the <strong>Map</strong> button. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_Mapbutton.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_Mapbutton.png' alt=' '></a>\n</li>\n<li>In the <strong>Map Requirements to Template</strong> modal window, use the check boxes to select the requirements that you want to map.  <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM_CustomTemplates/KCM_Requirements_Map+Requirements+to+Template.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM_CustomTemplates/KCM_Requirements_Map+Requirements+to+Template.png' alt=' '></a>\n</li>\n<li>Scroll to the bottom of the window and click <strong>Done Mapping</strong>. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_DoneMapping.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_DoneMapping.png' alt=' '></a>\n</li>\n</ol>\n<p>Once you have added all of the necessary requirements to this template, you can convert it to a scope. See our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360046703714.html' target='_self'>How to Convert a Template to a Scope</a> article for instructions.</p>\n<p><a name='OneByOne'></a></p>\n<h2 id='h_01J82M61AWHBAQSXTVRJCMYT6Y'>Creating Requirements One-By-One</h2>\n<p>Follow the steps below to create template requirements individually. Please see the <a href='#IDENTIFYING' target='_self'>Identifying Actionable Requirements</a> section for examples of requirements. </p>\n<ol role='list'>\n<li>From the <strong>Template Requirements</strong> area of the page, click the <strong>Create</strong> button. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplate_Createbutton.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplate_Createbutton.png' alt=' '></a>\n</li>\n<li>Add details for your requirement by following the instructions below.\n<ol role='list' type='a'>\n<li>\n<strong>Name:</strong> Add a name to identify your requirement.</li>\n<li>\n<strong>Description:</strong> Describe the purpose of the requirement. The requirement description can include objectives, processes, or procedures that need to be implemented and documented in order to meet the requirement.</li>\n<li>\n<strong>Primary ID </strong>and<strong> Sub ID:</strong> Enter a <strong>Primary ID</strong> and <strong>Sub ID</strong> for the requirement. To learn about the <strong>Primary ID</strong> and <strong>Sub ID</strong>, see the <a href='#ID' target='_self'>Using the Primary ID and Sub ID Fields</a> section below. </li>\n<li>\n<strong>ID Separator:</strong> (Optional) Use the drop-down menu to select a character that the system will place between the<strong> Primary ID</strong> and <strong>Sub ID</strong> for each of your requirements. This is a visual preference. If you do not select a character, the default ID separator will be used, as described below.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If your <strong>Primary ID</strong> and <strong>Sub ID</strong> only contain numbers, the default separator will be a period (.). If your <strong>Primary ID</strong> and <strong>Sub ID</strong> contain numbers and letters, the default separator will be a space ( ).</div>\n</div>\n</li>\n</ol>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplate_CreateRequirementpage.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplate_CreateRequirementpage.png' alt=' '></a>\n</li>\n<li>Click the <strong>Create</strong> button.</li>\n<li>Repeat steps 1-3 for each requirement that you want to add to your template.</li>\n</ol>\n<p>Once you have added all of the necessary requirements to this template, you can convert it to a scope. See our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360046703714.html' target='_self'>How to Convert a Template to a Scope</a> article for instructions.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360045245034-How-to-Create-Custom-Templates-for-Scopes",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_CreateTemplate.png",
      "alt": "This image displays the **Create Template** screen within an application, located via the breadcrumb: **Compliance > Template > Create Template**.\n\nThe core element is the form titled **\"Add new Template,\"** requiring three inputs:\n\n1.  **Name\\*** (a): A required text field populated with the value **\"NIST SP800-171 (Custom).\"**\n2.  **Version\\*** (b): A required text field populated with the value **\"Rev. 2.\"**\n3.  **Tag(s)** (c): A multi-select input field displaying the currently selected tag **\"NIST\"** in a blue pill-box format.\n\nThe form includes two action buttons located at the bottom right: a secondary **Cancel** button (gray) and a primary **Create** button (green) for submitting the new template data.",
      "position": 1,
      "context": "a tag from the drop-down menu."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/TemplateRequirements_Importbutton.png",
      "alt": "This image depicts a segment of a software application's data management interface, focused on \"Template Requirements.\"\n\n**Title and Context:**\nThe primary header, centrally displayed on the left, is \"Template Requirements.\"\n\n**Action Controls (Top Right):**\nA group of three distinct, blue-colored action buttons is positioned to the right of the title:\n1.  **Create**\n2.  **Map**\n3.  **Import** (This button is explicitly highlighted with a non-UI specific orange circular outline and pointed to by an orange arrow.)\n\n**Pagination Control:**\nDirectly below the action buttons is a pagination control labeled \"Page Size:\". This control features an input box containing the value \"100\" and an associated spinner/selector for adjusting the number of entries displayed per page.\n\n**Data Grid Headers (Partial View):**\nThe bottom portion displays the header row of a data table structure. Column headers are:\n1.  **Requirement ID** (Includes a bidirectional sorting icon)\n2.  **Name** (Includes a bidirectional sorting icon)\n3.  **Description** (Includes a bidirectional sorting icon)\n4.  **Action**",
      "position": 2,
      "context": "te page, click the Import button."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM_CustomTemplates/KCM_Requirements_Delete+and+Select+Separator.png",
      "alt": "This image displays the lower section of a UI intended for managing data records and system configuration, specifically within a requirements or control management interface.\n\n**1. Data Grid and Record Actions:**\nThe top section shows the final two rows of a data grid. Columns include ID categories (\"AC\"), numerical identifiers (e.g., \"3.1.20\"), titles (\"Access Control: External Systems\"), and descriptions. The last column contains a red trash can icon (delete action) for each record. Pointer 4 highlights the delete icon associated with requirement 3.1.20.\n\n**2. Pagination and Summary:**\nBelow the table, standard pagination controls are present: First Page (`<<`), Previous Page (`<`), Current Page (**1**, highlighted blue), Next Page (**2**), Next set (`>`), and Last Page (`>>`). A summary line reads: \"Showing **1 - 20** of **49** records.\"\n\n**3. Configuration Input (ID Separator - Pointer 5):**\nA configuration section is shown, titled \"ID Separator,\" accompanied by a circular information icon (`i`). This is followed by a dropdown select box instructing the user to: \"Select ID Separator, or leave for default.\"\n\n**4. Final Actions:**\nAt the bottom right, two action buttons conclude the screen: \"Cancel\" (secondary, gray) and \"Add Requirements\" (primary action, green).",
      "position": 3,
      "context": "ash can icon to remove any requirements from the import."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_Mapbutton.png",
      "alt": "This image captures a segment of a web application displaying a data management view.\n\n**Context and Header:**\nThe main heading for the page is **Template Requirements**.\n\n**Action Controls (Upper Right):**\nA group of three primary action buttons are present:\n1.  **Create**\n2.  **Map**\n3.  **Import**\n\n*Note: The **Map** button is overlaid with a thick orange circle and pointed to by an orange arrow, indicating it as the focus of an external instruction.*\n\n**Pagination/View Controls:**\nA control element labeled **Page Size:** allows configuration of the number of items displayed. The current value is set to **100** within a numeric input field with adjoining up/down spinner arrows.\n\n**Data Table Structure:**\nThe bottom section displays the header row for a data table or list view. The visible columns are:\n*   **Requirement ID** (includes a sort toggle icon)\n*   **Name** (includes a sort toggle icon)\n*   **Description** (includes a sort toggle icon)\n*   **Action**",
      "position": 4,
      "context": "the template page, click the Map button."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM_CustomTemplates/KCM_Requirements_Map+Requirements+to+Template.png",
      "alt": "The image displays a user interface screen titled **\"Map Requirements to Template\"**, likely a modal window used for associating governance or compliance requirements with predefined templates.\n\n**UI Structure and Controls:**\n\n1.  **Title:** \"Map Requirements to Template.\"\n2.  **Paging Control:** Located in the upper right, labeled **\"Page Size:\"** with a dropdown selector currently set to **\"10.\"**\n3.  **Data Grid:** A tabular structure displaying requirements data with five columns:\n    *   **Selection Column:** A column containing unchecked checkboxes for row selection. The header row contains a master selection checkbox (unchecked).\n    *   **Templates:** Displays associated template tags.\n    *   **Requirement ID** (Sortable): Unique identifier for the requirement.\n    *   **Name** (Sortable): Short title of the requirement.\n    *   **Description** (Sortable): Detailed text defining the requirement.\n\n**Data and Filtering:**\n\nThe grid includes a dedicated filter row immediately below the column headers, featuring text input fields for search functionality (e.g., \"Search...\" placeholder in Name and Description columns). The **Requirement ID** filter is pre-populated with the value **\"a1.3.\"**\n\nTwo full data entries are visible:\n\n| Selection | Templates | Requirement ID | Name | Description |\n| :---: | :---: | :---: | :--- | :--- |\n| $\\square$ | SSAE18 SOC2 TSC (Blue Badge) | A1.3 | Tests Recovery Plan Procedures | The entity tests recovery plan procedures supporting system recovery to meet its objectives. |\n| $\\square$ | SSAE18 SOC2 TSC (Blue Badge) | A1.3.1 | Implements Business Continuity Plan Testing | Business continuity plan testing is performed on a periodic basis. The testing includes (1) development of testing scenarios... |",
      "position": 5,
      "context": "boxes to select the requirements that you want to map."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplates_DoneMapping.png",
      "alt": "This image displays common user interface elements for data navigation and submission within a white background application.\n\n**Paging/Pagination Controls:**\nA standard pagination widget is visible, indicating navigation across multiple data pages.\n*   **Controls:** Left-most and right-most chevrons (`<<`, `>>`) for first/last page, and single chevrons (`<`, `>`) for previous/next page.\n*   **Active Page:** Page **1** is highlighted in a solid blue rectangle, indicating the current view.\n*   **Next Page:** Page **2** is visible and selectable.\n\n**Record Count/Context:**\nBelow the pagination controls, text provides context about the dataset size:\n*   \"Showing **1 - 100** of **184** records.\" (Numbers are bolded). This confirms 100 records are displayed per page, and the total dataset contains 184 records.\n\n**Action Buttons (Bottom Right):**\nTwo action buttons are positioned in the bottom right corner:\n1.  **Cancel:** A secondary, light gray button labeled \"Cancel.\"\n2.  **Done Mapping:** A primary, prominent green button labeled \"Done Mapping.\" This button is highlighted with an orange oval overlay, suggesting it is the intended or currently active focus of the user interaction.",
      "position": 6,
      "context": "m of the window and click Done Mapping."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplate_Createbutton.png",
      "alt": "This image displays a segment of a web application interface, likely a management dashboard for requirements templates.\n\n**Header and Context:**\nThe main title in the upper left is **\"Template Requirements\"**.\n\n**Action Buttons (Top Right):**\nThree navigational or action buttons are located in the top right corner. The leftmost button, **\"Create\"**, is highlighted by an orange elliptical annotation and an accompanying arrow. The other two buttons are **\"Map\"** and **\"Import\"**. All three buttons appear rectangular and are colored teal/blue.\n\n**Data Display Controls:**\nBelow the action buttons, a pagination control element labeled **\"Page Size:\"** is visible. The associated input box defaults to the value **\"100\"** and includes a small up/down selector (spinner control).\n\n**Table Header (Partial View):**\nThe beginning of a data table or grid is shown at the bottom. The visible column headers include:\n1. **Requirement ID** (with a sort/filter icon).\n2. **Name** (with a sort/filter icon).\n3. **Description** (with a sort/filter icon).\n4. **Action** (no sort/filter icon visible).",
      "position": 7,
      "context": "a of the page, click the Create button."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM_ComplianceModule/CustomTemplates/CustomTemplate_CreateRequirementpage.png",
      "alt": "The image displays a \"Create Requirement\" user interface form used for defining a new technical or policy requirement.\n\n### UI Structure and Content\n\nThe form is organized hierarchically with four main data entry sections, followed by action buttons:\n\n1.  **Name (Required Field):** A single-line text input labeled \"Name *\" (indicated by an asterisk as a required field).\n    *   *Value:* `System and Information Integrity: Monitor Traffic`\n\n2.  **Description:** A multi-line text area labeled \"Description.\"\n    *   *Content:* `Monitor organizational systems, including inbound and outbound communications traffic, to detect attacks and indicators of potential attacks.`\n\n3.  **Requirement ID (Required Block):** This section consists of two mandatory fields:\n    *   **Primary ID \\*:** Single-line text input with the value `SI`.\n    *   **Sub ID \\*:** Single-line text input with the value `3.14.6`.\n\n4.  **ID Separator:** A dropdown menu labeled \"ID Separator.\" An informational icon is present next to the label.\n    *   *Placeholder/Current Selection:* `Select ID Separator, or leave for default.`\n\n### Actions\n\nThe form footer contains two action buttons:\n\n*   **Cancel** (Standard button, light gray).\n*   **Create** (Primary action button, highlighted in green).",
      "position": 8,
      "context": "r will be a space ( )."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "custom",
      "scopes",
      "templates"
    ],
    "image_count": 8
  }
}