{
  "id": 360021761873,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360021761873.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360021761873.html",
  "author_id": 21027160967,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 9,
  "vote_sum": 0,
  "vote_count": 2,
  "section_id": 8746226512787,
  "created_at": "2019-04-16T18:42:42Z",
  "updated_at": "2025-03-11T17:20:07Z",
  "name": "How to Complete Questionnaires and Respond to Issues: A Guide for Vendor Users",
  "title": "How to Complete Questionnaires and Respond to Issues: A Guide for Vendor Users",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T17:20:07Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "Vendor Risk Management",
    "KCM Vendor",
    "KCM GRC Vendor",
    "Vendor Module",
    "Vendor Instructions",
    "answerbot_kcmgrc"
  ],
  "body": "<p>If another organization is considering working with your organization to purchase a product or service, they may need to perform a risk management assessment on your organization. If the organization uses KCM GRC to manage their risk management assessments for vendors or third parties, they can create a KCM GRC user account for your organization. Then, they can send questionnaire assessments to your user account.</p>\n<p>For information about activating and accessing your KCM GRC account, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360052119554#ACTIVATE' target='_self'>Activating and Accessing Your Account</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360052119554' target='_self'>How to Activate Your Account, Access Your Account, and Reset Your Password</a> article. </p>\n<p>See the sections below to learn how to activate your account, complete questionnaires, and respond to issues that your client has created for your questionnaire answers.</p>\n<p><a name='COMPLETING'></a></p>\n<h2 id='h_01G1704R17VHEM9CSPXF1PPXWD'>Completing Questionnaires</h2>\n<p>When your client assigns a questionnaire to you, you will receive an email notification from KCM GRC. To log in to your KCM GRC account and access the questionnaire, click the <strong>here </strong>link in the email.<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorUserEmail_Generic.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorUserEmail_Generic.png' alt=' ' width='471' height='358'></a></p>\n<p>After you log in to your account, you will be taken to your <strong>Vendor Portal Dashboard</strong>. From your <strong>Vendor Portal Dashboard</strong>, you can view the questionnaires that have been assigned to you, issues that have been created for your assessment responses, and any documents that you have attached to your assessment responses.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> If you haven't received a questionnaire email notification from KCM GRC, ask your client to send you a link to log in to your vendor portal.</div>\n</div>\n<p>To complete the questionnaire you were assigned, follow the steps below:</p>\n<ol role='list'>\n<li>Click the link in your notification email to log in to your account. When you log in to your account, you'll be taken to the <strong>Vendor Portal Dashboard. </strong>\n</li>\n<li>From the <strong>Name</strong> column of the <strong>Questionnaires</strong> section of the page, click the name of the questionnaire that you would like to complete. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_QuestionnaireName.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_QuestionnaireName.png' alt=' '></a>\n</li>\n<li>Complete your questionnaire by answering questions individually or by importing your answers. If you do not know which method you should use to complete your questionnaire, see the information below:\n<ul role='list'>\n<li>If your organization does not use answer templates from an industry-standard assessment tool, you will need to answer questions individually. To learn how to answer questions individually, see the <a href='#INDIVIDUALLY' target='_self'>Answering Questions Individually</a> subsection below.</li>\n<li>If your organization uses answer templates from an industry-standard assessment tool, such as the Consensus Assessments Initiative Questionnaire (CAIQ) or the Standardized Information Gathering Questionnaire (SIG), you can import your answer file into the questionnaire. To learn how to import your answer file, see the <a href='#IMPORTING' target='_self'>Importing Answers with Assessment Tools</a> subsection below. </li>\n</ul>\n</li>\n</ol>\n<p><a name='INDIVIDUALLY'></a></p>\n<h3 id='h_01J833ED9T396SRVD28XVQJG4Q'>Answering Questions Individually</h3>\n<p>If your organization does not use answer templates from an industry-standard assessment tool, you will need to answer the questions in the questionnaire individually. For most questionnaires, the questions will be grouped into sections, which can help you keep track of your progress. </p>\n<p>To answer questions individually, follow the steps below:</p>\n<ol role='list'>\n<li>Open the questionnaire you would like to complete. For more information about accessing the questionnaire, see the introduction of the <a href='#COMPLETING' target='_self'>Completing Questionnaires</a> section above.</li>\n<li>For each question in the questionnaire, select the answer that applies to your organization.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>When you answer questions with answers that are displayed as check boxes, you can select more than one answer. When you answer questions that are displayed as free-form text fields, you can enter up to 1,000 characters. If you need more space for your answer, click the <strong>Add Comment</strong> button to add a comment that includes more information.</div>\n</div>\n</li>\n<li>After you select a response, click the <strong>Save Answer</strong> button. You will need to save each response before you can finalize and submit your questionnaire. If you need to exit the assessment and complete it later, you will lose the progress for questions that you have not saved. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_SaveAnswerbutton.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_SaveAnswerbutton.png' alt=' '></a>\n</li>\n<li>(Optional) Click the <strong>Add Comment</strong> and <strong>Attach File</strong> buttons to add notes or supporting files to your responses. For information about the file requirements, see <a href='https://support.knowbe4.com/hc/en-us/articles/4414553246483#FILE_TYPES' target='_self'>Do the files that vendors can upload to questionnaires need to meet any specific requirements?</a> question in our <a href='https://support.knowbe4.com/hc/en-us/articles/4414553246483' target='_self'>KCM GRC: Vendor Risk Management Module Frequently Asked Questions (FAQ)</a> article.  <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_CommentFileButtons.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_CommentFileButtons.png' alt=' '></a>\n</li>\n<li>When you complete the questions in a question set, select a new question set from the <strong>Sections</strong> menu. When you select a new question set, a new set of questions will display.\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>The fraction next to each section represents the number of questions you have answered out of the total number of questions in the section.</div>\n</div>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Sections+menu.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Sections+menu.png' alt=' '></a>\n</li>\n<li>When you finish the questionnaire, click the <strong>Finalize Questionnaire </strong>button at the bottom of the page to submit your questionnaire. When you click this button, your client will receive an email notifying them that the questionnaire is ready for review. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/VendorGuide_FinalizeQuestionnaire.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/VendorGuide_FinalizeQuestionnaire.png' alt=' '></a>\n</li>\n</ol>\n<p><a name='IMPORTING'></a></p>\n<h3 id='h_01J833ED9TESZ0702CP7QTT5F9'>Importing Answers with Assessment Tools</h3>\n<p>If your organization uses an official assessment tool to respond to industry-standard questionnaires such as the CAIQ or SIG, you can upload the file to populate answers to questions in the questionnaire.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> The assessment tool file must be an official assessment management tool produced by the Standardized Information Gathering (SIG) Questionnaire or the Consensus Assessments Initiative Questionnaire (CAIQ). </div>\n</div>\n<p>The assessment tool file must be in one of the file formats listed below:</p>\n<ul role='list'>\n<li>XLSX</li>\n<li>XLSM</li>\n<li>JSON</li>\n</ul>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>If you are using the SIG 2020 assessment tool, you will need to export a JSON file from the workbook and then use the file to import your questionnaire answers. To export the JSON file, navigate to the <strong>Formula Notes</strong> tab of your assessment tool, then click the <strong>Export SIG JSON</strong> button.</div>\n</div>\n<p>To import an official answer file into a questionnaire, follow the steps below:</p>\n<ol role='list'>\n<li><span>Open the questionnaire you would like to complete. For more information about accessing the questionnaire, see the introduction of the <a href='#COMPLETING' target='_self'>Completing Questionnaires</a> section above.</span></li>\n<li>From the <strong>Questionnaire Submission</strong> page, click the <strong>Import Answers</strong> button in the top-right corner. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Import+Answers+Button.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Import+Answers+Button.png' alt='Import Answers button'></a>\n</li>\n<li>In the <strong>Import Answers</strong> window that opens, select the appropriate questionnaire answer file from the <strong>Questionnaire Type</strong> drop-down menu.</li>\n<li>Click the <strong>Click to Upload</strong> button, then select your answer file. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_ClicktoUploadButton.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_ClicktoUploadButton.png' alt=' '></a>\n</li>\n<li>All of the questions you have answered or commented on in your answer file will populate in the<strong> Import Answers</strong> window. If you would like to upload a file to support your response to a question, click the <strong>Click to Upload</strong> button. To delete answers from the import list, click the <strong>trash</strong> icon. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Import+Answers.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Import+Answers.png' alt=' '></a>\n</li>\n<li>When you are ready to import your answers, click the <strong>Save</strong> button at the bottom of the window.\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> If you need to edit or add comments to an answer after clicking the <strong>Save</strong> button, you can import the answer file again. However, you will need to make any changes in your answer file before you import the file again. </div>\n</div>\n</li>\n<li>After you finish importing answers into the questionnaire, click the <strong>Finalize Questionnaire</strong> button at the bottom of the page to submit your assessment. Your client will receive an email notifying them that the questionnaire is ready for review.</li>\n</ol>\n<p><a name='RESPONDING'></a></p>\n<h2 id='h_01J833ED9TPTET2E812K191FQH'>Responding to Issues</h2>\n<p>If your client is unsatisfied with an answer you provided or if they would like to request additional information from you regarding a specific question, they can create an issue for that question. The purpose of an issue is to initiate additional communication between you and your client.</p>\n<p>If your client creates one or more issues for your questionnaire responses, you will receive an email notification. You can click the link in the email notification to navigate to your vendor portal, where you can respond to issues. </p>\n<p>To respond to an issue, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KCM GRC account.</li>\n<li>Select the <strong>Issues</strong> tab from your navigation panel. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_IssuesNavpanel.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_IssuesNavpanel.png' alt=' '></a>\n</li>\n<li>In the <strong>Description</strong> column, click an issue's description to open the issue.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> You can view the issue's priority from the <strong>Priority </strong>column. The issue's priority can help you determine how quickly you need to respond to the issue.</div>\n</div>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM+Questionnaire_Issue+Description+Link.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM+Questionnaire_Issue+Description+Link.png' alt='Issue Description Link'></a>\n</li>\n<li>From the <strong>Issue Details</strong> page, read the <strong>Issue Description</strong>. Under this description, you can view the question the issue was created for.  <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM+Questionnaire_Issue+Description.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM+Questionnaire_Issue+Description.png' alt='Issue Response field'></a>\n</li>\n<li>In the <strong>Response</strong> field, enter your response to the issue. You can enter up to 1,000 characters in this field.</li>\n<li>Click the <strong>Save Response</strong> button to submit your response.</li>\n<li>(Optional) If you need to provide a file to the issue, click the <strong>Click to Upload</strong> button on the left side of the <strong>Issue Details</strong> page.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> Uploading a file will replace any files you previously uploaded for this question.</div>\n</div>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/VendorGuide_IssuesClicktoUploadButton.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/VendorGuide_IssuesClicktoUploadButton.png' alt=' ' width='331' height='334'></a>\n</li>\n</ol>\n<p>When you submit your issue response, your client will receive an email notifying them that you responded. When your client responds back to you, you will also receive an email. You can continue to communicate with your client from the <strong>Issue Details</strong> page until your client closes the issue.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> You can view closed issues by selecting the <strong>Issues</strong> tab from your navigation panel and then selecting the <strong>Closed Issues (#)</strong> subtab.</div>\n</div>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360021761873-How-to-Complete-Questionnaires-and-Respond-to-Issues-A-Guide-for-Vendor-Users",
  "images": [
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorUserEmail_Generic.png",
      "alt": "This image displays a notification email template for a vendor assessment process. The template is structured into three main sections: Header, Instructional Banner, and Body Text/Call-to-Action.\n\n**UI Elements and Layout:**\n1.  **Header:** A light gray bar featuring the dark gray and orange \"KCM\" logo on the left. The transmission date, \"Message sent on April 9, 2019,\" is right-aligned.\n2.  **Instructional Banner:** A prominent, solid orange block containing the primary instruction in large, white, bold text.\n3.  **Body:** A light gray/white area containing secondary instructions and the action link in standard dark gray text.\n\n**Text and Template Variables (Content Focus):**\n\n*   **Instructional Banner Text:** Defines the purpose and required action. It utilizes two dynamic template variables:\n    > \"As a part of **[[Organization Name]]**'s vendor assessment process, you are being asked to complete the following questionnaire: **[[Questionnaire Title]]**.\"\n\n*   **Body Text (Instructions):** Provides timing and support context:\n    1.  Instruction for timely submission: \"We ask that you submit the completed questionnaire as soon as possible.\"\n    2.  Contact information instruction: \"Should you have any questions pertaining to this questionnaire, please reach out to your point of contact, **[[Organization's Name]]**\"\n\n*   **Call-to-Action (CTA):** The final line presents the action prompt, where the word 'here' functions as a hyperlink:\n    > \"Click **here** to get started.\" (The word \"here\" is rendered in blue text.)",
      "position": 1,
      "context": "ss the questionnaire, click the here link in the email."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_QuestionnaireName.png",
      "alt": "The image displays a section of the **Vendor Portal Dashboard**, titled **Questionnaires**.\n\nThe UI includes a search input field with the placeholder text **\"Search Questionnaire\"**.\n\nA data table lists existing questionnaires under the following sortable column headers: **Name**, **Template**, **Status**, and **Date Created**.\n\nThe table displays one record:\n*   **Name:** **CAIQ Full Questionnaire 2019** (Styled as a hyperlink).\n*   **Template:** **CAIQ Full Questionnaire 2019**.\n*   **Status:** **Sent** (Displayed within a blue status tag).\n*   **Date Created:** **April 23, 2019**.\n\nThe summary below the table indicates the total displayed count: **One record**.",
      "position": 2,
      "context": "ck the name of the questionnaire that you would like to complete."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_SaveAnswerbutton.png",
      "alt": "This image displays a User Interface (UI) section for answering a security questionnaire or audit control.\n\n**Question and Context:**\nThe primary text prompt is: \"Do you use an automated source code analysis tool to detect security defects in code prior to production?\"\n\n**Controls and Interaction:**\n1.  **Response Options (Radio Buttons):** Located under the heading \"Answer,\" there are three mutually exclusive radio button choices:\n    *   No (Unselected)\n    *   Yes (Selected)\n    *   N/A (Unselected)\n\n2.  **Action Buttons (Header):** Located in the top right, two secondary action buttons are present:\n    *   A blue button labeled \"Add Comment\" (accompanied by a speech bubble icon).\n    *   A blue button labeled \"Attach File\" (accompanied by a document icon).\n\n3.  **Primary Action Button (Footer):** Located in the bottom right, a critical action button is highlighted by an orange oval border (denoting focus or importance):\n    *   A prominent green button labeled \"Save Answer.\"\n\n**State:**\nThe control is currently answered \"Yes.\" The interface is awaiting submission via the \"Save Answer\" button.",
      "position": 3,
      "context": "you will lose the progress for questions that you have not saved."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_CommentFileButtons.png",
      "alt": "The image displays a cropped section of a user interface containing three distinct action buttons.\n\n1.  **Primary Action Buttons (Highlighted):** Two adjacent rectangular buttons, sharing a dark blue background color, are enclosed within a thick orange highlight box.\n    *   **Left Button:** Labeled **Add Comment** and features a speech bubble icon.\n    *   **Right Button:** Labeled **Attach File** and features a document icon with a downward arrow (indicating upload functionality).\n\n2.  **Confirmation Button (Context):** A third button is visible in the lower right corner, labeled **Save Answer**. This button uses a bright green background color, typically signifying final confirmation or completion of input.",
      "position": 4,
      "context": "Management Module Frequently Asked Questions (FAQ) article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Sections+menu.png",
      "alt": "This image displays a web application interface for a structured **Questionnaire Submission**, specifically focusing on the \"Informational Introduction and CAIQ Assessment.\"\n\n**Header and Navigation:**\n*   The main title is \"Questionnaire Submission.\"\n*   Breadcrumb navigation indicates the current location: `Vendor Portal > Questionnaire`.\n*   A primary action button is visible in the top right: a green button labeled **\"Import Answers\"** (with an import icon).\n\n**Layout and Structure:**\nThe screen is split into two primary columns: the detailed Question Panel (left) and the Section Navigation Panel (right).\n\n**Question Panel (Left):**\n*   **Active Question:** Displays a specific security assessment question regarding the use of industry standards (e.g., BSIMM, NIST) in the **Software Development Lifecycle (SDLC)**.\n*   **Action Buttons:** Two blue buttons allow interaction with the question: **\"Add Comment\"** and **\"Attach File.\"**\n*   **Answer Input:** The answer section uses radio buttons for selection: **Yes, No,** or **N/A.**\n*   **Submission Control:** A green button at the bottom saves the user's input: **\"Save Answer.\"**\n\n**Section Navigation Panel (Right):**\n*   **Title:** \"Sections.\"\n*   **Progress Tracking:** Each section displays the completion status (Answered/Total Questions).\n*   **Sections Listed:**\n    *   Custom Questions (0/5)\n    *   CAIQ v3.0.1 (0/295) (This is an expandable section, indicated by a downward chevron).\n    *   Application & Interface ... (0/5) (Indented sub-section)\n    *   Application & Interface ... (0/2)\n    *   Application & Interface ... (0/1)\n    *   Application & Interface ... (0/1)\n    *   Audit Assurance & Com... (0/1)",
      "position": 5,
      "context": "t of the total number of questions in the section."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/VendorGuide_FinalizeQuestionnaire.png",
      "alt": "This image displays a set of user interface (UI) buttons for managing a questionnaire or response form.\n\n**Key UI Elements:**\n\n1.  **Top Navigation/Action Buttons (Blue):**\n    *   **Add Comment:** A rectangular blue button featuring a speech bubble icon and the text \"Add Comment.\"\n    *   **Attach File:** A rectangular blue button featuring a file/document icon with an arrow pointing down (indicating attachment/upload) and the text \"Attach File.\"\n\n2.  **Primary Action Buttons (Green):**\n    *   **Save Answer:** A small, right-aligned rectangular green button with the text \"Save Answer.\"\n    *   **Finalize Questionnaire:** A large, prominent rectangular green button located at the bottom of the visible area, containing the text \"Finalize Questionnaire.\" This button is highlighted by an orange elliptical annotation.\n\n**Context:**\n\nThe buttons are presented against a light grey background and appear to belong to an interface for submitting or editing responses, providing options for saving partial progress, adding documentation/notes, and submitting the final result.",
      "position": 6,
      "context": "il notifying them that the questionnaire is ready for review."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Import+Answers+Button.png",
      "alt": "",
      "position": 7,
      "context": "Import Answers button in the top-right corner."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorGuide_ClicktoUploadButton.png",
      "alt": "The image displays a segment of a web interface designed for data ingestion, titled **\"Import Answers.\"**\n\nThe UI consists of the following elements:\n\n1.  **Questionnaire Type:** A labeled dropdown selection box. The current selected value is **\"CAIQ 3.0.\"**\n2.  **File Upload Button:** A primary blue action button labeled **\"Click to Upload,\"** featuring an upload icon. This button is encircled by an instructional orange oval.\n3.  **Status Indicator:** Adjacent to the upload button, status text reads **\"No File Selected\"** (displayed in green text), indicating that the required file has not yet been chosen for import.",
      "position": 8,
      "context": ">Click to Upload button, then select your answer file."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM_Questionnaire+Import+Answers.png",
      "alt": "This screenshot displays the **Import Answers** functional interface, designed for bulk entry of responses and supporting evidence for a list of structured questions.\n\n**UI Elements and Context:**\n\n1.  **Title:** The page header is prominently labeled \"Import Answers.\"\n2.  **Controls:** A search bar labeled \"Search Questions...\" is available for filtering the dataset. A right-aligned \"Page Size\" dropdown is set to **5**, controlling the number of rows displayed.\n3.  **Data Grid (Question Table):** The main content is a tabular display with five columns:\n    *   **External ID:** (e.g., A&A-01.1, A&A-01.2).\n    *   **Question:** Detailed text of the audit or compliance query.\n    *   **Comment:** An input field for explanatory text (currently blank).\n    *   **Answer:** A response field, populated as **\"Yes\"** for all displayed entries.\n    *   **Upload:** The action column for evidence submission.\n\n**Functionality Focus (Upload Column):**\n\n*   Each row in the **Upload** column contains two interactive elements:\n    *   A blue button labeled **\"Click to Upload\"** (preceded by an upload icon), used to attach supporting documentation.\n    *   A small trashcan icon, used to delete the attachment associated with that question.\n\n**Navigation and Actions:**\n\n*   **Pagination:** A footer pagination control is active, showing page **1** selected out of a visible range up to 10 pages, supported by standard navigation arrows.\n*   **Action Buttons:** Two final action buttons are located in the bottom right corner: **Cancel** (secondary button) and **Save** (primary blue button).",
      "position": 9,
      "context": "s from the import list, click the trash icon."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_IssuesNavpanel.png",
      "alt": "The image displays a partial view of an application's user interface, focusing on the vertical navigation sidebar and application header.\n\n**UI Elements and Context:**\n\n*   **Header/Branding:** The top left corner features the stylized \"KCM\" application logo/branding.\n*   **Navigation Sidebar:** A dark gray vertical menu pane contains navigation links.\n*   **Menu Items:**\n    *   **Dashboard:** Listed with a speedometer/gauge icon.\n    *   **Issues:** Listed directly beneath \"Dashboard,\" paired with an icon depicting a list overlying servers or monitors.\n\n**Annotation:**\n\n*   A prominent, thick orange directional arrow overlays the screenshot, explicitly pointing toward and highlighting the **Issues** navigation link, indicating it as the target selection.",
      "position": 10,
      "context": "GRC account.\nSelect the Issues tab from your navigation panel."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM+Questionnaire_Issue+Description+Link.png",
      "alt": "",
      "position": 11,
      "context": "quickly you need to respond to the issue."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/KCM+Questionnaire_Issue+Description.png",
      "alt": "",
      "position": 12,
      "context": "tion, you can view the question the issue was created for."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/VendorUserGuide/VendorGuide_IssuesClicktoUploadButton.png",
      "alt": "The image displays a user interface dialog box titled **\"Upload File Attachment.\"**\n\n**Content Details:**\n\n1.  **Existing Attachment:** Under the heading **\"Attachment associated with this issue,\"** the existing file name **kcm-export-2.zip** is listed. This entry is accompanied by a cloud download icon and a trash/delete icon, indicating options to retrieve or remove the current file.\n2.  **Warning Message:** A critical notice is present in red text, preceded by a warning icon ($\\triangle$): **\"Uploading a new attachment will replace the existing attachment.\"**\n3.  **Upload Control:** The main interaction is a blue button labeled **\"Click to Upload,\"** preceded by an upload icon. (Note: This button is highlighted by an orange oval, indicating it as the focal point of the interaction.)\n4.  **Status Indicator:** Directly beneath the upload button, a status message in green text reads **\"No File Selected,\"** indicating the state before a file is chosen from the local system for upload.",
      "position": 13,
      "context": "s you previously uploaded for this question."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "issues",
      "questionnaires",
      "respond",
      "users",
      "vendor"
    ],
    "image_count": 13
  }
}