{
  "id": 360013635634,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360013635634.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360013635634.html",
  "author_id": 368027116814,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 1,
  "vote_count": 5,
  "section_id": 8594210251283,
  "created_at": "2018-12-13T20:18:06Z",
  "updated_at": "2025-11-21T17:13:39Z",
  "name": "Partner and Multi-Account: Getting Started Guide",
  "title": "Partner and Multi-Account: Getting Started Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-11-14T19:47:44Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "partner",
    "answerbot",
    "localizing",
    "answerbot_kmsat"
  ],
  "body": "<p>In your Account Management console, you can edit your account profile and settings, manage your users, create phishing campaigns, and more.</p>\n<p>For a quick walkthrough of how to use your console, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360046225014'>Management Console Overview</a> video.</p>\n<h2 id='h_01HBV7XEBMYWQ07V357WHTN2HS'>Logging In</h2>\n<p>You can log in to your Account Management console from your KnowBe4 Account Management login page. This page is the KnowBe4 instance where your console is hosted, followed by the subdirectory <strong>/management/login</strong>. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354'>Learner Support: KnowBe4's Training Instances and Login Links</a> article for a full list of login links.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerLogin.png'><img src='https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerLogin.png' alt=' '></a></p>\n<p>You can also log in to your Account Management console using SAML. For more information, see the <a href='#h_01HBV7XEBMRXTSJXPAZPAJKXJE'>Personal Settings</a> section below.</p>\n<h2 id='h_01HBV7XEBMWVATX3XC4F5TAFBT'>Partner Dashboard</h2>\n<p>Once you log in to your account, you will see your <strong>Partner Dashboard</strong> page. Your <strong>Partner Dashboard</strong> page will display an overview of your subscription and the accounts you manage.For more information about this page, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/KMSAT_Partner+Dashboard+Details.png'><img src='https://helpimg.s3.amazonaws.com/reseller/KMSAT_Partner+Dashboard+Details.png' alt='Partner Dashboard'></a></p>\n<ol type='a'>\n<li>\n<strong>Bulk Subscription Level: </strong>If you've purchased a bulk license of seats for the accounts you manage, you can view the subscription level. If you haven't purchased a bulk license of seats, this field will display <strong>N/A</strong>.</li>\n<li>\n<strong>Bulk Subscription End Date</strong>: If you've purchased a bulk license of seats for the accounts you manage, you can view the end date for your subscription. If you haven't purchased a bulk license of seats, this field will display<strong> N/A</strong>.</li>\n<li>\n<strong>Total Bulk Active Accounts</strong>: View the total number of your accounts that are using your bulk subscription.</li>\n<li>\n<strong>Total Active Accounts</strong>: View the total number of your paid accounts.</li>\n<li>\n<strong>Total Trial Accounts</strong>: View the total number of your trial accounts.</li>\n<li>\n<strong>Total Free Accounts</strong>: View the total number of your free accounts.</li>\n<li>\n<strong>Total Bulk Purchased Seats</strong>: View the total number of seats you've purchased for your bulk subscription. If you haven't purchased a bulk license of seats, this field will display <strong>N/A</strong>.</li>\n<li>\n<strong>Total Bulk Active Users</strong>: View the total number of active users from your accounts that use your bulk subscription.</li>\n<li>\n<strong>Total Active Users</strong>: View the total number of active users from your accounts with any paid subscription.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Users that were recently archived or restored may not be counted in your number of<strong> Total Active Users</strong>. This data typically refreshes overnight.</div>\n</div>\n</li>\n<li>\n<strong>New Accounts by Month</strong>: View a graph that displays the number of new accounts in your console, grouped by the month they were created in.</li>\n</ol>\n<h2 id='h_01HBV7XEBMRXTSJXPAZPAJKXJE'>Personal Settings</h2>\n<p>We recommend that you set up your console with the settings on your profile. To access your profile, click your email address on the top-right corner of the page, then click <strong>Personal Settings</strong>.</p>\n<h3 id='h_01K9SK5VRVDEM8QRER5PTKSESB'>Personal Details</h3>\n<p>In your <strong>Personal Details</strong> subtab, you can update information such as your name, mobile phone number, multi-factor authorization (MFA) settings, and more. For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/reseller/Partner_PersonalSettings.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/reseller/Partner_PersonalSettings.png' alt=' '> </a></p>\n<ol type='a'>\n<li>\n<strong>First Name:</strong> Enter your preferred first name.</li>\n<li>\n<strong>Last Name:</strong> Enter your preferred last name.</li>\n<li>\n<strong>Time Zone:</strong> Select your preferred time zone. Your selection will change how timestamps appear in the admin console.</li>\n<li>\n<strong>Date and Time Format:</strong> Select your preferred date and time format. Your selection will change how dates and times appear in the admin console.</li>\n<li>\n<strong>Phone Number:</strong> Enter your preferred phone number.</li>\n<li>\n<strong>Extension:</strong> Enter the extension of your preferred phone number, if applicable.</li>\n<li>\n<strong>Mobile Phone Number:</strong> Enter your preferred mobile phone number.</li>\n<li>\n<strong>Multi-factor Authentication:</strong> Enable or disable multi-factor authentication (MFA) for your account. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360001216148'>Partner and Multi-Account: Enable Two-Factor or Multi-factor Authentication on My Account</a> article.</li>\n<li>\n<strong>Change Password:</strong> Click this button to change your password.</li>\n</ol>\n<p>After making any updates to this page, click <strong>Update Personal Details</strong> to save your changes.</p>\n<h3 id='h_01K9SK9S29KV976JEXD783TC0P'>Notifications and Alerts</h3>\n<p>You can use the <strong>Notifications and Alerts</strong> subtab to manage system notifications and alerts. Enable the <strong>Critical Alerts</strong> toggle to receive critical and time-sensitive notifications for platform updates that may require administrative attention or action. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46417308055443'>KnowBe4 Platform Notifications</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/reseller/Partner_NotificationsAlerts.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/reseller/Partner_NotificationsAlerts.png' alt=' '> </a></p>\n<p>Click <strong>Save Changes</strong> to confirm and save your updates.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>For your convenience, a Manage Notifications link is included at the bottom of every notification. Selecting the link opens a dedicated page where you can manage your preferences. For security purposes, access to this page expires after 24 hours. You can always manage your notification preferences by using the Notifications and Alerts subtab.</div>\n</div>\n<h2 id='h_01HBV7XEBMRM7666XWCXTEX9Q2'>Account Settings</h2>\n<p>To access your Account Settings, click your email address on the top-right corner of the page, and then click <strong>Account Settings</strong>. On this page, you can adjust your organization name, contact information, and the following settings:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/GettingStarted/ResellerAccountSettings.png'><img src='https://helpimg.s3.amazonaws.com/reseller/GettingStarted/ResellerAccountSettings.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Company Logo</strong>: You can change the logo displayed on the top-left corner of your account. Your logo will apply to all of your clients' accounts as well. The image you select must be in .png format and less than 300 KB.</li>\n<li>\n<strong>Only Allow Console Sessions from One IP at a Time</strong>: You can enable this feature to prevent admins from having simultaneous console sessions on multiple IP addresses.</li>\n<li>\n<strong>Restrict Console Sessions to Specific IP Ranges</strong>: You can enable this option to restrict all account management admin sessions to the IP ranges entered below.</li>\n<li>\n<strong>Account Session Timeout</strong>: You can select a time period of account inactivity from the drop-down menu. The system will automatically log you out after the specified period of inactivity. To change this option for your clients, it can be accessed under their <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a>.</li>\n<li>\n<strong>SAML</strong>: You can enable SAML on your account for an added layer of security. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/206293387'>SAML Integration Overview</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/360013562393'>Partner and Multi-Account: Enable SAML on Your Account Management Console</a> articles.</li>\n<li>\n<strong>Purchased Add-ons</strong>: Your add-ons will appear here.</li>\n</ol>\n<h2 id='h_01HBV7XEBMVZWZEV4F0K6F042G'>Accounts</h2>\n<p>You might need to view account details for your existing accounts or access these accounts as an admin. This can be done from the <strong>Accounts</strong> tab of your Account Management console. For details on how to manage existing accounts, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013722293'>Partner and Multi-Account: Viewing Your Accounts</a> article.</p>\n<p>The different color backgrounds on the accounts indicate the type of account that they have. A yellow background color indicates a Free account, a dark gray background color indicates an Archived account, and an orange background color indicates a Trial account.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/Managed+Accounts+List.png'><img src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/Managed+Accounts+List.png' alt=' '></a></p>\n<p>To add an account to your Account Management console, log in to the <a href='https://knowbe4.my.site.com/partners/s/login/' target='_blank' rel='noopener noreferrer'>Partner Portal</a>. Under the <strong>Contact Us</strong> drop-down menu, select <strong>Add Domain Account</strong>. You will need to provide the following information:</p>\n<ul>\n<li>Company Name (Legal Entity Name)</li>\n<li>Domain Name</li>\n<li>Street address, including Country, State or Province, and City</li>\n<li>The initial number of users that will be uploaded to the console</li>\n<li>Who will be managing the console?</li>\n<li>Do you have the client's permission to phish and train this domain?</li>\n<li>Whether the account will be a Paid account or Trial account</li>\n</ul>\n<p>You will receive a response within 24 business hours.</p>\n<p>If you are adding a Trial account, the 30-day trial period begins the day the domain is added to your console.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> If you have users who frequently move between different managed accounts in your organization, please contact our support team to have the <strong>Modify email addresses of archived users synced to another KnowBe4 account</strong> option enabled for your account. For more information on this option, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500010136521'>Partner and Multi-Account: Move Users Across Managed Accounts</a> article.</div>\n</div>\n<h2 id='h_01HBV7XEBMZQJJ62N4M5WZ326W'>Importing Users to Accounts</h2>\n<p>You can bulk import all the users on a managed account at once by using our Import feature. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013722333'>Partner and Multi-Account: Import Users</a> article.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerImportUsers.png'><img src='https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerImportUsers.png' alt=' '></a></p>\n<h2 id='h_01HBV7XEBMXWM71Y2PJ25SPSTV'>Phishing</h2>\n<p>From the <strong>Phishing</strong> tab, you can create and edit your managed phishing campaigns, managed email templates, and managed landing pages. See the subsections below for more information.</p>\n<h3 id='h_01HBV7XEBMBN0JES0K9JV71HK3'>Managed Phishing Campaigns</h3>\n<p>You can create phishing campaigns for all of your managed accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360049400313'>Partner and Multi-Account: Create a Managed Phishing Campaign</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerManagedPhishingCampaigns.png'><img src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerManagedPhishingCampaigns.png' alt=' '></a></p>\n<p>You can also edit and monitor the phishing campaigns you have created. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360048740854'>Partner and Multi-Account: Monitor a Managed Phishing Campaign</a> article.</p>\n<h3 id='h_01HBV7XEBMQAD3PZC8H3AXK71J'>Managing Email Templates</h3>\n<p>You can create your own custom email templates for each of your managed accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360048740854'>Partner and Multi-Account: Monitor a Managed Phishing Campaign</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewPhishingTemplate.png'><img src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewPhishingTemplate.png' alt=' '></a></p>\n<p>You can also export email templates you have created and import them to other customer accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115011301068'>Partner and Multi-Account: Use the Import and Export Feature</a> article.</p>\n<h3 id='h_01HBV7XEBMA1N7E2JV425HT2VR'>Managing Landing Pages</h3>\n<p>You can create your own custom landing pages for each of your managed accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013616314'>Partner and Multi-Account: Manage Landing Pages</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewLP.png'><img src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewLP.png' alt=' '></a></p>\n<p>You can also export landing pages you have created and import them to other customer accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115011301068'>Partner and Multi-Account: Use the Import and Export Feature</a> article.</p>\n<h2 id='h_01HBV7XEBMAK73K9W8AS0X2384'>Training</h2>\n<p>From the <strong>Training</strong> tab, you can create and edit your managed training campaigns and managed training notification templates. See the subsections below for more information.</p>\n<h3 id='h_01HBV7XEBM7TX00S8VV77KCE5E'>Managing Training Campaigns</h3>\n<p>You can use managed training campaigns to create training campaigns for multiple accounts from your Account Management console. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4403006428307'>Partner and Multi-Account: Create and Monitor Managed Training Campaigns</a> article.</p>\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong> Before you can create a managed training campaign, you’ll need to add content from the ModStore to your managed library. For more information, see the <a href='#h_01HBV7XEBM7PW48DJDMGCKBFGA'>ModStore</a> section below.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/ResellerManagedTrainingCampaigns.png'><img src='https://helpimg.s3.amazonaws.com/reseller/ResellerManagedTrainingCampaigns.png' alt=' '></a></p>\n<h3 id='h_01HBV7XEBMRD0WGNS36Q8PH7K8'>Managing Notification Templates</h3>\n<p>You can create custom training notifications for each of your managed accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4402971030419'>Partner and Multi-Account: Create Managed Training Notifications</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewTrainingTemplate.png'><img src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewTrainingTemplate.png' alt=' '></a></p>\n<h2 id='h_01HBV7XEBM9EMNVN5W0XKC5RQB'>Partners</h2>\n<p>From the <strong>Partners</strong> tab, you can view, edit, and delete your partners. To learn more about partners in your Account Management console, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360038664394'>Partner and Multi-Account: Manage Partners</a> article.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> You'll only see the <strong>Partners</strong> tab if this feature is enabled on your Account Management console. If you're interested in adding that feature, please contact your Account Manager.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/GettingStarted/ResellerPartnerTab.png'><img src='https://helpimg.s3.amazonaws.com/reseller/GettingStarted/ResellerPartnerTab.png' alt=' '></a></p>\n<h2 id='h_01HBV7XEBM2N446FXQ31N5WX33'>Admins</h2>\n<p>From the <strong>Admins</strong> tab of your Account Management console, you can grant account management admin rights to additional users at your organization to assist you with managing your client accounts. Only admins with <strong>Full Access Admin</strong> permissions on the management account can grant additional administrator permissions to other users. To learn how to add another admin to your Account Management console, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013722733'>Partner and Multi-Account: Manage Partner Admins</a> article.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerAdmins.png'><img src='https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerAdmins.png' alt=' '></a></p>\n<h2 id='h_01HBV7XEBM7PW48DJDMGCKBFGA'>ModStore</h2>\n<p>From the <strong>ModStore</strong> tab of your Account Management console, you can view training content and add content to the libraries of your managed accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/8147337786259'>Partner and Multi-Account: Managed ModStore and Library Guide</a>.</p>\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong> Before you can begin a managed training campaign, you must add content from the ModStore to your managed library.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/managedmodstore.png'><img src='https://helpimg.s3.amazonaws.com/reseller/managedmodstore.png' alt=' '></a></p>\n<h2 id='h_01HBV7XEBM7ZV7GPKD5RQDY50G'>Reports</h2>\n<p>You can view and create reports for any of your managed accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360015189573'>Partner and Multi-Account: Account Management Reporting Guide</a>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerReports.png'><img src='https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerReports.png' alt=' '></a></p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360013635634-Partner-and-Multi-Account-Getting-Started-Guide",
  "images": [
    {
      "url": "https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerLogin.png",
      "alt": "This image displays the \"Account Management Sign In\" login screen for KnowBe4, accessible via the URL `https://training.knowbe4.com/management/login`.\n\n**Header and Context:**\n\n*   **URL:** The address bar shows the secure URL as `https://training.knowbe4.com/management/login`.\n*   **Branding:** The top of the page features the orange KnowBe4 logo followed by the tagline \"Human error. Conquered.\"\n\n**Account Management Sign In Form:**\n\n*   **Title:** The central element is a box titled \"Account Management Sign In.\"\n*   **Input Fields:**\n    *   **Email:** An active input field labeled \"Email.\"\n    *   **Password:** An input field labeled \"Password,\" containing the placeholder text \"Enter your password.\"\n*   **Options:** A checkbox labeled \"Remember me\" is positioned below the password field (unchecked).\n*   **Action Button:** A solid blue button labeled \"Sign in.\"\n\n**Ancillary Links and Footer:**\n\n*   **Recovery Links:** Below the primary button are two blue hyperlinks for assistance: \"Forgot your password?\" and \"Didn't receive confirmation instructions?\"\n*   **Footer Links:** The page footer contains standard navigation links: \"About\" and \"Helpdesk.\"\n*   **Copyright:** The bottom of the page displays the copyright notice: \"© 2019 KnowBe4, Inc. All Rights Reserved.\"",
      "position": 1,
      "context": "aining Instances and Login Links article for a full list of login links."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/KMSAT_Partner+Dashboard+Details.png",
      "alt": "",
      "position": 2,
      "context": "nage.For more information about this page, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/reseller/Partner_PersonalSettings.png",
      "alt": "This image displays the \"**Personal Settings**\" configuration screen, organized into a standard form interface.\n\n## UI Structure and Navigation\n\nThe page header is \"**Personal Settings**\" (preceded by a gear icon). Navigation is managed via two tabs: \"**Personal Details**\" (active) and \"**Notifications and Alerts**.\"\n\nThe main body is the \"Personal Details\" configuration form, structured into various user fields:\n\n### Identity and Contact Fields\n\n*   **Email:** Displays a sensitive, obscured value (blurred).\n*   **First Name (a):** Text input field.\n*   **Last Name (b):** Text input field.\n*   **Time Zone (c):** Dropdown menu displaying the current selection: `(GMT-04:00) Eastern Time (US & Canada)`.\n*   **Date and Time Format (d):** Dropdown menu displaying the current selection: `MM/DD/YYYY hh:mm AM/PM (12-hour)`.\n*   **Phone Number (e):** Text input field.\n*   **Extension (f):** Text input field.\n*   **Mobile Phone Number (g):** Text input field.\n\n### Security Settings\n\n*   **Multi-Factor Authentication:** Displays the status \"**Disabled**\" (marked with a gray 'x' icon). An adjacent blue action button is labeled \"**Enable**\" (h).\n*   **Password:** Displays masked input (padlock icon followed by five dots). An adjacent blue action button is labeled \"**Change Password**\" (i).\n\n### Form Submission\n\nA primary, blue action button is located at the bottom of the form: \"**Update Personal Details**.\"",
      "position": 3,
      "context": "For more information, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/reseller/Partner_NotificationsAlerts.png",
      "alt": "This is a screenshot of a user interface section for managing notification settings within a \"Personal Settings\" module.\n\n**Header and Navigation:**\n*   The main page title is **\"Personal Settings\"**, accompanied by a gear/cog icon.\n*   A tab navigation bar is present below the title, with two tabs: **\"Personal Details\"** (inactive, blue text) and **\"Notifications and Alerts\"** (active, highlighted white background with a gray border).\n\n**Content Area (Notifications and Alerts):**\n*   A subsection header reads **\"Security Awareness Console Notifications\"** in bold text.\n*   A single notification option is displayed: **\"Critical Alerts\"**.\n*   This option is controlled by an **inactive (off) toggle switch** (gray color).\n*   A descriptive text follows: \"KnowBe4 will send critical updates or notify admins when attention is needed in the console.\"\n*   A further detail line is present, indented with a vertical separator bar: \"Notification Frequency: Critical alerts are sent in real-time, and reminders are sent as needed.\"\n\n**Action Button:**\n*   At the bottom, a primary action button is displayed in blue: **\"Save Changes\"**.",
      "position": 4,
      "context": "s/articles/46417308055443'>KnowBe4 Platform Notifications article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/GettingStarted/ResellerAccountSettings.png",
      "alt": "This image displays a segment of an administrative settings panel, categorized into six distinct configurable sections (labeled a through f).\n\n**General Context:** The interface governs company branding, account security, session management, identity management (SAML), and purchased features.\n\n**UI Elements and Configuration Details:**\n\n| Label | Section Title / Header | UI Element Type | Current Status / Text Value |\n| :---: | :--- | :--- | :--- |\n| **a** | **Company Logo** | File Input Button | Button labeled \"Choose File\" for uploading the company logo. |\n| | **Account Management Admin Settings** | Section Header | N/A |\n| **b** | Only Allow Console Sessions from One IP at a Time | Checkbox | Unchecked (Disabled). Includes a help icon. |\n| **c** | Restrict Console Sessions to Specific IP Ranges | Checkbox | Unchecked (Disabled). Includes a help icon. |\n| **d** | **Account Session Timeout** | Dropdown Menu | Currently set to \"48 hours.\" Includes a help icon. |\n| **e** | **SAML** | Identity Management Status | Status indicator reads *(Disabled)*. Includes a button labeled \"+ SAML Settings\" to initiate configuration. |\n| **f** | **Purchased Add-ons** | Section Header / Status Display | Status text indicates \"No purchased SKU.\" |",
      "position": 5,
      "context": "ur organization name, contact information, and the following settings:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/Managed+Accounts+List.png",
      "alt": "The image displays the **KnowBe4** application interface, centered on the **Managed Accounts** page.\n\n**Header and Navigation:**\nThe top navigation bar features the KnowBe4 logo and the primary menu with links: DASHBOARD, **ACCOUNTS** (active selection), PHISHING, TRAINING, PARTNERS, ADMINS, MODSTORE, and REPORTS. The upper right utility area includes blurred user details, a notification icon with a pending alert count ('1'), and a help/account menu.\n\n**Page Content and Controls:**\nThe page title is prominently displayed as **\"Managed Accounts.\"**\nA control bar below the title includes active filter settings: Status: Active, Billing Type: Any, and Partner: All Partners. Available actions include a green button labeled **\"Download CSV\"** (with a download icon) and a prominent search bar displaying the placeholder text **\"Search by domain or name...\"** A magnifying glass icon initiates the search, and a gear icon provides additional settings.\n\n**Data Table:**\nThe main content is a detailed, sortable table listing managed accounts. Column headers are:\n1. Organization (showing blurred data entries, each with a blue forward arrow icon)\n2. Billing Type\n3. Date Created\n4. Purchased Add-ons\n5. Seats\n6. Users\n7. Phish-prone %\n8. PSTs (Phishing Security Tests)\n9. Actions (indicated by a dropdown arrow for row-specific operations)\n\nSample data rows show various account details, including Billing Types (e.g., 'Paid', 'Diamond'), creation dates (e.g., 09/05/2019, 11/08/2017), Seat/User counts, and Phish-prone percentages (e.g., 0.0%).",
      "position": 6,
      "context": "d account, and an orange background color indicates a Trial account."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerImportUsers.png",
      "alt": "This image displays the **Manage Users & Groups** administrative interface, specifically the **CSV Import** functionality within the **Import Users** tab.\n\n**Context and Navigation:**\nThe primary navigation bar features tabs for *Users, Groups, Import Users, Active Directory, Merge Users,* and *Security Roles*. The **Import Users** tab is currently active, with the **CSV Import** sub-tab selected over *Quick import*.\n\n**Form Elements (User Input):**\n1.  **Upload a CSV file:** A standard file input field is present, accompanied by a \"Browse...\" button for file selection.\n2.  **Notify Upon Import Completion:** This section includes a dropdown menu, currently set to \"-- None --\".\n3.  **Notification Checkbox:** A checkbox labeled \"**Send Import Notification to admin@yourdomain.com**\" is checked, indicating that an administrative email notification will be sent upon process completion.\n4.  **Action Button:** A prominent blue button at the bottom is labeled \"**Import Users**.\"\n\n**Technical Requirements and Guidance (Information Panels):**\n1.  **CSV Header Requirement Panel:** This panel lists the full required header line for the CSV file. The fields include, but are not limited to: *Email, First Name, Last Name, Group, Location, Password, Employee Number, Job Title, AD Managed, Risk Booster, Custom Fields (1-4),* and *Time zone*. It specifies that **Email is mandatory**, other fields are optional, and the separator must be a comma (\",\"). Three example CSV formats are listed.\n2.  **Password Policy Panel:** This section advises against using the password field in the CSV, stating, \"This is not necessary or recommended... Users will be prompted to set up their own passwords upon their first login.\"",
      "position": 7,
      "context": "les/360013722333'>Partner and Multi-Account: Import Users article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerManagedPhishingCampaigns.png",
      "alt": "This is a screenshot of the KnowBe4 security awareness platform's administrative interface, specifically the Phishing section.\n\n**Header/Navigation Bar:**\n*   **Branding:** \"KnowBe4\" logo and tagline \"Human error. Conquered.\"\n*   **Primary Navigation:** Tabs labeled \"DASHBOARD,\" \"ACCOUNTS,\" \"PHISHING\" (currently selected, indicated by a blue background), \"TRAINING,\" \"ADMINS,\" and \"REPORTS.\"\n*   **User/Help Elements:** An obscured user menu and a blue question mark icon (Help/Support).\n\n**Page Content (Main Area):**\n*   **Page Title:** \"Managed Phishing Campaigns,\" preceded by a network/structure icon.\n*   **Call-to-Action (CTA):** A prominent blue button on the right, labeled \"+ Managed Phishing Campaign.\" A large red arrow points to this button.\n*   **Secondary Navigation (Tabs):** Tabs below the title control the displayed content type: \"Campaigns\" (currently selected, indicated by a grey background), \"Email Templates,\" and \"Landing Pages.\"\n*   **Filter/View Options (Toggle Buttons):** A set of small buttons used to filter campaign status, including \"Active\" (currently selected, dark grey), \"Inactive,\" \"Hidden,\" \"PhishFlip,\" and \"All.\"",
      "position": 8,
      "context": "-Account: Create a Managed Phishing Campaign article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewPhishingTemplate.png",
      "alt": "The image displays a user interface screen titled **Phishing Email Templates**.\n\n**Header and Primary Action:**\nThe top right features the main call-to-action: a blue button labeled **+ Create Phishing Template**. (Note: An overlaid orange arrow points toward this button.)\n\n**Primary Navigation Tabs:**\nTwo main navigation tabs are present:\n1.  **Email Templates** (Active)\n2.  **Landing Pages** (Inactive)\n\n**Template Sub-Navigation/Filter:**\nWithin the active \"Email Templates\" view, a toggle control is set to:\n*   System Templates (Inactive)\n*   **Managed Templates** (Active)\n\n**Content Control Row (Bottom):**\nThis row contains category management and template filtering tools:\n*   The section heading **Managed Categories** is followed by a blue button labeled **+ Add New Category**.\n*   The main content heading is **All Templates**.\n*   To the right, utility actions include a gray button labeled **Import** (with an upload icon) and a text input field labeled **Search**.",
      "position": 9,
      "context": "ulti-Account: Monitor a Managed Phishing Campaign article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewLP.png",
      "alt": "This technical screenshot displays the **Landing Pages** management interface within the **PHISHING** module of the KnowBe4 console.\n\n**UI Context and Navigation:**\n\n*   The main navigation identifies **PHISHING** as the active module.\n*   The primary tab selection is **Landing Pages** (active), while **Email Templates** is inactive.\n*   The user is currently viewing the **Managed Landing Pages** secondary tab (highlighted by a red rectangle), distinguished from **System Landing Pages**.\n\n**Key Actions and Elements:**\n\n*   The prominent action button in the upper right corner is the blue **+ Create Landing Page** (highlighted by an orange arrow).\n*   The left sidebar, titled **Managed Categories**, contains the action button **+ Add New Category**. It lists two category views: **All Landing Pages** (1) and **Managed pages** (1).\n*   The main data view is titled **All Landing Pages**. Above the table, an **Import** button and a **Search** input field are present.\n\n**Data Table:**\n\n*   The table headers include Checkbox (selection), **Title**, **Updated**, **URL**, and **Actions**.\n*   One row of data is visible: **Netflix Login Page - KB4**, updated on **11/28/2019**, and linked to an EU-secure URL. The **Actions** column includes icons for Copy/Duplicate and View/Preview.",
      "position": 10,
      "context": "s/360013616314'>Partner and Multi-Account: Manage Landing Pages article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/ResellerManagedTrainingCampaigns.png",
      "alt": "This image displays the primary interface for managing training campaigns within a web application.\n\n**Page Context and Primary Action:**\n*   **Page Title:** \"Managed Training Campaigns.\"\n*   **Creation Button:** A prominent blue button is located in the top right corner, labeled **\"+ Managed Training Campaign\"**. (Note: An external orange arrow is overlaid, pointing specifically to this button, indicating a key instructional focus.)\n\n**Navigation and Filtering:**\n*   **Tabs:** Two main navigation tabs are present: **\"Campaigns\"** (currently selected/active) and **\"Notification Templates\"** (inactive hyperlink).\n*   **Status Filter:** A segmented control allows filtering the list content: **\"Active\"** (currently selected), **\"Inactive,\"** and **\"All.\"**\n*   **Search Functionality:** A search input box is located on the right side of the filtering controls, featuring the placeholder text **\"Search\"** and a magnifying glass icon for execution.\n\n**Data Table Structure:**\n*   The lower portion of the screen displays the header row for a campaign data table (data rows are empty).\n*   **Sortable Columns:** The columns **\"Name\"** and **\"% Complete\"** are indicated as sortable via paired caret icons (up/down arrows).\n*   **Column Headers:** The five columns are: **Name, Accounts, Content, % Complete,** and **Actions.**",
      "position": 11,
      "context": "ModStore section below."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerNewTrainingTemplate.png",
      "alt": "This screen capture displays the **KnowBe4** administrative console, focused on the **Training Notification Templates** section.\n\n**Context and Navigation:**\n*   The main navigation bar is visible at the top, with the **TRAINING** tab highlighted in blue, indicating the current module.\n*   The primary page header is **Training Notification Templates** (preceded by an envelope icon).\n\n**Key UI Elements and Controls:**\n*   **Primary Action:** A red arrow points to the blue button labeled **+ New Training Notification Template**, which is positioned in the upper right.\n*   **Sub-Navigation:** The content area uses segmented tabs to filter templates: **System Templates** (inactive) and **Managed Templates** (active/dark gray).\n*   **Managed Categories Section:** This area features the header \"Managed Categories\" and an accompanying blue action button, **+ Add New Category**.\n*   **Template Controls:** The bottom right includes the header \"All Templates\" next to two utility controls: an **Import** button (dark gray with a download icon) and a **Search** input field with a magnifying glass icon.",
      "position": 12,
      "context": "ti-Account: Create Managed Training Notifications article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/GettingStarted/ResellerPartnerTab.png",
      "alt": "This image displays the KnowBe4 \"Partners\" administration interface, characterized by a white background and a structured layout.\n\n**Header and Navigation:**\nThe top bar features the KnowBe4 logo and tagline (\"Human error. Conquered.\"). Primary navigation tabs include DASHBOARD, ACCOUNTS, **PARTNERS** (currently active and highlighted in blue), and REPORTS. Utility elements on the far right include a notification bell icon and a help icon.\n\n**Page Context and Controls:**\nThe main content area is headed by \"Partners\" (preceded by a globe icon).\nA blue primary action button, \"+ Create Partner,\" is positioned in the top right corner.\nA search control section is present, including a help icon, an input field with the placeholder text \"Search by name or email...\", a search magnification icon, and a settings/filter gear icon with a dropdown menu.\n\n**Partners Data Table:**\nThe page displays a list of partners in a sortable data table format. The column headers are:\n\n1.  **Organization** (Sortable)\n2.  **Join Date** (Sortable)\n3.  **Subscription**\n4.  **End Date** (Sortable)\n5.  **\\# Accounts**\n6.  **\\# Users**\n7.  **Actions**\n\n**Data Examples (First Two Rows):**\n*   **Row 1:** Organization \"(ACS) Associated Computer Systems Ltd,\" Join Date \"09/21/2017,\" Subscription \"N/A,\" \\# Accounts \"23,\" \\# Users \"5050.\"\n*   **Row 2:** Organization \"(MPCA) Michigan Primary Care Association,\" Join Date \"07/01/2021,\" Subscription \"N/A,\" \\# Accounts \"2,\" \\# Users \"162.\"\n\nAll listed organizations are displayed as clickable links (blue text). The \"Actions\" column for each row contains a dropdown indicator, signifying available record-specific functions.",
      "position": 13,
      "context": "ested in adding that feature, please contact your Account Manager."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/reseller/InstructionalGuide/ResellerAdmins.png",
      "alt": "The image displays the KnowBe4 administrative console with the **ADMINS** tab selected in the main navigation bar.\n\n**Title and Actions:**\nThe main content area is titled **Account Management Admins** (preceded by a globe icon). A prominent blue button in the top-right corner allows for admin creation, labeled **+ Create Admin**.\n\n**Contextual Information:**\nA descriptive panel explains the function of the role: \"Account Management admins can manage all customer accounts. You can create additional admins who can manage or report on customer accounts.\"\n\n**Data Grid Structure (Admin List):**\nA table lists existing administrators, utilizing the following seven column headers:\n1.  **Full Name**\n2.  **Email** (Displayed as a hyperlink)\n3.  **Confirmed** (Timestamp of confirmation)\n4.  **Permissions** (Includes a help icon next to the header)\n5.  **MFA** (Multi-Factor Authentication status, accompanied by an orange linked-rings icon)\n6.  **MFA QR Link** (Content is intentionally blurred/obscured)\n7.  **(Action column)** (Contains a downward-pointing chevron/dropdown menu for row-specific actions)\n\n**Example Data Entries:**\n*   **Erin Erickson:** Permissions are listed as \"Manage Phishing Campaigns,\" and the MFA status is \"disabled.\"\n*   **Gina George:** Permissions are listed as \"Manage Phishing Campaigns,\" and the MFA status is \"disabled.\"",
      "position": 14,
      "context": "360013722733'>Partner and Multi-Account: Manage Partner Admins article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/managedmodstore.png",
      "alt": "This image is a screenshot of the KnowBe4 training platform interface, specifically displaying the **ModStore** section (content marketplace).\n\n**Header and Navigation:**\n*   The primary navigation bar features tabs: DASHBOARD, ACCOUNTS, PHISHING, TRAINING, ADMINS, **MODSTORE** (highlighted as active), and REPORTS.\n*   The system identifier in the upper left is \"KnowBe4 | Human error. Conquered.\"\n*   The user context in the upper right shows the account email (`reseller@mgmt.kb4-demo.com`), a notification bell, and a help icon.\n\n**ModStore Interface:**\n*   The main panel title is \"Managed ModStore,\" positioned above secondary navigation tabs: **Browse** (active) and Library.\n\n**Featured Content Carousel:**\n*   A large carousel displays a featured video module.\n*   The image shows security expert Kevin Mitnick seated with a laptop, overlaid with binary code graphics.\n*   A \"Featured Content\" tag is present in the upper left of the banner.\n*   The content title is \"Kevin Mitnick SECURITY AWARENESS TRAINING.\"\n*   Content details specify: \"Video Module | 5 minutes | June 2022.\"\n*   Action buttons below the text are \"View Details\" and \"Add to Library.\"\n*   Navigation controls (left/right arrows, pagination dots) indicate this is a rotating content banner.\n\n**Filtering and Search Controls:**\n*   A filtering area is located below the carousel, containing three primary input fields:\n    1.  **Content Types:** Dropdown menu currently set to \"All.\"\n    2.  **Topics:** Dropdown menu currently set to \"All.\"\n    3.  **Search:** An input box with a magnifying glass icon.\n*   A collapsible section labeled \"Additional Filters\" is present below the primary filters.\n\n**Recommended Content Section:**\n*   A section titled \"Recommended\" displays horizontal thumbnails of additional content.\n*   Navigation arrows are present to scroll through recommended items.\n*   Visible content titles include: \"SECURELY WORKING FROM HOME,\" an unidentified content piece, and a partially visible item titled \"2019 KEVIN MITNICK Security Awareness.\"",
      "position": 15,
      "context": "d training campaign, you must add content from the ModStore to your managed library."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/reseller/InstructionalGuide/ResellerReports.png",
      "alt": "The image displays the KnowBe4 web application interface, specifically within the Reporting module.\n\n**Context and Navigation:**\n*   **Branding:** The top left corner features the KnowBe4 logo and the tagline \"Human error. Conquered.\"\n*   **Primary Navigation:** A horizontal menu bar includes links for DASHBOARD, ACCOUNTS, PHISHING, TRAINING, ADMINS, and **REPORTS**. The REPORTS link is highlighted in blue, indicating the current section.\n*   **Page Title:** The main content area is titled \"Account Management Reporting.\"\n\n**UI Elements and Functionality:**\n*   **Report View Tabs:** Two tabs define the main reporting area: \"**Choose Report by Category**\" (currently active) and \"Report Viewer.\"\n*   **Search and Filtering:** A search input field labeled \"Search...\" is present for filtering reports.\n*   **View Toggle:** To the right of the search bar, view controls allow switching between report display formats. The detailed list/grid view icon (three horizontal bars with vertical lines) is currently selected (highlighted blue), while the simple list view icon (three horizontal bars) is unselected.\n\n**Displayed Reports (List View):**\nThe interface lists report options, each featuring a title, description, and thumbnail preview.\n\n1.  **Report Title:** Risk Score Reports\n    *   **Description:** \"View your organization’s Risk Scores by user group, location, or riskiest users.\"\n    *   **Thumbnail:** Shows a preview image of a data visualization, including a color-coded pie chart.\n\n2.  **Report Title:** Account Report Card\n    *   **Description:** \"View the average Risk Score, Phish-prone Percentage, and other helpful data for each account. This report can be used to assess the training statuses of an account or determine what types of phishing emails that users in that account are prone to clicking.\"\n    *   **Thumbnail:** Shows a preview image of bar graphs and line charts tracking metrics over time.",
      "position": 16,
      "context": "189573'>Partner and Multi-Account: Account Management Reporting Guide."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "account",
      "getting",
      "multi",
      "partner",
      "started"
    ],
    "image_count": 16
  }
}