{
  "article": {
    "id": 360049400313,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360049400313.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360049400313.html",
    "author_id": 368027116814,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 15,
    "vote_sum": 3,
    "vote_count": 5,
    "section_id": 8594969672211,
    "created_at": "2020-05-29T18:34:54Z",
    "updated_at": "2025-09-09T13:05:03Z",
    "name": "Partner and Multi-Account: Create a Managed Phishing Campaign",
    "title": "Partner and Multi-Account: Create a Managed Phishing Campaign",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-05T19:04:56Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "phishing",
      "partner",
      "answerbot",
      "#localize",
      "answerbot_kmsat"
    ],
    "body": "<div class='callout-remember'>\n<div>\n<strong>Important:</strong>For managed accounts to receive managed phishing campaigns, both the managed and the partner accounts must be opted in to <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955-Phishing-Templates-Advanced-Features-Guide'>advanced features</a>.</div>\n</div>\n<p>A campaign can consist of either a single phishing test or a recurring series of tests done weekly, bi-weekly, monthly, or quarterly. You can define which accounts, users, or groups to target. You can also select individual phishing templates for a one-time test, a fully randomized system, or managed templates so that users on your managed accounts receive different phishing templates at different times.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>In order to create a managed phishing campaign, admins must be granted the right permissions. This can be done from the Admins tab of your management platform. To learn more, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360013722733-Partner-and-Multi-Account-Manage-Partner-Admins#EDIT'>Editing a Partner Admin</a> section of the <a href='https://support.knowbe4.com/hc/en-us/articles/360013722733-Partner-and-Multi-Account-Manage-Partner-Admins'>Partner/Multi-Account: Manage Partner Admins</a> article.</div>\n</div>\n<p>To create a new managed phishing campaign, navigate to the <strong>Phishing</strong> tab and click the <strong>+ Managed Phishing Campaign</strong> button in the upper-right corner of the screen. This action will take you to the <strong>New Managed Phishing Campaign</strong> screen. For more information about this screen, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/ManagedPhishingCampaign_ManagedCampaignAnnotated.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/ManagedPhishingCampaign_ManagedCampaignAnnotated.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>Campaign Name</strong>: Enter a name for your phishing campaign here. This field is required.</li>\n<li>\n<strong>Send to</strong>: Click <strong>Select Accounts</strong> to select which accounts you want to include in this phishing campaign. Click <strong>Select Users or Groups</strong> to select either specific groups or select <strong>All Users</strong> for each selected account. You also have the option to click <strong>Add All Account Users</strong> from <strong>Select Users or Groups</strong> instead of clicking <strong>All Users</strong> for each account.</li>\n<li>\n<strong>Frequency</strong>: Select how often you would like to send Phishing Security Tests (PSTs) for this campaign. If you select <strong>One-time</strong>, this campaign will send one PST to the selected accounts, users, or groups. For ongoing phishing campaigns, we recommend selecting either <strong>Bi-weekly</strong> or <strong>Monthly</strong>.</li>\n<li>\n<strong>Start Time</strong>: Set the date, time, and time zone you would like your phishing campaign to start. Your default time zone is the one set in your <strong>Account Settings</strong>.</li>\n<li>\n<strong>Sending Period</strong>: Select when to start sending PSTs. You can choose to send all of the emails at once or over a period of time.\n<ol type='a'>\n<li>\n<strong>Send all emails when the campaign starts</strong>: Emails will begin sending as soon as the campaign begins. The timing of sending and delivery will vary, depending on the number of users in the campaign. In most campaigns, all emails will be sent within an hour after the campaign starts. Users will not receive the email at the same time, but they will receive it on the same day.</li>\n<li>\n<strong>Send emails over…</strong>: Selecting this option will send phishing tests to the users randomly during the time period selected. You can enter a number between one and six and pick business days, weeks, or months.</li>\n</ol>\n</li>\n<li>\n<strong>Track Activity</strong>: Choose how long you would like to track activity on your phishing campaign. This period will begin after the last email is sent. The minimum tracking duration is 1 day, while the maximum is 6 months. The digit entered must be from 1 to 6. At a minimum, we recommend tracking activity for at least 3 days. Here, days refer to calendar days rather than business days. Activity includes clicks, attachment opens, replies, data entry, and reporting by the Phish Alert Button (PAB). You and local admins can see this information from individually managed accounts on the <strong>Phishing</strong> tab.</li>\n<li>\n<strong>Track Replies to Phishing Emails</strong>: If you select this check box, you can track if users on your managed accounts are prone to responding to phishing emails. For more details on this feature, view our <a href='https://support.knowbe4.com/hc/en-us/articles/234956728-Reply-To-Phishing-Guide'>Reply-To Phishing Guide</a>. You and local admins can see this information from individually managed accounts on the <strong>Phishing</strong> tab.</li>\n<li>\n<strong>Template Topics</strong>: Select the phishing template topics you want to use. You can select one or more phishing template topics. By default, no template topics are selected, and your templates will be random. This field is required.</li>\n<li>\n<strong>Set Template Language</strong>: Use this check box to select the languages you want to use in this phishing campaign. If multiple languages are selected, users will receive templates in any of the selected languages. This setting will override the account’s default phishing language and the language set in the user’s profile. When this check box is selected, the <strong>Language Override</strong> drop-down menu will appear. You can select a maximum of five languages.</li>\n<li>\n<strong>Difficulty Rating</strong>: Select the difficulty rating for your phishing campaign from the drop-down menu. For more information about difficulty levels, see our <a href='https://support.knowbe4.com/hc/en-us/articles/218333717-Template-Difficulty-Ratings-Overview'>Template Difficulty Ratings Overview</a> article.</li>\n<li>\n<strong>Template Selection</strong>: Select what type of template you would like to use. You can select a specific template or use one of our Automated Template Selections: AIDA Selected, Full Random, or Random. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500003848062-Automated-Template-Selection-Overview'>Automated Template Selection Overview</a> article. If you selected to use a specific template, the <strong>Specific Template</strong> drop-down menu will appear.\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>If you’re interested in further customizing your phishing templates, see our <a href='https://support.knowbe4.com/hc/en-us/articles/228001628-Hide-Phishing-Templates-or-Categories'>Hide Phishing Templates or Categories</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/12732930359699-KnowBe4-Console-Account-Settings-Phishing'>KnowBe4 Console Account Settings: Phishing</a> articles.</div>\n</div>\n</li>\n<li>\n<strong>Phish Link Domain</strong>: Select the domain you would like to display for phishing links in your campaign from the drop-down menu. Each domain is owned by KnowBe4 and is only used for PSTs. By default, this field will select a random domain. For more information on available domains or how to hide a domain from use, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360061705153-Manage-Phish-Link-Domains'>Manage Phish Link Domains</a> article.</li>\n<li>\n<strong>Landing Page</strong>: Select the landing page you want to use for your phishing campaign from the drop-down menu. Landing pages are what your users see when they fail a phishing test. If you customized a landing page for your campaign, it will be automatically selected in this field. For more information about landing pages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/218627727-Change-the-Landing-Page-on-Your-Phishing-Campaign'>Change the Landing Page on Your Phishing Campaign</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/204240768-Create-and-Edit-Email-Templates-and-Landing-Pages'>Create and Edit Email Templates and Landing Pages</a> articles.</li>\n<li>\n<strong>Send an email report to account admins after each phishing test</strong>: Select this check box to automatically send a report to all account admins each time a phishing test finishes. The reports include metrics such as Phish-prone Percentage, number of attachments opened, and more.</li>\n<li>\n<strong>Hide from Reports</strong>: Select this check box to hide the phishing campaign from user profiles and phishing reports. Hidden campaigns will not impact Risk Scores or Phish-prone Percentages. We recommend using this option when running a test campaign for whitelisting or other phishing functionality tests.</li>\n<li>\n<strong>Prevent campaign edits by local account admins</strong>: You can select this option to prevent admins on your managed accounts from editing this campaign.</li>\n<li>\n<strong>Create Managed Campaign</strong>: Once you’ve finished customizing your phishing campaign, click this button to save all changes.</li>\n</ol>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360049400313-Partner-and-Multi-Account-Create-a-Managed-Phishing-Campaign",
    "images": [
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/ManagedPhishingCampaign_ManagedCampaignAnnotated.png",
        "alt": "This image displays a configuration form used for setting up a security campaign (implied to be a phishing test or awareness training). The form is structured vertically with labeled input fields, selectors, and options.\n\n**Key UI Elements and Configuration Fields:**\n\n1.  **Campaign Identification and Distribution:**\n    *   **Campaign Name:** Text input field.\n    *   **Send To:** Two parallel dropdown selectors: \"Select Accounts...\" and \"Select Users or Groups...\"\n\n2.  **Scheduling and Frequency:**\n    *   **Frequency:** Tabbed selector with five options, currently displaying \"One-time\" (selected), \"Weekly,\" \"Biweekly,\" \"Monthly,\" and \"Quarterly.\"\n    *   **Start Time:** Consists of a date picker (`04/28/2025`), a time input (`2:51 PM`), and a time zone selector (`(GMT-04:00) Eastern Time (US & Canada)`).\n\n3.  **Sending Period:**\n    *   Radio button selection:\n        *   Option 1: \"Send all emails when the campaign starts.\"\n        *   Option 2 (Selected): \"Send emails over [3] [business days]\" (numeric input and dropdown for time unit).\n\n4.  **Activity Tracking:**\n    *   **Track Activity:** Defines the tracking duration using a numeric input (`6`) and a dropdown unit (`months`), followed by the text \"after the sending period ends.\"\n    *   **Tracking Option:** Checkbox labeled \"Track Replies to Phishing Emails.\"\n\n5.  **Template Definition:**\n    *   **Template Topics:** Dropdown selector labeled \"Select one or more topics...\"\n    *   **Template Language:** Checkbox labeled \"Set Template Language.\"\n    *   **Difficulty Rating:** Dropdown selector defaulted to \"All Ratings.\"\n    *   **Template Selection:** Dropdown selector defaulted to \"Full Random (Random email to each user).\"\n    *   **Template Availability:** A gray horizontal bar labeled \"Available Templates (0 Total)\" with an addition button (\"+\") on the right.\n\n6.  **Phishing Configuration:**\n    *   **Phish Link Domain:** Dropdown selector defaulted to \"Random Domain.\"\n    *   **Landing Page:** Dropdown selector defaulted to \"Default Landing Pages.\"\n\n7.  **Reporting and Permissions (Checkboxes):**\n    *   \"Send an email report to local account admins after each phishing test.\"\n    *   \"Hide from Reports.\"\n    *   \"Prevent campaign edits by local account admins.\"\n\n8.  **Action Button:**\n    *   A primary blue button at the bottom labeled **\"Create Managed Campaign.\"**\n\n*Note: Multiple fields are accompanied by context-sensitive help icons (question marks).*",
        "position": 1,
        "context": "een, see the screenshot and list below:"
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "account",
        "and",
        "campaign",
        "managed",
        "multi",
        "partner",
        "phishing"
      ],
      "image_count": 1
    }
  }
}