{
  "article": {
    "id": 360059091413,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360059091413.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360059091413.html",
    "author_id": 1501549449361,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 10,
    "vote_sum": 4,
    "vote_count": 12,
    "section_id": 26420669305107,
    "created_at": "2020-11-12T14:49:20Z",
    "updated_at": "2025-11-25T21:56:22Z",
    "name": "Identify and Address False Positives",
    "title": "Identify and Address False Positives",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-25T21:56:22Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "whitelisting",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>If you are running a phishing campaign and see results that are unusual, you may be experiencing false clicks. When reviewing campaign results, if you see a 100 percent click rate or IP addresses that don't belong to your organization, this can be an indication of false positives. Below are some of the common reasons for false positives as well as some tips for handling them.</p>\n<h2 id='h_01HBVJBX3Q7EXS1SZ9EVKQ5ARM'>What Is Considered a Click?</h2>\n<p>Clicks are what we track when a user clicks on a phishing link in a simulated email. However, there are other ways a click may be registered. We refer to clicks that were not caused by a user clicking a phishing link as false positives. Listed below are some common reasons for false positives:</p>\n<ul>\n<li>Improper whitelisting of your spam filter. Improper whitelisting can cause automated clicks or bot clicks. To learn how to tell if your click was a bot click, please see our <a href='#h_01HBVJBX3Q8HQQHBG2TN86YJPR'>How to Identify Bot Clicks</a> section below.</li>\n<li>Additional whitelisting may be required. Your spam filter may require additional whitelisting in order to exempt simulated phishing emails from link analysis or link probing.</li>\n<li>Mail filters with security add-on packs that have not been whitelisted.</li>\n<li>Endpoint security or antivirus software.</li>\n<li>Link preview functions as part of mobile device operating systems.</li>\n<li>Security software that is incorporated into mobile device management (MDM) systems.</li>\n<li>Phishing emails that are forwarded from one user to another user. This action may be registered as a click because the forwarded email was sandboxed and checked by the mail server or because the recipient of the forwarded email clicked on the link.</li>\n</ul>\n<h2 id='h_01HBVJBX3Q8HQQHBG2TN86YJPR'>How to Identify Bot Clicks</h2>\n<p>Instances of improper or insufficient whitelisting can lead to a bot click. Bot clicks are caused by an automated process within your infrastructure. You can identify a bot click by examining your phishing campaign results. Listed below are some ways you can identify bot clicks:</p>\n<ul>\n<li>The times listed in the <strong>Delivered</strong>, <strong>Open</strong>, and<strong> Click</strong> columns are all the same or are within a minute of each other.</li>\n<li>The <strong>Clicked</strong> tab indicates the browser or browser version is one that is not used in your environment or is outdated.</li>\n<li>The operating system listed is one that your users don’t have access to in your environment.</li>\n<li>The IP address belongs to a provider of one of your security products.</li>\n</ul>\n<h2 id='h_01HBVJBX3QYH7QYSTVRBMQBX45'>Unexpected IP Addresses in Campaign Results</h2>\n<p>When a click is registered in the console, the IP address is registered from where the click originated. Below are some examples of why you may see unexpected IP addresses:</p>\n<ul>\n<li>If a user is on a mobile device and clicks on the link, the click could show as coming from the cellular service provider.</li>\n<li>If a user is on the Wi-Fi in their house, the click would register as being from an IP address from that internet service provider (ISP).</li>\n<li>If a user is on public Wi-Fi, the click would register from the location of where the user was when they clicked.</li>\n<li>If you or one of your products uses a hosted services provider, such as AWS, the IP address may come from another location or even another country. Certain link analysis processes may not occur on the client side, and the link may be passed to the security provider’s backend processing or analysis center.</li>\n<li>If the URL is sent to VirusTotal, the IP address may come from another location. This link may be sent automatically by a product you use or by your user. When a URL is submitted to VirusTotal, they analyze the URL to determine if it needs to be added to their threat definitions as hostile. Sometimes, this link analysis is instant. Other times, it may happen over the course of several hours. These IP addresses may register as a security vendor or they may register as an ISP.</li>\n</ul>\n<h2 id='h_01KAF1CSYVPF667XSSA3K6C1K3'>Common Causes of False Positives</h2>\n<p>False positives in phishing simulations typically stem from three main sources:</p>\n<ul>\n<li>\n<strong>Link scanner interference</strong>: Security tools that automatically select links before users see emails</li>\n<li>\n<strong>Inadequate whitelisting</strong>: KnowBe4 domains are not properly exempted from security scanning</li>\n<li>\n<strong>Misconfigured</strong> security policies: Spam filters or mail flow rules that conflict with phishing test delivery</li>\n</ul>\n<p>To minimize false positives, configure your spam filters to exclude KnowBe4 phishing emails from link analysis and probing. Ensure smart hosts and advanced delivery policies align with your campaign configurations. When investigating link scanner-related issues, review your whitelisting settings with IT admins to strike a balance between security requirements and accurate training metrics.</p>\n<h2 id='h_01HBVJBX3Q60K6XWZ24ZKQYN0Y'>How to Prevent False Positives</h2>\n<p>Knowing your infrastructure is the most important step for preventing false positives. Since there are a wide variety of security software products, you may want to check the documentation of the software or service providers that you use to see if there is a section about exempting links or domains from link scanning, link analysis, or link probing.</p>\n<p>You can also run test campaigns with a couple of different templates on machines that would have the same setup as your users' workstations. These test campaigns can help you see if your current setup will cause false positives.</p>\n<p>Make sure your users are only reporting emails via the Phish Alert Button and not your mail server's phishing button or any other third-party reporting feature.</p>\n<p>Check to see if your security products have the option of additional whitelisting. If you can, whitelist our phish link domains and our landing page domains. This extra step can help prevent false positives. To see a list of our root phishing domains, navigate to the <strong>Phishing</strong> tab in your KnowBe4 console and select the <strong>Domains </strong>subtab. For more information on the <strong>Domains</strong> subtab, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360061705153'>How to Manage Phish Link Domains</a> article.</p>\n<p>If you are still experiencing issues with false positives, contact our <a href='https://support.knowbe4.com/hc/en-us/requests/new'>support team</a> and they will be happy to assist you.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360059091413-Identify-and-Address-False-Positives",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "and",
        "false",
        "identify",
        "positives"
      ],
      "image_count": 0
    }
  }
}