{
  "article": {
    "id": 360019709833,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360019709833.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360019709833.html",
    "author_id": 21027160967,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 3,
    "vote_sum": 2,
    "vote_count": 2,
    "section_id": 360000156808,
    "created_at": "2019-03-12T21:10:41Z",
    "updated_at": "2025-03-11T18:33:58Z",
    "name": "How to Create and Manage KCM GRC User Accounts",
    "title": "How to Create and Manage KCM GRC User Accounts",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T18:33:58Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "contributor",
      "confirming account",
      "user roles",
      "RBAC",
      "disable user",
      "create new user",
      "KCM General",
      "answerbot_kcmgrc"
    ],
    "body": "<p>In KCM GRC, you can create or import user accounts and assign user roles to each account. By assigning user roles, you can give users access to only the information that they need to perform their responsibilities. To learn about the user roles that KCM GRC offers, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148' target='_self'>KCM GRC: User Roles</a> article.</p>\n<p>After you create user accounts and assign user roles, you can manage the accounts by updating user information, confirming user accounts, and disabling user accounts.  </p>\n<h2 id='h_01HVVYAJ347XFHFYVZ8KPYT58Q'>Creating User Accounts</h2>\n<p>To create a user account in your platform, follow the steps below: </p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> If you're using KCM GRC's Policy Management module to manage internal policy acknowledgments, you will need to use a different method to add end-users to your KCM GRC account. To learn about this method, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360000727248#StepThree' target='_self'>Step Three: Add End Users to the Policy Management Module</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360000727248' target='_blank' rel='noopener'>Policy Management Module Guide</a>.</div>\n</div>\n<ol role='list'>\n<li>Log in to your platform and click the <strong>Settings</strong> button at the top-right corner of the page.</li>\n<li>Select <strong>Create New User</strong> from the drop-down menu. \n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCMCreateNewUserButton.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCMCreateNewUserButton.png' alt=' '></a>\n</li>\n<li>On the <strong>Create User</strong> page, fill out each of the fields. To learn about each field, see the list below:\n<ol role='list' type='a'>\n<li>\n<strong>First Name:</strong> Enter the user's first name. The user will be addressed by their first name in the automated emails sent from your KCM GRC account.</li>\n<li>\n<strong>Last Name:</strong> Enter the user's last name.</li>\n<li>\n<strong>Email:</strong> Enter the user's business email. \n<div class='callout-warning'>\n<div class='callout__content'>\n<strong>Important:</strong> The user must be able to receive emails at this email address in order to confirm their account.</div>\n</div>\n</li>\n<li>\n<strong>Telephone:</strong> Click the flag drop-down menu and select the telephone number format for your country. Then, enter the user's phone number.</li>\n<li>\n<strong>User Roles:</strong> Click the drop-down menu and select one or more user roles to assign to the users. Please refer to our <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148' target='_blank' rel='noopener'>User Roles</a> article to learn about the permissions for each user role.\n<ul role='list'>\n<li>\n<strong>Allowed Scopes: </strong>Click the drop-down menu and select the scopes you'd like the user to have access to. This field is only applicable for Scope Administrator and Auditor roles.</li>\n<li>\n<strong>Allowed Campaigns: </strong>Click the drop-down menu and select the policy campaigns that you'd like the user to have access to. This field is only applicable to Campaign Administrator and Auditor roles.</li>\n</ul>\n</li>\n<li>\n<strong>Create:</strong> After entering all of the user's information, click this button. </li>\n</ol>\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_CreateUser.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_CreateUser.png' alt=' '></a>\n</li>\n</ol>\n<h3 id='h_01HVVYAJ34XD3FVA70XQHWVZCB'>Importing User Accounts</h3>\n<p>If you are creating multiple user accounts at once, you can save time by importing users with a CSV file. When you import users into your account, the users are automatically assigned the Contributor user role. After you import your users, you can change their user roles, or you can add additional user roles.</p>\n<p>When you create your CSV file, follow the guidelines below: </p>\n<ul role='list'>\n<li>The file should be a valid CSV file with a comma separator.\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important: </strong>If you are using Microsoft Excel, your file must be saved in the CSV UTF-8 (Comma delimited) format.</div>\n</div>\n</li>\n<li>The following header line is required:\n<pre>email,first_name,last_name</pre>\n</li>\n</ul>\n<p>To import users into your account with a CSV file, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your platform and click the <strong>Settings</strong> button at the top-right corner of the page.</li>\n<li>Select <strong>Manage Users</strong> from the drop-down menu.</li>\n<li>Click the <strong>Import</strong> button at the top of the page.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ManageUsers-Importbutton.png'><img src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ManageUsers-Importbutton.png' alt=' '></a>\n</li>\n<li>In the <strong>Import Items</strong> window, click the<strong> Click to Upload</strong> button. \n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ImportUsers-ClicktoUploadbutton.png'><img src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ImportUsers-ClicktoUploadbutton.png' width='581' height='401' alt=' '></a>\n</li>\n<li>Select the CSV file that contains your list of users.</li>\n<li>(Optional) Review the users in the list. If you would like to remove a user from the import, click the trashcan icon.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ImportItems-Usersmodal.png'><img src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ImportItems-Usersmodal.png' alt='The Import Items Modal Window' width='477' height='512'></a>\n</li>\n<li>When you're ready to import these users, click the <strong>Import Items</strong> button.</li>\n</ol>\n<p>After you click the <strong>Import Items</strong> button, user accounts will be created for all users that you imported. These users will receive an email that prompts them to activate their accounts. For information about account activation, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360052119554' target='_self'>How to Activate Your Account, Access Your Account, and Reset Your Password</a> article.</p>\n<p>Until they have been assigned to one or more tasks, Contributors are unable to access data in your KCM GRC platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148' target='_blank' rel='noopener'>KCM GRC: User Roles</a> article. If you'd like to change a user's user role, see the <a href='#MANAGING' target='_self'>Managing Users</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148' target='_blank' rel='noopener'>KCM GRC: User Roles</a> article.</p>\n<h2 id='h_01HVVYAJ34S16647CXDEEGBJ5Q'>Managing User Accounts</h2>\n<p>If you're an Account Administrator, you can monitor and manage your users' details from the <strong>Manage Users</strong> page. To navigate to the <strong>Manage Users</strong> page, log in to your platform and click the <strong>Settings</strong> button in the top-right corner of the page. Then, select <strong>Manage Users</strong> from the drop-down menu.  <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png' alt=' '></a></p>\n\n<p>For more information about the <strong>Manage Users</strong> page, see the list below:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ManageUsersview.png'><img src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ManageUsersview.png' alt=' '></a></p>\n<ol role='list'>\n<li>\n<strong>Full Name</strong>: This column displays the user's full name. If you have created one or more user groups for your Compliance Management module, you can select the check box next to each user that you'd like to add to a group. Then, you can select the desired group from the <strong>Select a Group</strong> drop-down menu and click <strong>Add To Selected Group</strong>.\n<ul role='list'>\n<li>To learn about working with user groups in the Compliance Management module, please see our <a href='https://support.knowbe4.com/hc/en-us/articles/360049480674' target='_self'>Working with User Groups</a> article.</li>\n</ul>\n</li>\n<li>\n<strong>Status</strong>: This column displays the status of the user account. The statuses are Active, Awaiting Confirmation, and Disabled.\n<ul role='list'>\n<li>To learn about account confirmation, see the <a href='#h_01HVVYAJ359B7143ZDAR9VX8QE'>Confirming User Accounts</a> section below.</li>\n</ul>\n</li>\n<li>\n<strong>Date Updated</strong>: This column displays the last date that changes were made to the user's account. This includes the user's email address, phone number, or user role.</li>\n<li>\n<strong>Disable User Icon</strong>: Click this icon to disable the user account and transfer their responsibilities to a different user.\n<ul role='list'>\n<li>For more information, see the <a href='#h_01HVVYAJ35W28PMAWRMKKH483N'>Disabling User Accounts and Transferring Responsibilities</a> section below.</li>\n</ul>\n</li>\n<li>\n<strong>Pencil Icon</strong>: Click this<strong> </strong>icon to edit the user's account. When you click this icon, you'll be taken to the <strong>User Management</strong> page.\n<ul role='list'>\n<li>For more information about the <strong>User Management</strong> page, see the <a href='#h_01HVVYAJ34QCXFT0S9VVVJER25'>Updating User Details</a> section below.</li>\n</ul>\n</li>\n</ol>\n<h3 id='h_01HVVYAJ34QCXFT0S9VVVJER25'>Updating User Account Details</h3>\n<p>If you're an Account Administrator, you can update your users' details and account settings. For example, you can change a user's user roles or give the user access to additional scopes.</p>\n<p>To view a user's profile, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your platform and click the <strong>Settings</strong> button at the top-right corner of the page.</li>\n<li>From the drop-down menu, select <strong>Manage Users</strong>.</li>\n<li>Click the pencil icon under the <strong>Actions</strong> column.</li>\n</ol>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> If you're not an Account Administrator and you'd like to update your own account information, log in to your account and click your name at the top-right corner of the page. Then, click the <strong>Profile</strong> button.</div>\n</div>\n<p>To learn about the settings that are available on the <strong>User Management</strong> page, see the details below:<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/UserManagementPage.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/UserManagementPage.png' alt=' '></a></p>\n\n<ol role='list'>\n<li type='a'>\n<strong>Set Up MFA:</strong> Click this button to connect your user account with your organization's multi-factor authentication (MFA) application.\n<ul role='list'>\n<li>For details about configuring MFA for your user account, configuring MFA for individual accounts, and configuring MFA for all user accounts, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000173767-KCM-GRC-Enable-and-Set-Up-Multi-Factor-Authentication#OptionalIndividualSetup' target='_blank' rel='noopener'>Enable and Set Up Multi-factor Authentication</a> article.</li>\n</ul>\n</li>\n<li type='a'>\n<strong>Disable User: </strong>Click this button to disable the user's account and transfer their responsibilities to another user.\n<ul role='list'>\n<li>For more information, see the <a href='#h_01HVVYAJ35W28PMAWRMKKH483N'>Disabling Users and Transferring Responsibilities</a> section below.</li>\n</ul>\n</li>\n<li type='a'>This widget provides an overview of the user's responsibilities in your KCM GRC console.\n<ul role='list'>\n<li>\n<strong>Scopes:</strong> If the user is a Scope Administrator or an Auditor, this shows the number of scopes that the user has been granted access to.</li>\n<li>\n<strong>Policy Campaigns:</strong> If the user is a Campaign Administrator or an Auditor, this shows the number of policy management campaigns the user has been granted access to.</li>\n<li>\n<strong>Tasks:</strong> When applicable, this shows the number of tasks the user is currently assigned to. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360050048234' target='_self'>Working with Task Schedules for Controls</a> article. </li>\n<li>\n<strong>Compliance Percentage: </strong>When applicable, this shows the percentage of this user's assigned tasks that were satisfied on time.</li>\n</ul>\n</li>\n<li type='a'>\n<strong>Task History:</strong> This tab shows all of the tasks the user is currently assigned to and the tasks the user has satisfied in the past. The <strong>Task History</strong> table lists the following information for all tasks that the user is Responsible for:\n<ul role='list'>\n<li>\n<strong>Name:</strong> The task name. The task may have the same name as the associated control.</li>\n<li>\n<strong>Due At:</strong> The date the task evidence is due or was previously due.</li>\n<li>\n<strong>Completed On:</strong> The date the task was marked as complete.</li>\n<li>\n<strong>Status:</strong> The current task status. The statuses are Failed, Past Due, Active, Satisfied, or Closed Late. </li>\n<li>\n<strong>Stage:</strong> The current stage of satisfying the task. The stages are Awaiting Approval, Approved, or Open. All failed or unsatisfied tasks will show the <strong>Open</strong> stage. All closed tasks will show the <strong>Approved</strong> stage.</li>\n</ul>\n</li>\n<li>\n<strong>Audit Trail</strong><span>: Click this tab to view actions that the user has made in your KCM GRC account.</span>\n</li>\n<li>\n<strong>User Roles:</strong> Click the drop-down menu and select additional user roles that you’d like to add. To remove a user role, click the <strong>x</strong> button to the right of the role name.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>Only Account Administrators can demote other Account Administrators' user roles. However, Account Administrators cannot demote their own user roles.</div>\n</div>\n</li>\n<li>\n<strong>Allowed Scopes:</strong> Click this drop-down menu to select the scopes you'd like the user to have access to. This field is only available for users with Scope Administrator user roles.</li>\n<li>\n<strong>Allowed Campaigns:</strong> Click the drop-down menu to search for or select the policy campaigns you'd like your users to have access to. This field is only available for users with Campaign Administrator user roles. </li>\n<li>\n<strong>Require MFA: </strong>Click the slider button to mandate MFA for this user's account. This button is only available for Account Administrator user roles.\n<ul role='list'>\n<li>Before you enable this setting, ensure the user has installed an authenticator application. The user will be required to set up their MFA application the next time they log in to their KCM GRC account. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000173767' target='_blank' rel='noopener'>Enable and Set Up Multi-Factor Authentication</a><span> article.</span>\n</li>\n</ul>\n</li>\n</ol>\n<h3 id='h_01HVVYAJ359B7143ZDAR9VX8QE'>Confirming User Accounts</h3>\n<p>Once you've created a new user, they must confirm their account before they can log in. The user will receive an account confirmation email at the email address you provided when you <a href='#CREATING' target='_self'>created the user's account</a>. For more information about activating a user account, see our <a class='article-list-link' href='https://support.knowbe4.com/hc/en-us/articles/360052119554'>KCM GRC: Account Activation, Account Access, and Resetting Your Password</a> article.</p>\n<p>If the user did not receive the account confirmation email, be sure they've checked their Spam or Junk folder. If you need to resend the activation email to your user, see the <a href='#h_01HVVYAJ35MB3545KPJZB1TRCA' target='_self'>Resending Account Confirmation Emails</a> subsection below for instructions</p>\n<h3 id='h_01HVVYAJ35MB3545KPJZB1TRCA'>Resending Account Confirmation Emails</h3>\n<p>If you're an Account Administrator and your user has not received an email to confirm their account, follow the steps below to resend their account confirmation email:</p>\n<ol role='list'>\n<li>Log in to your platform and click the <strong>Settings</strong> button at the top-right corner of the page.</li>\n<li>From the drop-down menu, select <strong>Manage Users</strong>.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png' alt=' '></a>\n</li>\n<li>From the <strong>Manage Users</strong> page, find the user who needs the confirmation email and click the <strong>update user icon</strong> in the far-right column.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_UpdateUsericon.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_UpdateUsericon.png' alt=' '></a>\n</li>\n<li>From the <strong>User Management</strong> page, click the <strong>Resend Activation</strong> button.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/ResendActivation.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/ResendActivation.png' alt=' '></a>\n</li>\n<li>In the <strong>Are you sure you want to reconfirm this user?</strong> prompt, select <strong>Yes</strong>.</li>\n</ol>\n<p>If the user does not receive the account confirmation email, we recommend that the user checks their Spam and Junk folders.</p>\n<p>To learn about account activation when SSO is enabled for your account, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360052119554' target='_self'>How to Activate Your Account, Access Your Account, and Reset Your Password</a> article. If you are experiencing difficulty with the account activation process, contact our <a href='mailto:support@knowbe4.com' target='_self'>support team</a> for help.</p>\n<h3 id='h_01HVVYAJ35W28PMAWRMKKH483N'>Disabling User Accounts and Transferring Responsibilities</h3>\n<p>If you're an Account Administrator, you can disable user accounts. For example, if one of your compliance users with Contributor or Scope Administrator user roles leaves your organization, you would need to disable the user's account. When you disable a user account, you can reassign the user's responsibilities for controls, tasks, and vendors. </p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>If you are transferring responsibilities from a Scope Administrator to another Scope Administrator, the Scope Administrator who is receiving the responsibilities should have the same <strong>Allowed Scopes</strong> as the user who you are disabling. </div>\n</div>\n<p>To disable a user and transfer the user's responsibilities, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your platform.</li>\n<li>Click the <strong>Settings</strong> button at the top-right corner of the page.</li>\n<li>From the drop-down menu, select <strong>Manage Users</strong>. \n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png' alt=' '></a>\n</li>\n<li>From the <strong>Manage Users</strong> page, find the user you need to disable and click the <strong>disable user</strong> <strong>icon</strong>.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_DisableUsericon.png'><img src='https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_DisableUsericon.png' alt=' '></a>\n</li>\n<li>From the <strong>Disable </strong><strong>User </strong>page, select a user or users to transfer the user's responsibilities to. To learn about the responsibilities you can transfer, see the list below:\n<ol role='list' type='a'>\n<li>\n<strong>Tasks</strong>: Transfer the tasks that the user was responsible for approving or completing to the new user. If the user is the User Assigned for tasks, the new user will become the User Assigned for those tasks. If the user is the Approving Manager or Second-level Approving Manager for tasks, the new user will become the Approving Manager of Second-level Approving Manager for those tasks. Only tasks that have not been satisfied will be transferred to the new user. To learn which tasks have been satisfied and which tasks have not been satisfied, see the list below:\n<ul role='list'>\n<li>Tasks that have not been satisfied include the tasks in the list below: \n<ul role='list'>\n<li>Tasks that have a task stage of <strong>Open</strong> and a task status of <strong>Active</strong>,<strong> Past Due</strong>, or <strong>Failed</strong>.</li>\n<li>Tasks that have a task stage of <strong>Awaiting Approval</strong>.</li>\n<li>All new tasks that will be created in the future for task schedules that the disabled user was assigned to.</li>\n</ul>\n</li>\n<li>Tasks that have been satisfied include the tasks in the list below:\n<ul role='list'>\n<li>Tasks that have a task status of <strong>Satisfied</strong> and a task stage of <strong>Approved</strong>.</li>\n<li>Tasks that have task status of <strong>Closed Late</strong> and a task stage of <strong>Approved</strong>.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<strong>Controls</strong>: Transfer the controls that the user was responsible for to the new user. You can transfer controls to users who have the Account Administrator, Scope Administrator, or Risk Administrator user roles. If you do not want to transfer the controls to another user, you can select <strong>Unassigned</strong>.</li>\n<li>\n<strong>Vendors</strong>: Transfer the vendors that the user was the Vendor Owner for to the new user. You can transfer vendor ownership to users who have the Account Administrator or Vendor Administrator user roles.</li>\n</ol>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/KCM_Disable+Users+Page.png'><img src='https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/KCM_Disable+Users+Page.png' alt=' '></a>\n</li>\n<li>Click the <strong>Disable and Transfer</strong> button to confirm any responsibility transfers and disable the user account.</li>\n</ol>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>If you disable a user who is a member of a user group that you've created for controls, the user will be automatically removed from the user group. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360049480674' target='_self'>Working With User Groups</a> article. However, if the user is a member of a group in the Policy Management module, they will not be removed from that group when they are disabled. To learn more, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360000727248#StepTwo' target='_self'>Step Two: Create User Groups for Policy Management Campaigns</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360000727248' target='_self'>Policy Management Module Guide</a>.  </div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360019709833-How-to-Create-and-Manage-KCM-GRC-User-Accounts",
    "images": [
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCMCreateNewUserButton.png",
        "alt": "This image displays a segment of a software user interface (UI) showing a primary navigation tab and its associated dropdown menu.\n\n**Context and UI Elements:**\n\n*   **Navigation Bar:** Features two visible top-level links: \"Support\" (with an associated icon) and \"Settings\" (accompanied by a gear icon).\n*   **Dropdown Menu:** Originates from the \"Settings\" tab and lists four navigational options:\n    1.  `Account Settings` (Gear icon)\n    2.  `Create New User` (Single-person silhouette icon)\n    3.  `Manage Users` (Group/multiple-person icon)\n    4.  `Archived Items` (Archive box icon)\n*   **Active Selection:** The `Create New User` option is highlighted with a light blue background, indicating it is the current selection or the target action.\n\n**Annotation:**\n\nA thick, bright orange, L-shaped arrow overlays the image. This annotation graphically directs the user's focus, pointing sequentially from the \"Settings\" tab down to the highlighted \"Create New User\" option within the dropdown menu.",
        "position": 1,
        "context": "age.\nSelect Create New User from the drop-down menu."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_CreateUser.png",
        "alt": "This image depicts the \"Create User\" configuration form, capturing standard user identity fields and specific role/scope assignments.\n\n**Title:** \"Create User\"\n\n**Form Elements (Data Input):**\n\n*   **(a) First Name\\*:** Text input field, pre-filled with \"John\". (Required field)\n*   **(b) Last Name\\*:** Text input field, pre-filled with \"Smith\". (Required field)\n*   **(c) Email\\*:** Text input field, pre-filled with \"KCMGRCCompliance@knowbe4.com\". (Required field)\n*   **(d) Telephone\\*:** International telephone input field, pre-filled with the US flag icon and number \"+1 813 555 5555\". (Required field)\n\n**Configuration Elements (Roles and Scopes):**\n\n*   **(e) User Roles\\*:** A multi-select dropdown field. Currently selected is \"Scope Administrator\", displayed as a blue pillbox tag with a closing 'x' icon. The label includes a required asterisk and an information ('i') icon.\n*   **(e) Allowed Scopes\\*:** A multi-select dropdown field. Two scopes are currently selected and displayed as blue pillbox tags:\n    1.  \"NIST SP800-53 rev4 CONVERTED\"\n    2.  \"PCI DSS Supplement 3.1 CONVERTED id9 TES...\" (Truncated label)\n    The label includes a required asterisk and an information ('i') icon.\n\n**Action Button:**\n\n*   **(f) Create:** A solid blue button labeled \"Create\" for submitting the form.",
        "position": 2,
        "context": ": After entering all of the user's information, click this button."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ManageUsers-Importbutton.png",
        "alt": "The image displays a segment of a web application's administrative interface titled **Manage Users**.\n\n**Navigation and Context:**\n*   The primary navigation includes two tabs: **Users** (currently active and underlined) and **User Groups**.\n\n**Primary Actions and Controls:**\n*   Two action buttons are displayed horizontally: **Create User** and **Import**.\n*   The **Import** button is highlighted by a thick orange ellipse, indicating a point of focus.\n*   A dropdown selection box is positioned to the right of the buttons, featuring the placeholder text **Select a Group...**\n\n**Data Grid/Table Structure:**\n*   The lower portion shows the header row for a user data grid. Column headers include:\n    *   An unmarked checkbox (selection column).\n    *   **Full Name** (with a sorting indicator showing ascending sort).\n    *   **Email** (with a sorting indicator).\n    *   **User Groups**\n    *   **User Roles**\n    *   **Status** (with a sorting indicator).",
        "position": 3,
        "context": "li>\nClick the Import button at the top of the page."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ImportUsers-ClicktoUploadbutton.png",
        "alt": "This image displays an \"Import Items\" dialogue window overlaid on a background UI.\n\n**Header Section:**\nThe dialogue title is \"Import Items.\" Top right controls include an information icon linked to \"Learn More,\" and a close 'X' button.\n\n**Instructional Panel (Blue Box):**\nA prominent blue informational banner provides CSV formatting requirements.\n*   **Header Line:** Required header fields are specified as: `email, first_name, last_name`.\n*   **Mandatory Rules:** Text confirms, \"All fields are mandatory. Separator should be a comma, and the file should be a valid CSV.\"\n*   **Field Size Limits:** A bulleted list details character limits:\n    *   `email: 255 character limit`\n    *   `first_name: 255 character limit`\n    *   `last_name: 255 character limit`\n\n**Action Controls (Bottom Section):**\n1.  **Upload Button:** A primary gray button labeled \"Click to Upload\" (with an upload icon).\n2.  **Status Indicator:** A green text field displays the current file status: \"No File Selected\".\n3.  **Download Button:** A blue call-to-action button labeled \"Download Example CSV\" (with a download icon).",
        "position": 4,
        "context": "rong> window, click the Click to Upload button."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ImportItems-Usersmodal.png",
        "alt": "",
        "position": 5,
        "context": "you would like to remove a user from the import, click the trashcan icon."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png",
        "alt": "This image displays a section of a web application's user interface, specifically a drop-down menu accessed via a main navigation tab.\n\n**UI Elements and Hierarchy:**\n\n1.  **Main Navigation Tab:** Located at the top, the active tab is labeled \"**Settings**\" and is preceded by a gray gear icon (⚙️). Adjacent to it is a tab labeled \"**Support**\" with an associated icon.\n2.  **Dropdown Menu:** A white overlay menu extends vertically below the \"Settings\" tab. Menu items are listed with associated icons:\n    *   ⚙️ **Account Settings**\n    *   👤 **Create New User**\n    *   👥 **Manage Users**\n    *   🗑️ **Archived Items**\n\n**Annotation and Focus:**\n\nAn thick, orange, L-shaped arrow annotation highlights the path from the main \"Settings\" tab down to the \"**Manage Users**\" option within the dropdown menu, indicating the user action or technical focus point.",
        "position": 6,
        "context": "Then, select Manage Users from the drop-down menu."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/CMv2_ManageUsersview.png",
        "alt": "This image displays the administrative \"Manage Users\" interface, featuring a tabular list of system users.\n\n**Context and Navigation:**\nThe current view is designated by the title \"Manage Users.\" The breadcrumb navigation is visible in the upper right corner: `Home Icon > Manage Users > Users`. The primary navigation consists of two tabs: \"Users\" (active) and \"User Groups.\"\n\n**Action Bar Controls:**\nAbove the table, a control bar features action buttons:\n1.  **\"Create User\"** (Blue button)\n2.  **\"Import\"** (Blue button)\n3.  Group Management: A dropdown labeled **\"Select a Group...\"** followed by the button **\"Add Selected To Group.\"**\n4.  Pagination: A **\"Page Size:\"** control dropdown, currently set to \"50.\"\n\n**Data Table Structure and Filtering:**\nThe interface presents user data in a table with a filter row immediately below the headers. The columns are:\n*   Selection Checkbox (a): Used for bulk selection.\n*   **Full Name:** Contains a search text field filter.\n*   **Email:** Contains a search text field filter (content is redacted).\n*   **User Groups** (Content is redacted/blank).\n*   **User Roles:** Displays roles in blue, pill-shaped tags (e.g., \"Risk Administrator\"). Features a search/dropdown filter.\n*   **Status (b):** Displays status in pill-shaped tags (e.g., \"Active\" in blue, \"Disabled\" in orange). Features a search/dropdown filter. The column is sortable.\n*   **Date Created, Date Updated (c), Last Login:** All display date stamps and are sortable.\n*   **Actions:** Contains contextual icons for row-specific operations.\n\n**Row Data Example:**\nThe first row lists \"Anna Littlical\" with the role \"Risk Administrator\" and status \"Active.\"\n\n**Action Icons:**\nThe 'Actions' column contains two primary icons for row manipulation:\n*   **Edit (e):** A pencil icon, used to modify user details.\n*   **Delete/Remove (d):** A user silhouette with a small 'x', typically used to remove or disable access for the specific user.",
        "position": 7,
        "context": "more information about the Manage Users page, see the list below:"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/UserManagementPage.png",
        "alt": "This image displays the \"User Management\" interface for a user named \"John Smith,\" divided into a summary panel and a configuration panel.\n\n**I. Left Panel (User Summary and Actions):**\n\n*   **Identity and Status:** Displays the user name \"John Smith\" with role tags: \"Policy Administrator\" and \"Scope Administrator.\" The user's status is \"Active.\"\n*   **User Controls (a, b):** Two primary action buttons are visible: a green button to \"Set Up MFA\" and a red button to \"Disable User.\"\n*   **MFA Status:** The user's current Multi-Factor Authentication (MFA) secure login status is explicitly listed as \"Disabled\" (highlighted in red).\n*   **Metrics Panel (c):** A dashboard component displays count data: \"Scopes\" (0), \"Policy Campaigns\" (0), and \"Tasks\" (4). It also shows a \"Compliance Percentage\" of 100.00%, indicated by a full green progress bar.\n\n**II. Right Panel (Configuration Settings):**\n\n*   **Navigation Tabs (d, e):** The primary view is \"Settings\" (active), with secondary navigation options for \"Task History\" and \"Audit Trail.\"\n*   **Basic Details:** Standard required fields (marked with an asterisk) for First Name (\"John\"), Last Name (\"Smith\"), Email, and Telephone (includes a US country code selector).\n*   **Access and Role Configuration:** All configuration fields utilize multi-select dropdown components that display selected items as deletable tags.\n    *   **User Roles (f):** Configured roles include \"Scope Administrator\" and \"Campaign Administrator.\"\n    *   **Allowed Scopes (g):** Configured scopes include \"PCI DSS Supplement 3.1 CONVERTED\" and \"NIST SP800-53 rev4 CONVERTED.\"\n    *   **Allowed Campaigns (h):** Configured campaigns include \"Anti-Corruption Policy.\"\n*   **MFA Requirement (i):** A toggle switch labeled \"Require MFA\" is present, currently in the off position.\n*   **Save Action:** A blue \"Save\" button is located at the bottom of the configuration form.",
        "position": 8,
        "context": "t are available on the User Management page, see the details below:"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png",
        "alt": "This image displays a section of a web application's user interface, specifically a drop-down menu accessed via a main navigation tab.\n\n**UI Elements and Hierarchy:**\n\n1.  **Main Navigation Tab:** Located at the top, the active tab is labeled \"**Settings**\" and is preceded by a gray gear icon (⚙️). Adjacent to it is a tab labeled \"**Support**\" with an associated icon.\n2.  **Dropdown Menu:** A white overlay menu extends vertically below the \"Settings\" tab. Menu items are listed with associated icons:\n    *   ⚙️ **Account Settings**\n    *   👤 **Create New User**\n    *   👥 **Manage Users**\n    *   🗑️ **Archived Items**\n\n**Annotation and Focus:**\n\nAn thick, orange, L-shaped arrow annotation highlights the path from the main \"Settings\" tab down to the \"**Manage Users**\" option within the dropdown menu, indicating the user action or technical focus point.",
        "position": 9,
        "context": "the page.\nFrom the drop-down menu, select Manage Users."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_UpdateUsericon.png",
        "alt": "The image displays a cropped section of a data grid or table. Two header columns are visible: **\"Updated At\"** and **\"Last Login,\"** both containing sort/filter indicators (vertical up/down arrows).\n\nDate data is visible in the corresponding cells (e.g., \"26, 2019\" and \"March 26, 2019\").\n\nThe right side of the grid contains action icons: a **pencil icon** (standard Edit function) and a **person silhouette with an asterisk** (likely Manage Access or Profile view).\n\nA thick **orange arrow** and a **circular orange highlight** are used as instructional annotations, specifically drawing attention to the **pencil (Edit) icon** in the top data row.",
        "position": 10,
        "context": "tion email and click the update user icon in the far-right column."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/ResendActivation.png",
        "alt": "The image displays a section of a **User Management** interface detailing the profile for \"John Smith.\"\n\n**UI Context and Roles:**\nThe user's account has two roles assigned: \"Policy Administrator\" and \"Scope Administrator,\" displayed in blue labels below the name.\n\n**Status and Actions:**\nThe user's current account **Status** is \"Awaiting Confirmation.\"\nTwo primary action buttons are visible:\n1.  A highlighted blue button labeled \"**Resend Activation**\" (preceded by an envelope icon).\n2.  A red button labeled \"**Disable User**\" (preceded by a user/x icon).\n\n**User Metadata Fields:**\nThe following read-only fields are listed (data obscured where noted):\n*   **Email:** (Obscured)\n*   **Telephone:** (Obscured)\n*   **Created On:** March 21, 2019\n*   **Last Modified:** March 26, 2019\n*   **MFA Secure Login:** Disabled (Text rendered in red to indicate status).",
        "position": 11,
        "context": "g>User Management page, click the Resend Activation button."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_NavToManageUsers.png",
        "alt": "This image displays a section of a web application's user interface, specifically a drop-down menu accessed via a main navigation tab.\n\n**UI Elements and Hierarchy:**\n\n1.  **Main Navigation Tab:** Located at the top, the active tab is labeled \"**Settings**\" and is preceded by a gray gear icon (⚙️). Adjacent to it is a tab labeled \"**Support**\" with an associated icon.\n2.  **Dropdown Menu:** A white overlay menu extends vertically below the \"Settings\" tab. Menu items are listed with associated icons:\n    *   ⚙️ **Account Settings**\n    *   👤 **Create New User**\n    *   👥 **Manage Users**\n    *   🗑️ **Archived Items**\n\n**Annotation and Focus:**\n\nAn thick, orange, L-shaped arrow annotation highlights the path from the main \"Settings\" tab down to the \"**Manage Users**\" option within the dropdown menu, indicating the user action or technical focus point.",
        "position": 12,
        "context": "he page.\nFrom the drop-down menu, select Manage Users."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/Working_with_Users/KCM_DisableUsericon.png",
        "alt": "The image displays a cropped section of a digital data table, typically used for managing records.\n\n**Text and Context:**\nThe table includes two visible column headers: **\"Updated At\"** and **\"Last Login,\"** both equipped with vertical sort/filter controls (stacked up/down arrows). The data rows beneath these headers contain date information, specifically **\"March 26, 2019.\"**\n\n**UI Elements and Focus:**\nThe rightmost column contains action icons for the corresponding data record. An orange arrow and a circular highlight draw attention to the primary element: the **Remove User/Delete User icon**. This icon is visually represented by a silhouette of a person overlaid with a small 'x'. A row immediately below the highlighted area also displays an **Edit icon** (a pencil) next to the Remove User icon.",
        "position": 13,
        "context": "need to disable and click the disable user icon."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KCM/Working_with_Users/KCM_Disable+Users+Page.png",
        "alt": "This page, titled **\"Disable User,\"** is a utility screen accessed via the breadcrumb path: `Home > Manage Users > Disable and Transfer`.\n\nThe primary function of the page is defined by the subtitle: **\"Disable and Transfer User Responsibilities for 'Site Admin'.\"**\n\nA critical information note, framed by a blue border, states: **\"This user will be removed from any user groups that they are a member of.\"**\n\nThe body of the page is organized into three distinct sections, each requiring the selection of a new owner for the designated responsibilities before the user can be disabled. Each section follows the same UI pattern:\n\n1.  **Tasks:**\n    *   A header bar labeled **\"Tasks.\"**\n    *   A displayed metric: **\"Number of Tasks that will transfer: 223.\"**\n    *   A required action: **\"Select new user:\"** followed by a dropdown menu placeholder **\"Select option.\"**\n\n2.  **Controls:**\n    *   A header bar labeled **\"Controls.\"**\n    *   A displayed metric: **\"Number of Controls that will transfer: 3.\"**\n    *   A required action: **\"Select new user:\"** followed by a dropdown menu placeholder **\"Select option.\"**\n\n3.  **Vendors:**\n    *   A header bar labeled **\"Vendors.\"**\n    *   A displayed metric: **\"Number of Vendors that will transfer: 6.\"**\n    *   A required action: **\"Select new user:\"** followed by a dropdown menu placeholder **\"Select option.\"**\n\nAt the bottom of the interface, two action buttons are presented:\n*   **Disable and Transfer** (Primary, filled button).\n*   **Cancel** (Secondary button).",
        "position": 14,
        "context": "o have the Account Administrator or Vendor Administrator user roles."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "accounts",
        "and",
        "grc",
        "kcm",
        "manage"
      ],
      "image_count": 14
    }
  }
}