{
  "id": 360019399793,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360019399793.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360019399793.html",
  "author_id": 368027116814,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 6,
  "vote_sum": 9,
  "vote_count": 17,
  "section_id": 7314544417683,
  "created_at": "2019-03-06T21:22:09Z",
  "updated_at": "2024-05-08T19:01:10Z",
  "name": "KnowBe4's Courseware Player Guide",
  "title": "KnowBe4's Courseware Player Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2024-05-08T19:01:10Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "training",
    "training content",
    "knowbe4 publisher",
    "courseware player",
    "media player",
    "answerbot",
    "answerbot_kmsat",
    "answerbot_enduser"
  ],
  "body": "<p>The courseware player for KnowBe4's training and video modules provide options that will help you train your users with an accessible interface that offers features such as closed captioning and multi-browser and device support. You'll see this interface when taking any of our newly published KnowBe4 content or any of KnowBe4's video modules. Please note that the courseware player is only used for content created by the KnowBe4 publisher.</p>\n<p>Use the jump links below to see the features offered for the training module player and the video module player.</p>\n\n<h2 id='iv_01H7X3T7X8XJ6AY4SQR9Z28Q0G'>Interacting with the Training Module Player Version 3</h2>\n<p>This version of the module player is available for all 2020 content published by KnowBe4. Use the KnowBe4 training module player to navigate through your training module, interact with the script, and lookup terms described in the module using the glossary.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/modstore/CoursewarePlayer/coursewareplayer_trainingplayerv2.png'><img src='https://helpimg.s3.amazonaws.com/modstore/CoursewarePlayer/coursewareplayer_trainingplayerv2.png' alt=' '></a></p>\n\n<ol role='list'>\n<li>Click the hamburger button to show the sidebar menu. For information on the options available in the sidebar, see the <a href='#SIDEBAR_V3' target='_self'>Using the Sidebar for Version 3</a> section below.</li>\n<li>Click here to play or pause the video.</li>\n<li>Click here to mute or unmute the volume on the video.</li>\n<li>Use this feature to change the speed of the video.</li>\n<li>Click here to turn on closed captioning for the video.</li>\n<li>Click here to make the video full screen. Click the button again or press the escape key on your keyboard to exit full screen mode.</li>\n<li>Click this button to show or hide the transcript.</li>\n<li>Select the checkbox to have the transcript automatically scroll to line up with the video. You can disable this feature if you wish to read at your own pace.</li>\n<li>Subtitles are highlighted in the transcript panel so that you can follow along with the video.</li>\n<li>Click the left-facing arrow to return to the previous section.</li>\n<li>Click the right-facing arrow to proceed to the next section. </li>\n</ol>\n\n\n<h3 id='iv_01H7X3T7X84WTGB6K1WQCYBNH1'>Using the Sidebar for Version 3</h3>\n<p>By default, the sidebar is closed. To expand these features, click the hamburger menu in the top left corner to show the menu. The sidebar gives you various options (described below) and shows you how many sections are included in the module and which section number you're on.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/modstore/CoursewarePlayer/coursewareplayer_trainingplayer_sidebarv3.png'><img src='https://helpimg.s3.amazonaws.com/modstore/CoursewarePlayer/coursewareplayer_trainingplayer_sidebarv3.png' alt=' '></a></p>\n\n<ol role='list'>\n<li>Click this arrow to hide the sidebar.</li>\n<li>Displays the name of the slide that you are currently on. It also shows you a progress bar and how many slides you have left.</li>\n<li>Click this tab to open the table of contents. Click on the name of a section to go back to a section you previously reviewed. Please be aware, you will not be able to use this feature to skip ahead in the training.</li>\n<li>Click this button to open a glossary of terms for the training module. You can use the search bar to search for definitions of specific terms.</li>\n<li>Click this button to see any reference material.</li>\n<li>Click this option to toggle the sound on or off for the training module.</li>\n</ol>\n",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360019399793-KnowBe4-s-Courseware-Player-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/modstore/CoursewarePlayer/coursewareplayer_trainingplayerv2.png",
      "alt": "This image depicts an embedded video player interface from a security awareness training platform (KnowBe4), likely accessed via a web browser. The content is titled \"Defining Types of Sensitive Information - Introduction.\"\n\n**Video Content:** The video frame displays a flow chart graphic showing a central building icon linked to four circular nodes labeled \"Clients,\" \"Customers,\" \"Consultants,\" and \"Coworkers.\" The background is a muted image of office cabinets.\n\n**UI Elements and Controls:**\n\n1.  **Hamburger Menu Icon:** Located in the top-left corner, typically used to access course navigation or settings.\n2.  **Playback Control:** A standard triangular play icon (currently paused or ready to play).\n3.  **Volume/Mute Control:** An icon indicating the sound status (currently muted).\n4.  **Playback Speed:** Displays the current speed setting, \"2x\" (twice normal speed).\n5.  **Closed Captioning Toggle:** A button labeled \"cc\" for enabling or disabling subtitles.\n6.  **Fullscreen Toggle:** An icon used to expand the video player to fullscreen.\n7.  **Transcript Visibility Toggle:** A button labeled \"Hide Video Transcript\" that controls the display of the textual transcript below the player.\n8.  **Transcript Options:** Includes a dropdown for \"Available Languages: en\" and a checkbox labeled \"Toggle Automatic Scroll\" (checked), which syncs the transcript view with video progress.\n9.  **Video Transcript:** The transcript text is visible below the video player. The text line corresponding to the current timestamp (00:00:26) is highlighted in an orange box: \"Ready? Let's go.\" Previous timestamps (e.g., 00:00:23) are also visible.\n10. **Previous Navigation Button:** A chevron icon pointing left, used to navigate to the previous slide or chapter.\n11. **Next Navigation Button:** A chevron icon pointing right, used to navigate to the next slide or chapter.",
      "position": 1,
      "context": "ript, and lookup terms described in the module using the glossary."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/modstore/CoursewarePlayer/coursewareplayer_trainingplayer_sidebarv3.png",
      "alt": "This image displays the interface of a security awareness training module within the KnowBe4 Learning Management System (LMS). The layout is structured with a left navigation sidebar and a main content panel featuring a video player and synchronized transcript.\n\n**Left Sidebar (Navigation and Context):**\n\n1.  **Course Progress:** The current module is titled \"Defining Types of Sensitive Information\" (2). A progress indicator shows that the user is on slide **2/19**.\n2.  **Navigation Links:** Standard navigational links are present for accessing course resources: **Table of Contents** (3), **Glossary** (4), and **References** (5).\n3.  **Training Options (6):** A dedicated settings pane confirms audio is enabled, displaying the status **\"On\"** with a speaker icon.\n4.  **Header Context (1):** The browser URL points to `training.knowbe4.com/...`, confirming the LMS environment.\n\n**Main Content Panel (Video and Transcript):**\n\n1.  **Video Player:** The player displays a visual asset (an open filing cabinet drawer containing red folders).\n2.  **Video Controls:** Standard player controls are visible: Play button, volume, scrubber, time remaining (`-0:28`), playback speed selector (`2x`), Closed Caption (CC) toggle, and fullscreen button.\n3.  **Transcript Section:** A section labeled \"Transcript\" is displayed below the video player. It features an option to \"Hide Video Transcript.\"\n4.  **Transcript Controls:** The transcript settings indicate **\"Available Languages: en\"** and that **\"Toggle Automatic Scroll\"** is active (checked).\n5.  **Synchronization:** The text synchronized with the video playback is displayed, with the active sentence highlighted in an orange bounding box: **`00:00:00 Let's begin by stating that the words sensitive, confidential,`**. Subsequent text is visible below.",
      "position": 2,
      "context": "included in the module and which section number you're on."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "courseware",
      "player"
    ],
    "image_count": 2
  }
}