{
  "id": 39515697709971,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/39515697709971.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/39515697709971.html",
  "author_id": 31899104510995,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 0,
  "vote_count": 0,
  "section_id": 39401806118547,
  "created_at": "2025-03-18T21:31:12Z",
  "updated_at": "2025-11-18T19:10:05Z",
  "name": "Prevent - Analytics Dashboard",
  "title": "Prevent - Analytics Dashboard",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-11-18T19:10:05Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "answerbot_prevent"
  ],
  "body": "<p>Prevent analytics allows admins to access top-level statistics and data for their organization. This feature lets admins explore these data points to examine an overview of each email event.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/egress/Prevent%2BDashboard.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/egress/Prevent%2BDashboard.png' alt=' '> </a></p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>By selecting the navigation menu at the top-left corner of the page, you can navigate to other KnowBe4 products, including Defend, PhishER, and KSAT. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/46612807962771.html'>Login Page and Navigation Menu Overview</a> article.</div>\n</div>\n<h2 id='h_01JPQZ8XP4A5TR20Z497YE3NME'>Dashboard Data</h2>\n<p>The Prevent dashboard displays an overview of every analyzed email, focusing on those emails where Prevent has driven end-users to change their behavior, whether updating, removing, or replacing recipients or sensitive content. The dashboard will link to a search emails page and apply relevant filters based on what you select, allowing you to conduct a more granular analysis.</p>\n<p>The data displayed on the initial dashboard aggregates the key Prevent use cases presented in the security center. The pie chart summarizes breach types, including:</p>\n<ul>\n<li>Aggregated potential breaches prevented, and a percentage increase or decrease indicator</li>\n<li>Aggregated potential breaches prevented for the preceding date period for comparison</li>\n<li>Misdirected emails prevented by users accepting Prevent advice</li>\n<li>Misspelled emails prevented by users accepting Prevent advice</li>\n<li>Data exfiltration emails prevented by users accepting Prevent advice</li>\n<li>Large recipient emails prevented by users accepting Prevent advice</li>\n<li>Data loss events (DLP) prevented by users accepting Prevent advice</li>\n<li>Misdirected content, including content analysis, events prevented by users accepting Prevent advice</li>\n<li>New recipient emails prevented by users accepting Prevent advice</li>\n<li>No or partial TLS emails prevented by users accepting Prevent advice</li>\n<li>Multi-domain emails prevented by users accepting Prevent advice</li>\n</ul>\n<h3 id='h_01JQ4PDK4G7YSBWYJMXE0HWG69'>Potential Breaches Prevented</h3>\n<p>This chart displays the number of potential breach events that contain at least one external recipient, allowing you to filter those emails easily. Clicking on any slice of the chart allows you to view a description of that statistic.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000001iGdB.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000001iGdB.jpg' alt=''> </a></p>\n<h3 id='h_01JQ4PDK4GGVR6QKDJ0SFY296S'>Silenced Prompts</h3>\n<p>This card displays the Prevent use cases you have chosen not to prompt users with Prevent advice about. These use cases are still being silently monitored. This feature can help you monitor the areas for which you may wish to configure prompting in the future.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000001gqmP.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000001gqmP.jpg' alt=''> </a></p>\n<h3 id='h_01JQ4PDK4G5CD2T41065V1K3H2'>Data Loss Prevention (DLP)</h3>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>Data Loss Prevention (DLP) is included as part of the Prevent Enterprise offering.</div>\n</div>\n<p>This section displays a high-level overview of the statistics relating to any data matching for content analysis, misdirected content, or DLP policies your organization has configured can be viewed. The following data is displayed:</p>\n<ul>\n<li>Total number of DLP policies triggered for the given time period</li>\n<li>All data matches by type, identified during the given time period</li>\n<li>List of triggered DLP policies for the given time period</li>\n</ul>\n<p>Clicking on any of these data points will take you to a filtered list of emails triggering those policies or matching those data types. </p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000001gutG.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000001gutG.jpg' alt=''> </a></p>\n<h3 id='h_01JQ4PDK4GD8H9HJXVACTNHAYE'>Date Filtering</h3>\n<p>The date drop-down menu in the top-right corner of the screen allows you to view data for the previous:</p>\n<ul>\n<li>Day</li>\n<li>Week</li>\n<li>Month</li>\n<li>Quarter</li>\n<li>Year</li>\n<li>Custom Range</li>\n</ul>\n<h2 id='h_01JPQZ8XP4HHGNPGH46CRAM55V'>Data Retention</h2>\n<p>The retention period for Prevent Analytics is 18 months, plus a rolling 30 days. This data is required to improve the accuracy of the Prevent services and provide trend and risk analysis for reporting.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/39515697709971-Prevent-Analytics-Dashboard",
  "images": [
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/egress/Prevent%2BDashboard.png",
      "alt": "This image displays the dark mode user interface of the **KnowBe4 Prevent - Dashboard**.\n\n**Header and Global Context:**\n*   The header includes the KnowBe4 logo and the dashboard title: \"KnowBe4 Prevent - Dashboard.\"\n*   A date range picker shows the selected period: \"08/20/2025 - 11/17/2...\"\n*   A dropdown menu is active, displaying \"KnowBe4.\"\n*   User status is shown as \"Logged in as [redacted],\" adjacent to a \"Log Out\" button.\n\n**Navigation Sidebar:**\n*   The left-hand navigation pane lists top-level categories: Home, Human Risk Management, Defend, Prevent (expanded), Protect, Settings, and Help.\n*   Under the expanded \"Prevent\" category, the **\"Prevent Dashboard\"** is currently selected and active. The \"Search Emails\" option is also visible.\n\n**Main Dashboard Area: Potential Breaches Prevented:**\n*   The primary view is titled \"Potential Breaches Prevented.\"\n*   The status indicator shows: \"Last Updated: 8/8/2024, 10:25:58 AM.\"\n*   Summary metrics for both the Current Period and Previous Period display a value of **0**.\n*   The \"Breach Type Summary\" panel is empty, displaying a critical message:\n    *   **Alert:** \"No Potential Breaches Prevented data for the time period selected\"\n    *   **Instruction:** \"Please try and select another date range. If this message persists, please contact KnowBe4 Support.\" (\"KnowBe4 Support\" is presented as a hyperlink).\n\n**Sub-Panels (Partial View):**\nTwo statistical panels are partially visible at the bottom of the screen:\n1.  **Current Period Statistics** (with an info icon and \"Last Updated: 8/8/2024, 10:25:58 AM\").\n2.  **Aggregated Statistics** (with an info icon and update information).",
      "position": 1,
      "context": "ets admins explore these data points to examine an overview of each email event."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000001iGdB.jpg",
      "alt": "This image displays a dark-mode security analytics dashboard focused on \"Potential Breaches Prevented,\" structured into three main sections: Key Metrics, Breach Type Summary, and a Detailed Annotation.\n\n**1. Key Metrics:**\nThe header indicates the total number of prevented breaches across two periods:\n*   **Current Period:** 102 events, showing a trend of a downward arrow followed by \"1%\".\n*   **Previous Period:** 103 events.\n\n**2. Breach Type Summary:**\nBelow the metrics is the \"Breach Type Summary,\" visualized via a pie chart detailing six categories, each listing the total count and the count classified as \"External\" (indicated by an orange dot icon).\n\n| Category | Total Count | External Count |\n| :--- | :--- | :--- |\n| Data exfiltration | 45 | 45 |\n| Data loss prevention (DLP) | 14 | 14 |\n| Misspelled recipient | 10 | 8 |\n| Large recipient list | 5 | 4 |\n| Misdirected email | 20 | 9 |\n| Misdirected content | 8 | 4 |\n\nThe pie chart uses blue tones for \"Misdirected\" categories and light tones for \"DLP\" and \"Data exfiltration\" categories.\n\n**3. Detailed Annotation:**\nA summary box at the bottom provides an aggregated statistic for the human error categories:\n*   **Headline:** Misdirected/Human Error: **43** (External: 25)\n*   **Description:** \"43 events occurred when Egress Prevent advised the user and resulted in changed behavior.\" This indicates that 43 events in the aggregated \"Misdirected/Human Error\" group were actively prevented through user intervention triggered by the Egress Prevent system.",
      "position": 2,
      "context": "Clicking on any slice of the chart allows you to view a description of that statistic."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000001gqmP.jpg",
      "alt": "This image displays a dark-themed UI dashboard component summarizing policy enforcement metrics, titled **\"Silenced Prompts\"** with an adjacent help or information icon (question mark).\n\nThe component presents data in a table format with two columns: **\"Policy\"** and **\"Triggered.\"** The \"Triggered\" column shows the total count for the policy and includes a directional percentage change indicator (up arrow for increase, down arrow for decrease). Red text indicates an increase in triggers, and green text indicates a decrease.\n\nThe policies and their corresponding triggered counts are listed as follows:\n\n| Policy | Triggered Count (Change) |\n| :--- | :--- |\n| New recipient | 21.1k (↑ 0.1%, Red) |\n| No or partial TLS | 1.1k (↓ 30.1%, Green) |\n| Multi-domain | 538 (↓ 31.7%, Green) |\n| Misdirected content | 63 (↓ 21.3%, Green) |\n| Misdirected email | 8 (↑ 100%, Red) |\n| Large recipient list | 3 (↑ 200%, Red) |\n| Misspelled recipient | 1 |\n| Data loss prevention (DLP) | 1 |\n\nThe highest recorded policy trigger is \"New recipient\" at 21.1k, while the largest percentage change is \"Large recipient list\" with a 200% increase. The policies \"Misspelled recipient\" and \"Data loss prevention (DLP)\" both recorded 1 trigger each, with no accompanying percentage change data.",
      "position": 3,
      "context": "re can help you monitor the areas for which you may wish to configure prompting in the future."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000001gutG.jpg",
      "alt": "This image displays a dashboard component for **Data Loss Prevention (DLP)**, utilizing a dark mode theme to present security metrics. The interface is divided into three primary information widgets:\n\n**1. Policies Triggered Overview (Left Panel):**\n*   **DLP Policies Triggered:** The current count is displayed prominently as **232**. A comparison indicator shows a **↑ 24.1%** increase (highlighted in red/orange) over the comparison period.\n*   **Previous Period:** The preceding period's trigger count is listed as **187**.\n\n**2. Most Frequently Matched Data Types (Right Panel):**\n*   This widget lists sensitive data types identified, formatted as interactive \"tags\" or \"pills,\" each containing an information icon, the data type name, and the total match count.\n*   The highest volume matches include: **Financial Data (4303)**, **HR Data (3542)**, **Sales Data (2328)**, and **IP Address (1231)**.\n*   Other matched types include VIN, Legal Data, UK Banking Information, Profanity, various card numbers (Mastercard, Visa, AMEX), and specific identifiers (Passport, SSN, NHS, DOB, HIC, UKDriverLicense, DoD ID, and Social Security Number).\n\n**3. DLP Policies Breakdown (Bottom Table):**\n*   A table view provides a detailed breakdown of active policies and their trigger counts.\n*   **Columns:** \"Policy\" and \"Triggered.\"\n*   **Data Rows:**\n    *   `Profanity_prompt`: **184** triggers, with an associated trend of **↑ 0.5%**.\n    *   `Mosaic_Keyword_violation`: **42** triggers.\n    *   `Volante_Keyword_violation`: **6** triggers.",
      "position": 4,
      "context": "take you to a filtered list of emails triggering those policies or matching those data types."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "analytics",
      "dashboard",
      "prevent"
    ],
    "image_count": 4
  }
}