{
  "article": {
    "id": 39515660464019,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/39515660464019.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/39515660464019.html",
    "author_id": 31899104510995,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 42972312463891,
    "created_at": "2025-03-18T21:31:19Z",
    "updated_at": "2025-08-11T17:03:48Z",
    "name": "Prevent - User Guide: COM Add-In",
    "title": "Prevent - User Guide: COM Add-In",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-08-05T19:03:36Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot_prevent"
    ],
    "body": "\n<p>Prevent helps to avoid data breaches such as sending an email to the wrong recipient, attaching the wrong file to an email, and ensuring sensitive data is not shared with unauthorized recipients.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>The information contained in this guide is the default configuration of Prevent. Your experience may vary depending on your organization’s configuration choices.</div>\n</div>\n<div>Expand the sections below to learn more about the Prevent functionality.</div>\n<div>\n<ul class='js-toggles'>\n<li title='Microsoft Outlook Add-In '>When composing an email, you will see the Prevent shield icon in your Microsoft Outlook ribbon. As you add recipients to your email, the shield icon will respond to your choices. The color of the shield icon is representative of Prevent’s status:\n<table border='1'>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1'>\n<strong><span>Shield</span></strong> </td>\n<td colspan='1' rowspan='1'><span><strong>Description</strong></span></td>\n</tr>\n<tr>\n<td colspan='1' rowspan='1'><img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004MWWo.jpg'></td>\n<td colspan='1' rowspan='1'>Prevent is not active yet, or your Microsoft Outlook is offline.</td>\n</tr>\n<tr>\n<td colspan='1' rowspan='1'><img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004MJUo.jpg'></td>\n<td colspan='1' rowspan='1'>Prevent is active and has not detected anything unusual. </td>\n</tr>\n<tr>\n<td colspan='1' rowspan='1'><img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004MRk4.jpg'></td>\n<td colspan='1' rowspan='1'>Prevent has identified potential risks, and suggested actions are available in the side panel or upon pressing send. </td>\n</tr>\n<tr>\n<td colspan='1' rowspan='1'><img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004MY2L.jpg'></td>\n<td colspan='1' rowspan='1'>Prevent has identified high risks, and suggested actions are available in the side panel or upon pressing send.</td>\n</tr>\n</tbody>\n</table>\n<p>To open the task pane containing more information and suggested changes, select the Prevent <strong>shield</strong> icon. </p>\n<p>Clicking on the <strong>shield</strong> icon when composing your email will display a risk assessment of your recipients. When Prevent detects a risk, hover over the email address to understand why. Select the three-dot icon to select the suggested action. An example is shown in the screenshot below:</p>\n<p><img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004MP5Y.jpg' width='423' height='282'></p>\n<p>Upon sending, you may also be prompted with guidance. An example is shown in the screenshot below:</p>\n<p><img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004Mfex.jpg' width='581' height='220'></p>\n<p>Review the information provided in the prompt, which will be tailored to the risk detected. In most cases, a <strong>Send Anyway</strong> option is presented that can be selected if you want to proceed. If you need to cancel and, for example, replace misaddressed recipients, select <strong>Cancel</strong>. <span>See the <a href='https://support.knowbe4.com/hc/en-us/articles/39515676762515-Prevent-On-Send-Prompt-Triggers' target='_self'>Prevent - On-Send Prompt Triggers</a> article to learn about all the different scenarios that can lead to receiving a prompt</span>. </p>\n</li>\n<li title='Mobile Experience'>\n<p>The Prevent experience is different on mobile compared to Microsoft Outlook Add-In. You will receive feedback in an email when a potential risk is identified. This email will provide a risk assessment summary and give you a chance to approve and send the email or reject and discard the email, as seen in the screenshot below:</p>\n<p><img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004MhqP.jpg' width='379' height='467'></p>\n<p>Depending on the configuration set by your admins, if you do not action this email, your email will automatically be sent or rejected after a given time period.</p>\n</li>\n</ul>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/39515660464019-Prevent-User-Guide-COM-Add-In",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004MWWo.jpg",
        "alt": "**Monochromatic UI Icon:** A stylized heater shield graphic divided into four alternating quadrants (quarterly division). The quadrants are shaded in light gray (top-left, bottom-right) and white (top-right, bottom-left). This UI element typically signifies security status, protection, or elevated administrative permissions. The image is rendered on a black background.",
        "position": 1,
        "context": "Shield \nDescription"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004MJUo.jpg",
        "alt": "**UI Element:** Security Status Icon (Shield Graphic).\n\n**Description:** A shield-shaped icon utilizing a quarterly field partition. The four quadrants alternate between deep green and white. Specifically, the top-left and bottom-right quadrants are green, and the top-right and bottom-left quadrants are white.\n\n**Context/Function:** This graphic typically serves as a visual indicator of system defense, active security status, or verified protection within the user interface.",
        "position": 2,
        "context": "s://helpimg.s3.amazonaws.com/egress/0EMSr000004MWWo.jpg'>\nPrevent is not active yet, or your Microso"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004MRk4.jpg",
        "alt": "This image is a low-resolution security icon depicting a heraldic shield. The shield is divided into four equal quadrants (quarterly division). The color scheme alternates between a saturated orange/red-orange and white. Specifically, the top-left and bottom-right quadrants are orange, and the top-right and bottom-left quadrants are white. This UI element typically represents protection, defense status, or antivirus functionality within a system interface.",
        "position": 3,
        "context": "c='https://helpimg.s3.amazonaws.com/egress/0EMSr000004MJUo.jpg'>\nPrevent is active and has not detec"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004MY2L.jpg",
        "alt": "This image is a concise user interface (UI) icon representing **Security** or **Protection Status**.\n\n**Visual Description:**\nThe element is a shield graphic with a standard rounded base and slightly curved top edge. It is divided into four equal quadrants (quarterly pattern). The colors alternate strictly between **solid Red (or Crimson)** and **White**.\n\n**Pattern Breakdown:**\n*   Top-Left Quadrant: Red\n*   Top-Right Quadrant: White\n*   Bottom-Left Quadrant: White\n*   Bottom-Right Quadrant: Red\n\n**Context:**\nTypically used in UI design to denote a secured state, firewall activation, anti-virus protection, or system defense features.",
        "position": 4,
        "context": "pg'>\nPrevent has identified potential risks, and suggested actions are available in the side panel o"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004MP5Y.jpg",
        "alt": "A user interface window, titled **Egress Prevent** (accompanied by a gray shield icon), displays a security risk assessment for email recipients.\n\n**Text and Context:**\n\n1.  **Header:** \"Egress Prevent\" with a shield icon.\n2.  **Instructional Text:** \"The risk assessment of your recipients is shown below.\"\n3.  **Status Indicator:** A prominent, red, rounded button contains the white text: **\"Unverified Recipients\"**.\n4.  **Guidance Text:** \"Hover over an email address to gain more information\"\n5.  **Recipient List:** The generic email address **`user@domain.com`** is listed. To the right of the email address is a vertical ellipsis (three dots) indicating a context or options menu.\n6.  **Action Menu:** A context menu is overlaid near the bottom right, displaying a single available action button: **Delete**. This button likely corresponds to the adjacent recipient address.",
        "position": 5,
        "context": "An example is shown in the screenshot below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004Mfex.jpg",
        "alt": "The image displays a modal warning dialog box originating from the **Egress Prevent** application feature.\n\n**UI Elements and Context:**\n\n*   **Header:** Features the 'egress' branding logo in the top left corner, and a standard close control ('X') icon in the top right.\n*   **Title:** The prompt is clearly titled **Egress Prevent**.\n*   **Warning Text:** The body text provides context for the alert: \"You wouldn't normally include the following recipients with the other recipients on this email.\"\n*   **Identified Detail:** The email address flagged as unusual is displayed prominently in bold: **emily@egressdemo.com**.\n*   **Call to Action Query:** The final prompt before controls asks, \"Are you sure you want to send?\"\n\n**User Controls (Buttons):**\n\n*   **Primary Action:** A solid, dark blue button labeled **Send anyway** (used to override the warning and proceed).\n*   **Secondary Action:** An outlined white button labeled **Cancel** (used to stop the sending action and return to the email draft).",
        "position": 6,
        "context": "An example is shown in the screenshot below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004MhqP.jpg",
        "alt": "This image displays an **Egress** security notification requiring approval for a flagged outbound email. The interface is characterized by a dark blue header featuring the white and yellow Egress logo.\n\n**Notification Context and UI Elements:**\n\n*   **Header:** The primary warning is titled, \"We need to double check something...\"\n*   **Context:** The accompanying text states, \"We need approval before we can send your message 'Test'.\"\n*   **Action Buttons:** Two prominent action buttons require immediate user input:\n    1.  **Approve Button:** Green background, labeled \"Approve and send email\".\n    2.  **Reject Button:** Red background, labeled \"Reject and discard email\".\n*   **Default Policy:** A critical notice below the buttons indicates the default action if no response is received: \"If we don't hear from you, we will automatically approve and send this email with **no changes made**\" (emphasis in red).\n\n**Summary of Policy Violations/Flagged Content:**\n\nThe lower section, titled \"Summary,\" outlines the technical rationale for the held email using a bulleted list:\n\n*   **Policy Rule 1 (Sensitive Data):** \"It is against company policy to send sensitive data to a personal email account.\"\n*   **Compliance Warning:** \"This email may be reviewed for compliance with our policies.\"\n*   **Contextual Anomaly:** A second bullet point describes an unusual recipient inclusion: \"Based on your previous email communications you wouldn't normally include [CENSORED DATA, highlighted] with the other recipients on this email.\"\n*   **Confirmation Prompt:** The notification concludes with a direct user verification question: \"Did you mean to include [CENSORED DATA, highlighted]?\"",
        "position": 7,
        "context": "This email will provide a risk assessment summary and give you a chance to approve and send the emai"
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "prevent"
      ],
      "image_count": 7
    }
  }
}