{
  "article": {
    "id": 4406998837011,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/4406998837011.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/4406998837011.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": true,
    "position": 10,
    "vote_sum": 38,
    "vote_count": 64,
    "section_id": 7759838481811,
    "created_at": "2021-09-15T21:48:50Z",
    "updated_at": "2025-11-25T14:21:14Z",
    "name": "KnowBe4 Security Awareness Training (KSAT) Console Integrations",
    "title": "KnowBe4 Security Awareness Training (KSAT) Console Integrations",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-25T14:21:14Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p>Below is a list of some of our integrations for KSAT. If you do not see the integration you are looking for, visit our <a href='https://developer.knowbe4.com/'>API documentation</a> to learn more about our API's capabilities. For more information on integrations for our other products, see our <a href='https://support.knowbe4.com/hc/en-us/articles/18466152719251'>Phish Alert Button Integrations</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/18465780476947'>PhishER Integrations</a> articles.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>These integrations are with third parties. We recommend contacting the third party if you need further help with an integration.</div>\n</div>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>iPaaS (Integration Platform as a Service) integrations are available for the KnowBe4 Security Awareness Training (KSAT) console. These integrations enable KSAT customers to connect with various vendors and establish the ideal integration flow. The iPaaS integrations utilize KnowBe4’s Graph APIs to enable automated security awareness training workflows and data management in areas including groups, users, phishing, and training. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46509264511123-Integrate-with-KSAT-Using-iPaaS-Connectors'>Integrate with KSAT Using iPaaS Connectors</a> article.</div>\n</div>\n<ul>\n<li>\n<strong>Adlumin </strong>is a security detection and response platform built to discover threats and IT operations needs in real-time. KnowBe4 integrates with Adlumin to send KSAT phishing and training data to Adlumin's Proactive Defense Program. With this integration, you can view phishing, training, and Risk Score reports directly from your Adlumin platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/7621862341395'>How to Integrate Adlumin with Your KSAT Console</a> article.</li>\n<li>\n<strong>anecdotes</strong> is a compliance management platform. This integration allows you to send phishing, training, and user data from your KnowBe4 console to your anecdotes platform to automate and manage your compliance program. For more information, see our<a href='https://support.knowbe4.com/hc/en-us/articles/28818573957779'> Integrate anecdotes with Your KnowBe4 Console</a> article.</li>\n<li>\n<strong>Anzenna</strong> is an AI-powered, agentless security platform that predicts and prevents insider threats before they cause a breach. This integration with KnowBe4’s KSAT console allows you to send Phishing Security Test (PST) data for additional security recommendations. For more information, see Anzenna’s <a href='https://app.tango.us/app/workflow/Onboarding-Anzenna--Connecting-KnowBe4-6b5d63eeddcc4537af3c02a32a4bdbc5'>Onboarding Anzenna: Connecting KnowBe4</a> article.</li>\n<li>\n<p><strong>A-SCEND</strong> is a compliance automation solution from A-LIGN that monitors and collects training completions for compliance requirements. This integration allows you to send training data from your KSAT console to A-SCEND for your compliance needs.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/23030866722707'>How to Integrate A-LIGN with Your KSAT Console</a> article.</p>\n</li>\n<li>\n<strong>Cisco’s Duo</strong> is an identity security solutions platform that specializes in multi-factor authentication (MFA) and zero trust security. This SCIM integration allows you to sync and manage your Duo users within your KSAT console. For more information how to integrate Duo with KSAT, see the <a href='https://duo.com/docs/automated-provisioning#configure-automated-provisioning'>Configure Automated Provisioning</a> documentation from Duo and our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374-SCIM-Configuration-Guide'>SCIM Configuration Guide</a>.</li>\n<li>\n<strong>CloudEagle</strong> is an AI-powered platform that helps finance, operations, and IT teams streamline the management and renewal of software-as-a-service (SaaS) apps. You can integrate your Asana on the CloudEagle platform into your KSAT console. Integrating these apps with KSAT allows you to access detailed information about organizations, view user lists, manage user accounts, and monitor accurate usage of the Asana platform through user login activity. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/46832111065491-Integrate-Asana-on-CloudEagle-into-Your-KSAT-Console'>Integrate Asana on CloudEagle into Your KSAT Console</a> article. </li>\n<li>\n<p><strong>COZYROC SSIS+</strong> is a platform that allows you to migrate data from one place to another. This integration allows you to send campaign and user data from your KSAT console into the COZYROC platform.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/23984403032851'>Integrating COZYROC SSIS+ with Your KSAT Console</a> article.</p>\n</li>\n<li>\n<strong>C<sub>n</sub>Sight</strong> is a cybersecurity performance management software. This integration allows you to send phishing data from your KSAT console to your C<sub>n</sub>Sight platform to provide a broader view of your organization’s cybersecurity performance.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/15877468654483'>How to Integrate C<sub>n</sub>Sight with your KSAT Console</a> article.</li>\n<li>\n<strong>ControlMap </strong>is a cybersecurity compliance automation platform that monitors and collects evidence. This integration allows you to automatically mark training requirements as complete when your users complete their assigned KSAT training.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/11753002536467'>How to Integrate ControlMap with Your KSAT Console</a> article.</li>\n<li>\n<strong>Cortex XSOAR </strong>is a SOAR platform that automates security operations and incident response. This integration allows you to use the KSAT pack so you can push and pull data to and from your KSAT console. To learn about the benefits of this integration, see our <a href='https://www.knowbe4.com/hubfs/KnowBe4-KMSAT-PER-Cortex-SOAR-Integration.pdf'>Cortex XSOAR and KnowBe4</a> document.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/13654988560275'>How to Integrate Cortex XSOAR with Your KSAT Console</a> article.</li>\n<li>\n<strong>Cortex XSIAM</strong> is a service integration and management (SIAM) platform that helps to address and resolve security threats more efficiently. This integration allows you to use the KSAT pack so you can push and pull data to and from your KSAT console. For more information, see Cortex's <a href='https://xsoar.pan.dev/docs/reference/integrations/know-be4-kmsat-event-collector' target='_blank' rel='noopener'>KnowBe4 integration documentation</a>.</li>\n<li>\n<strong>CYE’s Hyver</strong> is a Cyber Risk Quantification Platform that allows you to create findings based on data from phishing simulation outcomes and compliance gaps discovered during KnowBe4’s security awareness training in your organization. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/37610912923923-Integrate-CYE-s-Hyver-with-Your-KSAT-Console'>Integrate CYE’s Hyver with Your KSAT Console</a> article.</li>\n<li>\n<strong>Cypago </strong>is a compliance platform that automates the process of preparing for compliance audits. This integration allows you to send KSAT training and user data to Cypago to show that your users are meeting compliance requirements.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/13938135773587'>How to Integrate Cypago with Your KSAT Console</a> article.</li>\n<li>\n<strong>Cyren Inbox Security </strong>is a cloud-based, Internet security technology company that provides security as a service and threat intelligence services to businesses.Cyren Inbox Security establishes a new layer of automated security to detect and remediate phishing, business email compromise (BEC), and malware threats that have penetrated existing defenses and reached the user mailbox.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4411071693843'>Cyren Inbox Security (CIS) Integration</a> article.</li>\n<li>\n<strong>Databee</strong> is a risk and compliance platform from Comcast. This integration allows you to send phishing information from KSAT to Databee to get risk insights within your organization. For more information, see the <a href='https://docs.databee.buzz/docs/knowbe4' target='_blank' rel='noopener noreferrer'>KnowBe4 integration documentation</a> from Databee.</li>\n<li>\n<strong>Drata</strong> is a security and compliance automation platform that monitors and collects evidence when your personnel complete their assigned security awareness training. This integration can help you monitor your training results and compliance status for security audits.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/6822999325203'>How to Integrate Drata with Your KSAT Console</a> article and the Drata article <a href='https://drata.com/integrations' target='_blank' rel='noopener'>Drata Integrations</a>.</li>\n<li>\n<strong>D3 Security </strong>is a security operations management software that provides tools and integrations for security automation, analysis, and incident response. D3 Security’s XGEN SOAR platform connects D3 Security’s playbook engine to external systems to exchange data and trigger system actions. This integration allows you to streamline data analysis and automate manual functions in your KSAT console. You can also use this integration to send data back to your KSAT console to change attributes, such as your users' Risk Scores.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/6348954801427'>How to Integrate D3 Security with Your KSAT Console</a> article.</li>\n<li>\n<strong>Egress</strong> is a cloud-based email security platform that assesses human risk to help you prepare for phishing attacks and data breaches before they happen. With this integration, you can send your KSAT data to Egress to better prepare for cybersecurity attacks.For more information, see Egress’s <a href='https://support.egress.com/s/article/Egress-and-KnowBe4-Integration' target='_blank' rel='noopener noreferrer'>KnowBe4 integration documentation</a>.</li>\n<li>\n<strong>ENGAIZ' ComplySec360™</strong> is an information and security compliance platform that helps startups and small and medium enterprises improve their risk posture and helps with continued compliance with SOC 2, ISO 27001, GDPR, HIPAA, and more. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/40807972628755-Integrate-ENGAIZ-ComplySec360-with-Your-KSAT-Console'>Integrate ENGAIZ ComplySec360™ with Your KSAT Console</a> article in our Knowledge Base.</li>\n<li>\n<strong>Gradient MSP</strong> is a managed billing reconciliation service that enables partners to synchronize the latest active user counts from their KnowBe4 customer accounts, ensuring accurate billing based on the actual number of active users rather than the originally ordered seat count. For more information, see Gradient’s <a href='https://support.meetgradient.com/knowbe4-security-awareness-training-ksat'>Overview and Configuration Guide: Integrating KnowBe4 KSAT with Gradient</a> article.</li>\n<li>\n<strong>Harmonic Security</strong> is a data security platform that allows new workflows for security awareness training. For example, you can use Tines’ webhooks to build workflows that allow users to resolve their own security issues in Harmonic Security’s user intervention features. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/34725210336787-Integrating-Harmonic-Security-with-KSAT-Using-Tines'>Integrating Harmonic Security with KSAT Using Tines</a> article.</li>\n<li>\n<strong>Hyperproof </strong>is a cloud-based security and compliance automation platform that monitors and collects evidence. This integration can help you monitor your KSAT training results and compliance status for security audits.For more information, see the Hyperproof article <a href='https://docs.hyperproof.io/hypersyncs/connecting-knowbe4/' target='_blank' rel='noopener'>Connecting to KnowBe4 and creating a Hypersync</a>.</li>\n<li>\n<strong>JupiterOne (J1)</strong> is a cloud-native security platform that connects across your siloed security tools, empowering unobstructed visibility into security risks across your entire cyber asset universe. This platform connects the dots between complex relationships and data, providing ultimate visibility to your environment, infrastructure, and operations.For more information, see the JupiterOne (J1) article <a href='https://support.jupiterone.io/hc/en-us/articles/360023741834-KnowBe4' target='_blank' rel='noopener'>KnowBe4 Integration with JupiterOne</a>.</li>\n<li>\n<strong>KCM GRC </strong>is a KnowBe4 platform that you can use to centralize your compliance and risk management efforts. This integration allows you to create automated KCM GRC tasks that collect training completion data from your KSAT platform. This data will automatically be uploaded as evidence for tasks so you can demonstrate how your organization is meeting its training requirements.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/7728644706579'>How to Integrate KnowBe4's KSAT Console with KCM GRC</a> article.</li>\n<li>\n<strong>Liongard</strong> is a controls-monitoring platform that helps you continuously manage security posture across your IT stack and more. This integration allows you to monitor phishing tests, security awareness campaigns, and users to keep risks under control.For more information, see Liongard’s <a href='https://docs.liongard.com/docs/knowbe4-inspector' target='_blank' rel='noopener noreferrer'>KnowBe4 integration documentation</a>.</li>\n<li>\n<strong>Mirage</strong> is an AI-driven social engineering platform that allows you to protect your organization through vishing (voice phishing) simulations, training, and mobile-based mitigation. You can sync Mirage simulation events directly into your KSAT console for reporting, training, and targeting purposes. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/37195269982995-Integrate-Mirage-with-Your-KSAT-Console'>Integrate Mirage with Your KSAT Console</a> article.</li>\n<li>\n<strong>MobileMind</strong> is a professional learning hub for schools. With this integration, you can send KnowBe4 training data to your MobileMind platform to provide a centralized place for tracking KnowBe4 courses. For more information, see the <a href='https://knowledge.mobilemind.io/knowbe4-integration-setup' target='_blank' rel='noopener noreferrer'>KnowBe4 integration setup</a> from MobileMind.</li>\n<li>\n<strong>Noetic Cyber</strong> is a cyber asset management and control platform that allows you to optimize your cybersecurity posture. This integration allows you to pull your phishing and training data into Noetic Cyber’s Security Asset Management platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/28676775042707'>Integrate Noetic Cyber with Your KnowBe4 Console</a> article.</li>\n<li>\n<strong>Okta</strong> is a cloud-based identity and access management (IAM) platform that connects your apps, logins, and devices into one place. With this integration, you use the KnowBe4 <a href='https://support.knowbe4.com/hc/en-us/articles/115016090908-Reporting-API-Overview'>Reporting API</a> to pull data into Okta. For more information, see Okta’s <a href='https://help.okta.com/wf/en-us/content/topics/workflows/connector-reference/knowbe4/knowbe4.htm' target='_blank' rel='noopener noreferrer'>KnowBe4 connector</a> documentation.</li>\n<li>\n<strong>Onyxia</strong> is a cybersecurity management platform that allows you to evaluate and organize your cybersecurity program. With this integration, you can send training information from KSAT to Onyxia to get strategic cybersecurity program recommendations. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/32668976790419'>Integrate Onyxia with your KnowBe4 Console</a> article.</li>\n<li>\n<strong>Red Vector’s Fulcrum</strong> is an intelligence platform designed to enhance insider risk management. Integrating Fulcrum with KSAT can help you identify possible workplace threats earlier by performing risk analysis. This integration also allows you to assign training campaigns to reduce workplace risks. For more information, see our Integrate <a href='https://support.knowbe4.com/hc/en-us/articles/39568659128083-Integrate-Red-Vector-s-Fulcrum-with-Your-KSAT-Console'>Red Vector’s Fulcrum with Your KSAT Console</a> article.</li>\n<li>\n<strong>SCIM </strong>(<a href='http://www.simplecloud.info/' target='_blank' rel='noopener'>System for Cross-domain Identity Management</a>) is an integration by KnowBe4 that allows you to leverage user data from your identity provider to provision, meaning to populate and maintain, your users within your KnowBe4 Console. For more information about SCIM, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374'>SCIM Configuration Guide</a>. For more information about our supported providers, see the following articles:\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/4402065050771'>How to Configure SCIM for Okta</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360053851814'>How to Configure SCIM for Azure</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/5278551802003'>How to Configure SCIM for OneLogin</a></li>\n<li><a href='https://support.jumpcloud.com/support/s/article/Identity-Management-with-KnowBe4' target='_blank' rel='noopener'>How to Configure SCIM for JumpCloud</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/12908176296979'>How to Configure SCIM for Rippling</a></li>\n<li><a href='https://support.pingidentity.com/s/marketplace-integration/a7i1W000000TOdqQAG/knowbe4-provisioning-connector' target='_blank' rel='noopener noreferrer'>How to Configure SCIM for PingFederate and PingOne</a></li>\n<li><a href='https://docs.cyberark.com/Idaptive/Latest/en/Content/Applications/AppsWeb/Knowb4.htm' target='_blank' rel='noopener noreferrer'>How to Configure SCIM for CyberArk Identity</a></li>\n</ul>\n</li>\n<li>\n<strong>Secureframe</strong> is a security and compliance software that helps automate the compliance process. This integration allows you to send training data from your KSAT console to your Secureframe account to help automate your organization’s compliance process.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/20620725438995'>How to Integrate Secureframe with Your KSAT Console</a> article.</li>\n<li>\n<strong>SeeMetrics </strong>is a cybersecurity performance management platform that provides metrics and data visualization to its customers. KnowBe4 integrates with SeeMetrics to display your KSAT and PhishER data on their platform.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12186201780755'>How to Integrate SeeMetrics with Your KSAT Console</a> article.</li>\n<li>\n<strong>Seemplicity</strong> is a Remediation Operations (RemOps) platform that accelerates risk reduction and streamlines security compliance workflows. It helps organizations manage and automate remediation efforts across multiple teams, improving efficiency, effectiveness, and speed. Integrating with KSAT allows you to receive findings about training completion status via the Seemplicity platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/43819663383187-Integrate-Seemplicity-with-Your-KSAT-Console'>Integrate Seemplicity with Your KSAT Console</a> article.</li>\n<li>\n<strong>ServiceNow</strong> is an automation platform. With this integration, you’ll get detailed information about your organization's phishing preparedness.For more information, see <a href='https://store.servicenow.com/sn_appstore_store.do#!/store/application/812ff8dd16e4f110574a0b1574d8de0f/2.0.1?referer=%2Fstore%2Fsearch%3Flistingtype%3Dallintegrations%25253Bancillary_app%25253Bcertified_apps%25253Bcontent%25253Bindustry_solution%25253Boem%25253Butility%25253Btemplate%25253Bgenerative_ai%25253Bsnow_solution%26q%3DKnowbe4&amp;sl=sh' target='_blank' rel='noopener noreferrer'>ServiceNow’s KnowBe4 Integration for SecOps</a> article.</li>\n<li>\n<strong>Sprinto</strong> is a compliance automation platform that tracks training campaigns from KnowBe4 to help you monitor onboarding and periodic security training across your organization. Integrating with KSAT allows Sprinto to automatically update training completion statuses based on real-time campaign data, which reduces manual effort and ensures you have audit-ready evidence. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/44246673017491-Integrate-Sprinto-with-Your-KSAT-Console'>Integrate Sprinto with Your KSAT Console</a> article.</li>\n<li>\n<strong>Swimlane </strong>is a security operations management software that provides workflow tools, such as automated incident response. Their SOAR platform streams your incident response process by integrating your people, processes, and technology.For more information, see Swimlane's <a href='https://apphub.swimlane.com/swimbundles/swimlane/sw_knowbe4' target='_blank' rel='noopener'>integration documentation</a>.</li>\n<li>\n<strong>Tidal Cyber</strong> is a threat-informed defense platform that allows organizations to efficiently assess, organize, and optimize their cyber defenses based on a deep understanding of the threats and adversaries that are most relevant to them. Phishing Security Test (PST) activity can also be integrated into your Tidal Cyber platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/38651027541395-Integrate-Tidal-Cyber-into-Your-KSAT-Console'>Integrate Tidal Cyber into Your KSAT Console</a> article.</li>\n<li>\n<strong>Tines </strong>is an automation platform that makes it easy for you to offload any of your monotonous workflows, giving you back time to increase your impact. You can connect to any REST API or web application in seconds.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4409410658323'>How to Add Training Notifications to Slack with the Tines Integration </a>article.</li>\n<li>\n<strong>Trustero</strong> is an AI-driven Governance, Risk, and Compliance (GRC) platform that allows you to better collect evidence for more robust reporting. It has a pre-built integration with KnowBe4’s security awareness training. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/35144945856531-Integrating-Trustero-with-KSAT'>Integrating Trustero with KSAT</a> article.</li>\n<li>\n<strong>Truto</strong> is a unified API platform. KnowBe4 integrates with Truto to allow easy access to our APIs. With this integration, you can set up and perform specific actions between KnowBe4 and other applications using the Truto Unified API. see the <a href='https://truto.one/integrations/detail/knowbe4' target='_blank' rel='noopener noreferrer'>KnowBe4 API integration</a> and <a href='https://truto.one/integrations/detail/knowbe4scim' target='_blank' rel='noopener'>KnowBe4 SCIM API integration</a> articles from Truto.</li>\n<li>\n<strong>Vanta </strong>is a security compliance automation company that seeks to improve an organization’s security monitoring and significantly reduce the required time to prepare for security audits.For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4418571900051'>How to Integrate Vanta with Your KSAT Console</a> article and the Vanta article <a href='https://help.vanta.com/hc/en-us/articles/4409230659604-How-to-set-up-the-KnowBe4-integration' target='_blank' rel='noopener'>Connecting Vanta &amp; KnowBe4</a>.</li>\n<li>\n<strong>Workato</strong> is a workflow automation platform that allows organizations to connect to both cloud and on-premise applications. This integration allows you to build automated workflows with KSAT’s API.For more information, see Workato’s <a href='https://www.workato.com/integrations/knowbe4' target='_blank' rel='noopener'>KnowBe4 integrations and automation</a> article.</li>\n<li>\n<strong>XM Cyber</strong> provides cloud security that helps organizations identify and fix security exposures in their networks. Its Security Control Monitoring (SCM) module provides you with insights into the configuration and activation of security controls. For more information, see our Integrating <a href='https://support.knowbe4.com/hc/en-us/articles/35798030434323-Integrating-XM-Cyber-s-SCM-with-KSAT'>XM Cyber’s SCM with KSAT</a> article.</li>\n</ul>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/4406998837011-KnowBe4-Security-Awareness-Training-KSAT-Console-Integrations",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "awareness",
        "console",
        "integrations",
        "ksat",
        "security",
        "training"
      ],
      "image_count": 0
    }
  }
}