{
  "article": {
    "id": 4409255959827,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/4409255959827.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/4409255959827.html",
    "author_id": 403968826754,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 34,
    "vote_sum": 1,
    "vote_count": 1,
    "section_id": 26429650317203,
    "created_at": "2021-10-26T12:21:10Z",
    "updated_at": "2024-04-18T22:55:08Z",
    "name": "Retired Third-Party Content",
    "title": "Retired Third-Party Content",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-04-18T22:55:08Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "modstore",
      "training content",
      "Content",
      "archived",
      "removed",
      "archived content",
      "removed content"
    ],
    "body": "<p>ModStore content that was published by a third party and licensed to KnowBe4 is considered third-party content. Regardless of the publisher, under your subscription license with KnowBe4, we reserve the exclusive right to periodically retire and archive content. This includes, without limitation, content that is outdated, inaccurate, or no longer meets our quality standards. </p>\n<p>The <strong>Retiring Soon</strong> tag is applied to all content that is set to be retired. You can see this tag on content featured in the <strong>ModStore </strong>tab, on the <strong>Library </strong>subtab, and on the <strong>Training</strong> tab.</p>\n<p><strong>Tip:</strong> For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467#RETIRING'>What Is the Retiring Soon Tag?</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467'>ModStore and Library Guide</a>.</p>\n<p>When the retirement date passes, content in the ModStore with the <strong>Retiring Soon</strong> status is removed from the ModStore and changed to the <strong>Retired </strong>status. After being <strong>Retired</strong>, the third-party content will change to the <strong>Archived </strong>status. Archived content cannot be downloaded or used in new training campaigns. We make reasonable efforts to provide time between status changes. When permitted, we aim to provide access to content in the <strong>Retired</strong> status for at least one month before the content is archived.</p>\n<p>Since third-party content is subject to KnowBe4's contractual agreement with the third-party publisher, the process of archiving this content is slightly different from archiving KnowBe4 content. See the list below for details:</p>\n<ul role='list'>\n<li>We will identify all customers that have either downloaded the content or added the content to their libraries in the past year. Then, as a courtesy, we will notify these customers that the content will be retiring soon and then archived.</li>\n<li>Archived content from a third-party publisher will no longer be available for use in any way.</li>\n<li>If an active campaign includes archived third-party content, users will not be able to view that piece of content. Instead, users will see a page that indicates the content is no longer available. </li>\n<li>If you received permission from KnowBe4 to host third-party content through means other than the KnowBe4 learning management system (LMS), you will be informed by your Customer Success Manager that the retired third-party content must be removed from the third-party LMS or any other mechanism used to host the content. Any copies or backups of the third-party content must be deleted and destroyed.</li>\n<li>Archived third-party content will still be listed in your library. However, when you navigate from your library to the content's <strong>Item Details</strong> page, you will be unable to view the content. </li>\n<li>If you used third-party content in a training campaign before it was retired, statistics like completion status, time spent, and score will still be available in your console.</li>\n</ul>\n<p>New content is continuously added to the ModStore, outpacing the content being retired. As a result, we recommend that you search the ModStore for new content that covers the same topics as the retired content. For more information about retired content, archived content, or how to find new content in the ModStore, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467'>ModStore and Library Guide</a>.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/4409255959827-Retired-Third-Party-Content",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "content",
        "party",
        "retired",
        "third"
      ],
      "image_count": 0
    }
  }
}