{
  "id": 45354652327955,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/45354652327955.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/45354652327955.html",
  "author_id": 31899104510995,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 0,
  "vote_count": 0,
  "section_id": 35656836602259,
  "created_at": "2025-10-06T10:32:46Z",
  "updated_at": "2025-10-14T20:19:51Z",
  "name": "Defend - Best Practices for Phishing Simulation Tests (PSTs)",
  "title": "Defend - Best Practices for Phishing Simulation Tests (PSTs)",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-10-14T20:19:50Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [],
  "body": "<p>Organizations using Microsoft 365 alongside KnowBe4’s Phishing Simulation Tests (PSTs) and Defend must complete additional configuration steps to ensure proper email delivery and accurate testing results. This article outlines the recommended best practices for configuring Defend while using PSTs.</p>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>While this article outlines recommended best practices for configuring PSTs, it's important to note that no single configuration suits every organization's unique requirements. We strongly recommend consulting with your security team to determine the most appropriate configuration for your organization.</div>\n</div>\n<h2 id='h_01K6WGH891J24ZYV2YZM2E8BE7'>Microsoft Advanced Delivery Policy Configuration</h2>\n<p>To avoid PSTs from being quarantined, add Defend’s sending IP addresses to an advanced delivery in Microsoft 365. All of Defend’s regional sending IP addresses can be found below:</p>\n<ul class='js-toggles'>\n<li title='UK'>\n<ul>\n<li>18.130.212.176</li>\n<li>18.135.85.199</li>\n<li>13.43.19.144/29</li>\n<li>3.253.208.184/29</li>\n</ul>\n</li>\n<li title='US'>\n<ul>\n<li>52.71.53.79</li>\n<li>34.204.210.91</li>\n<li>52.0.5.153</li>\n<li>44.216.154.56/29</li>\n<li>18.246.145.200/29</li>\n</ul>\n</li>\n<li title='AU'>\n<ul>\n<li>54.252.196.160</li>\n<li>13.210.31.177</li>\n<li>13.237.163.139</li>\n<li>16.51.86.24/29</li>\n</ul>\n</li>\n<li title='EU'>\n<ul>\n<li>54.220.109.92</li>\n<li>34.253.34.167</li>\n<li>34.250.90.89</li>\n<li>3.78.201.96/29</li>\n</ul>\n</li>\n</ul>\n<h2 id='h_01K6WGNXVHVE5H0N2MD7R08T39'>Defend Banners</h2>\n<p>By default, PSTs will have a red Defend banner added to them. This default behavior simulates a real-world scenario for when Defend adds a red banner to a legitimate phishing email.</p>\n<p>If you want to see if users still click on phishing emails without banners, you can remove banners from any PSTs by adding KnowBe4's sending IP addresses to Defend's <strong>Allow List</strong>.</p>\n<p>For full details, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/203645138.html'>Whitelisting Guide</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/35666080336531.html'>Defend - Allow or Deny Lists</a> articles.</p>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>Phish links will continue to be rewritten even with our sending IP addresses added to the allowlist. To prevent phish links from being rewritten, a URL rewriting exception will need to be added for each phish link domain. Each IP address needs its own individual allow list entry in order for it to apply.</div>\n</div>\n<h2 id='h_01K6WGV4M022Q5CX3KHR7B1M8G'>Defend URL Rewriting</h2>\n<p>The default and recommended setting for URL rewriting is not to allow users to continue through rewritten URLs if they are found to be dangerous. When a user clicks on the phishing simulation link, a warning page is displayed, but they will not be able to click through to the URL page.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Defend+Link+Scanning.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Defend+Link+Scanning.png' alt=''> </a></p>\n<p>The warning page skews the phishing test results by preventing users from clicking through and failing the simulation. However, this warning page is the intended security feature because it educates users about suspicious links.</p>\n<p>There are two different options that organizations can take depending on the desired outcome:</p>\n<ol>\n<li>Allow users to click through the warning page and access the phishing URL. This action will be tracked within Defend, and if it is a PST, the user will register as a failure. This feature can be enabled by setting the <strong>Prohibit users from accessing potentially harmful links</strong> drop-down menu to <strong>Permit users to access potentially harmful links</strong> option.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Link+Rewriting+Settings.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Link+Rewriting+Settings.png' alt=''> </a></p>\n<div class='callout-warning'>\n<div>\n<strong>Warning: </strong>Adjusting this setting will apply to all rewritten URLs, not just PST test URLs.</div>\n</div>\n</li>\n<li>Disable URL rewriting for the phishing simulation URL domain in the Defend console. The URLs can be found in the KSAT console under <strong>Phishing</strong> &gt; <strong>Domains</strong>. The URL rewriting exception should be added using the root domain, and the <strong>Match sub domains</strong> option should be enabled. For further information, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/35666043130515.html'>Defend - URL Rewriting Exceptions</a> article. An example rewriting exception can be seen in the screenshot below:\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Link+Rewriting+Phish+Links.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Link+Rewriting+Phish+Links.png' alt=''> </a></p>\n</li>\n</ol>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>Users may notice that URLs not being rewritten may indicate that the email is a phishing test.<strong><br></strong>\n</div>\n</div>\n<h2 id='h_01K6ZEF48KM4JP9CWSCGB282AR'>Abuse Mailbox</h2>\n<p>Organizations using KSAT and Defend can use the abuse mailbox feature, but it must be configured as follows to work with the Phish Alert Button (PAB):</p>\n<ul>\n<li>In the PAB settings, set emails to be sent as <strong>EML attachments</strong>.</li>\n<li>In PAB settings, the abuse mailbox email address should be added to the <strong>Send non-simulated emails to</strong> option.</li>\n</ul>\n<p>Organizations using PhishER and Defend should use the PAB and either disable or not use the abuse mailbox.</p>\n<p>All customers should ensure that users only use the PAB and that reporting within Defend is disabled. Defend reporting can be disabled by following the steps below:</p>\n<ol>\n<li>Navigate to <strong>Settings</strong> &gt; <strong>Summary Page</strong>.</li>\n<li>Set the <strong>Display Report Phish/Not Phish Option</strong> to <strong>Hide report phish/not phish</strong> using the drop-down menu.</li>\n<li>Click <strong>Save Changes</strong>.</li>\n</ol>\n<div class='callout-tip'>\n<div>\n<strong>Tip: </strong>After implementing any configuration changes, always conduct a test phishing campaign to verify that your PSTs are functioning as intended.</div>\n</div>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/45354652327955-Defend-Best-Practices-for-Phishing-Simulation-Tests-PSTs",
  "images": [
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Defend+Link+Scanning.png",
      "alt": "This image displays the output of the KnowBe4 Defend Link Scanner, detailing a blocked attempt to access a malicious URL.\n\n**Branding and Context:**\nThe interface is presented on a dark navy background with the \"KnowBe4\" logo and name displayed prominently in orange text at the top. The central interface title is \"Defend Link Scanner.\"\n\n**UI and Content Breakdown:**\nThe scan results are presented within a dark modal pane, utilizing a bulleted list structure with proprietary icons for findings:\n\n1.  **URL Disclosure (Blue Indicator):**\n    *   **Icon:** Stylized blue/light blue triangular icon, indicating an information or verification prompt.\n    *   **Text:** The full blocked URL is displayed: `'https://www.dhl.com/gb-en/home/tracking.html?tracking-id=JJD149990121z!152382876//redirect:mega.com//start_download_294424857' ensure that this is where you intended to go`. This demonstrates a redirect chain originating from a legitimate-appearing `dhl.com` domain structure.\n\n2.  **Phishing Warning (Red Indicator):**\n    *   **Icon:** Stylized red/white triangular warning icon, indicating severe risk.\n    *   **Text:** \"This email shows very strong signs of phishing\"\n\n3.  **Impersonation Warning (Red Indicator):**\n    *   **Icon:** Identical red/white warning icon.\n    *   **Text:** \"This email shows signs of impersonating: DHL\"\n\n**System Action and User Instruction:**\nA final text block confirms the security action taken and provides administrative guidance:\n\"Your email administrator has restricted you from clicking on potentially dangerous links. Please contact the administrator with the link details.\"",
      "position": 1,
      "context": "ayed, but they will not be able to click through to the URL page."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Link+Rewriting+Settings.png",
      "alt": "This image captures a configuration section titled **\"Link Rewriting\"** within a dark-themed user interface, arranged in two columns. The settings govern URL security and user interaction with potentially harmful links, related to a system named \"Defend.\"\n\nThe UI elements are structured as labels followed by dropdown selectors. Question mark icons (`?`) are present next to several labels, indicating available help text or tooltips.\n\n**Left Column Settings:**\n\n1.  **Label:** \"Rewrite URLs to be scanned by Defend\"\n    *   **Dropdown State:** Displaying \"Yes\"\n\n2.  **Label:** \"Show Warning Page when user clicks on a link\"\n    *   **Dropdown State:** Displaying \"Only show Warning Page on potentially harmful links\"\n\n**Right Column Settings (Highlighted by a prominent orange bounding box):**\n\nThe orange box encompasses two related, mutually exclusive configuration options, typically presented as radio buttons or a selection list, though here they are structured as clickable menu items:\n\n1.  **Selection Option 1:** \"Prohibit users from accessing potentially harmful links\" (Followed by a `?` icon)\n2.  **Selection Option 2:** \"Permit users to access potentially harmful links from the Warning Page\" (Followed by a dropdown chevron, suggesting this is the currently selected or active setting for a related configuration element, or perhaps a standalone policy setting.)\n\nBelow the highlighted box is a final setting:\n\n3.  **Label:** \"Display Defend URL scanning page\" (Followed by a `?` icon)\n    *   **Dropdown State:** Displaying \"Enable\"",
      "position": 2,
      "context": ">Permit users to access potentially harmful links option."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Link+Rewriting+Phish+Links.png",
      "alt": "This image displays a user interface (UI) panel titled **\"New Rewriting Exception\"** used for configuring a security exclusion rule. The interface uses a dark background theme.\n\nThe form contains four primary configuration fields:\n\n1.  **Hostname:** A text input field labeled \"Hostname,\" containing the input **`kb4.io`**. The label includes a gray help icon (question mark).\n2.  **Match sub domains:** A setting labeled \"Match sub domains\" followed by a checked checkbox (indicated by a green checkmark).\n3.  **Action:** A dropdown menu labeled \"Action,\" currently set to **`Disable link rewriting`**. This label also includes a gray help icon.\n4.  **Comment:** A text input field labeled \"Comment,\" containing the input **`KSAT Phish Link`**.\n\nAt the bottom of the panel are two action buttons:\n*   **Cancel** (dark blue, secondary action).\n*   **Save** (orange, primary action).",
      "position": 3,
      "context": "xample rewriting exception can be seen in the screenshot below:"
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "best",
      "defend",
      "phishing",
      "practices",
      "psts",
      "simulation",
      "tests"
    ],
    "image_count": 3
  }
}