{
  "id": 5477041619603,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/5477041619603.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/5477041619603.html",
  "author_id": 1534339111301,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 11,
  "vote_count": 11,
  "section_id": 11759045401491,
  "created_at": "2022-04-12T20:35:50Z",
  "updated_at": "2025-08-25T15:28:51Z",
  "name": "QR Code Phishing Security Tests (PSTs) Guide",
  "title": "QR Code Phishing Security Tests (PSTs) Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-08-14T14:36:39Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "localized",
    "answerbot",
    "answerbot_kmsat"
  ],
  "body": "<p>When you create a phishing campaign, you have the option to test your users with QR codes. QR codes, or quick response codes, are scannable barcodes that contain data in a compact format. QR codes can include data such as a link to a website, a location on a map, or a digital business card. If your users scan a malicious barcode, they could be prompted to visit a dangerous website. Additionally, malicious links hidden in QR codes may be able to bypass your organization's security filters.</p>\n<p>QR code Phishing Security Tests (PSTs) can help prepare your users for real QR code phishing attacks. For example, your users may be used to using a QR code to view the online menu at their favorite restaurant. Unfortunately, not all QR codes are safe to scan. Using QR code phishing, you can train your users to spot fake QR codes.</p>\n<h2 id='h_01HQR2V1EDS5ATA0GJ3A3B7CFD'>Creating a QR Code Phishing Campaign</h2>\n<p>You can create a QR code phishing campaign from the <strong>Phishing</strong> tab of your KSAT console. When you create the campaign, you will need to select our <strong>QR Code</strong> template topic. If your users scan these QR codes or enter data after scanning them, the results will be tracked in your KSAT console.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>You can customize these templates by navigating to Phishing Phishing Templates in your KSAT console. For more information about customizing templates, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/204240768.html'>Create and Edit Email Templates and Landing Pages</a> article.</div>\n</div>\n<p>To create a QR code phishing campaign, follow the steps below:</p>\n<ol>\n<li>From your KSAT console, navigate to the <strong>Phishing</strong> tab.</li>\n<li>Click the <strong>+ Create Phishing Campaign</strong> button.</li>\n<li>In the <strong>Template Topics</strong> drop-down menu, select <strong>QR Code</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/QRCode_PhishingTemplatesSection.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/QRCode_PhishingTemplatesSection.png' alt=''> </a></p>\n</li>\n<li>From the <strong>Template Selection</strong> drop-down menu, you can select a specific template or use one of our Automated Template Selections: <strong>AI-selected templates</strong>, <strong>Full Random</strong>, <strong>Random</strong>, or <strong>Specific Template</strong>. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500003848062.html'>Automated Template Selection Overview</a> article. If you select to use a specific template, a <strong>Specific Template</strong> drop-down menu will appear.</li>\n<li>Fill out the rest of the fields on the page. For more information about the available fields, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/204239938.html'>Create a Phishing Campaign</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/204239938.html'>Create and Manage Phishing Campaigns</a> article.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>When you select your landing page, you can select a data entry landing page to test whether your users will share sensitive information after scanning a QR code. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/204446387.html'>Data Entry Landing Pages Guide</a>.</div>\n</div>\n</li>\n<li>Click the <strong>Create Campaign </strong>button.</li>\n</ol>\n<h3 id='h_01HQR2V1EEN5SHF21GGFBZWXWE'>Example QR Code PST</h3>\n<p>When your users receive a QR code PST email, the QR code will display in the body of the email. For an example of a QR code PST, see the image below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/QRCode_QRCodeEmailExample.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/QRCode_QRCodeEmailExample.png' alt=''> </a></p>\n<p>The QR code will be a unique link for each user. If a user scans the QR code with their mobile device, they will be redirected to the landing page. Scanning the QR code will be recorded as a failure.</p>\n<h2 id='h_01HQR2V1EEVT9QBXSFEKEBTCWG'>Viewing QR Code PST Results</h2>\n<p>You can view the results of your QR code PSTs from the <strong>Campaigns</strong> subtab or from a specific user's <strong>User Details</strong> page in your KSAT console. For more information about viewing QR code PST results, see the subsections below.</p>\n<h3 id='h_01HQR2V1EET7Y43Q1NY8WR3RZK'>Viewing QR Code PST Results from the Campaigns Subtab</h3>\n<p>To view the results of a QR code PST from the <strong>Campaigns</strong> subtab, follow the steps below:</p>\n<ol>\n<li>In your KSAT console, navigate to <strong>Phishing</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>Click on the name of the phishing campaign for which you want to view the results.</li>\n<li>\n<p>Click the <strong>Phishing Security Tests</strong> subtab.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you sent the QR code PST as a one-time phishing campaign, skip this step and step 4 below.</div>\n</div>\n</li>\n<li>Click on the name of the QR code PST.</li>\n<li>From the PST’s overview page, click the <strong>Users</strong> subtab.</li>\n</ol>\n<p>The <strong>Users</strong> subtab will provide information about your users’ QR code PST results, such as which users scanned the QR code and which users entered data into a landing page. From the <strong>Users</strong> subtab, you have the option to download the full list of PST results as a CSV file. To do so, click the <strong>Download CSV</strong> button.</p>\n<p>To learn more about viewing PST results, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/217841868.html'>Monitor and Review Phishing Campaigns</a> article.</p>\n<h3 id='h_01HQR2V1EEHHS6S8QJSC0VHRH5'>Viewing QR Code PST Results from the User Details Page</h3>\n<p>You can also view whether a specific user failed your QR code PST from a user's <strong>User Details</strong> page. To view a specific user’s PST failures, follow the steps below:</p>\n<ol>\n<li>In your KSAT console, navigate to the <strong>Users</strong> tab.</li>\n<li>From the user list, click on the name of the user whose results you would like to view. When you click on the user’s name, the user’s <strong>User Details</strong> page will open.</li>\n<li>From the <strong>User Details</strong> page, select the <strong>Phishing</strong> subtab.</li>\n</ol>\n<p>From the table on the <strong>Phishing</strong> subtab, you can view the <strong>QR Code Scanned</strong> column to see if the user has failed a QR code PST. If the user failed a QR code PST, a check mark will display in the column.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Phishing/QR+Phishing/QRCode_UserDetails.png'><img src='https://helpimg.s3.amazonaws.com/Phishing/QR+Phishing/QRCode_UserDetails.png' alt='User Details Section'></a></p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/5477041619603-QR-Code-Phishing-Security-Tests-PSTs-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/QRCode_PhishingTemplatesSection.png",
      "alt": "This user interface screenshot displays the template selection and filtering configuration area for a phishing simulation campaign.\n\n**Header and Context:**\nThe screen title is **Phishing Templates**. A subtitle provides context: \"Template options may vary based on the groups targeted for the campaign.\"\n\n**Configuration Fields:**\n\n1.  **Template Topics:**\n    *   Input Control: Multi-select dropdown.\n    *   Current Selection: **QR Code** (displayed as a removable tag).\n    *   Controls: A close/clear icon (X) and a dropdown chevron are visible within the input boundary.\n\n2.  **Template Language Settings:**\n    *   Activation Checkbox: **Set Template Language** (checked). A help icon (?) is associated with the label.\n    *   **Language Override:** (Sub-field, visible when checked)\n        *   Input Control: Single-select dropdown.\n        *   Current Selection: **English (United States)** (displayed as a removable tag).\n\n3.  **Difficulty Rating:**\n    *   Input Control: Dropdown select.\n    *   Current Selection: **All Ratings**.\n    *   Controls: A dropdown chevron is visible, and a help icon (?) is positioned to the right of the input field.\n\n4.  **Template Selection:**\n    *   Input Control: Display/Dropdown field.\n    *   Current Value/Mode: **AI-selected templates, powered by AIDA.**\n    *   Action Link: **Preview** (blue text with an eye icon) is available to the right of the input field.\n\n**Summary Field:**\nAn informational field at the bottom states: **Available Templates (132+ Total)**.",
      "position": 1,
      "context": "cs drop-down menu, select QR Code."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/QRCode_QRCodeEmailExample.png",
      "alt": "This image displays an email preview within a development or testing environment, titled \"Email Preview - WhatsApp: Protect your privacy with Fingerprint Lock! (QR Code)\".\n\n**UI Elements and Context:**\n*   The header features two active (ON) blue toggle switches for viewing content: \"Show Remote Images\" and \"Show Embedded Images.\"\n*   Action buttons include \"Send Me a Test Email\" (blue, with envelope icon) and \"Toggle Red Flags\" (red, with flag icon).\n*   Navigation chevrons are present on the left and right margins for navigating previews.\n*   Header metadata fields (From, Reply To, Subject, Template ID) are present but blurred.\n\n**Email Content Structure:**\n*   **Header Graphic:** A dark blue banner containing a representation of a smartphone displaying a \"WhatsApp Locked\" screen (featuring a padlock and fingerprint sensor prompt) next to a large, green WhatsApp logo.\n*   **Primary Text:** \"Protect your WhatsApp conversations from prying eyes with Fingerprint Lock.\"\n*   **Instructional Text:** \"Scan the QR code below for easy setup.\"\n*   **Key Element:** A large, high-density black and white QR code is centrally displayed, intended for initiating the Fingerprint Lock setup.\n*   **Footer:** Includes the WhatsApp logo and a regulatory disclaimer: \"You are receiving this notification because you signed up for promotional announcements from WhatsApp.\"\n*   **Action Link:** A blue hyperlink labeled \"Unsubscribe\" is provided for opting out of future notifications.",
      "position": 2,
      "context": "For an example of a QR code PST, see the image below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Phishing/QR+Phishing/QRCode_UserDetails.png",
      "alt": "",
      "position": 3,
      "context": "If the user failed a QR code PST, a check mark will display in the column."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "code",
      "phishing",
      "psts",
      "security",
      "tests"
    ],
    "image_count": 3
  }
}