{
  "id": 8293053887251,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/8293053887251.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/8293053887251.html",
  "author_id": 6274409661715,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 1,
  "vote_sum": 3,
  "vote_count": 3,
  "section_id": 26410689830803,
  "created_at": "2022-08-01T19:29:23Z",
  "updated_at": "2025-03-11T17:56:06Z",
  "name": "Smart Groups Quickstart Guide",
  "title": "Smart Groups Quickstart Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T17:56:06Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [
    "01HA2SWQYPJW53QZJARG57DC2A"
  ],
  "label_names": [
    "adi",
    "ad sync",
    "localized",
    "answerbot"
  ],
  "body": "<p>If you’re a Platinum or Diamond customer, you can use our <strong>Smart Groups</strong> feature to create dynamic user groups based on custom criteria. Smart Groups automatically add and remove users based on these criteria. You can use this feature to phish and train groups of users, generate detailed reports, and more.</p>\n<p>To learn how to plan and set up a Smart Group, see the sections below or watch our <a href='https://support.knowbe4.com/hc/en-us/articles/8360930759955'>Creating Smart Groups</a> video. For a detailed overview of what Smart Groups are and how you can use them, see our <a href='https://support.knowbe4.com/hc/en-us/articles/8354913796115/' target='_self'>Smart Groups Overview </a>article.</p>\n<h2 id='h_01H9TKP3R72JPMY366A4EYBDMA'>Review and Update Your Users’ Information</h2>\n<p>Before you create a Smart Group, verify that the necessary user information has been added to your KSAT console. For example, if you want to make a Smart Group of all users who are located in a certain region, make sure you have location information recorded for each user.</p>\n<p>To verify that you have the necessary information in your KSAT console, follow the steps below:</p>\n<ol role='list'>\n<li>In your KSAT console, navigate to the <strong>Users</strong> tab.</li>\n<li>At the top-right of the <strong>Manage Users</strong> page, click the gear icon.</li>\n<li>From the drop-down menu that opens, select the check box next to the information you need to verify. For example, you could select the <strong>Location</strong> check box. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/ColumnUsersList.gif'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/ColumnUsersList.gif' alt=' '></a>\n</li>\n<li>The selected check box will now display as a column in the user list. You can sort the data in this column by clicking the arrow icon on the left side of the column’s header. Review this column to verify that the correct information is displayed. For example, if you selected <strong>Location</strong>, you could verify that your users have locations listed.</li>\n</ol>\n<p>If you follow this process and find that you’re missing information you need for your Smart Group, use one of the methods below to import new data:</p>\n<ul role='list'>\n<li>If you use a user provisioning integration such as <a href='https://support.knowbe4.com/hc/en-us/articles/228373888'>Active Directory</a> or <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374'>SCIM</a> in your account, you must update your users' missing information directly from your identity provider. If you want to update a field that isn’t included in your identity provider, manually upload the data using the <a href='https://support.knowbe4.com/hc/en-us/articles/204936887-Users-and-Groups-Management-Guide#h_01HC01D0M78DF5Y067R0S9H71Q'>CSV Import</a> feature.</li>\n<li>If you do not use a user provisioning integration in your account, you can create and import a CSV file to add user information. For more information about this process, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204873347#h_01FEXJ82K9M03HQZ3D1N1MA46M'>Import Users with a CSV File</a> article.</li>\n</ul>\n<h2 id='h_01H9TKP3R72QPPM2DYDSK3FWXW'>Plan Your Smart Groups</h2>\n<p>Before you create any Smart Groups, we recommend planning the purpose of each group. This will help you to select the right criteria for the group. You can view our <a href='https://support.knowbe4.com/hc/en-us/articles/8355402984851' target='_self'>Smart Groups Glossary of Criteria Types</a> for more information on the criteria types available for your Smart Groups.</p>\n<p>You can use Smart Groups to automate processes in the KSAT console. For example, you can link Smart Groups to your phishing campaigns to automatically phish certain users. For some of these automated processes, you might need to create several Smart Groups and several training or phishing campaigns. To plan these in advance, download our <a href='https://helpimg.s3.amazonaws.com/SmartGroups/KB-SmartGroupsPlanning-Worksheet.pdf' target='_blank' rel='noopener'>Smart Groups Planning Worksheet</a>. You can use this document as a template for building your own automated process with Smart Groups.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> We also have worksheets to help you plan your training and phishing campaign settings. To download these worksheets, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/7879267662739/'>Phishing and Training Campaign Planning Resources</a> article.</div>\n</div>\n<h2 id='h_01H9TKP3R8D7VYH6K69AVWNJ92'>Create a Smart Group</h2>\n<p>After you verify that you have the needed user information and develop a plan for your Smart Group, you’ll be ready to create the group. To create a Smart Group, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KSAT console and navigate to <strong>Users</strong> &gt; <strong>Groups</strong>.</li>\n<li>Click the <strong>+ Create New Group</strong> button at the top-right corner of the page.</li>\n<li>Enter a group name in the <strong>Group Name</strong> field.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> If you have enabled <a href='https://support.knowbe4.com/hc/en-us/articles/228373888-Active-Directory-Integration-ADI-Configuration-Guide' target='_self'>Active Directory Integration (ADI)</a>, keep in mind that a Smart Group can’t have the same name as any Active Directory user group. You'll need to give your Smart Groups unique names.</div>\n</div>\n</li>\n<li>If needed, select a security role for this Smart Group from the <strong>Security Roles</strong> drop-down menu. For more information see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015389767'>How to Use Security Roles</a> article.</li>\n<li>Select the <strong>Make this a Smart Group</strong> check box.</li>\n<li>Click <strong>Create Group</strong>. When you click this button, the Smart Group’s overview page will open.</li>\n<li>Click the <strong>Smart Group Criteria</strong> drop-down menu and select the criteria type you would like to set for the group. For more information about each option, see our <a href='https://support.knowbe4.com/hc/en-us/articles/8355402984851' target='_self'>Smart Groups Glossary of Criteria Types</a>. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/SmartGroups/2022+quickstart+step+7.png'><img src='https://helpimg.s3.amazonaws.com/SmartGroups/2022+quickstart+step+7.png' alt=' '></a>\n</li>\n<li>When you select the criteria type, a modal will open. In the criteria settings modal, you can select specifications for the criteria type such as its scope and time frame. Select the options that you would like, then click <strong>Save</strong>. The example below shows the <strong>Training</strong> criteria type. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/SmartGroups/2022+quickstart+step+8.png'><img src='https://helpimg.s3.amazonaws.com/SmartGroups/2022+quickstart+step+8.png' alt=' ' width='419' height='503'></a>\n</li>\n<li>If you need to add additional criteria, you can create up to five criteria per Smart Group. The <strong>Smart Group Criteria</strong> section lists all the criteria you’ve added.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> Users will only be added to your Smart Group if they meet every criterion.</div>\n</div>\n</li>\n</ol>\n<p>Once you add all of your criteria, click the <strong>Save</strong> button at the bottom of the <strong>Smart Group Criteria</strong> section. When you click <strong>Save</strong>, the Smart Group will populate with the users who meet all the specific criteria.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/SaveSmartGroupCriteria.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/SaveSmartGroupCriteria.png' alt=' '></a></div>\n<h2 id='h_01H9TKP3R8XD705Y0RP9M8TSNT'>Review Your Smart Group Criteria Results</h2>\n<p>Once you’ve added and saved your criteria, you can review your criteria results. Next to each criterion, the total number of users who meet each criterion will be displayed in a green box. The number next to your first criterion represents the number of users who meet that criterion alone. The number next to your second criterion displays the users who meet this criterion as well as the first criterion. The number on your last criterion displays the users who fit all of the criteria you set for the Smart Group.</p>\n<p>In the example below, there are 269 users that meet the first criterion, 49 users that meet the first criterion and the second criterion, and 4 users that meet all three criteria.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/UserCountSmartGroupCriteria.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/UserCountSmartGroupCriteria.png' alt=' '></a></div>\n<p>If your Smart Group has more than one criterion, you can click the chart icon in the top-right corner of the Smart Group Criteria section. When you click this icon, you will see a Venn diagram of users who meet each criterion. Each circle of the diagram represents a different criterion. The color of the circle corresponds to the color of the criterion. You can hover your cursor over a section of the diagram to see more information about the users in the Smart Group.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/ChartSmartGroupCriteria.gif'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/ChartSmartGroupCriteria.gif' alt=' '></a></div>\n<h2 id='h_01H9TKP3R8A8QJDPJ79G2MF2YW'>Maintain Your Smart Groups</h2>\n<p>Smart Groups are designed to help you easily manage user groups without requiring much maintenance. However, we do recommend performing occasional maintenance checks on your Smart Groups. After you create a Smart Group, determine how often you need to check on that group. Generally, we recommend checking on your Smart Groups every six to twelve months, but you may need to check more frequently depending on the Smart Group. Also, make sure to consider the <a href='https://support.knowbe4.com/hc/en-us/articles/8355402984851#h_01H9TQNP0498Z54TJ0KWJZKDAN'>Time Frame Options</a> that you set for the Smart Group. If you set a <strong>Range</strong> in a criterion, determine whether you will need to update that range periodically to match your goals. If you set a <strong>Duration</strong> in a criterion, we recommend checking that criterion according to the duration you set. For example, the Smart Group below should be checked every three months:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/DurationSmartGroupCriterion.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/DurationSmartGroupCriterion.png' alt=' '></a></div>\n<p>We recommend that you create audit groups to easily verify that your automated processes are working properly. Audit groups are typically created to reflect the opposite of your automated process. For example, if you build an automated phishing process, your audit Smart Group should include users who have never received a Phishing Security Test (PST). To learn more about automated Smart Group processes, see our <a href='https://support.knowbe4.com/hc/en-us/articles/8354913796115/#USES' target='_self'>Smart Groups Overview </a>article.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/8293053887251-Smart-Groups-Quickstart-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/ColumnUsersList.gif",
      "alt": "This image displays the \"Manage Users\" administrative interface of a web application.\n\n**Header and Navigation:**\n*   The page title is **\"Manage Users\"**.\n*   A blue primary button, **\"Add Users\"** with a dropdown indicator, is located in the top-right corner.\n*   A secondary navigation bar includes the following tabs, with **\"Users\"** currently selected: \"Groups,\" \"Import Users,\" \"Provisioning,\" \"Merge Users,\" \"Messages,\" and \"Security Roles.\"\n\n**Filtering and Utility Controls:**\n*   Filtering options are available via dropdown menus for **\"Status: Active,\" \"Type: All,\"** and **\"Groups: All.\"**\n*   Utility links include **\"Bulk Archive\"** and **\"Generate CSV.\"**\n*   A search bar labeled **\"Search by email or name...\"** is provided, accompanied by a Search icon and a Settings (gear) icon for advanced options.\n\n**User Data Table:**\nThe primary content is a sortable data table listing user accounts. Columns include:\n1.  **(Selection Checkbox)**\n2.  **User:** Displays both the email address (e.g., `Abbie.Grant@kb4salesdemo.com`) and the full name below it. A Windows OS icon precedes the email, suggesting the account type or sync source.\n3.  **PPP:** A percentage metric (e.g., `0%`, `37.5%`).\n4.  **Risk:** A numeric risk score (e.g., `10.3`).\n5.  **Groups:** A multi-line list of associated groups (e.g., `kb4salesdemo.com, Production West, Justice League`).\n6.  **Joined on:** Date of account creation (e.g., `02/11/2022`).\n7.  **Last Sign-In:** Date of most recent login (e.g., `03/08/2022`).\n8.  **Actions:** A dropdown indicator providing row-specific actions for the user.",
      "position": 1,
      "context": "For example, you could select the Location check box."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/SmartGroups/2022+quickstart+step+7.png",
      "alt": "The image displays a user interface section focused on configuring **\"Smart Group Criteria.\"** A main dropdown menu, labeled **\"Smart Group Criteria,\"** is actively open, revealing a list of rule types for group definition.\n\n**Dropdown Menu Criteria (Options):**\n*   User Field\n*   User Date\n*   Phish Event\n*   Vish Event\n*   Breach Event\n*   Training\n*   After Training\n*   Assessment\n\n**Contextual UI Elements:**\n*   A section header reads **\"Users.\"**\n*   Filtering controls display the current status: **Status: Active** and **Type: All**.\n*   The adjacent pane includes instructional text: \"...add at least one criterion to populate your Smart Group.\"\n*   Below the filters, the interface provides a **Download CSV** link (in green) and a partially visible search field (placeholder: \"Search by email o...\").\n*   The user table column headers visible are: **User, PPP, Groups, Joined on,** and **Added on** (followed by a tooltip icon).",
      "position": 2,
      "context": "/en-us/articles/8355402984851' target='_self'>Smart Groups Glossary of Criteria Types."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/SmartGroups/2022+quickstart+step+8.png",
      "alt": "This image displays a criteria configuration interface, likely a modal or section within a larger application, focused on defining enrollment or training rules.\n\n**UI Elements and Configuration:**\n\n1.  **Criteria Dropdowns (Default Values):**\n    *   **Condition:** Drop-down selector set to **Must**.\n    *   **Training Event:** Drop-down selector set to **Enrolled**.\n    *   **Scope:** Drop-down selector set to **Any Available**.\n\n2.  **Time Frame Control:**\n    *   A segmented control labeled **Time Frame** offers three options: **Range**, **Duration**, and **Any**.\n    *   **Duration** is currently active/selected, highlighted in dark gray.\n\n3.  **Duration Input Fields (Active Configuration):**\n    *   A drop-down selector set to **In the last**.\n    *   A numeric stepper input field displaying the value **3**. This field is flanked by decrement (-) and increment (+) buttons.\n    *   A drop-down selector specifying the unit of time, set to **Months**.\n\n4.  **Action Buttons (Footer):**\n    *   A secondary action button labeled **Cancel** (gray background).\n    *   A primary action button labeled **Save** (blue background).",
      "position": 3,
      "context": "The example below shows the Training criteria type."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/SaveSmartGroupCriteria.png",
      "alt": "This image displays a configuration screen titled **\"Smart Group Criteria,\"** used for defining dynamic group membership based on specific rules.\n\n**Header Section:**\n*   The primary title is **Smart Group Criteria**.\n*   A dropdown menu, also labeled **Smart Group Criteria**, is present below the title.\n*   Top right utilities include a gray button with a pie chart icon (likely for analytics or reporting) and a help icon (question mark).\n\n**Criteria Definition Section:**\nThe screen lists two active criteria rules, each enclosed in a light gray box, with vertical color-coded bars for differentiation (pink and green). Each rule includes descriptive text and two action icons (Edit/Pencil and Delete/Trash Can) on the right.\n\n1.  **Criterion 1 (Training):**\n    *   **Type:** Training (Indicated by the pink vertical bar).\n    *   **Condition:** User must not have completed 2023 Your Role: Internet Security and You.\n\n2.  **Criterion 2 (User Field):**\n    *   **Type:** User Field (Indicated by the green vertical bar).\n    *   **Condition:** The group name must be equal to Management.\n\n**Action Bar (Footer):**\nThe bottom section contains navigational and confirmation controls:\n*   **Cancel** button (standard gray).\n*   **Save** button (primary action, highlighted blue). An orange arrow points directly at the **Save** button, indicating the required action.\n*   **Show User Counts** toggle switch (active/blue), positioned on the far right, used to calculate and display the number of users meeting the defined criteria.",
      "position": 4,
      "context": "Group will populate with the users who meet all the specific criteria."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/UserCountSmartGroupCriteria.png",
      "alt": "This interface displays the **Smart Group Criteria** configuration page.\n\n**Header Elements:**\nThe page title is \"Smart Group Criteria.\" A contextual dropdown button next to the title is labeled \"Smart Group Criteria.\" Top-right navigation includes a pie chart icon (reporting) and a question mark icon (help).\n\n**Criteria List:**\nThe page lists three defined criteria, each presented as a gray card with a color-coded vertical strip indicating the criteria type. Each criterion displays the specific condition, the current user count meeting the criterion, and action icons for editing and deleting.\n\n1.  **Criterion 1 (Pink Strip / Training):** Condition: \"User must have been enrolled in any available courses in the last 3 months.\" User Count: **269 users**.\n2.  **Criterion 2 (Green Strip / User Field):** Condition: \"The location must be equal to Southwest.\" User Count: **49 users**.\n3.  **Criterion 3 (Orange Strip / Assessment):** Condition: \"User must have scored more than 50% on the entire assessment in the latest completed.\" User Count: **4 users**.\n\n**Footer Controls:**\nAction buttons at the bottom left include a standard gray \"Cancel\" button and a blue primary \"Save\" button. A dynamic toggle switch is located in the bottom right, labeled and currently active (blue toggle) as **\"Show User Counts.\"**",
      "position": 5,
      "context": "nd the second criterion, and 4 users that meet all three criteria."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/ChartSmartGroupCriteria.gif",
      "alt": "This image displays a configuration interface for defining and managing a \"Smart Group Criteria\" and viewing the resulting user population.\n\n### I. Dashboard and Metric Overview (Top Panel)\n\n*   **Risk Score Visualization:** A line graph on the left tracks \"Risk Score\" over time, scaled 0 to 75 (Y-axis). A data point is marked on \"8. Sep.\"\n*   **Risk Gauge:** A semi-circular gauge on the top right, scaled 0 to 100, segmented into colored risk zones (Green, Yellow, Orange, Red). The current score pointer rests at 0.\n*   **Contextual Link:** Text linking to guidance: \"See our Virtual Risk Officer (VRO) Guide for details about how Risk Scores are calculated.\"\n\n### II. Smart Group Criteria Definition\n\nThe central panel is titled **\"Smart Group Criteria\"** and contains three active filter rules:\n\n1.  **Criteria 1 (Training):** Highlighted by a pink vertical bar.\n    *   **Rule:** \"User must have been enrolled in any available courses in the last 3 months.\"\n    *   **Affected Users:** 269 users.\n2.  **Criteria 2 (User Field):** Highlighted by a green vertical bar.\n    *   **Rule:** \"The location must be equal to Southwest.\"\n    *   **Affected Users:** 49 users.\n3.  **Criteria 3 (Assessment):** Highlighted by an orange vertical bar.\n    *   **Rule:** \"User must have scored more than 50% on the entire assessment in the latest completed.\"\n    *   **Affected Users:** 4 users.\n\n*   **Rule Management:** Each criterion includes standard action icons for **Edit** (pencil) and **Delete** (trashcan). User counts are dynamically displayed in green pills.\n*   **Configuration Actions:** Below the criteria list are primary control buttons: **Cancel** (standard button) and **Save** (primary blue button).\n*   **Display Toggle:** A toggle switch, **\"Show User Counts,\"** is active (turned on).\n\n### III. Users Data Grid\n\nThe bottom section, titled **\"Users,\"** displays the resulting population based on the applied criteria.\n\n*   **Filtering:** Two active dropdown filters are visible: **Status: Active** and **Type: All**.\n*   **Data Export/Search:**\n    *   A link to **Generate CSV** is provided (with a download icon).\n    *   A search field labeled **\"Search by email or name...\"** is present.\n    *   A settings/gear icon is located next to the search bar.\n*   **Table Columns (Visible Header Only):** The data grid header includes columns for **User**, **PPP**, **Risk**, **Groups**, **Joined on**, **Added on**, and **Actions**. Sort/filter arrows are present on the data fields.",
      "position": 6,
      "context": "he diagram to see more information about the users in the Smart Group."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/Users/Groups/EN/DurationSmartGroupCriterion.png",
      "alt": "This image displays a UI configuration screen titled **Smart Group Criteria**.\n\n**Header Elements:**\n*   The primary page title is **Smart Group Criteria**.\n*   A dark gray button adjacent to the title is labeled **Smart Group Criteria ▼**, indicating a dropdown or tab selection for the current view.\n*   The top right corner features a gray utility button containing a pie chart icon (for reporting/analytics) and a **Help** icon (question mark in a circle).\n\n**Content Area (Criterion Row):**\n*   The content area shows a single defined rule, visually separated by a pink vertical sidebar on the left.\n*   The rule category is **Training**.\n*   The full criterion text states: **User must have been enrolled in any available course in the last 3 months.**\n*   The time-based parameter, **in the last 3 months**, is demarcated by an orange bounding box, signifying it as a configurable or editable value.\n*   A green status badge on the right indicates the current user population matching the criteria: **269 users**.\n*   Action icons are present for managing the rule: **Edit** (pencil icon) and **Delete** (trash can icon).",
      "position": 7,
      "context": "ample, the Smart Group below should be checked every three months:"
    }
  ],
  "metadata": {
    "category": "Security Awareness Training",
    "section": "Smart Groups",
    "topics": [
      "awareness",
      "groups",
      "quickstart",
      "security",
      "smart",
      "training"
    ],
    "image_count": 7
  }
}