{
  "id": 115010347968,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/115010347968.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/115010347968.html",
  "author_id": 21027160967,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 21,
  "vote_count": 29,
  "section_id": 20158694656531,
  "created_at": "2017-07-11T16:53:03Z",
  "updated_at": "2025-06-09T14:55:45Z",
  "name": "Best Practices Guide: Set Up a Baseline Test",
  "title": "Best Practices Guide: Set Up a Baseline Test",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-05-28T14:03:04Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "MAPS",
    "PHISHING TEST",
    "AR",
    "Learner Experience",
    "SCORM files",
    "PhishML",
    "Learner Dashboard",
    "LX",
    "localized",
    "Console Feature"
  ],
  "body": "<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>We’ve added advanced features to phishing templates! All accounts will be opted in to phishing template advanced features in 2025. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955'>Phishing Templates Advanced Features Guide</a>.</div>\n</div>\n<p>Before you begin your security awareness training program, we strongly recommend sending an unannounced simulated phishing test to all of your users. This test will help you establish a baseline for your organization.</p>\n<p>The results of this baseline phishing test will show your organization's initial <a href='https://support.knowbe4.com/hc/en-us/articles/115010178267-How-Is-Phish-prone-Percentage-Calculated-' target='_self'>Phish-prone Percentage</a>. The Phish-prone Percentage is the percentage of users who are likely to click on a phishing email. Consider this initial Phish-prone Percentage the baseline, or starting point, for your organization. Your organization's overall Phish-prone Percentage or Account Average Phish-prone Percentage is based on the Phish-prone Percentage of all users on your account, including those who have not received a Phishing Security Test (PST). As you conduct ongoing phishing tests, compare your organization's Phish-prone Percentage with the initial Phish-prone Percentage to measure the success of your security awareness training plan.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Before you conduct your baseline test, please ensure you've whitelisted KnowBe4's IP addresses or domains in your email environment. Use our <a href='https://helpimg.s3.amazonaws.com/supporttools/whitelisting-wizard.html' target='_blank' rel='noopener noreferrer'>Whitelisting Wizard</a> or review our <a href='https://support.knowbe4.com/hc/en-us/articles/203645138' target='_self'>Whitelisting Guide</a> to learn the best method for whitelisting your email client and spam filters.</div>\n</div>\n<h2 id='h_01HH2KJ5WRGX246B4FRY3EZEX2'>Why Shouldn't I Announce the Test?</h2>\n<p>We recommend conducting an unannounced baseline phishing test in order to get the most accurate results. By not announcing the test, you can see how vulnerable your organization would be if a real phishing attack made it through your email filters. Having this insight can help you gain buy-in from your stakeholders. To learn more, please see: <a href='https://support.knowbe4.com/hc/en-us/articles/115010148647' target='_self'>How Can I Engage My Stakeholders in My Security Awareness Training Plan?</a>.</p>\n<h2 id='h_01HH2KJ5WRRP3QKWWB6F8MBXBZ'>Recommended Settings for the Baseline Test Campaign</h2>\n<p><strong>Tip:</strong>After you've whitelisted and before you create a baseline phishing campaign, we recommend running at least one test campaign that is limited to a small group of users. To learn more, see the <a href='https://support.knowbe4.com/hc/en-us/articles/206523288#PRELIMINARY' target='_self'>Preliminary Test Campaign</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/206523288' target='_self'>Quickstart Implementation Guide</a>.</p>\n<p>To create your baseline campaign, go to <strong>Phishing</strong> &gt; <strong>+ Create Phishing Campaign</strong>. We recommend using the following settings for your baseline test campaign:</p>\n<p><strong>Note:</strong> All phishing campaigns are localized by default.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Baseline_Phishing/BaselinePhishing_CampaignSettings1-6.png'><img src='https://helpimg.s3.amazonaws.com/Baseline_Phishing/BaselinePhishing_CampaignSettings1-6.png' alt='An image of campaign settings 1-6.'></a></p>\n<ol>\n<li>\n<strong>Campaign Name: </strong>Name your campaign something descriptive, such as \"Baseline Test\".</li>\n<li>\n<strong>Send to:</strong> Select <strong>All Users</strong>.</li>\n<li>\n<strong>Frequency:</strong> Select <strong>One-time</strong>.</li>\n<li>\n<strong>Start Time:</strong> From the drop-down menus, select the desired date and time for your baseline test. The time you select should be during your organization's business hours as that is when your users are actively checking their emails.</li>\n<li>\n<strong>Sending Period: </strong>Select <strong>Send all emails when the campaign starts</strong>. When this setting is selected, emails will begin sending as soon as the campaign begins. The timing of sending and delivery will vary, depending on the number of users in the campaign. In most campaigns, all emails will be sent within an hour after the campaign starts..</li>\n<li>\n<strong>Track Activity: </strong>We recommend that you track phishing test failures for at least three days. For more information about sending and tracking periods, see our <a href='https://support.knowbe4.com/hc/en-us/articles/217841868' target='_self'>How to Monitor and Review Phishing Campaigns</a> article.</li>\n<li>\n<strong>Track Replies to Phishing Emails: </strong>You can turn this setting on if you wish to track your users' replies to the phishing test emails. For more information about reply-to phishing, see our <a href='https://support.knowbe4.com/hc/en-us/articles/234956728-Reply-To-Phishing'>Reply-To Phishing</a> article. <img src='https://helpimg.s3.us-east-1.amazonaws.com/Baseline_Phishing/BaselinePhishing_CampaignSettings8-16.png'>\n</li>\n<li>\n<strong>Template Topics:</strong> Select the <strong>Phishing for Sensitive Information</strong> category from the drop-down menu.</li>\n<li>\n<strong>Set Template Language:</strong> If enabled, this setting will override the phishing language set in users’ profiles. For more information about your language settings, please visit our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513-Localization-Guide'>Localization Guide</a>.</li>\n<li>\n<strong>Difficulty Rating:</strong> This setting estimates how sophisticated a template is and how likely it is to trick your users into failing. For this campaign’s purposes, keep the <strong>Difficulty Rating</strong> set to <strong>All Ratings</strong>.</li>\n<li>\n<strong>Template Selection:</strong> From the drop-down menu, select <strong>Specific Template (Choose one template)</strong>.</li>\n<li>\n<strong>Specific Template:</strong> Select the <strong>IT: Password Check Required Immediately</strong> phishing template. \n<ol>\n<li>\n<strong>Preview:</strong> Clicking <strong>Preview</strong> will reveal the phishing template you are sending to your users.</li>\n</ol>\n</li>\n<li>\n<strong>Phish Link Domain</strong>: Choose a domain to use for the phishing link. This choice is the domain that your users will see when they hover over the phishing link, so choose one that looks safe to click on.</li>\n<li>\n<strong>Landing Page:</strong> Keep <strong>Default Landing Pages</strong> selected.</li>\n<li>\n<strong>Add Clickers To:</strong> For this campaign’s purposes, you do not need to make a selection.</li>\n<li>\n<strong>Send an email report to account admins after each phishing test:</strong> Select this checkbox so that an email will be sent to all of your account administrators after the test is complete. This email report will be sent to administrators after the <strong>Track Activity</strong> time period has concluded.</li>\n</ol>\n<h2 id='h_01HH2KJ5WR3GN8HM9054HA1Q2Q'>After the Baseline Test</h2>\n<p>After the baseline phishing test, your users may be confused or concerned about the email that they received. To help with this confusion, we recommend that you send an email explaining what the phishing test was, and you can even share your organization's Phish-prone Percentage to emphasize the importance of security awareness training. We've provided a template that you can use for this email, please see: <a href='https://support.knowbe4.com/hc/en-us/articles/219576987-What-Can-I-Send-to-My-Users-After-the-Baseline-Phishing-Test-Is-Completed-'>Template for After Your Baseline Phishing Test</a>.</p>\n<p>We recommend enrolling your users in security awareness training shortly after conducting your baseline phishing test. To learn more, see <a href='https://support.knowbe4.com/hc/en-us/articles/115010187647-Enrolling-Your-Employees-in-Security-Awareness-Training'>Best Practices Guide: Create Your First Training Campaign</a>.</p>\n<p>Once users have completed their initial security awareness training assignment, we recommend that you conduct ongoing phishing tests so that your users can practice the skills they've learned as part of their training. To learn more about ongoing phishing tests, see our <a href='https://support.knowbe4.com/hc/en-us/articles/225574347-Best-Practices-Guide-How-Do-I-Effectively-Integrate-KnowBe4-Into-My-Organization-' target='_self'>Best Practices Guide</a>. </p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/115010347968-Best-Practices-Guide-Set-Up-a-Baseline-Test",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/Baseline_Phishing/BaselinePhishing_CampaignSettings1-6.png",
      "alt": "",
      "position": 1,
      "context": "Note: All phishing campaigns are localized by default."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Baseline_Phishing/BaselinePhishing_CampaignSettings8-16.png",
      "alt": "This image displays the configuration interface for the latter half of a simulated phishing campaign setup. The layout consists of labeled fields and corresponding input elements (dropdowns, checkboxes) arranged vertically.\n\n### UI Element Details (Fields 8 through 15)\n\nAll major configuration fields utilize dropdown menus, and fields 9, 10, 13, 14, and 15 include a standard question mark icon (`?`) indicating access to context-sensitive help or tooltips.\n\n| # | Label | Input Type | Current Value/State | Specific Elements |\n| :---: | :--- | :--- | :--- | :--- |\n| **8** | Template Topics | Tagged Dropdown | `Phishing for Sensitive Information` (tag removable via 'X') | N/A |\n| **9** | Set Template Language | Checkbox | Unchecked | Help icon (`?`) |\n| **10** | Difficulty Rating | Dropdown Menu | `All Ratings` | Help icon (`?`) |\n| **11** | Template Selection | Dropdown Menu | `Specific Template (Choose one template)` | N/A |\n| **12** | Specific Template | Dropdown Menu | `IT: Password Check Required Immediately (Lin...` (truncated text) | **Preview** link (Blue text with eye icon) |\n| **13** | Phish Link Domain | Dropdown Menu | `employeeportal.net-login.com` | Help icon (`?`) |\n| **14** | Landing Page | Dropdown Menu | `Default Landing Pages` | Help icon (`?`) |\n| **15** | Add Clickers to | Dropdown Menu | `Select Group` | Help icon (`?`) |\n\n### Reporting and Action Elements\n\n| # | Element Type | Text/Label | State |\n| :---: | :--- | :--- | :--- |\n| **16** | Checkbox | Send an email report to account admins after each phishing test | Unchecked |\n| N/A | Checkbox | Hide from Reports | Unchecked (Includes help icon `?`) |\n| N/A | Action Button | Create Campaign | Blue, primary action button located at the bottom of the section. |\n\n*(Note: The orange circled markers (8 through 16, and 'a') are instructional annotations overlaid on the image and are not part of the functional user interface.)*",
      "position": 2,
      "context": "For more information about reply-to phishing, see our Reply-To Phishing article."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "baseline",
      "best",
      "practices",
      "test"
    ],
    "image_count": 2
  }
}