{
  "article": {
    "id": 115006118227,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/115006118227.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/115006118227.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 19,
    "vote_count": 23,
    "section_id": 360000156868,
    "created_at": "2017-04-24T18:03:09Z",
    "updated_at": "2025-03-11T16:57:18Z",
    "name": "Weak Password Test (WPT) Product Manual",
    "title": "Weak Password Test (WPT) Product Manual",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T16:57:18Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "wpt",
      "weak passwords",
      "weak password test",
      "weak passwords test",
      "vulnerable password",
      "weak pass",
      "localized",
      "Lead Generator",
      "answerbot"
    ],
    "body": "<p>To learn about Weak Password Test (WPT), read the sections below or watch a brief <a href='https://support.knowbe4.com/hc/en-us/articles/360001529147-Video-Weak-Password-Test-WPT-'>Weak Password Test (WPT)</a> video.</p>\n<h2 id='iv_01H8ESADZXPNTAWFKS5946SHQ7'>Introduction to WPT</h2>\n<p>WPT is a free tool that examines your Active Directory (AD) for user passwords that are susceptible to password-related attacks.</p>\n<p>WPT connects to your AD to retrieve your password table using hashed passwords and encryption algorithms. The tool then analyzes the passwords against ten potential password vulnerabilities.</p>\n<p>Your results will display which user accounts failed the test and why. This information can empower you to increase your organization's password complexity requirements, train your users about safe password practices, or take other actions to help your organization's security.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/wpt/EN/WeakPasswordTest.png'><img src='https://helpimg.s3.amazonaws.com/wpt/EN/WeakPasswordTest.png' alt=' '></a></div>\n<h2 id='iv_01H8ESADZXCP0Z324X9C3RE8VM'>System Requirements and Prerequisites</h2>\n<p>To run WPT, your system must meet the following requirements:</p>\n<ul role='list'>\n<li>Windows 10 or later (32 or 64-bit), Windows Server 2016 or later</li>\n<li>Active Directory (AD), running on Windows Server 2008 R2 or later</li>\n<li>Ability to access the domain controller (DC)</li>\n<li>Internet access</li>\n<li>.NET Framework 4.7.2, will be installed if needed</li>\n<li>At least two processors</li>\n<li>At least 2GB of RAM</li>\n<li>At least 1GB of hard disk drive (HDD) space available on your system drive</li>\n<li>User Account Control (UAC) enabled</li>\n</ul>\n<p>We recommend running this test on a system other than your DC, as the scanning process can temporarily generate significant network traffic and central processing unit (CPU) usage.</p>\n<p>For installation, you will need the following information:</p>\n<ol role='list'>\n<li>The license key that you received via email upon signing up for the test.</li>\n<li>The domain name of your AD. For example, MyDomain.com or MyDomain.local.</li>\n<li>The name of your DC.</li>\n<li>The credentials to connect to your AD.</li>\n</ol>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>For the test to run successfully, the credentials you use to connect to your AD with WPT must have <strong>Replicating Directory Changes</strong> and <strong>Replicating Directory Changes All</strong> permissions enabled. These permissions allow you to obtain a copy of your password table for analysis.</div>\n</div>\n<h2 id='iv_01H8ESADZXYY7V153YHSCS53TE'>Installation and Setup</h2>\n<p>Once you’ve met the system requirements and prerequisites, you can install and set up WPT. To get started, follow the steps below:</p>\n<ol role='list'>\n<li>Sign up to download the WPT tool on our <a href='https://www.knowbe4.com/weak-password-test' target='_blank' rel='noopener noreferrer'>WPT page</a> and download the WPT installation file.</li>\n<li>Check your email to retrieve your unique WPT license key, which you’ll need to use during the setup process.</li>\n<li>Run the WPT installation file.</li>\n<li>Review and accept the license agreement. Then, click <strong>Install</strong> to complete the installation. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/wpt/AcceptTerms.png'><img src='https://helpimg.s3.amazonaws.com/wpt/AcceptTerms.png' alt=' '></a>\n</li>\n<li>Click <strong>Finish</strong> to launch WPT. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/wpt/FinishSetup.png'><img src='https://helpimg.s3.amazonaws.com/wpt/FinishSetup.png' alt=' '></a>\n</li>\n<li>Enter your license key from Step 1 and click <strong>OK</strong>. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/wpt/EN/LicenseKey.png'><img src='https://helpimg.s3.amazonaws.com/wpt/EN/LicenseKey.png' alt=' ' width='586' height='444'></a>\n</li>\n<li>Under <strong>Active Directory Details</strong>, enter the required details from your Active Directory (AD):\n<ul role='list'>\n<li>The domain name of your AD</li>\n<li>The name of your domain controller (DC)</li>\n</ul>\n</li>\n<li>Under <strong>Credentials</strong>, enter the username and password for the account you created, which has <strong>Replicating Directory Changes</strong> and <strong>Replicating Directory Changes All</strong> permissions enabled.</li>\n<li>Click <strong>Start Test</strong><span> to start your test.</span>\n</li>\n<li>The test will analyze your AD accounts for weak passwords. Depending on the size of your AD and workstation performance, this process may take a minute or longer. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/wpt/EN/WPT_Progress.png'><img src='https://s3.amazonaws.com/helpimg/wpt/EN/WPT_Progress.png' alt=' '></a>\n</li>\n<li><span>Your results will be displayed on-screen as soon as the test is complete. To understand each vulnerability, read the next section.</span></li>\n</ol>\n<h2 id='iv_01H8ESADZXTJDX6K2NHACEHC98'>Understanding Your Results</h2>\n<p>Your WPT results will indicate how many accounts were vulnerable and what vulnerability affected each account. The below sections will help you navigate your results and understand the types of password vulnerabilities found.</p>\n<h3 id='iv_h_01HKR9NKWJ95DJNT57W9RMDZPM'>Navigating Your Results</h3>\n<p>Your Active Directory (AD) accounts will be listed as individual rows. In each row, one or more checkmarks indicate the specific vulnerabilities found for that particular account. You can also search for a specific account by entering characters into the search box.</p>\n<p>A pie chart compares the number and type of vulnerabilities found and can be used to determine your organization's most common password vulnerabilities.</p>\n<p>You can filter the results by failure type if you would like to analyze a specific vulnerability. To do so, click the specific failure type on the left side of the window, and only accounts with that type will remain in the list.</p>\n<p>Below is additional information about the WPT user interface:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/wpt/EN/WPT_Results.png'><img src='https://helpimg.s3.amazonaws.com/wpt/EN/WPT_Results.png' alt=' '></a></div>\n<ol class='alpha' role='list'>\n<li>You can filter your results by failure type by clicking the sidebar on the left side of the page.</li>\n<li>You can search for specific AD accounts in the search bar.</li>\n<li>The checkmarks in each row indicate the type of password vulnerability found for each account.</li>\n<li>You can export your results as an Excel Spreadsheet or a PDF file.</li>\n<li>Click <strong>Rerun Test</strong> to run WPT again. We recommend that you save your current results before clicking this button.</li>\n</ol>\n<h3 id='iv_01H8ESADZXH4PN9KE2E4P8JRSQ'>Failure Types</h3>\n<p>WPT analyzes your data to look for ten different failure types that can leave your organization vulnerable to an attack, detailed below.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/wpt/FailureVulnerabilities.png'><img src='https://helpimg.s3.amazonaws.com/wpt/FailureVulnerabilities.png' alt=' ' width='286' height='601'></a></div>\n<ol role='list'>\n<li>\n<strong>Weak Password: </strong>This failure indicates that the affected account's password matched one of those listed in our weak password dictionary. These passwords are either very common, easy to guess, or have been made available to attackers because of past data breaches.</li>\n<li>\n<strong>Shared Password: </strong>This failure indicates that the affected account shares a password with at least one other account.</li>\n<li>\n<strong>Empty Password: </strong>This failure includes accounts that do not have a set password.</li>\n<li>\n<strong>Clear Text Password: </strong>This failure includes passwords that are stored in clear text in an Active Directory (AD). This means the users' AD passwords are stored using reversible encryption.</li>\n<li>\n<strong>Password Not Required: </strong>This failure includes accounts that have the capability of not having a password.</li>\n<li>\n<strong>Password Never Expires: </strong>This failure indicates that the account has its password timeout set to zero. Because of this setting, even if the <strong>Password never expires</strong> check box in the user’s properties is unchecked, their password will never expire. WPT will check password expiration settings in your organization’s domain policies, fine-grained password policies, and user properties.</li>\n<li>\n<strong>LM Hash Password: </strong>This failure indicates that the affected account uses a Local Area Network (LAN) manager hash, which is an antiquated method. These passwords are vulnerable to brute force attacks and can be quickly cracked.</li>\n<li>\n<strong>AES Encryption Not Set: </strong>This failure indicates that the account doesn’t use Advanced Encryption Standard (AES) to encrypt the user’s password. AES encrypts passwords with a 128-bit or 256-bit key. Passwords that use AES encryption are less vulnerable to attacks.</li>\n<li>\n<strong>DES-Only Encryption: </strong>This failure indicates that affected accounts were set up using the retired Data Encryption Standard (DES) mechanism. This could be a result of old software that doesn’t know how to react to AES.</li>\n<li>\n<p><strong>Missing Pre-Authentication: </strong>This failure indicates that affected accounts have pre-authentication, a security mechanism, turned off. When enabled, pre-authentication creates an encrypted authentication request so that attempts to authenticate to the account are logged.</p>\n<p>This account may be at risk of a brute force attack. Brute force attacks can occur offline and are difficult to detect.</p>\n</li>\n</ol>\n<h2 id='iv_h_01HKQ5T0VDDCK34EF99K01ZABJ'>Settings</h2>\n<p>There are different settings you can choose from to allow you to customize your WPT. Read the subsections below for more information.</p>\n<h3 id='iv_h_01HKQ5VJW9BTAVAZJXFWQ20285'>Optional Vulnerabilities</h3>\n<p>You can enable or disable two password vulnerabilities from your WPT scan: <strong>AES Encryption No Set</strong> or <strong>Password Never Expires</strong>. To access these settings, click the <strong>gear</strong> icon in the top-right corner of the window.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/wpt/EN/WPT_OptionalVulnerabilities.png'><img src='https://helpimg.s3.amazonaws.com/wpt/EN/WPT_OptionalVulnerabilities.png' alt=' ' width='677' height='509'></a></div>\n<h3 id='iv_h_01HKQ5VJW9T173F7HTFPV9ZHGD'>Custom Passwords</h3>\n<p>WPT uses a large password library to determine if a user's password is weak. If there are specific passwords you would like to include in the WPT scan, you can import a text file including these passwords. To access this setting, click the <strong>gear</strong> icon in the top-right corner of the window.</p>\n<p>Before importing your text file, make sure that your file is less than 10MB and that you only include one password on each line of the file.</p>\n<h3 id='iv_h_01HKQ5VDDFR6AFQACJ7QFZP87E'>Language</h3>\n<p>You can change your WPT language by clicking the language name in the bottom-right corner of the window.</p>\n<h2 id='iv_01HKQ69ANS3ZA640WZ8QM2XGZR'>Security</h2>\n<p>Your Active Directory (AD) and user information are kept secure while using WPT. The test results only identify the user accounts that failed the test and why so that you can take action.</p>\n<p>Below are details about how your data is handled during WPT:</p>\n<ul role='list'>\n<li>None of the information from your AD will be transmitted to KnowBe4 at any point during the test.</li>\n<li>The data pulled from your AD is encrypted.</li>\n<li>WPT does not display the passwords of any of your AD user accounts.</li>\n<li>Passwords in AD are in a hashed format, and the hashed format will not be visible during the test.</li>\n<li>The information obtained during the test is saved in local memory, not to disk.</li>\n</ul>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/115006118227-Weak-Password-Test-WPT-Product-Manual",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/wpt/EN/WeakPasswordTest.png",
        "alt": "This image displays the results of a security application titled \"KnowBe4 Weak Password Test,\" presented in a dashboard format.\n\n**Header and Navigation:**\nThe application title \"KnowBe4 Weak Password Test\" is displayed in the top bar, alongside standard window controls (Settings gear icon, Help question mark icon, minimize, and close).\n\n**Summary Statistics (Upper Left):**\nTwo large colored panels summarize the findings:\n1.  **VULNERABLE:** Red panel indicating **26 accounts**.\n2.  **NOT VULNERABLE:** Green panel indicating **6 accounts**.\n\n**Vulnerability Overview (Center Top):**\nThe title \"FOUND 40 VULNERABILITIES\" is displayed above a detailed multi-colored pie chart. A legend to the right of the chart provides a breakdown of the vulnerability types and their counts:\n*   Weak Password: 4\n*   Shared Password: 6\n*   Empty Password: 1\n*   Clear Text Password: 1\n*   Password Not Required: 1\n*   Password Never Expires: 23\n*   LM Hash Password: 2\n*   DES-Only Encryption: 1\n*   Missing Pre-Authentication: 1\n\n**Action and Context Panel (Upper Right):**\nA text block provides context about the test (using \"more than 11 million common passwords\") and directs the user to click the **\"Rerun Test\"** orange button to re-execute the scan.\n\n**Detailed Account List (Lower Section):**\nThis section is divided into a sidebar menu and a primary data table.\n\n**Sidebar Menu (Left):**\nThis menu categorizes the accounts based on vulnerability type. \"All Accounts\" is highlighted in orange, showing a total count of **32**. The list mirrors the pie chart legend, showing counts for each category, including \"AES Encryption Not Set\" (0).\n\n**Data Table (Right):**\nThe table presents specific account names and indicates which vulnerabilities apply to them using checkmarks ($\\checkmark$).\n*   A **Search** box is positioned above the table.\n*   The data can be exported via **\"Export to Excel\"** and **\"Export to PDF\"** links.\n*   The columns include \"Account Name\" followed by columns matching the vulnerability types (e.g., \"Weak Password,\" \"Shared Password,\" \"Empty Password\").\n*   Visible account names include \"ac01\" through \"ac07,\" \"admin01,\" \"Administrator,\" \"hr01\" through \"hr06,\" and \"ma01.\"\n\n**Footer:**\nThe application footer displays: \"Copyright © KnowBe4, Inc. 2024,\" the software version number \"v. 1.10.3.305,\" and the language setting \"English (United States).\"",
        "position": 1,
        "context": "s about safe password practices, or take other actions to help your organization's security."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/wpt/AcceptTerms.png",
        "alt": "This is the License Agreement step of the **KnowBe4 Weak Password Test Setup** wizard.\n\n**UI Context:** A standard Windows installation dialog featuring a dark gray graphic panel on the left displaying an orange logo (a magnifying glass over the characters `p(a*)**`).\n\n**Content Area:**\n*   **Header:** \"Please read the KnowBe4 Weak Password Test License Agreement\"\n*   **License Text:** The main content box provides links to legal documentation:\n    *   `https://www.knowbe4.com/Terms` (Terms of Service)\n    *   `https://www.knowbe4.com/Product-Privacy-Notice` (Privacy Policy)\n*   **Copyright:** `© 2016-2023 KnowBe4, Inc.`\n*   **Acceptance Control:** A mandatory checkbox is present and currently checked, labeled: \"I accept the terms in the License Agreement\".\n\n**Navigation Controls:**\nThe footer contains four buttons:\n1.  **Print** (Active)\n2.  **Back** (Disabled/Grayed out)\n3.  **Install** (Active)\n4.  **Cancel** (Active)",
        "position": 2,
        "context": "Then, click Install to complete the installation."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/wpt/FinishSetup.png",
        "alt": "This screenshot displays the final confirmation stage of the **KnowBe4 Weak Password Test Setup** wizard.\n\n**UI Elements and Context:**\n\n*   **Title Bar:** Displays the application title: \"KnowBe4 Weak Password Test Setup.\"\n*   **Context:** The wizard is announcing the successful completion of the setup process.\n*   **Header Text:** \"Completed the KnowBe4 Weak Password Test Setup Wizard.\"\n*   **Instructional Text:** \"Click the Finish button to exit the Setup Wizard.\"\n*   **Branding Panel (Left):** A dark gray panel featuring an orange graphic: a magnifying glass focused on the characters \"p\", \"a\", and two asterisks (**p a * *), representing password auditing.\n*   **Post-Setup Action:** A checkbox is provided for immediate execution: **[X] Launch KnowBe4 Weak Password Test**. This option is checked by default.\n*   **Control Buttons (Footer):**\n    *   **Back:** Disabled (grayed out), indicating no return steps are permitted at the final stage.\n    *   **Finish:** Primary action button (highlighted), confirming exit and, due to the checkbox state, launching the application.\n    *   **Cancel:** Active button for aborting the wizard exit.",
        "position": 3,
        "context": "img.s3.amazonaws.com/wpt/AcceptTerms.png' alt=' '>\n\nClick Finish to launch WPT."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/wpt/EN/LicenseKey.png",
        "alt": "The image displays the KnowBe4 Weak Password Test (WPT) application interface, overlaid by a mandatory modal dialog requesting license information.\n\n**Main Application Window (Background):**\n\n1.  **Title and Branding:** The application is titled \"KnowBe4 Weak Password Test.\" The header features the KnowBe4 logo and tagline, \"Human error. Conquered.\"\n2.  **Introduction:** Introductory text explains the purpose of WPT: checking Active Directory (AD) for weak passwords and locally analyzing account information.\n3.  **Content Section:** A heading for \"Active Directory Details\" is partially visible, indicating the application requires configuration input for AD connection (credentials and server details are implied by the obscured input fields).\n4.  **Footer:** The status bar includes the copyright \"Copyright © KnowBe4, Inc. 2024,\" version number \"v. 1.10.3.305,\" and a language selector set to \"English (United States).\"\n5.  **Action Button:** A prominent orange primary action button labeled \"Start Test\" is located in the bottom-right corner.\n\n**License Key Modal Dialog (Foreground):**\n\n1.  **Context:** The foreground element is a modal dialog titled \"License Info.\" This dialog interrupts the workflow, preventing interaction with the main application until resolved.\n2.  **Header:** The dialog features a graphical icon depicting a gold key next to a lock cylinder.\n3.  **Title and Instructions:** The main heading is **\"License Key.\"** Instructional text reads: \"You have received the name of the license owner and the license key via email. Please copy the license key and insert here in order to use the KnowBe4 Weak Password Test application.\"\n4.  **Input Field:** A single, unpopulated, long text input box is provided for the user to paste or type the license key.\n5.  **Controls:** The dialog includes two control buttons: **\"OK\"** (to validate and proceed) and **\"Cancel\"** (to dismiss the dialog).",
        "position": 4,
        "context": "Step 1 and click OK"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/wpt/EN/WPT_Progress.png",
        "alt": "This image displays the interface for the **KnowBe4 Weak Password Test** application while an active scan is running.\n\n**Application Context:**\nThe title bar displays \"KnowBe4 Weak Password Test\" and includes standard window controls alongside application-specific buttons for Settings (gear icon) and Help (question mark icon).\n\n**Status Indicators and Text:**\nThe primary operation status is indicated by the bold text: **\"Checking for Weak Passwords...\"**. This is followed by a contextual disclaimer: \"This might take some time, depending on Active Directory and workstation performance.\"\n\n**Progress and Control:**\nA horizontal progress bar shows minimal blue fill, suggesting the operation is in the initial stage. To the right, an enabled button labeled **\"Cancel\"** allows the user to terminate the ongoing process.\n\n**Real-Time Metrics:**\nThe following operational data is displayed below the progress bar:\n*   **Start time:** 12:12:20 PM\n*   **Time elapsed:** 00:00:01\n*   **Vulnerabilities:** 39 (Indicating 39 weak passwords have been identified at this early stage of the scan).",
        "position": 5,
        "context": "Depending on the size of your AD and workstation performance, this process may take a minute or long"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/wpt/EN/WPT_Results.png",
        "alt": "This image is a screenshot of the KnowBe4 Weak Password Test application interface, summarizing the results of an Active Directory security scan.\n\n**Summary and Visualization:**\nThe upper section reports **\"FOUND 40 VULNERABILITIES.\"** Two large indicator boxes provide an account status summary: **\"VULNERABLE 26 accounts\"** (Red) and **\"NOT VULNERABLE 6 accounts\"** (Green). A large pie chart graphically represents the distribution of 10 distinct vulnerability types, detailed in an adjacent legend with corresponding counts (e.g., Weak Password: 4, Shared Password: 6, Password Never Expires: 23). Contextual text describes the test methodology (using \"more than 11 million common passwords\").\n\n**Action Element (e):**\nAn orange action button, labeled **\"Rerun Test,\"** is provided below the descriptive text for re-initiating the scan.\n\n**Data Navigation and Filtering (a):**\nThe left panel serves as a vertical navigation pane (**a**), listing the 10 vulnerability categories and an aggregated **\"All Accounts\"** tab (currently active and highlighted in orange), along with the count of affected accounts for each category. The total count for \"All Accounts\" is 32.\n\n**Data Grid and Controls (b, c, d):**\nThe right pane displays the detailed account results in a searchable data grid.\n*   **Search Function (b):** A search field is located above the grid columns.\n*   **Export Controls (d):** Text links labeled **\"Export to Excel\"** and **\"Export to PDF\"** allow data extraction.\n*   **Data Grid (c):** The grid displays account names (e.g., \"ac01,\" \"Administrator,\" \"hr01\") and includes columns for each vulnerability type (e.g., \"Weak Password,\" \"Shared Password,\" \"Empty Password,\" \"Clear Text Password\"). Checkmarks (✓) within the cells indicate which vulnerabilities apply to a specific account.\n\n**Footer:**\nThe footer displays the copyright notice (**Copyright © KnowBe4, Inc. 2024**), the application version (**v. 1.10.3.305**), and the locale (**English (United States)**).",
        "position": 6,
        "context": "ype will remain in the list.\nBelow is additional information about the WPT user interface:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/wpt/FailureVulnerabilities.png",
        "alt": "The image displays a vertical list, likely representing a security audit summary or a filter menu for account vulnerabilities.\n\n**UI Structure and Context:**\nThe interface utilizes a solid orange header bar labeled **\"All Accounts\"** in white text, establishing the scope of the list. Below the header is a list composed of ten discrete, vertically stacked rectangular entries, each corresponding to a specific security weakness or configuration error.\n\n**List Elements and Data:**\nEach entry contains descriptive text on the left and a numerical indicator enclosed in an orange circle on the right. The indicators index the list from 1 to 10.\n\nThe ten security findings listed, in order (1 through 10), are:\n\n1.  **Weak Password**\n2.  **Shared Password**\n3.  **Empty Password**\n4.  **Clear Text Password**\n5.  **Password Not Required**\n6.  **Password Never Expires**\n7.  **LM Hash Password**\n8.  **AES Encryption Not Set**\n9.  **DES-Only Encryption**\n10. **Missing Pre-Authentication**",
        "position": 7,
        "context": "t failure types that can leave your organization vulnerable to an attack, detailed below."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/wpt/EN/WPT_OptionalVulnerabilities.png",
        "alt": "The image displays the **KnowBe4 Weak Password Test (WPT)** application dashboard with a foreground configuration dialog box open.\n\n**I. Application Dashboard Context (Background, Partially Obscured):**\n*   **Vulnerability Summary:** Two primary status indicators show **VULNERABLE (26 accounts)** (Red) and **NOT VULNERABLE (6 accounts)** (Green).\n*   **Navigation Panel:** A vertical menu lists specific vulnerability types (e.g., Weak Password, Shared Password, AES Encryption Not Set, DES-Only Encryption). \"All Accounts\" is currently selected (Orange highlight).\n*   **Data Area (Right):** Contains export options (\"Export to Excel,\" \"Export to PDF\") and a truncated data grid view.\n*   **Application Footer:** Displays the version number (v. 1.10.3.305) and copyright information.\n\n**II. Configuration Dialog (Foreground, Active):**\nThe dialog is titled **\"KnowBe4 Weak Password Test\"** and features a single active tab labeled **\"General.\"**\n\n**A. Optional Vulnerabilities Section:**\nThis section lists two toggles, both currently set to **\"On\"** (blue active state):\n1.  Scan Active Directory accounts for the vulnerability **\"AES Encryption Not Set.\"**\n2.  Scan Active Directory accounts for the vulnerability **\"Password Never Expires.\"**\n\n**B. Custom Passwords Section:**\n*   **Description:** Explains that WPT uses an aggregated database and allows the user to import a text file for additional checks (one password per line).\n*   **Import Function:** An **\"Import...\"** button is provided.\n*   **Current Status:** Text confirms, **\"There is no custom password to be validated.\"**\n\n**C. Dialog Actions:**\n*   The primary action button at the bottom right of the dialog is **\"Save Updates.\"**",
        "position": 8,
        "context": "ings, click the gear icon in the top-right corner of the window."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "manual",
        "password",
        "product",
        "test",
        "weak",
        "wpt"
      ],
      "image_count": 8
    }
  }
}