{
  "article": {
    "id": 115004742808,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/115004742808.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/115004742808.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 20,
    "vote_sum": 35,
    "vote_count": 41,
    "section_id": 4406922364307,
    "created_at": "2017-03-21T15:25:22Z",
    "updated_at": "2025-08-25T15:32:43Z",
    "name": "Add Your Company Logo, Logo URL, and Brand Color to Your Console",
    "title": "Add Your Company Logo, Logo URL, and Brand Color to Your Console",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-08-14T14:42:08Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "add",
      "logo",
      "my logo",
      "company logo",
      "add logos",
      "url logo",
      "company url logo",
      "localized",
      "Console Feature",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>You can add your organization’s logo and brand colors to specific areas of your KnowBe4 console. Branding your KnowBe4 console gives your users a familiar look and feel whether they are using the platform or taking their training in the Learner Experience (LX). You can add your organization’s logo and brand colors to your KnowBe4 console from the <strong>Branding</strong> section of your <strong>Account Settings</strong>.</p>\n<h2 id='h_01HH2JT38K9HJYC0T1FM5K23R1'>Add Your Company Logo URL</h2>\n<p>You can add your company logo URL to your console to customize your phishing templates, training notifications, and landing pages. If you add your company logo URL, you can use the <strong>[[company_logo_img]]</strong> placeholder to populate the logo as-is in your templates.</p>\n<p>If you'd like to insert your logo but need to adjust its size in your template, use the <strong>[[company_logo_url]]</strong> placeholder to populate the logo URL in your source code. Then, you can add size tags to adjust the size of the populated image. For more information on adjusting image size, see the <a href='https://support.knowbe4.com/hc/en-us/articles/233412567-Troubleshooting-Template-Image-Issues#h_01HDHK5058N8M35657YNJQK6QK'>Image Sizing Issues</a> section in the Troubleshooting Template Image Issues article. For more information about placeholders, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204949707'>Placeholders Guide</a>.</p>\n<p>To add your company logo URL to your KnowBe4 console, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 account and click your email address in the top-right corner of the page.</li>\n<li>Select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Information</strong> &gt; <strong>Branding</strong>.</li>\n<li>In the <strong>Company Logo URL</strong> field, paste the URL for your company logo. This URL must be publicly available.\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong> The URL logo must be in GIF, JPG, or PNG format. We recommend that you use a small logo, preferably less than 200px by 200px. Our branded templates and landing pages will automatically resize your logo to an appropriate width or height.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FAQ/companyLogoURL.png'><img src='https://helpimg.s3.amazonaws.com/FAQ/companyLogoURL.png' alt=' ' width='664' height='273'></a></p>\n</li>\n<li>Once you have added your company logo URL, click the <strong>Save Changes</strong> button at the bottom of the page.</li>\n</ol>\n<p>Example of Logo in a Phishing Template</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FAQ/ELR4URL.png'><img src='https://helpimg.s3.amazonaws.com/FAQ/ELR4URL.png' alt=' '></a></p>\n<h2 id='h_01HH2JT38KSKE80W2323P0V6YT'>Add Your Company Logo</h2>\n<p>You can also add your company logo to your console to personalize your users' Learner Experience. Adding your company logo will provide a familiar learning experience for your users when they log in to take their training.</p>\n<p>To add your company logo to the Learner Experience, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 account and click on your email address in the top-right corner of the page.</li>\n<li>Select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Information</strong> &gt; <strong>Branding</strong>.</li>\n<li>Under <strong>Company Logo</strong>, click the <strong>Manage</strong> button.\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong> The company logo you select must be in JPEG, JPG, or PNG format. The image size must be less than 300 KB in size and 166 px in width by 42 px in height to fit the console. If your company logo doesn’t meet these size requirements, you can crop your logo using the image editor.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FAQ/companyLogoConsole.png'><img src='https://helpimg.s3.amazonaws.com/FAQ/companyLogoConsole.png' alt=' '></a></p>\n</li>\n<li>To save your changes, click the <strong>Save Changes</strong> button at the bottom of the page.</li>\n</ol>\n<p>Example of Logo in the Learner Experience (LX)</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FAQ/ELR4Console.png'><img src='https://helpimg.s3.amazonaws.com/FAQ/ELR4Console.png' alt=' '></a></p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you're a <a href='https://support.knowbe4.com/hc/en-us/articles/360013635634-Partner-and-Multi-Account-Getting-Started-Guide#h_01HBV7XEBMRXTSJXPAZPAJKXJE'>reseller, MSP or multi-account organization</a>, you can also add your logo in the same way in your management portal. Your logo will output to all of your accounts.</div>\n</div>\n<h2 id='h_01HH2JT38KPZYTJB5M01W8Z7G5'>Add Your Brand Color</h2>\n<p>You can add your brand color to your users’ Learner Experience. Adding a brand color to the Learner Experience provides your users with a familiar experience when they take their training. We recommend that you match your brand color to one of the main colors of your company logo.</p>\n<p>To add your brand color to the Learner Experience, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 account and click on your email address in the top-right corner of the page.</li>\n<li>Select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Information</strong> &gt; <strong>Branding</strong>.</li>\n<li>In the <strong>Brand Color</strong> field, click the color box icon to select a color. Or, you can enter a hex color code in the text field.\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/FAQ/main_theme_color.png'><img src='https://s3.amazonaws.com/helpimg/FAQ/main_theme_color.png' alt=' '></a></p>\n</li>\n<li>To save your changes, click the <strong>Save Changes</strong> button at the bottom of the page.</li>\n</ol>\n<p>To learn more about branding content in the Learner Experience, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360014116634-Learner-Experience-LX-Guide#h_01HC01AKG95BPZXHH446VYF97N'>Customization</a> section of our Learner Experience Guide.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/115004742808-Add-Your-Company-Logo-Logo-URL-and-Brand-Color-to-Your-Console",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/FAQ/companyLogoURL.png",
        "alt": "A configuration section titled **Branding** is displayed. Under this heading, there is a field labeled **Company Logo URL**, followed by a grey information icon enclosed in a circle (`(?)`). Below the label is an empty, horizontally long text input field designed for entering a Uniform Resource Locator (URL). The input field has rounded corners and a light grey border.",
        "position": 1,
        "context": "s and landing pages will automatically resize your logo to an appropriate width or height."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/FAQ/ELR4URL.png",
        "alt": "The image is a screenshot of an email or template preview focused on security awareness content, specifically a \"Scam of the Week\" notification.\n\n**UI Elements and Configuration (Top Section):**\n\n*   **Email Metadata:** Displays required email headers:\n    *   **From:** `ScamoftheWeek@KnowBe4.com`\n    *   **Reply-to:** `ScamoftheWeek@KnowBe4.com`\n    *   **Subject:** `Scam of the Week: Watch Out for Sean Connery Related Scams`\n*   **Test Fields (Top Right):** A utility interface includes two standard input fields with placeholders: `Email` and `Domain`. Below these fields is a link, marked with a blue envelope icon and associated checkbox, labeled: `Send me a test email`.\n\n**Branding and Layout (Middle Section):**\n\n*   **Logo Placeholder:** A centralized, horizontally oriented graphic banner is present. The banner has rounded corners and a yellow background bordered in orange. It contains the large, orange text **Your Logo**, flanked by two stylized golden trophy icons.\n\n**Content (Body Section):**\n\n*   **Main Headline:** A large, bold headline repeats the subject line: `Scam of the Week: Watch Out for Sean Connery Related Scams`.\n*   **Body Text:** A paragraph follows the headline, discussing context for the scam: \"Over the weekend, news broke that actor Sean Connery, who is known for portraying James Bond and countless other roles, passed away at the age of 90. Bad guys will be sure to exploit this celebrity death in a number of ways, so be extra cautious of any mention of Sean Connery in emails, text messages, and social media posts.\"",
        "position": 2,
        "context": "ve Changes button at the bottom of the page.\n\nExample of Logo in a Phishing Template"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/FAQ/companyLogoConsole.png",
        "alt": "This image displays a section of a configuration interface dedicated to company branding settings.\n\n**Context and Structure:**\nThe page section is titled **Branding** (H1/Section Header). It presents two distinct methods for configuring the company logo.\n\n**UI Elements and Functionality:**\n\n1.  **Company Logo URL:**\n    *   **Label:** \"Company Logo URL\"\n    *   **Contextual Help:** A question mark icon (?) follows the label, indicating a contextual help or tooltip feature.\n    *   **Input Field:** A single, long, empty text field is provided for entering a logo's direct URL (HTTP/HTTPS link).\n\n2.  **Company Logo (Management):**\n    *   **Label:** \"Company Logo\"\n    *   **Contextual Help:** A question mark icon (?) follows the label.\n    *   **Action Button:** A solid blue primary action button labeled **Manage** is positioned beneath the label. This button is designed to trigger a modal or navigate to a sub-screen for uploading, selecting, or otherwise administering logo assets directly (as opposed to specifying a URL).",
        "position": 3,
        "context": "o doesn’t meet these size requirements, you can crop your logo using the image editor."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/FAQ/ELR4Console.png",
        "alt": "The image displays a horizontal application header navigation component, separated from the content area by a thick orange horizontal rule.\n\n**UI Elements and Context:**\n\n1.  **Branding Placeholder:** Located on the left, a rounded rectangular element features an orange border and a pale yellow background. It contains the placeholder text, **“Your Logo”** (in orange), next to a solid gold trophy icon, signifying branding or gamification.\n2.  **Navigation Links:** Three primary navigation options are listed in all capital letters:\n    *   **DASHBOARD** (Inactive link, dark grey text).\n    *   **PHISHING** (Active selection, highlighted with white text against a solid blue background with rounded corners).\n    *   **TRAINING** (Inactive link, dark grey text).\n\nThe navigation structure indicates the user is currently viewing the **PHISHING** section of the application.",
        "position": 4,
        "context": "strong> button at the bottom of the page.\n\nExample of Logo in the Learner Experience (LX)"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/FAQ/main_theme_color.png",
        "alt": "This image displays a segment of a web application's configuration panel under the primary heading **Branding**. It presents three settings fields for customization:\n\n1.  **Company Logo URL:** A text input field associated with the label \"Company Logo URL\" and a contextual help icon (question mark in a circle). The input field is currently empty.\n2.  **Company Logo:** A control associated with the label \"Company Logo\" and a contextual help icon. It features a prominent blue action button labeled **Manage**.\n3.  **Brand Color:** This field is visually emphasized by an orange bounding box. The control is labeled **Brand Color** (with a contextual help icon) and includes a composite input element showing the current selected color. The element displays a color swatch (a small orange circle) followed by a text input field containing the corresponding hexadecimal color code: **#f26421**.",
        "position": 5,
        "context": "Or, you can enter a hex color code in the text field."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "and",
        "brand",
        "company",
        "console",
        "logo",
        "your"
      ],
      "image_count": 5
    }
  }
}