{
  "id": 12734085457555,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/12734085457555.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/12734085457555.html",
  "author_id": 6101752692627,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 5,
  "vote_sum": 8,
  "vote_count": 8,
  "section_id": 4406922364307,
  "created_at": "2023-01-04T18:14:21Z",
  "updated_at": "2025-10-27T20:03:06Z",
  "name": "KnowBe4 Console Account Settings: Training",
  "title": "KnowBe4 Console Account Settings: Training",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-05-14T20:40:46Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "localized",
    "answerbot",
    "answerbot_kmsat"
  ],
  "body": "<p>In this article, you'll learn about the Training section of your KSAT <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/226457887.html' target='_self'>account settings</a>. In the <strong>Training</strong> section, you can update your training and Learner Experience (LX) settings.</p>\n<h2 id='h_01HCDFEA0DQC2CQQ9XGM5B7NB5'>Training Settings</h2>\n<p>In the <strong>Training Settings</strong> section, you can update your training settings.</p>\n<p>See below for more information about the settings in this section:<a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Training/EN/TrainingSettingsAnnotated2.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Training/EN/TrainingSettingsAnnotated2.png' alt=' ' width='512' height='357'></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Add Content Surveys:</strong> Enable this setting to turn on the <strong>AddContent Survey</strong> option for all new training campaigns. If you enable this setting, you'll still have the option to disable content surveys when you create new training campaigns. See our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360023815053.html' target='_self'>Content Survey Guide</a> for more information about surveys.</li>\n<li>\n<strong>Use Direct Links in Notifications</strong>: Turn on this setting to enable direct links to training content in your training notifications. When enabled, the assignment list placeholders will take your users directly to their training content in the Learner Experience. When disabled, the assignment list placeholders will display as plain text instead of clickable links. See our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/6618204636819.html'>Training Information Placeholders Guide</a> for more information about placeholders.\n<div class='callout callout-remember'>\n<div class='callout__content'>\n<strong>Important: </strong><span style='color: #2c2c2c;'>Direct links work best when the user is already authenticated. If the user is not authenticated, they must log in to the Learner Experience and select the direct-to-training link to open their training.</span>\n</div>\n</div>\n</li>\n<li>\n<strong><span style='color: #2c2c2c;'>Track SCORM Interactions</span></strong><span style='color: #2c2c2c;'>: Enable this setting to send the users’ responses in interactive SCORM activities to the KnowBe4 learning management system (LMS). When disabled, user responses are not recorded. KnowBe4’s SCORM files send quiz interaction data. SCORM files uploaded by customers through the Uploaded Content subtab of the ModStore can send data from other types of interactions.</span> See the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360019644394.html'>Frequently Asked Questions (FAQ)</a> section of the Upload Custom Training Content article for a list of interaction types.</li>\n<li>\n<strong>Overwrite Fixed Return-path Address with Sender Address:</strong> We recommend selecting this check box if you use SPF alignment checks and want to spoof your domain. Please be sure to whitelist KnowBe4's servers before you select this check box.</li>\n<li>\n<strong>Add Custom Header:</strong> Select this check box to add a custom header name and header value to training notifications. If you select this check box, you must enter text in the <strong>Header Name</strong> and <strong>Header Value</strong> fields. If you whitelist your training notifications by email header, you can enable this setting and then whitelist your custom header text for increased security.</li>\n<li>\n<strong><span style='color: #2c2c2c;'>Enable Custom DKIM Signature:</span></strong><span style='color: #2c2c2c;'> Turn on this setting to enable a custom DKIM signature for training notifications.</span> For more information about this setting, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500010872521.html' target='_self'>Enable and Customize DKIM Signatures</a> article.</li>\n</ol>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you have our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/6654432814355.html'>SecurityCoach</a> product, your <strong>Training Email Headers</strong> settings will be applied to your SecurityCoach emails.</div>\n</div>\n<h2 id='h_01HCDFEA0DQ5ZEY9MJGJ129CHK'>Learner Experience (LX)</h2>\n<p>In this section, you can customize your users’ Learner Experience (LX).</p>\n<p>See below for more information about the settings in this section. If you prefer video tutorials, you can also watch our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360016839774.html' target='_self'>Learner Experience (LX) Account Settings</a> video for more information.<a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Training/EN/LearnerExperienceSettingsAnnotated.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Training/EN/LearnerExperienceSettingsAnnotated.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Default Training Language:</strong> Select your preferred language from the drop-down menu. This language will apply to the Learner Experience (LX) and content available in that language unless a user selects a different <strong>Training Language</strong>. If a user’s language is not available, the account’s default language will be used.</li>\n<li>\n<strong>Enable Localized Training Notifications:</strong> Enable this setting to send training notifications in each user's language. If a user’s language is not available, the account’s default language will be used. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360060622513.html' target='_self'>Localization Guide</a>.</li>\n<li>\n<strong>Reduce Visual Effects in Learner Experience:</strong> Select this check box to reduce visual effects in the Learner Experience. We recommend that you enable this setting if you have slow workstations in your environment or if you use Citrix or Flash-based browsers.</li>\n<li>\n<strong>Disable Tour Prompt:</strong> Select this check box to disable the tour prompt in the Learner Experience for your users. Users still have the option to launch the tour manually.</li>\n<li>\n<strong>Enable KnowBe4 Learner App:</strong> Enable this setting to allow your users to complete training through the KnowBe4 Learner App.<br>You can select the <strong>Select Notification Recipients</strong> drop-down menu below to send an email notification with app setup instructions to your users and groups. Notifications will immediately be sent when you click the <strong>Send </strong>button.</li>\n<li>\n<strong>Allow users to request login emails:</strong> Select this check box to allow your users to request login emails that contain a link and QR code to log in to the KnowBe4 Learner App.</li>\n<li>\n<strong>Demo KnowBe4 Learner App</strong>: Click this link to activate the KnowBe4 Learner App tab in your Learner Experience for 30 minutes. Once the tab is activated, you will be able to demo the app. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/9776769113747.html' target='_self'>KnowBe4 Learner App Admin FAQ</a> article.</li>\n<li>\n<strong>Enable Customized Need Help Button:</strong> Enable this setting to customize the information that users will see if they click the <strong>Need Help?</strong> button. When selected, a text field will display. In this text field, enter the URL or contact email address of your choice. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014116634.html' target='_self'>Learner Experience Guide</a>.</li>\n<li>\n<strong>Enable Learner Dashboard:</strong> Enable this setting to allow your users to view their Learner Dashboard. The Learner Dashboard shows your users a summary of their training completion, including their training status and training due dates. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360051484394.html'><span style='color: #1155cc;'>Learner Dashboard Overview</span></a> article.</li>\n<li>\n<strong>Enable Phishing Information:</strong> After you enable the Learner Dashboard, you can turn on this setting to allow users to view their own phishing test results.</li>\n<li>\n<strong>Enable Risk Information:</strong> After you enable the Learner Dashboard, you can turn on this setting to allow users to view their Personal Risk Score.</li>\n<li>\n<strong>Limit User Information Shown:</strong> After you enable the Team Dashboard, you can turn on this setting to limit the training and phishing details displayed on the <strong>Team Details for the Last Year</strong> tile. When this is enabled, the Team Dashboard will only show aggregated statistics for the team.</li>\n<li>\n<strong>Enable Team Dashboard:</strong> Enable this setting to add a Team Dashboard to the LX that allows managers to view their team's training progress and other statistics.</li>\n<li>\n<strong>Enable Phishing Information:</strong> After you enable the Team Dashboard, you can turn on this setting to display the team’s phishing results.</li>\n<li>\n<strong>Enable Risk Information:</strong> After you enable the Team Dashboard, you can turn on this setting to display the team’s current combined Risk Score.</li>\n<li>\n<strong>Enable Optional Training Campaigns:</strong> Turn on this setting if you would like the option to enroll your users in optional training campaigns. After you create an optional training campaign, the optional content will be added to your users’ LX. To view this optional content, your users can log in to their LX and navigate to the Library tab. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500002656002.html' target='_self'>Optional Learning Guide</a>.</li>\n<li>\n<strong>Enable AI-recommended learning, <em>powered by AIDA</em>:</strong> This feature is only available to Diamond accounts. Turn on this setting to provide relevant optional training content for your users without creating an optional training campaign. When this setting is enabled, all users will be able to view the <strong>Library</strong> tab in their LX. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500002656002.html' target='_self'>Optional Learning Guide</a>.</li>\n<li>\n<strong>Enable Badges:</strong> Turn on this setting if you would like to enable badges. For more information, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014116634.html' target='_self'>Badges</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014116634.html' target='_self'>Learner Experience Guide</a>.</li>\n<li>\n<strong>Badges Available to Users:</strong> Select the badges that you would like to allow users to earn. For more information, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014116634.html' target='_self'>Badges</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014116634.html' target='_self'>Learner Experience Guide</a>.</li>\n<li>\n<strong>Enable Leaderboards:</strong> Turn on this setting to enable leaderboards for your KSAT console.</li>\n<li>\n<strong>Leaderboard Types:</strong> Here, you can select either the <strong>Individual Leaderboard</strong> or <strong>Group Leaderboard</strong> option from this drop-down menu. For more information, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014116634.html'>Leaderboards</a> section of our Learner Experience Guide.</li>\n<li>\n<strong>Leaderboard Time Period:</strong> From this drop-down menu, select the timeframe for the leaderboard. This timeframe will be used to calculate points and rankings.</li>\n<li>\n<strong>Groups to Include in Training Leaderboard:</strong> If you select the <strong>Group Leaderboard </strong>option above, this drop-down menu will display. Select three to 25 groups to include in the leaderboard.</li>\n<li>\n<strong>Exclude training campaigns with no due date:</strong> Select this check box if you would like to exclude training campaigns that do not have a due date from the leaderboard. You can enable this setting to keep optional content from impacting the leaderboard.</li>\n</ol>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/12734085457555-KnowBe4-Console-Account-Settings-Training",
  "images": [
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Training/EN/TrainingSettingsAnnotated2.png",
      "alt": "The image displays a configuration panel titled **Training**, subdivided into two major settings groups: **Training Settings** and **Training Email Headers**.\n\n## Training Settings\n\nThis section consists primarily of three enabled toggle switches and one data duration selector:\n\n1.  **Toggle (Enabled):** Add Content Surveys\n2.  **Toggle (Enabled):** Use Direct Links in Notifications\n3.  **Toggle (Enabled):** Track SCORM Interactions\n4.  **Dropdown Selector:** Labeled \"Select Quiz Interaction Data Storage Duration.\" The current value selected is **24 months**.\n\n(All three toggles include an informational help icon.)\n\n## Training Email Headers\n\nThis section features three disabled controls related to email deliverability and customization:\n\n1.  **Checkbox (Disabled):** Overwrite Fixed Return-path Address with Sender Address\n2.  **Checkbox (Disabled):** Add Custom Header\n3.  **Toggle (Disabled/Gray):** Enable Custom DKIM Signature\n\n(All three header controls include an informational help icon.)",
      "position": 1,
      "context": "r more information about the settings in this section:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/Training/EN/LearnerExperienceSettingsAnnotated.png",
      "alt": "This image is a technical manual representation of a software configuration screen titled \"Learner Experience,\" controlling user interface settings for end users.\n\n**Key Sections and UI Elements:**\n\n1.  **Learner Experience (General Settings):**\n    *   **Default Training Language (a):** Dropdown set to \"English (United States).\"\n    *   **Link:** \"View Our Localization Guide.\"\n    *   **Checkboxes (b, c, d) (All unchecked):**\n        *   Enable Localized Training Notifications\n        *   Reduce Visual Effects in Learner Experience\n        *   Disable Tour Prompt\n\n2.  **KnowBe4 Learner App:**\n    *   **Toggle (e) (Enabled):** \"Enable KnowBe4 Learner App.\"\n    *   **Checkbox (f) (Checked):** \"Allow users to request login emails.\"\n    *   **Select Notification Recipients:** Input field showing \"Select one or more user groups...\" followed by a \"Send\" button.\n    *   **Link (g):** \"Demo KnowBe4 Learner App.\"\n\n3.  **Learner Assistance:**\n    *   **Toggle (h) (Unchecked):** \"Enable Customized Need Help Button.\"\n\n4.  **Learner Dashboard:**\n    *   **Toggles (i, j, k) (All Enabled):**\n        *   Enable Learner Dashboard\n        *   Enable Phishing Information\n        *   Enable Risk Information\n\n5.  **Team Dashboard:**\n    *   **Toggle (l) (Unchecked, highlighted yellow):** \"Limit User Information Shown.\"\n    *   **Toggles (m, n, o) (All Enabled):**\n        *   Enable Team Dashboard\n        *   Enable Phishing Information\n        *   Enable Risk Information\n\n6.  **Optional Learning:**\n    *   **Toggles (p, q) (Both Enabled):**\n        *   Enable Optional Training Campaigns\n        *   Enable AI-recommended learning, powered by AIDA\n    *   **Link:** \"View Our Optional Learning Guide.\"\n\n7.  **Badges:**\n    *   **Toggle (r) (Enabled):** \"Enable Badges.\"\n    *   **Badges Available to Users (s):** Multi-select tag field displaying numerous selected badges, including \"Cyber Hero Badge,\" \"Eager Beaver Badge,\" \"Eagle Eye Badge,\" \"Early Bird Badge,\" \"Graduate Badge,\" \"Hat Trick Badge,\" \"Hyperdrive Hero Badge,\" \"Lightning Fast Badge,\" \"Linguist Badge,\" \"New Recruit Badge,\" \"Night Owl Badge,\" \"On the Go,\" \"Pioneer Badge,\" and \"Policy Professional Badge.\"\n    *   **Link:** \"View Our Badges Guide.\"\n\n8.  **Leaderboard:**\n    *   **Toggle (t) (Enabled):** \"Enable Leaderboards.\"\n    *   **Leaderboard Types (u):** Dropdown set to \"Group Leaderboard (Training).\"\n    *   **Leaderboard Time Period (v):** Dropdown set to \"Past 30 Days.\"\n    *   **Groups to Include in Training Leaderboard (w):** Multi-select tag field displaying three selected groups: \"Justice League,\" \"The Avengers,\" and \"X-Men.\"\n    *   **Checkbox (x) (Unchecked):** \"Exclude training campaigns with no due date.\"\n\n*(Note: All controls labeled with a question mark (?) provide context-sensitive help.)*",
      "position": 2,
      "context": "count Settings video for more information."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "account",
      "console",
      "settings",
      "training"
    ],
    "image_count": 2
  }
}