{
  "id": 16567660822163,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/16567660822163.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/16567660822163.html",
  "author_id": 1534339111301,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 1,
  "vote_sum": 2,
  "vote_count": 2,
  "section_id": 20416655766931,
  "created_at": "2023-05-11T23:27:39Z",
  "updated_at": "2025-10-09T17:04:04Z",
  "name": "PhishER Settings: Account",
  "title": "PhishER Settings: Account",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-09-23T21:07:05Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "localized",
    "answerbot",
    "answerbot_phisher"
  ],
  "body": "<p>In the <strong>Account</strong> section of your <a href='https://support.knowbe4.com/hc/en-us/articles/360013919314' target='_self'>PhishER Settings</a>, you can generate reporting email addresses, set up your email server, manage custom email templates and notifications, and more.</p>\n<h2 id='h_01HQNFFDYF6MXQKSPW1ZR518FD'>Reporting Emails</h2>\n<p>From the <strong>Reporting Emails</strong> subtab, you can view your reporting email addresses and generate new reporting email addresses. Reporting email addresses are used to forward your users’ reported emails to your PhishER <strong>Inbox</strong>. You can set up a reporting email address to work with the <a href='https://support.knowbe4.com/hc/en-us/articles/208969608' target='_self'>Phish Alert Button (PAB)</a> to forward emails automatically. Or, if your organization doesn't use the PAB, you can use the reporting email address to forward emails manually. See the subsections of this article below to learn more about each method.</p>\n<p>For more information about the settings in the <strong>Reporting Emails</strong> subtab, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/reportingEmails.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/reportingEmails.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Generate New Email</strong>: You can click this button to generate a new reporting email address. You can generate as many reporting email addresses as you would like. For example, you could generate multiple reporting email addresses if your organization would like to use different reporting email addresses for specific user groups, PAB instances, or office locations.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>All emails forwarded to your reporting email addresses are sent to your PhishER <strong>Inbox</strong>.</div>\n</div>\n</li>\n<li>\n<strong>Reporting Email</strong>: This column displays your reporting email addresses.</li>\n<li>\n<strong>Tag</strong>: This column displays the custom tags associated with your reporting email addresses. To add a tag, click the <strong>edit</strong> icon and enter your tag in the field. Then, press <strong>Return</strong> or <strong>Enter</strong> to save your change. You can create one custom tag for each reporting email address. PhishER will automatically assign your tag to messages that the reporting email address forwards to your PhishER <strong>Inbox</strong>.</li>\n<li>\n<strong>Active</strong>: In this column, you can use the toggle button to enable or disable a reporting email address.</li>\n<li>\n<strong>Forwarded Only</strong>: In this column, you can select the check box to only allow reporting email addresses to receive emails that have been forwarded manually.</li>\n<li>\n<strong>Actions</strong>: In this column, you can click the <strong>paper</strong> icon to copy the reporting email address. You can click the <strong>trashcan</strong> icon to delete the reporting email address.</li>\n</ol>\n<h3 id='h_01HQNFFDYFQNZ0K8H9XN2GYE37'>Forwarding Reporting Emails Using the PAB</h3>\n<p>If your organization has installed the Phish Alert Button (PAB), you can set up a reporting email address to forward your users’ reported emails to your PhishER <strong>Inbox</strong> automatically. To forward emails with the PAB, you must add a reporting email address to the <a href='https://support.knowbe4.com/hc/en-us/articles/208969608#ENABLING' target='_self'>Phish Alert</a> section of your KSAT <strong>Account Settings</strong>.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>If you forward emails using the PAB, the entire message, including the header, will be forwarded to your PhishER <strong>Inbox</strong>.</div>\n</div>\n<p>To set up automatic email forwarding with the PAB, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your PhishER platform.</li>\n<li>Navigate to <strong>Settings</strong> &gt; <strong>Reporting Emails</strong>.</li>\n<li>In the <strong>Actions</strong> column, click the <strong>paper</strong> icon to copy your reporting email address.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/reportingEmails-CopyEmail.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/reportingEmails-CopyEmail.png' alt=' '></a></p>\n</li>\n<li>Log in to your KSAT console.</li>\n<li>Click your email address at the top-right corner of the page. From the drop-down menu that opens, select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Integrations</strong> &gt; <strong>Phish Alert</strong>.</li>\n<li>Click the <strong>+</strong> icon next to the PAB instance to view your settings.</li>\n<li>In the <strong>Send Non-Simulated Emails to:</strong> field, enter your reporting email addresses. For more information about this field, see the <a href='https://support.knowbe4.com/hc/en-us/articles/208969608#ENABLING' target='_self'>Enable and Configure PAB</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608' target='_self'>Phish Alert Button (PAB) Product Manual</a>.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>If your organization enables and configures the PAB after enabling PhishER, the reporting email address will automatically populate in the <strong>Send Non-Simulated Emails to:</strong> field. If you would like to remove this email address from the list, click the <strong>Remove PhishER Email Addresses</strong> button.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/RemovePERAddresses.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/RemovePERAddresses.png' alt=' '></a></p>\n</div>\n</div>\n</li>\n<li>Click the <strong>Save Phish Alert Settings</strong> button.</li>\n<li>At the bottom of the page, click the <strong>Save Changes</strong> button. </li>\n</ol>\n<h3 id='h_01HQNFFDYFHKREXNC389RKH0TP'>Manually Forwarding Report Emails</h3>\n<p>If your organization does not use the Phish Alert Button (PAB), your users will need to forward emails to your reporting email addresses manually. We recommend that you set up an alias email address in your mail server to route forwarded emails to your PhishER reporting email address. Then, instruct your users to forward all suspicious emails to the alias email address.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>As an alternative option, you can also download the EML file of an email, attach the EML file in a new email, and then send the new email to PhishER. PhishER will recognize this process as a PAB report. If you use the PAB to forward an email while the <strong>Forwarded Only</strong> check box is selected for the reporting email address, PhishER will recognize this process as a manual report. The forwarded email will be displayed with the <a href='https://support.knowbe4.com/hc/en-us/articles/208969608-Phish-Alert-Button-PAB-Product-Manual#h_01JNS7XXPJZR03P46S452J8KNJ'>Forwarded Email Prefix</a> in the subject line, and the original email attached as an EML file.</div>\n</div>\n<p>For more information about creating an alias email address in common email clients, see the list below:</p>\n<ul role='list'>\n<li>Apple iCloud: <a href='https://support.apple.com/guide/icloud/add-and-manage-email-aliases-mm6b1a490a/icloud' target='_blank' rel='noopener noreferrer'>Add and manage email aliases for iCloud Mail on iCloud.com</a>\n</li>\n<li>Gmail (Google Workspace): <a href='https://support.google.com/a/answer/33327' target='_blank' rel='noopener noreferrer'>Add or delete an alternate email address (email alias)</a>\n</li>\n<li>Microsoft Outlook: <a href='https://support.microsoft.com/en-us/office/add-or-remove-an-email-alias-in-outlook-com-459b1989-356d-40fa-a689-8f285b13f1f2' target='_blank' rel='noopener noreferrer'>Add or remove an email alias in Outlook.com</a> </li>\n</ul>\n<h2 id='h_01HQNFFDYGQ4EW03XENFFVYNHF'>Email Server</h2>\n<p>From the <strong>Email Server</strong> subtab, you can view and edit information about your default email template and email server settings for custom emails in your PhishER platform. If you create a PhishER action on the <strong>Actions</strong> tab and select the <strong>Send Email</strong> option for the <strong>Choose how you would like to report this action</strong> step, these email server settings will automatically populate in your email template.</p>\n<p>To adjust your default email template and related email server information, edit the settings on the <strong>Email Server</strong> subtab. For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/emailServerSettings.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/emailServerSettings.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Default From Address</strong>: Enter the email address that you would like to populate in the <strong>From</strong> field in your email template.</li>\n<li>\n<strong>Default From Name</strong>: Enter the name that you would like to populate in the <strong>From Name</strong> field in your email template.</li>\n<li>\n<strong>Default Reply to Address</strong>: Enter the email address that you would like to populate in the <strong>Reply To</strong> field in your email template.</li>\n<li>\n<strong>Default Reply to Name</strong>: Enter the name that you would like to populate in the <strong>Reply To Name</strong> field in your email template.</li>\n<li>\n<strong>X-Phisher header</strong>: If you would like to attach an email header to your custom email for flagging or tracking purposes, enter a custom email header in this field. Your header will be attached to the outgoing email from your PhishER platform.</li>\n<li>\n<strong>Email Headers</strong>: Select this check box if you would like to overwrite the fixed return-path email address when you enter an email address in the<strong> From</strong> field for a <a href='https://support.knowbe4.com/hc/en-us/articles/360019467573' target='_self'>custom email template</a>.</li>\n<li>\n<strong>DKIM Signature</strong>: Select this check box to enable DKIM signatures in your PhishER platform. A DKIM signature is a line of text that proves if a PhishER notification is authentic. DKIM signatures can be used for notifications from KnowBe4 or custom notifications that you've created. To learn more about DKIM signatures, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4403660264339' target='_self'>How to Enable and Customize PhishER DKIM Signatures</a> article.</li>\n<li>\n<strong>Configure DKIM</strong>: Select the type of signing domain you would like to use for DKIM signatures. To use KnowBe4's signing domain, select <strong>Use KnowBe4's Signing Domain</strong>. To use a signing domain from your organization, select <strong>Use Your Signing Domain</strong>.</li>\n<li>\n<strong>Add Custom Signing Domain</strong>: If you selected <strong>Use Your Signing Domain</strong>, click this button to open the <strong>Add Custom Signing Domain</strong> pop-up window. From the drop-down menu, select a signing domain. Then, click <strong>Add</strong> to add the signing domain to your platform.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/EmailServer_Settings_AddCSD.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/EmailServer_Settings_AddCSD.png' alt=' ' width='638' height='225'></a></p>\n</li>\n<li>\n<strong>Save</strong>: Click this button to save your email server settings.</li>\n<li>\n<strong>Allowed Domains</strong>: This section displays a list of all the domains that have been added and verified in your KSAT <strong>Account Settings</strong>. For more information about allowed domains, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013430414' target='_self'>How to Add and Verify Domains</a> article.</li>\n</ol>\n<h2 id='h_01HQNFFDYGH78P8WSM7CYDKCFB'>Email Templates</h2>\n<p>From the <strong>Email Templates</strong> subtab, you can view all of your custom email templates and create new custom templates. You can set up custom emails to use in your PhishER actions. If an action is triggered and an email template is attached to the action, PhishER will automatically send the email template to your specified recipients. To create a custom email template, click the <strong>New Email Template</strong> button at the top-right corner of the page. For more information about email templates, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360019467573' target='_self'>How to Create a Custom Email Template in PhishER</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/emailTemplates_Settings.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/emailTemplates_Settings.png' alt=' '></a></p>\n<h2 id='h_01HQNFFDYGM80E4ERB0W4W1DX5'>Notifications</h2>\n<p>From the <strong>Notifications</strong> subtab, you can view all of your notifications and create new notifications. Notifications are emails that you can send to your admins to inform them of changes to your saved queries in the PhishER <strong>Rooms</strong> tab. For example, you can notify admins once a room has less than 10 emails or more than 50 emails after a set period of time.</p>\n<p>For more information about the <strong>Notifications</strong> subtab, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/notifications1.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/notifications1.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>New Notification</strong>: You can click this button to create a new notification.</li>\n<li>\n<strong>Search</strong>: You can use this search bar to find specific notifications.</li>\n<li>\n<strong>Name</strong>: This column displays the notification’s name.</li>\n<li>\n<strong>Target Room</strong>: This column displays the PhishER room that is mentioned in the notification.</li>\n<li>\n<strong>Created At</strong>: This column displays the date and time of when the notification was created.</li>\n<li>\n<strong>Updated At</strong>: This column displays the date and time of when the notification was last updated.</li>\n<li>\n<strong>Actions</strong>: This column displays the actions available to perform for the notification. You can click the <strong>trashcan</strong> icon to delete the notification.</li>\n</ol>\n<h3 id='h_01HQNFFDYGC430KZHCYP59583V'>Creating Notifications</h3>\n<p>To create a notification, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your PhishER platform.</li>\n<li>Navigate to <strong>Settings</strong> &gt; <strong>Notifications</strong>.</li>\n<li>Click the <strong>New Notificatio</strong>n button in the top-right corner of the page. The <strong>New Notification</strong> pop-up window will open. For more information about the fields in this pop-up window, see the screenshot and list below:\n<ol role='list' type='a'>\n<li>\n<strong>Notification Name</strong>: In this field, enter a name for your notification.</li>\n<li>\n<strong>Select an existing saved query</strong>: From this drop-down menu, select the PhishER room you would like to mention in the notification.</li>\n<li>\n<strong>Thresholds</strong>: Select the <strong>Less Than</strong> and <strong>More Than</strong> check boxes to use one or both of the limit options. Then, enter numbers in the <strong>Emails</strong> fields to set the limits that will trigger PhishER to send the notification.</li>\n<li>\n<strong>Timeframe</strong>: Enter a number in the field and select a frequency from the drop-down menu to determine how often PhishER will send the notification.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>You must enter a timeframe of 10 or more minutes, 1 to 90 hours, or 1 to 90 days.</div>\n</div>\n</li>\n<li>\n<strong>Deliver to</strong>: In this field, enter the email addresses of the users who should receive the notification. Separate each email address with a line break.</li>\n</ol>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/PhishER_NewNotification.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/PhishER_NewNotification.png' alt='New Notification'></a></p>\n</li>\n<li>Click <strong>Save</strong> to create your notification.</li>\n</ol>\n<h2 id='h_01J7EJMERWJKYPW1SFZW3MMDHX'>Downloads</h2>\n<p>From the <strong>Downloads</strong> subtab, you can download any reports or large files generated in your console. For example, you can select a report from the <strong>Reports</strong> tab or select multiple reported messages in your PhishER <strong>Inbox</strong> and click the <strong>Download CSV</strong> button. The CSV file will display in the list of files when it is fully generated and available to download. Files that include more than 5000 messages from your PhishER <strong>Inbox</strong> will be displayed in the list of downloadable files. You can change the maximum item limit in the <strong>Preferences</strong> tab. Smaller files from your PhishER <strong>Inbox</strong> will automatically download through your browser and will be available from your browser’s download history.</p>\n<p>For more information about the <strong>Downloads</strong> subtab, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Settings/Downloads/EN/PERDownloads.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Settings/Downloads/EN/PERDownloads.png' alt=' ' width='983' height='377'></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Name</strong>: This column displays the file’s name.</li>\n<li>\n<strong>Created At</strong>: This column displays the date and time of when the file was generated to download.</li>\n<li>\n<strong>Expires At</strong>: This column displays the date and time of when the file will be removed from the list automatically.</li>\n<li>\n<strong>Actions</strong>: This column displays the actions available to perform for the file. You can click the <strong>download</strong> icon to download the file. You can click the <strong>trashcan</strong> icon to delete the file.</li>\n</ol>\n<h3 id='h_01J7EJRJNSQD15CSJZHTN77TTK'>Viewing Alerts for Downloads and Comments</h3>\n<p>When generated files are ready to access, an alert displays as a <strong>bell</strong> icon on the <strong>user</strong> icon at the bottom of the navigation bar. Click the <strong>bell</strong> icon to open the <strong>Alerts</strong> pop-up window and view alerts for all large files that are ready to download. New alerts are displayed in bold text. You can click the <strong>download</strong> icon to download a file. <strong>Alerts</strong> will also generate an event whenever a user responds to a message sent from the PhishER <strong>Discussion</strong> panel. You can click the <strong>email</strong> icon to navigate directly to a user's response. When you don’t have any new alerts, you can click the <strong>user</strong> icon and click <strong>Alerts</strong> to open the <strong>Alerts</strong> pop-up window. Previously viewed alerts are displayed in normal text.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>The <strong>Alerts</strong> pop-up window is user-specific, so you can only receive alerts for files that you generated in your console.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Settings/Downloads/EN/Alerts_New.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Settings/Downloads/EN/Alerts_New.png' alt=' '></a></p>\n<h2 id='h_01HQNFFDYGZ4296869BBKQS3JJ'>Data Retention</h2>\n<p>From the <strong>Data Retention</strong> subtab, you can set how long you would like for your data to be stored in PhishER. Data retention is calculated as the amount of time that has passed since a user reported a message. To configure your data retention settings, select a <strong>Retention Type</strong> and <strong>Retention Period</strong>.</p>\n<p>For more information about the <strong>Data Retention</strong> subtab, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/dataRetention.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/dataRetention.png' alt=' ' width='983' height='377'></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>No Message Retention (Past and Future)</strong>: You can select this option to permanently delete all records of both past and future messages. If you select this option, PhishER will delete the entire raw message as well as any actions, labels, rules, tags, and other data. None of the data removed from the message will display in any past or future PhishER reports or message details.</li>\n<li>\n<strong>No Message Retention (Future Only)</strong>: You can select this option to permanently delete all records of future messages. If you select this option, PhishER will delete the entire raw message as well as any actions, labels, rules, tags, and other data. None of the data removed from the message will display in any historical reports.</li>\n<li>\n<strong>Message Timestamps and Dispositioning Retention</strong>: You can select this option to permanently delete all records of the message, including the entire body, raw message details, and email addresses. If you select this option, PhishER will only keep information about message properties to dispositioning such as category, status, or priority and timestamps. This option is used to delete any information that isn't needed for reports on your PhishER <strong>Dashboard</strong> tab.</li>\n<li>\n<strong>Message Body and Details Retention</strong>: You can select this option to delete the entire raw message, including the body, headers, email addresses, and attachments. If you select this option, PhishER will remove private information that can be found in the email body from KnowBe4's servers. PhishER will only keep information about message properties, actions, labels, and rules.</li>\n<li>\n<strong>Retention Period</strong>: Use the drop-down menu and text field to set the period of time that you would like PhishER to retain data. You can set a period of days, months, or years. The minimum retention period is one day, and the maximum retention period is ten years.</li>\n<li>\n<strong>Save</strong>: Click this button to save your data retention settings.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>Data retention features are currently optional. However, KnowBe4 reserves the right to modify the default data retention settings. This modification would only affect PhishER accounts that have not configured their data retention settings.</div>\n</div>\n</li>\n</ol>\n<h2 id='h_01HQNFFDYGTM6N37GP9JW6Q2W0'>Preferences</h2>\n<p>From the <strong>Preferences</strong> subtab, you can set a password for files downloaded from your platform and set a limit for direct downloads. The <strong>Password Protected Downloads</strong> setting allows you to set a password to protect the files that you download from reported messages. The <strong>CSV File Direct Downloads</strong> setting allows you to set a maximum item limit for CSV file direct downloads.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/Preferences.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/Preferences.png' alt=' '></a></p>\n<p>To set a password for downloaded files, follow the steps below:</p>\n<ol role='list'>\n<li>Turn on the toggle to enable the <strong>Password Protected Downloads</strong> setting.</li>\n<li>In the <strong>Password</strong> field, enter a password that is at least six characters long.</li>\n<li>Click <strong>Update Password</strong>.</li>\n</ol>\n<p>Once this setting is enabled, all original files that you download from the <a href='https://support.knowbe4.com/hc/en-us/articles/13169303385619#VIEWMSGDETAILS' target='_self'>Message Details</a> page will be converted to password-protected ZIP files.</p>\n<p>To set a limit for direct downloads, follow the steps below:</p>\n<ol role='list'>\n<li>In the <strong>Maximum CSV File Items for Direct Downloads</strong> field, enter the number of items you want to be the limit for direct downloads.</li>\n<li>Click <strong>Update</strong>.</li>\n</ol>\n<p>Once this setting is updated, all CSV files that exceed this item limit will download in the background, and we will notify you when the file is ready in your <strong>Downloads</strong> subtab.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/16567660822163-PhishER-Settings-Account",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/reportingEmails.png",
      "alt": "This image is a screenshot of a \"Settings > Reporting Emails\" configuration page within a web application, likely a security or phishing incident response platform (implied by the context \"PhishER\" and \"PAB\").\n\n**Layout and Navigation:**\n\n*   **Header:** Displays the title \"Settings Reporting Emails.\" A prominent, orange-highlighted button labeled \"Generate New Email\" is positioned on the top right (labeled 'a' in the original image context).\n*   **Sidebar (Left):** A vertical navigation menu organizes settings under \"ACCOUNT\" and \"SECURITY ROLES.\" \"Reporting Emails\" is currently selected (dark blue background). Other options include Email Server, Email Templates, Notifications, Downloads, Data Retention, Preferences, Users, and Roles.\n*   **Content Area (Right):** Contains informational warnings and a data table.\n\n**Informational Context (Orange Box):**\n\nA large orange-bordered alert box provides crucial instructions regarding email submission:\n1.  It states the listed email addresses are for submitting messages into \"PhishER\" for analysis, requiring headers.\n2.  It recommends using KnowBe4's Phish Alert Button (PAB) and notes that the email address must be manually entered into PAB settings.\n3.  An alternative is suggested: setting up an organizational alias (e.g., `report-phish@organization.com`) to forward suspicious emails, with a warning that forwarding results in a loss of information (email headers).\n4.  A link labeled \"here\" provides further information.\n\n**Data Table (Reporting Emails List):**\n\nA table lists configured reporting email addresses with the following columns:\n\n*   **(b) Reporting Email:** Lists the destination addresses (blurred for privacy). The first entry also displays an edit icon next to the blurred address.\n*   **(c) Tag:** A column for categorization. The first entry has a tag displayed as a small rounded rectangle containing \"TC4.\"\n*   **(d) Active:** Uses an orange toggle switch to indicate whether the reporting email is enabled (both entries show the toggle in the 'On' position).\n*   **(e) Forwarded Only:** A checkbox indicating if the email address is used solely for forwarded messages (both entries are unchecked).\n*   **(f) Actions:** Contains two icons per row: a Copy icon and a Delete/Trash Can icon, enabling management of the entry.\n\n**Summary of Entries:**\n\nThe table currently displays two configured reporting email addresses, both of which are active. Only the first entry has a designated \"TC4\" tag.",
      "position": 1,
      "context": "g>Reporting Emails subtab, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/reportingEmails-CopyEmail.png",
      "alt": "This image displays the configuration screen for \"Reporting Emails\" within a security platform, likely PhishER.\n\n**Overall Context:**\nThe screen is used to manage system-generated email addresses to which users can submit suspicious messages, either via a reporting tool like the KnowBe4 Phish Alert Button (PAB) or standard email forwarding.\n\n**UI Elements and Text:**\n\n1.  **Header and Primary Action:** The page title is \"Reporting Emails.\" A prominent button in the top right corner is labeled \"Generate New Email.\"\n\n2.  **Instructional Panel (Alert Box):** A large, light-orange panel provides detailed setup instructions and warnings:\n    *   **PAB Instructions:** It informs the user that the displayed email address is for submitting messages into \"PhishER\" and recommends using KnowBe4's PAB for header integrity. It explicitly states that the address must be manually entered into PAB settings and is **not** automatically added.\n    *   **Alias Instructions:** It suggests an alternative method of setting up an organizational alias (e.g., `report-phish@organization.com`) that points to the reporting address. A warning is included that email forwarding results in a \"loss of information, such as email headers.\"\n    *   **Documentation Link:** A concluding sentence provides a hyperlink labeled \"here\" for further information.\n\n3.  **Reporting Email Data Table:** A table lists configured reporting email addresses. The visible table headers are:\n    *   Reporting Email\n    *   Active\n    *   Forwarded Only\n    *   Actions\n\n4.  **Data Row Details (First Entry):**\n    *   **Reporting Email:** A system-generated, unique email address is listed (partially obscured, starting `a35644ed-...@phisher.knowbe4.com`).\n    *   **Active:** The status is set to **ON** (indicated by a green toggle switch).\n    *   **Forwarded Only:** Status is **OFF** (indicated by an unchecked square checkbox).\n    *   **Actions:** Two action icons are present: a **Copy** icon (clipboard symbol) and a **Delete** icon (trash can symbol).",
      "position": 2,
      "context": "strong>paper icon to copy your reporting email address."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/RemovePERAddresses.png",
      "alt": "This image displays a User Interface (UI) for configuring an account integration, specifically focusing on settings related to non-simulated email delivery.\n\n**Left Navigation Pane:**\nThe sidebar is labeled \"Account Integrations\" and lists seven integration options, including SAML, Phish Alert, API, **PhishER**, Webhooks, Second Chance, and PasswordIQ.\n\n**Main Configuration Panel (KB4 Tech Content 5 Settings):**\nThe panel contains several input fields and controls under the title \"KB4 Tech Content 5 Settings.\"\n\n1.  **Setting Name:** An input field containing the value \"KB4 Tech Content 5.\"\n2.  **Icon:** Includes a \"Browse...\" button, a graphical representation of an email with a fishing hook overlay, and a \"X Reset\" link.\n3.  **License Key:** A blurred input field containing an alphanumeric string. Adjacent is a checkbox labeled \"Limit CRID Validation.\"\n4.  **Send Non-Simulated Emails to:** This section configures destinations for non-simulated phishing emails.\n    *   **Action Button:** A prominent blue button is present, labeled **\"Remove PhishER Email Addresses.\"** (A directional arrow highlights this control).\n    *   **Recipient Field:** A blurred input field contains the current recipient list.\n    *   **Instructions:** Subtext reads, \"Separate multiple email addresses with a comma.\"\n    *   **Control:** A checkbox labeled \"Send Us a Copy\" is available for verification purposes.",
      "position": 3,
      "context": "list, click the Remove PhishER Email Addresses button."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/emailServerSettings.png",
      "alt": "This image displays the \"Email Server\" configuration page within the \"SETTINGS\" dashboard of a web application. The panel focuses on defining default email identity and DKIM settings.\n\n## UI Elements and Configuration Details\n\nThe interface is divided into a left navigation sidebar (where \"Email Server\" is actively selected under the \"ACCOUNT\" group) and a main configuration pane.\n\n### Email Server Settings\n\nThe main pane presents the following configuration fields, most of which are text input fields or checkboxes:\n\n1.  **Default From Address (a):** Input field, pre-filled with `no-reply@phisher.knowbe4.com`.\n2.  **Default From Name (b):** Empty input field.\n3.  **Default Reply to Address (c):** Input field, pre-filled with `no-reply@phisher.knowbe4.com`.\n4.  **Default Reply to Name (d):** Empty input field.\n5.  **X-Phisher header (e):** Empty input field.\n6.  **Email Headers (f):** Checkbox labeled \"Overwrite Fixed Return-path Address with From Address\" (Checked).\n\n### DKIM Configuration\n\nThis section manages domain key identified mail (DKIM) settings:\n\n1.  **DKIM Signature (g):** Checkbox labeled \"Enable\" (Checked).\n2.  **Configure DKIM (h):** Radio button selection is active for \"Use Your Signing Domain.\" The alternate option, \"Use KnowBe4's Signing Domain,\" is unselected.\n    *   Labels for \"Signing Domain\" and \"Selector\" are visible beneath the radio buttons.\n3.  **Action Buttons (i):** An orange button labeled \"Add Custom Signing Domain\" is visible, adjacent to a circular information icon.\n4.  **Save Button (j):** A primary orange button labeled \"Save\" is located at the bottom of the main configuration area.\n\n### Allowed Domains (k)\n\nA secondary panel, titled \"Allowed Domains,\" lists three approved domains:\n*   `kb4u-demo.com`\n*   `knowbe4.com`\n*   `kb4-tutorials.com`\n\nA footer note explains the purpose of the list: \"Allowed Domains can be used to send custom emails to the users in that domain. To update the allowed domains, visit the KMSAT **Settings page**\" (with \"Settings page\" displayed as a hyperlink).",
      "position": 4,
      "context": "For more information, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/EmailServer_Settings_AddCSD.png",
      "alt": "This image displays a dialog or section of a web application designed for configuring domain-related settings, specifically focusing on signing domains for a DNS record.\n\n**Header:** The title is **Add Custom Signing Domain**, indicating the purpose of the interface is to initiate the creation of a new custom signing domain entry.\n\n**Input Field and Instructions:**\n1.  **Instruction Text:** A line of text prompts the user: \"Select the signing domain for this DNS record:\".\n2.  **Dropdown Menu:** Below the instruction is a standard bordered dropdown input field labeled **Select Signing Domain** with a downward-pointing chevron icon, indicating it is a selection component.\n\n**Action Buttons:** Located in the bottom right corner, there are two action buttons:\n1.  **Cancel:** A white button with grey text for dismissing the action.\n2.  **Add:** A prominent orange, rectangular button for confirming and submitting the action.",
      "position": 5,
      "context": "trong>Add to add the signing domain to your platform."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/emailTemplates_Settings.png",
      "alt": "This is a screenshot of an administrative **Settings** panel focused on email management.\n\n**Primary UI Elements and Context:**\n\n*   **Page Title:** \"Email Templates\" (Bold, H1 style).\n*   **Navigation Panel (Left Sidebar):** Under the main heading \"SETTINGS,\" there is a navigation menu labeled \"ACCOUNT.\"\n    *   Unselected Links: \"Reporting Emails,\" \"Email Server.\"\n    *   Selected Link: **\"Email Templates\"** (Highlighted in a dark blue/black background, confirming the current page context).\n*   **Action Button (Top Right):** A button labeled **\"New Email Template\"** with an orange outline, serving as the primary call to action.\n\n**Content Area:**\n\n*   A large white content box indicates the absence of data.\n*   **Displayed Text:** \"No Email Templates have been defined for this account. Click here to add a New Email Template\"\n*   **Call to Action within Content:** The phrase \"Click here to add a New Email Template\" is hyperlinked/underlined, providing an alternative method to initiate the creation process.",
      "position": 6,
      "context": ">How to Create a Custom Email Template in PhishER article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/notifications1.png",
      "alt": "This image displays the \"Notifications\" section within an application's **SETTINGS** management interface.\n\n**Context and Navigation:**\n*   The left sidebar shows the main navigation categories under the heading **ACCOUNT**: \"Reporting Emails,\" \"Email Server,\" \"Email Templates,\" **\"Notifications\"** (currently selected and highlighted in dark blue), and \"Data Retention.\"\n*   The main panel is titled **\"Notifications.\"**\n\n**Main Panel Elements:**\n\n*   **(a) New Notification Button:** A primary orange button in the upper right corner labeled **\"New Notification\"** allows users to create a new entry.\n*   **(b) Search Bar:** A text input field labeled **\"Search...\"** is present for filtering the notification list.\n*   **Notification List (Table View):** The remaining area displays a list of existing notifications structured in a table with the following labeled columns:\n    *   **(c) Name:** The notification title (currently sorting ascending, indicated by an up arrow). Row data is partially obscured/redacted.\n    *   **(d) Target Room:** Specifies the target environment or label for the notification. Sample data includes \"11-12-21\" and \"urgency\\_tag.\"\n    *   **(e) Created At:** The timestamp of creation. Sample data includes \"Jan 4, 2022 at 5:25 PM\" and \"Dec 10, 2021 at 1:44 PM.\"\n    *   **(f) Updated At:** The timestamp of the last modification. Sample data matches the \"Created At\" times for the two visible entries.\n    *   **(g) Actions:** Provides interaction options for each row, indicated by a trashcan icon (Delete function) for both visible entries.",
      "position": 7,
      "context": "trong>Notifications subtab, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/PhishER_NewNotification.png",
      "alt": "",
      "position": 8,
      "context": "Separate each email address with a line break."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/Settings/Downloads/EN/PERDownloads.png",
      "alt": "This image displays the **Downloads** section within a system's **Settings** interface.\n\n**1. Context and Navigation (Left Panel):**\nThe interface features a vertical navigation sidebar segregated into two primary sections:\n*   **ACCOUNT:** Includes options for \"Reporting Emails,\" \"Email Server,\" \"Email Templates,\" \"Notifications,\" **\"Downloads\" (currently active/highlighted)**, \"Data Retention,\" and \"Preferences.\"\n*   **SECURITY ROLES:** Includes \"Users\" and \"Roles.\"\n\n**2. Main Content Area (Downloads List):**\nThe main panel displays a sortable data table detailing available generated files. The header indicates the current view: \"Settings Downloads.\"\n\n**3. Table Structure and Content:**\nThe table includes four columns, all list headers featuring a sort indicator icon (`↑↓`):\n\n*   **a. Name:** Lists filenames, primarily time-stamped CSV reports (e.g., `reports-reporters-2024-09-03151249.csv`, `messages-2024-08-20130340.csv`).\n*   **b. Created At:** Displays the generation timestamp (Date and Time) of the file (e.g., `Sep 3, 2024 11:12 AM`).\n*   **c. Expires At:** Displays the timestamp when the file will be removed or become unavailable (e.g., `Oct 3, 2024 11:12 AM`).\n*   **d. Actions:** Provides inline controls for file management. Each row contains two dedicated icons:\n    *   A downward arrow icon (`↓`): Indicates the action to **Download** the file.\n    *   A trash can icon (`🗑`): Indicates the action to **Delete** the file.\n\nThe data shows recent activity, with files created on Sep 3, 2024, expiring one month later on Oct 3, 2024.",
      "position": 9,
      "context": "t the Downloads subtab, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Settings/Downloads/EN/Alerts_New.png",
      "alt": "The image displays the application's \"Dashboard\" interface, which is partially obscured by a central modal dialog titled **\"Alerts.\"**\n\n**A. Underlying Dashboard Context (Obscured):**\nThe background UI features a vertical navigation bar on the left (showing \"Dashboard,\" \"Rooms,\" \"Inbox,\" etc.) and a header with a search function and a date range selector set to **\"Last 30 Days.\"** Key performance indicators displayed at the top include:\n\n*   REPORTED MESSAGES: **2**\n*   AUTOMATICALLY RESOLVED: **0**\n*   MANUALLY RESOLVED: **0**\n*   UNRESOLVED: **2**\n\n**B. Alerts Modal (Primary Focus):**\nThe modal lists recent system and user events in a table format with columns **\"Date\"** and **\"Event.\"**\n\n| Date | Event Description | Icon |\n| :--- | :--- | :--- |\n| Apr 29, 2025 at 11:17 AM | New comment on \"Urgent: Sign in to your Google Account if you w...\" | Envelope (Email) |\n| Apr 28, 2025 at 4:59 PM | New comment on \"Urgent: Sign in to your Google Account if you w...\" | Envelope (Email) |\n| Apr 28, 2025 at 1:11 PM | messages-2025-04-28171055.csv ready for download | Download (File) |\n| Apr 14, 2025 at 5:49 PM | New comment on \"test\" from [Redacted] | Envelope (Email) |\n\n**C. Modal Controls:**\nPagination controls are visible below the list, indicating **\"1-4 / 4\"** total alerts displayed. The modal is closed via the **\"Close\"** button located in the bottom right corner.",
      "position": 10,
      "context": "ceive alerts for files that you generated in your console."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/dataRetention.png",
      "alt": "The image displays the **Data Retention** configuration screen within a system's **SETTINGS** interface.\n\n**1. Navigation Context:**\nThe page title is \"Data Retention.\" A vertical navigation sidebar indicates that \"Data Retention\" is the currently active selection, listed under the primary category **ACCOUNT**.\n\n**2. Select Retention Type (Radio Buttons):**\nFour mutually exclusive radio button options define the data retention policy. The current selection is **Message Body and Details Retention**.\n\n*   **No Message Retention (Past and Future):** Permanently deletes all records, including raw messages, actions, labels, rules, tags, and other data.\n*   **No Message Retention (Future Only):** Permanently deletes all records of *future* messages and associated data.\n*   **Message Timestamps and Dispositioning Retention:** Retains timestamps and dispositioning properties, but permanently deletes message records.\n*   **Message Body and Details Retention (Selected):** Retains message properties, actions, labels, and rules, but permanently deletes the entire raw message.\n\n*Note: The first, second, and fourth options include an informational icon next to their descriptive text.*\n\n**3. Retention Period:**\nA dedicated section labeled **Retention Period** allows the user to define the duration for data retention. This is configured using a numerical text box and a unit dropdown:\n*   **Numerical Input:** Set to **10**.\n*   **Unit Dropdown:** Set to **Years**.\n\n**4. Context and Action:**\nBelow the retention settings, a **NOTE** clarifies the calculation method: \"Data Retention is calculated as the elapsed time since a message was reported.\"\n\nThe form is concluded with a single, orange action button labeled **Save**.",
      "position": 11,
      "context": "trong>Data Retention subtab, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/Settings/Preferences.png",
      "alt": "The image displays the **Settings > Preferences** configuration screen of a web application, structured with a vertical navigation sidebar on the left and content panes on the right.\n\n**Navigation Sidebar:**\nThe sidebar features menu categories, including \"ACCOUNT\" and \"SECURITY ROLES.\" The \"Preferences\" item is actively selected (highlighted in dark blue/grey). Other visible options include Reporting Emails, Email Server, Email Templates, Notifications, Downloads, Data Retention, and Users.\n\n**Main Content Area (Preferences):**\nThe content area is divided into two distinct configuration blocks:\n\n1.  **Password Protected Downloads:**\n    *   **Title:** Password Protected Downloads.\n    *   **Description:** \"Set a password to protect the original email files and attachments when downloaded from reported messages.\"\n    *   **Toggle:** An orange, enabled toggle switch labeled \"Enabled.\"\n    *   **Password Field:** An input field labeled \"Password,\" currently displaying masked characters (\"********\").\n    *   **Action Button:** An orange button labeled \"Update Password.\"\n\n2.  **CSV File Direct Downloads:**\n    *   **Title:** CSV File Direct Downloads.\n    *   **Description:** \"Set the item limit for CSV file direct downloads. If the number of items in a CSV file exceeds this limit, the file will download in the background and we will notify you when the file is ready in your PhishER Settings > Download subtab.\"\n    *   **Input Field:** Labeled \"Maximum CSV File Items for Direct Download.\" The current value in the text input box is **10**.\n    *   **Action Button:** An orange button labeled \"Update.\"",
      "position": 12,
      "context": "ting allows you to set a maximum item limit for CSV file direct downloads."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "account",
      "phisher",
      "settings"
    ],
    "image_count": 12
  }
}