{
  "article": {
    "id": 18223402626323,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/18223402626323.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/18223402626323.html",
    "author_id": 12677132815251,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 4,
    "vote_count": 8,
    "section_id": 19302214521747,
    "created_at": "2023-07-05T15:07:24Z",
    "updated_at": "2025-08-15T20:48:07Z",
    "name": "Create and Manage Callback Phishing Campaigns",
    "title": "Create and Manage Callback Phishing Campaigns",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-08-15T20:48:07Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "sync active directory",
      "how to set up adi",
      "answerbot",
      "localizing",
      "callback phishing",
      "CBP"
    ],
    "body": "<p>If you're a Diamond-level customer, you can use callback phishing campaigns to allow you to see how likely users are to call unknown phone numbers and share sensitive information. With these campaigns, you can help prepare your users for real callback phishing attacks, also known as reverse vishing attacks. In these campaigns, users will receive an email with a phone number and a callback code. If they call the phone number, they'll be prompted to enter the callback code. Once they enter the callback code, they'll be asked to enter personal information.</p>\n<div style='padding: 56.25% 0 0 0; position: relative;'><iframe style='position: absolute; top: 0; left: 0; width: 100%; height: 100%;' title='Callback Phishing Promotional Video' src='https://player.vimeo.com/video/846027109?h=4db84cbcc8&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479' frameborder='0' allow='autoplay; fullscreen; picture-in-picture; clipboard-write; encrypted-media'></iframe></div>\n<p>\n<script src='https://player.vimeo.com/api/player.js'></script>\n</p>\n<h2 id='iv_01H84ZQDJM4GNRBPMY3CPERZB9'>Creating a Callback Phishing Campaign</h2>\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong>Make sure you import your users into the KSAT console before creating a callback phishing campaign. For more information about importing users, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204936887'>Users and Groups Management Guide</a>.</div>\n</div>\n<p>To create a callback phishing campaign, go to your KSAT console and navigate to <strong>Phishing</strong> &gt; <strong>Callback Phishing</strong>. Then, click <strong>+ Create Callback Phishing Campaign</strong>. On the <strong>New Callback Phishing Campaign</strong> page, you can customize your callback phishing campaign.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_Dashboard.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_Dashboard.png' alt=''> </a></p>\n<p>For more information about the <strong>New Callback Phishing Campaign</strong> page, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_CreateNewCampaignAnnotated.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_CreateNewCampaignAnnotated.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>Campaign Name:</strong> Enter a name for your callback phishing campaign. This is a required field.</li>\n<li>\n<strong>Send to:</strong> Select which users you would like to receive a callback phishing test. You can select either <strong>All Users</strong> or <strong>Specific Groups</strong>. If you choose<strong> Specific Groups</strong>, you must select a group from the drop-down menu. This is a required field.</li>\n<li>\n<strong>Template Topics:</strong> Select the type of callback phishing template you want to send. You can select one or more phishing template topics from the first drop-down menu. This is a required field.</li>\n<li>\n<strong>Difficulty Rating:</strong> Select the difficulty rating for your callback phishing campaign. For more information about difficulty levels, see our <a href='https://support.knowbe4.com/hc/en-us/articles/218333717-Template-Difficulty-Ratings-Overview'>Template Difficulty Ratings Overview</a> article.</li>\n<li>\n<strong>Template Selection:</strong> Select the specific callback phishing template you want to send. <strong>Full Random</strong> is selected by default. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500003848062-Automated-Template-Selection-Overview'>Automated Template Selection Overview</a> article.</li>\n<li>\n<strong>Greeting Template:</strong> Select the greeting template you want to send. This will be the audio message that your users hear if they call the phone number in the email. If you select a custom email template, the drop-down menu will populate the associated greeting template. For more information on callback phishing templates, see our <a href='https://support.knowbe4.com/hc/en-us/articles/19156987997843-Create-and-Edit-Callback-Phishing-Templates'>Create and Edit Callback Phishing Templates</a> article.</li>\n<li>\n<strong>Phone Number Region:</strong> Select the phone number region that will be added to the phone number in your callback phishing emails. For a full list of available regions, see the <a href='https://support.knowbe4.com/hc/en-us/articles/18223402626323-Create-and-Manage-Callback-Phishing-Campaigns#h_01HW3D50QV7RN0PDJZK7W4G6FW'>Available Regions for Callback Phishing</a> section at the end of this article.</li>\n<li>\n<strong>Start Time:</strong> Set the date, time, and time zone you would like your callback phishing campaign to start. Your default time zone is the one set in your <strong>Account Settings</strong>.</li>\n<li>\n<strong>Sending Period</strong>: Select when to start sending callback phishing tests. You can choose to send all of the emails at once or over a period of time. For more information about the available options, see below:\n<ul>\n<li>\n<strong>Send all emails when the campaign starts</strong>: If you select this option, callback phishing tests will be sent to all selected users when the campaign starts. Users will not receive the email at the same time, but they will receive it on the same day.</li>\n<li>\n<strong>Send emails over…</strong>: If you select this option, callback phishing tests will be sent to users at random during the time period selected. You can enter a number between one and four and pick business days or weeks. For more information about sending and tracking periods, see our <a href='https://support.knowbe4.com/hc/en-us/articles/217841868'>Monitor and Review Phishing Campaigns</a> article.</li>\n</ul>\n</li>\n<li>\n<strong>Define Business Days and Hours</strong>: By default, your campaign will only send emails during the business hours set in your <strong>Account Settings</strong>. You can change the hours when your emails are sent by entering a start and end time in this field. You can also choose what days you would like emails to be sent by selecting the date check boxes.</li>\n<li>\n<strong>Track Activity</strong>: Select how long you would like to track phishing failures after the sending period ends. You can enter a number between one and four and choose from either days, weeks, or months.Your KSAT console will track activity until the campaign’s end date. The campaign’s end date is a combination of three values: the date of the first email, the sending duration, and the tracking duration. For more information about these values, see below:\n<ul>\n<li>Date of the first email: This value represents the date, in Eastern Time (US &amp; Canada), of the first email sent during the callback phishing campaign.</li>\n<li>Sending duration: This value represents the period of time that your callback phishing campaign emails were all sent.</li>\n<li>Tracking duration: This represents the period of time when your KSAT console will track emails from your callback phishing campaign.</li>\n</ul>\n<p>For more information about sending and tracking periods, see our <a href='https://support.knowbe4.com/hc/en-us/articles/217841868'>Monitor and Review Phishing Campaigns</a> article.</p>\n</li>\n<li>\n<strong>Add Callback Failures to:</strong> Select a user group you want to add your users to if they fail a callback phishing test. You can then enroll the user group in remedial training. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/18223402626323-Create-and-Manage-Callback-Phishing-Campaigns#iv_h_01HV4CRVFHXYHMPG5R21WPT923'>Recommended Callback Phishing Training</a> section at the end of this article.</li>\n<li>\n<strong>Store full number users call from</strong>: Select this check box to store the full phone number used to call the callback phishing number. This setting can help you verify that the user called. This feature is disabled by default. If you do not enable this setting, your KSAT console will only store the area code associated with the phone number.</li>\n<li>\n<strong>Send an email report to account admins after each phishing test</strong>: Select this check box to automatically send a report to all account admins when a callback phishing test ends. The reports include metrics such as Phish-prone Percentage, callback failures, and more.</li>\n</ol>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong> On the <strong>New Callback Phishing Campaign</strong> page, you can click <strong>Send Me A Campaign Test</strong> to test the entire callback phishing experience. You must select an email template and a greeting template before you can send yourself a test.</div>\n</div>\n<p>Once you’ve finished customizing your callback phishing campaign, click <strong>Create Campaign</strong> to save all changes.</p>\n<h2 id='iv_01H84ZQDJM49H92DVGBQG5ZS9Q'>Managing Callback Phishing Campaigns</h2>\n<p>To manage your phishing campaigns, go to your KSAT console and navigate to <strong>Phishing</strong> &gt; <strong>Callback Phishing</strong> &gt; <strong>Campaigns</strong>.</p>\n<p>On the <strong>Callback Phishing Campaigns</strong> page, you can view and edit your campaign details. For more information about the <strong>Callback Phishing Campaigns</strong> page, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_ManagingCampaigns.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_ManagingCampaigns.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>Filters:</strong> You can use these filters to sort campaigns by <strong>Active</strong>, <strong>Inactive</strong>, or <strong>All</strong>.</li>\n<li>\n<strong>Campaign table:</strong> In this table, you can find a list of campaigns sorted by the <strong>Started At</strong> date, with the most recent campaign displaying at the top of the table. You can see each campaign’s groups, Phish-prone Percentage, when the campaign started, the campaign status, and the duration of the campaign.</li>\n<li>\n<strong>Name</strong>: Click the campaign’s name to view details about it. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/217841868'>Monitor and Review Phishing Campaigns</a> article.</li>\n<li>\n<strong>Status</strong>: This column displays the campaign’s status. The status can be <strong>Created</strong>, <strong>Pending</strong>, <strong>Active</strong>, <strong>Closed</strong>, or <strong>Error</strong>:\n<ul>\n<li>\n<strong>Created</strong>: The campaign is created but is not currently active. For one-time phishing campaigns, <strong>Created</strong> indicates that the campaign is scheduled to start.</li>\n<li>\n<strong>Pending</strong>: The callback phishing campaign is scheduled and waiting to be sent.</li>\n<li>\n<strong>Active</strong>: The callback phishing campaign is ongoing.</li>\n<li>\n<strong>Closed</strong>: The campaign is inactive. If the campaign is in the <strong>Active</strong> subtab and has the <strong>Closed</strong> status, the campaign is temporarily inactive until the next PST begins. If the campaign is in the <strong>Inactive</strong> subtab and has a <strong>Closed</strong> status, either the campaign had a one-time frequency and ended, or the campaign was manually deactivated by an admin.</li>\n</ul>\n</li>\n<li>\n<strong>Duration</strong>: This column displays the campaign’s duration. The duration will either be <strong>Sending</strong> or <strong>Tracking</strong>:\n<ul>\n<li>\n<strong>Sending</strong>: Your campaign is sending out callback phishing emails.</li>\n<li>\n<strong>Tracking</strong>: Your campaign is tracking user information.</li>\n</ul>\n</li>\n<li>\n<strong>Search:</strong> Here you can search for your callback phishing campaign.</li>\n<li>\n<strong>Actions</strong>: Click the drop-down arrow in this column to edit, clone, deactivate, or delete a campaign. For more information about these options, see below:\n<ul>\n<li>\n<strong>Edit</strong>: This option opens the <strong>Edit Callback Phishing Campaign</strong> page. You can adjust your campaign as needed and click <strong>Update Campaign</strong> to save your changes. Options that are grayed out cannot be changed.</li>\n<li>\n<strong>Clone</strong>: You can click this option to create a copy of an existing campaign. Your cloned campaign will have the same settings, except for a new start time and the word \"Clone\" in the campaign name. You can edit the campaign to remove the word “Clone.”</li>\n<li>\n<strong>Deactivate</strong>: You can click this option to stop your campaign from running.\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong>Once a campaign is deactivated, it cannot be reactivated.</div>\n</div>\n</li>\n<li>\n<strong>Delete</strong>: You can click this option to permanently delete a campaign and all data, including recipients, failures, reports, and more. This action can’t be undone.</li>\n</ul>\n</li>\n</ol>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Callback phishing failures don't currently affect your organization's <a href='https://support.knowbe4.com/hc/en-us/articles/360001358728'>Risk Score</a>.</div>\n</div>\n<h2 id='iv_h_01HV4CRVFHXYHMPG5R21WPT923'>Monitoring Your Callback Phishing Results</h2>\n<p>To monitor your callback phishing results, navigate to <strong>Phishing</strong> &gt; <strong>Callback Phishing</strong> &gt; <strong>Campaigns</strong>. Click on the <strong>Campaign Name</strong> to view an <strong>Overview</strong> of your callback phishing campaign.</p>\n<ol>\n<li>To learn more about the information available on the <strong>Overview</strong> page for a callback phishing campaign, see the list below:\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_OverviewAnnotated.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_OverviewAnnotated.png' alt=''> </a></p>\n<ol>\n<li>\n<strong>Preview Status Report Email:</strong> You can click this button to open a window that displays the current report for the callback phishing campaign. At the bottom of the window, you can also enter an email address to send the current report.</li>\n<li>\n<strong>Download Failures:</strong> You can click this button to download a CSV file with information about these failures.</li>\n<li>\n<strong>Failures in the First 8 Hours:</strong> This graph shows how many failures occurred in the first eight hours and at what time they occurred.</li>\n<li>\n<strong>This Phishing Security Test:</strong> This chart shows information about your callback phishing security test. The chart will display the campaign’s status, Phish-prone Percentage, number of users who received the phishing test, number of users who failed the phishing test, and the campaign’s end date.</li>\n<li>\n<strong>Failures by Day:</strong> This graph shows how many failures occurred on specific days during the callback phishing campaign.</li>\n<li>\n<strong>Phishing Email:</strong> This chart shows information about the email used in the callback phishing test, including the From address, To address, number of email recipients, Subject, Phish Domain, and a preview of the email template.</li>\n<li>\n<strong>Callback Settings:</strong> This chart shows information about your callback settings, including the phone number used and a preview of the greeting template and response template used.</li>\n</ol>\n</li>\n<li>To the right of the <strong>Overview</strong> subtab, you will see the <strong>Users</strong> subtab. Click on this tab for more insights into your callback phishing campaign. To learn more about the information available on the <strong>Users</strong> page, see the list below:\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_UsersOverview.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_UsersOverview.png' alt=''> </a></p>\n<ol>\n<li>\n<strong>Recipients:</strong> This column shows all users who will receive a simulated phishing email.</li>\n<li>\n<strong>Delivered:</strong> This column shows the number of simulated phishing emails successfully delivered to your users.</li>\n<li>\n<strong>Opened:</strong> This column shows the number of users who have opened a callback simulated phishing email. When a user opens a simulated phishing email, this open is recorded using a small tracking image automatically placed in each email. When the image loads, we are able to track the open in our system.</li>\n<li>\n<strong>Callback:</strong> This column shows the number of users who called the provided number back and entered the code they were given.</li>\n<li>\n<strong>Callback Data Entered:</strong> This column shows the number of users who entered their personal information.</li>\n<li>\n<strong>Reported:</strong> This column shows the number of users who successfully reported this callback phishing test using the Phish Alert Button. You can click the column filter to view more information about these users.</li>\n<li>\n<strong>Bounced:</strong> This column shows the number of emails that bounced. If our simulated callback phishing test cannot be delivered to your mail server, it will bounce. You can click the column filter to view more information about the emails that bounced, including the email addresses affected by the bounce and the reason for the bounce.</li>\n</ol>\n</li>\n</ol>\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong>We don't record any data that your users enter in a callback phishing call.</div>\n</div>\n<h2 id='h_01K07EYS982ZT3PAHEZRZQF4Z8'>Recommended Callback Phishing Training</h2>\n<p>If you are configuring a remedial training campaign for callback phishing, we recommend using our <strong>Callback Phishing: Email and Phone-Based Cyberattacks</strong> and <strong>Captain Awareness: Callback Phishing</strong> modules. This training module can help educate your users about callback phishing attacks and strengthen your organization’s human firewall. If you have additional questions regarding training recommendations for your organization, we recommend contacting your Customer Success Manager.</p>\n<p>For more information about setting up remedial training, see our <a href='https://support.knowbe4.com/hc/en-us/articles/206280728-Create-a-Remedial-Training-Campaign'>Create a Remedial Training Campaign</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/modstore/callback_phishing_thumbnail.png'><img src='https://helpimg.s3.amazonaws.com/modstore/callback_phishing_thumbnail.png' alt=' '></a></p>\n<h2 id='h_01HW3D50QV7RN0PDJZK7W4G6FW'>Available Regions for Callback Phishing</h2>\n<p>Callback phishing phone numbers are available for more than 15 countries, with additional regions being added periodically. See below for the full list of currently available regions:</p>\n<ul>\n<li>United States</li>\n<li>Argentina</li>\n<li>Australia</li>\n<li>Brazil</li>\n<li>Canada</li>\n<li>Chile</li>\n<li>Colombia</li>\n<li>France</li>\n<li>Germany</li>\n<li>Ireland</li>\n<li>Mexico</li>\n<li>Netherlands</li>\n<li>Spain</li>\n<li>Sweden</li>\n<li>Switzerland</li>\n<li>United Kingdom</li>\n</ul>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/18223402626323-Create-and-Manage-Callback-Phishing-Campaigns",
    "images": [
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_Dashboard.png",
        "alt": "This image displays the KnowBe4 user interface, specifically navigating to the \"Callback Phishing Campaigns\" section.\n\n**Header Navigation and State:**\n*   The top navigation bar contains links: **KnowBe4** (logo), **DASHBOARD**, **PHISHING** (active dropdown), **TRAINING**, **USERS**, **ASAP**, **PHYSICAL TESTS**, **MODSTORE**, and **REPORTS**.\n*   The **PHISHING** menu is active and displaying a dropdown with two options: **PHISHING** (regular) and **CALLBACK PHISHING**.\n*   The **CALLBACK PHISHING** option is highlighted in blue, indicating it is the currently selected or navigated destination. An orange arrow pointer is visually directing the user to this highlighted element.\n\n**Page Title and Actions:**\n*   The main content area title is partially visible as \"**Callback Phishing Campaign**.\"\n*   In the top right of the content area, there is a blue primary action button labeled **+ Create Callback Phishing Campaign**.\n\n**Sub-Navigation Tabs (Callback Phishing Campaign Tabs):**\n*   Below the main title is a horizontal tab bar containing sub-sections for campaign management: **Overview** (currently active tab), **Campaigns**, **Email Templates**, **Greeting Templates**, and **Response Templates**.\n\n**Content Display (Dashboard/Overview):**\n*   The main body contains a section titled **Last 5 Callback Phishing Campaigns**, followed by an empty bar chart structure showing vertical grid lines and campaign metrics (e.g., **Topics: Multiple Topics, Groups: Multiple Groups, 0%**).\n*   On the right side, a statistics panel summarizes campaign counts:\n    *   **All Campaigns** (with a gear icon)\n    *   Total Campaigns: **4**\n    *   Active Campaigns: **3**\n    *   Inactive Campaigns: **1**",
        "position": 1,
        "context": "rong> page, you can customize your callback phishing campaign."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_CreateNewCampaignAnnotated.png",
        "alt": "This document describes the user interface configuration form for a security platform's \"New Callback Phishing Campaign.\" The form is designed for scheduling and defining the parameters of a simulated phishing attack that includes a callback component.\n\n## New Callback Phishing Campaign Form Details\n\nThe form is segmented into six major configuration areas, beginning with a blue advisory banner: \"Note: A campaign will start 10 minutes after it is activated or created.\"\n\n### Campaign Setup\n*   **(a) Campaign Name:** A mandatory text input field for identifying the campaign.\n*   **(b) Send to:** A segmented control allowing selection between \"All Users\" (Deselected) and \"Specific Groups\" (Selected). A subsequent dropdown menu prompts the user to \"Select one or more groups...\" for targeting.\n\n### Phishing Templates\nThis section defines the email content used in the campaign.\n*   **(c) Template Topics:** Dropdown menu for topic selection (\"Please select\"). Includes a checkbox for \"Set Template Language.\"\n*   **(d) Difficulty Rating:** Dropdown menu, currently set to \"All Ratings.\"\n*   **(e) Template Selection:** Dropdown menu, currently set to \"Full Random (Random email to each user).\" A status indicator below confirms \"Available Templates (0 Total).\"\n\n### Callback Options\nThis section configures the voice component of the simulation.\n*   **(f) Greeting Template:** Dropdown menu for selecting the recorded greeting (\"Please select\").\n*   **(g) Phone Number Region:** Dropdown menu, set to \"United States - Direct.\"\n\n### Delivery Details\nThis section controls the campaign scheduling.\n*   **(h) Start Time:** Date and time picker input, currently displaying \"07/22/2025 10:24 AM.\" A corresponding timezone dropdown shows \"(GMT-04:00) Eastern Time (US & Canada).\"\n*   **(i) Sending Period:** Radio button controls for email delivery spread. The option \"Send emails over [3] [business days]\" is selected.\n*   **(j) Define Business Days and Hours:** A sub-section for defining the delivery window using the timezone (GMT-04:00). Time inputs are set from \"9:00 AM\" to \"5:00 PM.\" Day selectors show Monday through Friday selected, and Sunday and Saturday deselected.\n\n### Failure Tracking\nThis section defines the tracking duration and subsequent actions for failed users.\n*   **(k) Track Activity:** Input field set to track activity for \"3 days\" after the sending period ends.\n*   **(l) Add Callback Failures to:** Dropdown menu for assigning users who fail the test (\"Please select\").\n\n### Reporting\nThis section controls data collection and administrative notifications.\n*   **(m) Checkbox:** \"Store full phone number users call from\" (Unselected).\n*   **(n) Checkbox:** \"Send an email report to account admins after each phishing test\" (Unselected).\n\n### Action Buttons\nThe form concludes with the following actions:\n1.  **Create Campaign:** Primary blue button for form submission.\n2.  **Send Me A Campaign Test:** Secondary text link for previewing the campaign content.",
        "position": 2,
        "context": "ong> page, see the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_ManagingCampaigns.png",
        "alt": "The image displays a user interface page titled **\"Callback Phishing Campaigns,\"** designed for managing and viewing phishing test campaigns.\n\n**1. Header and Navigation:**\n*   A primary call-to-action button, **\"+ Create Callback Phishing Campaign,\"** is located in the top right corner.\n*   A horizontal tab navigation bar is present below the title, with **\"Campaigns\"** selected/active. Other tabs include \"Overview,\" \"Email Templates,\" \"Greeting Templates,\" and \"Response Templates.\"\n\n**2. Campaign Filtering and Tools (Top of Data Grid):**\n*   **Filter Toggles (a):** A segmented control allows filtering the campaign list by status: **\"Active\"** (currently selected), \"Inactive,\" and \"All.\"\n*   **Data Export (d):** A clickable green link, **\"Download Callback Phishing Failures,\"** provides data export functionality.\n*   **Search Bar (f):** A text input field labeled \"Search\" is available for querying the campaign list.\n\n**3. Data Grid Structure:**\nThe main content area is a data table listing campaigns, defined by the following column headers: **Name (b), Groups, Phish-prone %, Started At, Next Test, Status (d), Duration (e), and Actions (g).**\n\n**4. Campaign Data Rows:**\n\n*   **Row 1 (Top Campaign):**\n    *   **Name (b):** \"Sharon\\_CB\\_campaign.\" Detailed configuration includes template topics and \"Add callers to group: Read Only.\" A \"Localized Campaign\" badge is appended.\n    *   **Groups (c):** Lists specific targets: \"All Permissions,\" \"Clickers,\" \"Completed.\"\n    *   **Status (d):** A light blue pill badge reads **\"created.\"**\n    *   **Duration (e):** Shows \"Sending 3 Business Days\" with a minimal blue progress indicator.\n    *   **Actions (g):** A vertical ellipsis menu is visible, and when activated, displays a dropdown with four options: **\"Edit,\" \"Clone,\" \"Deactivate,\" and \"Delete.\"**\n\n*   **Row 2 (Second Campaign):**\n    *   **Name:** \"sharon\\_CB\\_Campaign\\_02.\"\n    *   **Groups:** \"All Users.\"\n    *   **Status:** A green pill badge reads **\"active.\"**\n    *   **Duration:** Shows \"Sending 1 Business Day\" with a more visible blue progress indicator.\n    *   **Started At:** Displays \"07/22/2025, 9:55 AM.\"",
        "position": 3,
        "context": "igns page, see the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_OverviewAnnotated.png",
        "alt": "This image displays the \"Overview\" page of a phishing security test dashboard, featuring two data charts and a detailed configuration sidebar.\n\n**I. Header and Navigation:**\n*   The main navigation includes two tabs: **Overview** (selected) and **Users**.\n*   Action links in the top right allow users to (a) **Preview Status Report Email** and (b) **Download Failures**.\n\n**II. Main Content Area (Failure Charts):**\n*   **Graph (c): Failures in the First 8 Hours**\n    *   A line graph charting failures against time, spanning 10:00 AM to 5:00 PM.\n    *   Data message displayed: \"No data to display.\"\n*   **Graph (e): Failures by Day**\n    *   A graph tracking failures across days.\n    *   Data message displayed: \"No data to display.\"\n\n**III. Sidebar Details Panel:**\nThe right-hand panel is segmented into three accordion-style sections detailing the test configuration and current status.\n\n*   **(d) This Phishing Security Test (Status and Metrics):**\n    *   Status: **Created** (highlighted in blue).\n    *   Phish-prone %: **0%**.\n    *   Recipients: **1**.\n    *   Failures: **0**.\n    *   Campaign End: **08/02/2025**.\n\n*   **(f) Phishing Email (Configuration):**\n    *   Fields include Phish Domain, From, To (with a link indicating \"1 recipient\"), and Subject (all containing blurred, configuration-specific text).\n    *   Preview link: **Email Template**.\n\n*   **(g) Callback Settings:**\n    *   Displays the configured Phone Number (blurred).\n    *   Preview links: **Greeting Template** and **Response Template**.",
        "position": 4,
        "context": "page for a callback phishing campaign, see the list below:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/callback+phishing/CallbackPhishing_UsersOverview.png",
        "alt": "This image displays the \"Users\" view of a **Phishing Security Test** campaign status dashboard, indicated as \"Not Started.\"\n\n**Header and Context:**\n*   The primary title is \"Phishing Security Test started on: [Date/Time, blurred] Not Started.\"\n*   A navigation link, \"← Back to Campaigns,\" is located in the top right corner.\n*   Two main tabs separate the view: \"Overview\" and the currently active tab, **\"Users.\"**\n\n**Campaign Funnel Visualization (Phishing Metrics):**\nA segmented horizontal bar chart tracks seven stages of the phishing test campaign lifecycle, with metrics displayed below each stage marker (a-g). The campaign currently lists 1 total recipient but zero progression through all subsequent stages (0% and 0 count).\n\n| Marker | Label | Status (Percentage / Count) | Line Color Significance |\n| :---: | :---: | :---: | :---: |\n| **a** | **Recipients** | 1 | Dark Grey (Current Focus) |\n| b | Delivered | 0% / 0 | Teal/Cyan |\n| c | Opened | 0% / 0 | Teal/Cyan |\n| **d** | **Callback** | 0% / 0 | Red (Signifies link click/failure) |\n| **e** | **Callback Data Entered** | 0% / 0 | Red (Signifies credential entry/failure) |\n| **f** | **Reported** | 0% / 0 | Green (Signifies desired positive action) |\n| g | Bounced | 0% / 0 | Teal/Cyan |\n\n**User Action Interface:**\nBelow the funnel metrics, the user interface includes a search functionality and action links:\n*   **Search Bar:** A text input field labeled \"Search for users by name or email.\"\n*   **Action Links (Bottom Right):** Two clickable functions: **Bulk Update** and **Download CSV**.",
        "position": 5,
        "context": "ilable on the Users page, see the list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/modstore/callback_phishing_thumbnail.png",
        "alt": "The image displays two adjacent content cards, typically used for listing training assets or modules within a digital interface.\n\n**Card 1 (Left):**\n*   **Title:** \"Callback Phishing: Email and Phone-Based Cyberattacks\"\n*   **Thumbnail Content:** An illustration depicting a woman on a phone, a smartphone with an incoming redirect arrow, and a fishing hook, symbolizing phishing activity. A small graduation cap icon is placed in the bottom-left corner of the thumbnail.\n*   **Metadata:** Listed below the title are two data points:\n    *   Type: \"Training Module\" (preceded by a mortarboard icon).\n    *   Value: \"12\" (preceded by a globe icon, typically indicating duration or count).\n\n**Card 2 (Right):**\n*   **Status Indicator:** An orange rectangular badge labeled \"New\" is positioned in the upper-left corner of the thumbnail.\n*   **Title:** \"Captain Awareness: Callback Phishing\"\n*   **Thumbnail Content:** A comic-style illustration featuring two silhouetted figures reacting to a laptop screen displaying a large red error indicator. A superhero character (Captain Awareness) stands in the background, with the title text \"CAPTAIN AWARENESS\" overlaid prominently.\n*   **Metadata:** Listed below the title are two data points:\n    *   Type: \"Video Module\" (preceded by a video recorder/screen icon).\n    *   Value: \"1\" (preceded by a globe icon).",
        "position": 6,
        "context": "te-a-Remedial-Training-Campaign'>Create a Remedial Training Campaign article."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "and",
        "callback",
        "campaigns",
        "manage",
        "phishing"
      ],
      "image_count": 6
    }
  }
}