{
  "article": {
    "id": 217841868,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/217841868.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/217841868.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 5,
    "vote_sum": 29,
    "vote_count": 37,
    "section_id": 360000156648,
    "created_at": "2016-03-25T14:02:59Z",
    "updated_at": "2025-11-11T18:29:23Z",
    "name": "Monitor and Review Phishing Campaigns",
    "title": "Monitor and Review Phishing Campaigns",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-07T20:08:01Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "MAPS",
      "PHISHING TEST",
      "AR",
      "Learner Experience",
      "SCORM files",
      "PhishML",
      "Learner Dashboard",
      "LX",
      "localized",
      "Console Feature"
    ],
    "body": "<div class='callout-note'>\n<div>\n<strong>Note:</strong>We’ve added advanced features to phishing templates! All accounts will be opted in to phishing template advanced features in 2025. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4410161863955'>Phishing Templates Advanced Features Guide</a>.</div>\n</div>\n<p>After you create a phishing campaign, you can monitor and review your campaign results from the <strong>Campaigns</strong> subtab of your KnowBe4 console. From this subtab, you can monitor your one-time phishing campaigns and ongoing phishing campaigns, view detailed user failure reports for each campaign, and more.</p>\n<p>For information about creating and managing a phishing campaign, see our <a href='https://support.knowbe4.com/hc/en-us/articles/204239938'>Create and Manage Phishing Campaigns</a> article. If you prefer video tutorials, see our <a href='https://support.knowbe4.com/hc/en-us/articles/226677068'>Monitoring Phishing Campaigns</a> video.</p>\n<h2 id='iv_h_01FNS4M2Y4BXYRSCJ3P8Q8P9FT'>Monitoring Your Phishing Campaigns</h2>\n<p>To monitor an individual phishing campaign, log in to your KnowBe4 console and navigate to <strong>Phishing</strong> &gt; <strong>Campaigns</strong>. To monitor a callback phishing campaign, navigate to <strong>Phishing</strong> &gt; <strong>Callback Phishing</strong> &gt; <strong>Campaigns</strong>.</p>\n<p>On the <strong>Campaigns</strong> subtab, you will be able to view a list of all your phishing campaigns and details about each campaign. These details include the groups enrolled in each campaign, when the last test email was sent in the campaign, the campaign’s status, and more.</p>\n<p>For more information about the <strong>Campaigns</strong> subtab, see the <a href='https://support.knowbe4.com/hc/en-us/articles/204239938-Create-and-Manage-Phishing-Campaigns#h_01HASTJRYTXH34CE8DY3NHXZVM'>Managing Phishing Campaigns</a> section of our Create and Manage Phishing Campaigns article. For more information on callback phishing campaigns, see the <a href='https://support.knowbe4.com/hc/en-us/articles/18223402626323-Create-and-Manage-Callback-Phishing-Campaigns#iv_01H84ZQDJM49H92DVGBQG5ZS9Q'>Managing Callback Phishing Campaigns</a> section of our Create and Manage Callback Phishing Campaigns article</p>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>If you see an icon that says <strong>Managed</strong> next to your campaign, that means that the phishing campaign was created by your account's managed service provider. Changes to this campaign will break the link between this campaign and the parent-managed phishing campaign. If the campaign has editing disabled, there will be a lock icon next to the managed icon.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/MonitorandReviewPSTs_PSThomepage.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/MonitorandReviewPSTs_PSThomepage.png' alt=''> </a></p>\n<p>If you’d like to view more information about one specific campaign, you can click on the campaign’s name. When you click on the campaign name, you’ll be taken to the campaign’s <strong>Overview</strong> page. On this page, you can view reports and information about the specific campaign.</p>\n<p>The information available on the campaign’s overview page will vary depending on whether the campaign was a one-time phishing test or an ongoing or recurring phishing campaign. For details about monitoring a <a href='#iv_h_01FNS54MBM74HGRXNHEJ9RQ7GC'>one-time phishing test</a> or an <a href='#iv_h_01FNS54XET990TPY7CCVHJ12RB'>ongoing or recurring phishing campaign</a>, see the subsections below.</p>\n<h2 id='iv_h_01FNS54MBM74HGRXNHEJ9RQ7GC'>Monitoring a One-Time Phishing Test</h2>\n<p>If your campaign was a one-time test, the campaign’s <strong>Overview</strong> page displays the average <a href='https://support.knowbe4.com/hc/en-us/articles/115010178267-Failures-and-Phish-prone-Percentages#iv_01H8F8Z5PHKKJ5AR5FXXNTY914'>Phish-prone Percentage</a> for the campaign, the number of clicks in the first eight hours of the campaign, the number of clicks by day, where the clicks occurred, and more.</p>\n<p>To learn more about the information available on the <strong>Overview</strong> page for a one-time phishing campaign, see the list below:</p>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>Callback phishing campaigns are always one-time tests.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Phishing/Campaigns/EN/PSTOverviewAnnotated.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Phishing/Campaigns/EN/PSTOverviewAnnotated.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Preview Status Report Email:</strong> You can click this button to open a window that displays the current report for the phishing campaign. At the bottom of the window, you can also enter an email address to send the current report to.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Phishing/Campaigns/EN/PreviewStatusReportEmail.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Phishing/Campaigns/EN/PreviewStatusReportEmail.png' alt=' ' width='540' height='273'></a></p>\n</li>\n<li>\n<strong>Download Failures</strong>: You can click this button to download a CSV file with information about these failures.</li>\n<li>\n<strong>Failures in the First 8 Hours</strong>: You can click this button to display a graph that shows how many failures occurred in the first eight hours and at what time they occurred.</li>\n<li>\n<strong>This Phishing Security Test</strong>: You can click this button to display a chart that shows information about your phishing security test. The chart will display the campaign’s status, <a href='https://support.knowbe4.com/hc/en-us/articles/115010178267-Failures-and-Phish-prone-Percentages#iv_01H8F8Z5PHKKJ5AR5FXXNTY914'>Phish-prone Percentage</a>, number of users who received the phishing test, number of users who failed the phishing test, the campaign’s end date, and more. The campaign’s end date is a combination of three values: the date of the first email, the sending duration, and the tracking duration.\n<ul>\n<li>Date of the first email: This represents the date, in Pacific Standard Time (PST), of the first email sent during the phishing campaign.</li>\n<li>Sending duration: This represents the period of time when your phishing campaign emails were all sent out.</li>\n<li>Tracking duration: This represents the period of time you track emails from your phishing campaign.</li>\n</ul>\n</li>\n<li>\n<strong>Failures by Day</strong>: You can click this button to display a graph that shows how many failures occurred on specific days during the campaign.</li>\n<li>\n<strong>Phishing Email</strong>: You can click this button to display a chart that shows information about the email used in the phishing test including the From address, To address, Reply-To address, Subject, included attachments, phish domain, and a preview of the landing page.</li>\n<li>\n<strong>Failures by IP Address Location</strong>: You can click this button to display a map that shows the locations of the IP addresses where the failures occurred. For more information about this map, see the <a href='#iv_01H8F9AW4JV92PPSTWJDW14MJT'>Using the Failures by IP Address Location Map</a> section of this article.</li>\n<li>\n<strong>Callback Settings</strong>: This chart shows information about your callback settings, including the phone number used and a preview of the greeting template and response template used.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>This chart will only appear for callback phishing campaigns.</div>\n</div>\n</li>\n</ol>\n<p>To monitor a specific user’s progress for this phishing test, click the <strong>Users</strong> subtab at the top of the page. For more information about the details available on the <strong>Users</strong> subtab, see the <a href='#iv_h_01FNS4P4ENXYMW47F68H47H9A8'>User Failure Reports</a> section of this article.</p>\n<h2 id='iv_h_01FNS54XET990TPY7CCVHJ12RB'>Monitoring an Ongoing or Recurring Phishing Campaign</h2>\n<p>If your campaign is either recurring or ongoing, the campaign’s <strong>Overview</strong> page will include the average <a href='https://support.knowbe4.com/hc/en-us/articles/115010178267-Failures-and-Phish-prone-Percentages'>Phish-prone Percentage</a> throughout the campaign, a list of the top 50 users that clicked on phishing links in test email, and more.</p>\n<p>To learn more about the information available on the <strong>Overview</strong> page for an ongoing or recurring phishing campaign, see the list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/recurring_phishingcampaigns.png'><img src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/recurring_phishingcampaigns.png' alt=' '></a></p>\n<ol>\n<li>\n<strong>Phish-prone % Over Time (1 year)</strong>: This graph shows how your users’ average Phish-prone Percentage for this campaign has changed over one year.</li>\n<li>\n<strong>Phishing Security Tests</strong>: On recurrent campaigns, you can click this tab to view an overview of each individual phishing test in your campaign. You can then click on the name of each individual phishing test for more information about that campaign. For more information, see the <a href='#iv_h_01FNS4P4ENXYMW47F68H47H9A8'>User Failure Reports</a> section of this article.</li>\n<li>\n<strong>Download All Failures</strong>: Click this button to download a CSV file with information about all failures from this campaign, both current and past.</li>\n<li>\n<strong>This Campaign</strong>: This chart shows the status of the campaign, the most recent Phish-prone Percentage, and the number of phishing security tests that had been run.</li>\n<li>\n<strong>Top 50 Clickers</strong>: This table shows the users who have clicked the most phishing links in the campaign. You can view the user’s name, email address, and the number of times they’ve clicked on a phishing link in the campaign.</li>\n<li>\n<strong>Download Top Clickers</strong>: Click this button to download a CSV file with information about the users who clicked the most phishing links in this campaign over the past year.</li>\n<li>\n<strong>Localization Exclusions</strong>: Because not all system templates are available in all user phishing languages, you must set the default phishing language for the account in <strong>Account Settings</strong>.\n<ol>\n<li>If the phishing template is unavailable in a user’s phishing language, it will be sent in the organization’s default phishing language. Be advised that a phishing campaign will not be created if no templates are available in a user’s language or the account’s default phishing language. For more information on which users were excluded from receiving a Phishing Security Test (PST), please visit <strong>Phishing</strong> &gt; <strong>Campaigns</strong> &gt; <strong>Campaign Overview</strong> &gt; <strong>Localization Exclusions</strong> in your KSAT console.</li>\n</ol>\n</li>\n</ol>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/LocalizationExclusions_PSTExclusions.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/LocalizationExclusions_PSTExclusions.png' alt=''> </a></p>\n<h2 id='iv_01H8F9AW4JV92PPSTWJDW14MJT'>Using the Failures by IP Address Location Map</h2>\n<p>On the <strong>Overview</strong> page for any individual phishing test, you can view a map of exactly where your phishing test failures occurred. This map is generated by determining where the IP address is located.</p>\n<p>You can hover over any area on your map to view both the IP address and the number of failures in that area.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/Map_2.png'> <img src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/Map_2.png' alt=''> </a></p>\n<p>If your phishing test failures only occur in one country, you will only see a map of that country. For example, if your users are all located in the United States, they would see a map like the one shown below.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/Map_US.png'> <img src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/Map_US.png' alt=''> </a></p>\n<h2 id='iv_h_01FNS4P4ENXYMW47F68H47H9A8'>User Failure Reports</h2>\n<p>On the <strong>Users</strong> subtab of any individual phishing test in a campaign, you can see which users failed your phishing test. We track several types of failures, including clicking on links, opening attachments, enabling macros on attachments, and entering data on a landing page. If you've installed our <a href='https://support.knowbe4.com/hc/en-us/articles/208969608'>Phish Alert Button</a>, you can also see if your users reported the email as a phishing email.</p>\n<p>To navigate to the <strong>Users</strong> subtab of a phishing test, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 console and navigate to <strong>Phishing</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>Click the name of the campaign in which the simulated phishing test was sent.</li>\n<li>Click the <strong>Phishing Security Tests</strong> subtab.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/phishingsecuritytest_campaigns.png'><img src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/phishingsecuritytest_campaigns.png' alt=' '></a></p>\n</li>\n<li>Click the simulated phishing test category that you’d like to view.</li>\n<li>Click the <strong>Users</strong> subtab.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/PSTgif_campaigns.gif'><img src='https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/PSTgif_campaigns.gif' alt=' '></a></p>\n</li>\n</ol>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>If you need to remove a phishing test failure from your reports, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360001214287'>Remove Failures from Phishing Reports</a> article.</div>\n</div>\n<p>For more information about the <strong>Users</strong> subtab, see the list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/MonitorandReview_UsersTabPhishingAnnotated.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/MonitorandReview_UsersTabPhishingAnnotated.png' alt=''> </a></p>\n<ol>\n<li>\n<strong>Recipients:</strong> This column shows all users who will receive a simulated phishing email.</li>\n<li>\n<strong>Delivered: </strong>This column shows the number of simulated phishing emails delivered to your users.</li>\n<li>\n<strong>Opened: </strong>This column shows the number of users who have opened a simulated phishing email. When a user opens a simulated phishing email, this open is recorded using a small tracking image automatically placed in each email. When the image loads, we are able to track the open in our system. If you’d like, you can remove this tracking image from all phishing tests in your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887'>Account Settings</a>.\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Opening the email is not considered a phishing test failure and does not contribute to a user's Phish-prone Percentage calculation.</div>\n</div>\n</li>\n<li>\n<strong>Clicked: </strong>This column shows the number of users who clicked a phishing link. You can click the column filter to view additional results, including the clickers in the campaign, the date and time they clicked, their browser, their operating system, their IP address, and more.</li>\n<li>\n<strong>QR Code Scanned</strong>: This column shows the number of users who scanned a QR code. You can click the column filter to view additional results, including the date and time they scanned, their browsers, their operating system, their IP address, and more.</li>\n<li>\n<strong>Replied: </strong>This column shows the number of users who replied to a phishing email. You can click the column filter to view additional results, including all users who replied to a phishing email and the reply the user sent.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>To view users who replied to a phishing email and to view their replies, you must have enabled <strong>Track Replies to Phishing Emails </strong>and <strong>Keep reply content for later review </strong>when you created the campaign. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/234956728-Reply-To-Phishing'>Reply-to Phishing Guide</a>.</div>\n</div>\n</li>\n<li>\n<strong>Attachment Open: </strong>This column shows the number of users who opened an attachment in the simulated phishing email. You can click the column filter to view additional results, including a list of any users who opened the attachment if you added attachments to the email.</li>\n<li>\n<strong>Macro Enabled:</strong> This column shows the number of users who enabled macros from the simulated phishing email. If you sent a simulated phishing email with an attachment that contains a macro, you can click the column filter to view more information about users who enabled the macro.</li>\n<li>\n<strong>Data Entered: </strong>This column shows the number of users who entered data into a landing page. You can click the column filter to view additional information about the users who entered data into a landing page.</li>\n<li>\n<strong>Reported: </strong>This column shows the number of users who successfully reported this phishing test using the Phish Alert Button. You can click the column filter to view more information about these users.</li>\n<li>\n<strong>Bounced</strong>: This column shows the number of emails that bounced. If our simulated phishing test was not able to deliver to your mail server, it will bounce. You can click the column filter to view more information about the emails that bounced, including the email addresses affected by the bounce and the reason for the bounce.</li>\n<li>\n<strong>Bulk Update:</strong> Click this button to open the <strong>Bulk Update Users</strong> pop-up window. You can upload a CSV file that lists specific users in order to remove phishing test failures and add PAB report events for multiple users at once.</li>\n<li>\n<strong>Download CSV</strong>: Click this button to download a CSV file with information about users based on the data you want to access. For example, if you want to view users who opened the phishing email, select <strong>Opened</strong>, and then download a CSV file.</li>\n<li>\n<strong>Email Preview:</strong> To preview the original phishing template the user received, click the <strong>envelope</strong> icon. From the preview window, you can also click the <strong>Send Me a Test Email</strong> button to view this phishing template in your inbox.</li>\n<li>\n<strong>Search for users by name or email:</strong> You can search for the email addresses or names of specific users who participated in the simulated phishing test and view their results.</li>\n</ol>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you click the phishing link while previewing the phishing template, your default landing page will open regardless of the landing page you selected for this phishing campaign.</div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/217841868-Monitor-and-Review-Phishing-Campaigns",
    "images": [
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/MonitorandReviewPSTs_PSThomepage.png",
        "alt": "This interface displays the management screen for \"Phishing Security Test Campaigns.\"\n\n**Context and Navigation:**\nThe primary title is \"Phishing Security Test Campaigns.\" A main action button in the upper right corner is labeled \"+ Create Phishing Campaign.\" The secondary navigation panel shows eight tabs, with \"Campaigns\" currently selected and \"Landing Pages\" marked with a \"New\" badge.\n\n**Controls and Filtering:**\nA filtering section displays segmented buttons: **Active (selected)**, Inactive, Hidden, and All. To the right, there is a \"Download Phishing Failures\" link with a download icon, and a functional search bar.\n\n**Data Table Structure:**\nThe main content is a data grid listing campaigns with nine columns: Name, Groups, Tests, Phish-prone %, Last Test, Next Test, Status, Duration, and Actions.\n\n**Campaign Detail Example:**\nThe campaign \"lorem ipsum Clone\" is listed with subtext detailing topics (\"Brand Knock-Offs, CEO Fraud\") and a \"Localized Campaign\" badge. The data shows 1 Test resulting in 0.0% Phish-prone rate. The \"Status\" is indicated by an 'active' green badge.\n\n**Actions Menu (Contextual):**\nWhen the dropdown arrow under the \"Actions\" column is selected (as shown for the second row), a contextual menu appears, providing five options with corresponding icons:\n1. Edit\n2. Clone\n3. Deactivate\n4. Hide from Reports\n5. Delete",
        "position": 1,
        "context": "will be a lock icon next to the managed icon."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KMSAT/Phishing/Campaigns/EN/PSTOverviewAnnotated.png",
        "alt": "This image displays the technical report dashboard for a completed phishing security test.\n\n**I. Header and Navigation:**\n\n*   **Title:** \"Phishing Security Test started on: 13/07/2019 03:35.\"\n*   **Context:** Campaign: \"Initial Campaign,\" One-time from category: \"IT.\"\n*   **Actions:** Links are present for (a) \"Preview Status Report Email\" and (b) \"Download Failures.\"\n*   **Tabs:** The \"Overview\" tab is selected, with an inactive \"Users\" tab visible.\n\n**II. Campaign Summary (Panel D):**\n\nThis metadata panel provides high-level results:\n\n*   **Status:** Closed\n*   **Phish-Prone %:** 28.6%\n*   **Recipients:** 238\n*   **Failures:** 68\n*   **Campaign End:** 14/07/2019 03:35\n\n**III. Failure Visualizations (Left Column):**\n\n*   **Failures in the First 8 Hours (Panel C):** A scatter plot showing the distribution of failures over time, from 04:00 AM to 11:00 AM. Key data points indicate failures grouped by hour, including a cluster of 40 failures near 04:00 AM.\n*   **Failures by Day (Panel E):** A bar chart detailing failures across three days: Jul 13 (59 failures), Jul 14 (7 failures), and Jul 15 (2 failures).\n*   **Failures by IP Address Location (Panel G):** A map visualization of the United States displaying failure locations via circular markers, identifying clusters in Fremont, CA; Wilmette, IL; and New York, NY.\n\n**IV. Test Details (Right Column):**\n\n*   **Phishing Email (Panel F):** Detailed settings of the simulated email:\n    *   **From:** IT@kb4u-demo.com\n    *   **To:** 238 recipients\n    *   **Subject:** Workspace 2.0 Upgrade Complete\n    *   **Phish Domain:** cnn.compromisedblog.com\n    *   **Preview Links:** Email Template and Landing Page.\n*   **Callback Settings (Panel H):** Configuration for the voice element of the test:\n    *   **Phone Number:** (Blank field)\n    *   **Preview Links:** Greeting Template and Response Template.",
        "position": 2,
        "context": "trong>Callback phishing campaigns are always one-time tests."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KMSAT/Phishing/Campaigns/EN/PreviewStatusReportEmail.png",
        "alt": "The image displays a modal dialog box centered over a partially visible, greyed-out dashboard interface featuring a chart and data table elements.\n\n**Modal Header and Context:**\nThe modal is titled via an orange and dark orange horizontal bar labeled **\"Phishing Email Sent\"**. A date, **07/12/2023**, is visible. The header includes a call-to-action: **\"See report at https://eu.knowbe4.com\"**.\n\n**Phishing Campaign Details:**\nThe main content area lists the specific attributes of the simulated phishing email:\n*   **From:** `account@microsoft-suppport.com`\n*   **To:** `538 recipients` (The recipient count is displayed in blue, indicating a hyperlink).\n*   **Subject:** `Microsoft: Unusual Sign-in Activity (Link)`\n*   **Attachment:** `No attachment`\n*   **Phish Domain:** `onlinebanking.kb4.io`\n\n**Attribution and Access:**\nBelow the details are a blue hyperlink, **\"Log in to https://eu.knowbe4.com\"**, and the copyright attribution, **\"KnowBe4, Inc\"**.\n\n**Action Panel:**\nThe bottom section features an input and action area:\n1.  A long, unpopulated **text input field** is provided for specifying email addresses.\n2.  Accompanying instructional text states: **\"Separate multiple email addresses with a comma. If this field is left blank, the email will be sent to all account admins.\"**\n3.  Two functional buttons are present: **\"Send Email\"** (blue, primary action) and **\"Close\"** (grey, secondary action).",
        "position": 3,
        "context": "w, you can also enter an email address to send the current report to."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/recurring_phishingcampaigns.png",
        "alt": "The image displays the \"Phishing Security Tests\" detailed view for the campaign titled \"Current Events and Social Networking.\" The campaign context notes it is based on categories \"Social Networking, Current Events\" and ran from \"05/13/2020 through 10/13/2020.\" A navigational link, \"← Back to Campaigns,\" is present in the top right corner.\n\n**Navigation and Metrics:**\nThe UI utilizes tabbed navigation, with \"Phishing Security Tests\" currently selected. Campaign status metrics are displayed in a sidebar panel (labeled \"⚙ This Campaign\"): Status is \"Running,\" Last Phish-Prone Percentage is \"0%,\" and the total number of Phishing Security Tests is \"6.\" An action button, \"Download All Failures,\" is located below the campaign title.\n\n**Primary Data Visualization (Line Graph):**\nA line graph titled \"Phish-prone % Over Time (1 year)\" tracks the Phish-prone Percentage (Y-axis) against time (X-axis, monthly increments from June 2020 to October 2020). The trend shows a decline in the percentage, from a high of 30.9% to 0%. A tooltip is visible on the graph, highlighting the data point for July 13, 2020, showing a \"Phish-prone\" percentage of \"20.8%.\" Instructions beneath the title advise the user to \"Click and drag in the plot area to zoom in.\"\n\n**Secondary Data (Clicker Table):**\nA section titled \"Top 50 Clickers\" displays a tabular list of users who clicked phishing links. Columns include Name, Email, and Clicks. The data shows users with click counts ranging from 5 down to 4 in the visible entries (e.g., Arianne Ullrich, Kathline Emard, and Kenia Nienow each have 5 clicks). An accompanying action link, \"Download Top Clickers,\" allows export of this specific dataset.",
        "position": 4,
        "context": "an ongoing or recurring phishing campaign, see the list below:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/LocalizationExclusions_PSTExclusions.png",
        "alt": "This image displays the detail page for a security testing campaign within an administrative UI, specifically focusing on user exclusion criteria.\n\n**Header and Campaign Status:**\nThe page title is **\"Phishing Security Test started on: Not Started.\"**\nCampaign metadata includes:\n*   **Campaign:** \\[Blurred]\n*   **One-time from topic:** Jan 2025\nA persistent status tag labeled **\"Hidden from Reports\"** is displayed below the metadata.\n\n**Navigation:**\nA horizontal tab navigation bar is present, listing three sections:\n1.  Overview\n2.  Users\n3.  **Localization Exclusions** (Currently selected and active).\n\n**Main Content (Localization Exclusions):**\nThe primary content area displays the section title **\"Localization Exclusions.\"**\nAn explanatory paragraph clarifies the criteria for exclusion: \"The listed users did not receive a Phishing Security Test because there were no selected templates available in their Phishing Language.\"\n\n**Data Table:**\nA table is present to list the excluded users. The table utilizes three columns:\n1.  **Name**\n2.  **Email**\n3.  **Phishing Language**\n\nThe table shows at least one row of blurred data, with a hyphen (-) visible under the \"Phishing Language\" column for the listed entry.",
        "position": 5,
        "context": "s in your KSAT console."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/Map_2.png",
        "alt": "This image is a geopolitical visualization titled **\"Failures by IP Address Location.\"**\n\n**Visualization Components:**\n1.  **Map:** A static, monochrome world map displaying country and continent outlines.\n2.  **Title:** \"Failures by IP Address Location.\"\n3.  **Legend:** Located at the bottom center, defining the data marker: a light blue circle labeled \"Failures.\"\n\n**Data Points and UI Elements:**\nThe map displays two geographical failure points using the marked circular icon.\n\n1.  **Active Tooltip (New York, NY):** A data point located in the northeastern United States (near New York, NY) features an active, persistent tooltip (indicating a hover state).\n    *   The location is labeled \"New York, NY.\"\n    *   The tooltip box displays the associated IP address: \"72.229.28.185.\"\n    *   The corresponding failure count is displayed as: \"Failures: 9.\"\n\n2.  **Static Label (Birmingham, GB):** A second data point located in the United Kingdom is labeled directly on the map with the text \"Birmingham, GB.\" No tooltip is active for this location.",
        "position": 6,
        "context": "rea on your map to view both the IP address and the number of failures in that area."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/Map_US.png",
        "alt": "This image is a geographic scatter plot visualization titled **\"Failures by IP Address Location,\"** with the regional context specified as **\"UnitedStates.\"**\n\n**Visualization Elements:**\n\n*   **Map Base:** A gray and white outline map of the contiguous United States, including internal state boundaries. Alaska and Hawaii are shown in an inset view below the main continental outline. The label **\"US\"** is centered geographically on the map body.\n*   **Data Markers:** Data points are represented by light blue, semi-transparent circular markers positioned over specific locations. The size of these markers suggests a proportional value relative to the number of failures.\n*   **Key Data Points and Labels:** Three failure locations are explicitly labeled:\n    1.  **Fremont, CA** (West Coast)\n    2.  **Wilmette, IL** (Midwest)\n    3.  **New York, NY** (East Coast)\n*   **Legend:** A simple legend is displayed at the bottom, defining the marker type:\n    *   [Light Blue Circle Icon] **Failures**\n\n**Context:** The visualization maps geolocation data derived from IP addresses to illustrate the distribution and concentration of detected failures across the US territory.",
        "position": 7,
        "context": "re all located in the United States, they would see a map like the one shown below."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/phishingsecuritytest_campaigns.png",
        "alt": "This screen displays the detailed dashboard for a security awareness campaign titled \"**Campaign: Phishing Campaign SJ**,\" which ran from **03/16/2021 through 11/22/2021**.\n\n**UI Context and Navigation:**\n*   The user is viewing the **Phishing Security Tests** tab (currently active/highlighted). An inactive **Overview** tab is also present.\n*   A link to **Download All Failures** is visible in the upper right.\n*   A navigation link, **← Back to Campaigns**, is located at the top right corner.\n\n**Campaign Status Panel (Right Sidebar):**\nA dedicated panel titled \"**⚙ This Campaign**\" provides key metrics:\n*   **Status:** Running (Blue text)\n*   **Last Phish-prone Percentage:** 0% (Blue text)\n*   **Phishing Security Tests:** 37 (Blue text)\n\n**Performance Visualization:**\n*   A time series chart titled \"**Phish-prone % Over Time (1 year)**\" is displayed.\n*   The Y-axis is labeled \"Phish-prone Percentage.\"\n*   The chart shows periodic data points (e.g., 04/30/2021, 06/30/2021) with a current Phish-prone Percentage of **0** across all recorded intervals.\n*   A user instruction below the title reads: *Click and drag in the plot area to zoom in*.\n\n**Bottom Panel (Clicker Data):**\n*   A section titled \"**Top 50 Clickers**\" is visible, providing a table preview.\n*   Available column headers are **Name**, **Email**, and **Clicks**.\n*   An action link, **Download Top Clickers**, is available below the title.",
        "position": 8,
        "context": ">\nClick the Phishing Security Tests subtab."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/monitor_phishing_campaigns/PSTgif_campaigns.gif",
        "alt": "This image displays the **Campaign Details** view for a cybersecurity platform, specifically focusing on a list of individual phishing security tests conducted within a continuous campaign.\n\n**Header and Context:**\n\n*   **Campaign Title:** **Campaign: Phishing Campaign SJ** (H1 level heading).\n*   **Description:** \"Weekly from categories: Banking and Finance, Current Event of the Month\" followed by \"Campaign ran from 03/16/2021 through 11/22/2021.\"\n*   **Navigation Link:** Top right corner features an active link: \"← Back to Campaigns.\"\n\n**Navigation Tabs:**\n\nTwo tabs are present below the title, indicating different views for the campaign:\n1.  **Overview** (Selected, active view).\n2.  **Phishing Security Tests** (Unselected).\n\n**Action Button:**\n\nA green text link is present on the right side above the data table: \"Download All Failures.\"\n\n**Data Table:**\n\nThe primary content is a sortable data table listing the individual security tests (emails) sent during the campaign.\n\n| Column Header | Data Type | Sample Data |\n| :--- | :--- | :--- |\n| **Subject** | Text/Link | \"Random emails from category: Banking and Finance,Current Event of the Month\" (Repeated for every row) |\n| **Status** | Text | \"Active\" (1 row), \"Closed\" (All subsequent visible rows) |\n| **Started on** | Date | \"11/22/2021\" (Most recent test) through \"10/04/2021\" (Oldest visible test) |\n| **Number of Users** | Numeric | \"14\" (Consistent for all visible rows) |\n| **Phish-prone %** | Percentage | \"0%\" (Consistent for all visible rows) |\n\nEach row also includes a dropdown indicator (downward-pointing chevron) in the far-right column, suggesting options or detailed views for that specific test. The mouse cursor is visible hovering over the \"0%\" value in the 10/18/2021 row.",
        "position": 9,
        "context": "ory that you’d like to view.\nClick the Users subtab."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/MonitorandReview_UsersTabPhishingAnnotated.png",
        "alt": "This image depicts a tracking dashboard for an email campaign, focused on individual recipient metrics and status progression through a funnel.\n\n### UI Context and Navigation\n\nThe upper left features two navigation tabs: **Overview** (inactive) and **Users** (active). The primary content is the 'Users' view, detailing recipient engagement.\n\n### Metric Funnel (Top Section)\n\nA prominent horizontal flow chart tracks recipient status across eleven steps, displaying both percentage and absolute counts. Success metrics (Delivered, Opened) are highlighted with a teal or green status bar, while low/zero engagement metrics (Clicked, Scanned, Replied, etc.) are highlighted with a red bar.\n\n| Step | Metric Label | Percentage | Count | Status Bar Color |\n| :--- | :--- | :--- | :--- | :--- |\n| **1** | Recipients | N/A | 64 | Dark Gray |\n| **2** | Delivered | 43.8% | 28 | Teal/Green |\n| **3** | Opened | 75% | 21 | Teal/Green |\n| **4** | Clicked | 0% | 0 | Red |\n| **5** | QR Code Scanned | 0% | 0 | Red |\n| **6** | Replied | 0% | 0 | Red |\n| **7** | Attachment Opened | 0% | 0 | Red |\n| **8** | Macro Enabled | 0% | 0 | Red |\n| **9** | Data Entered | 0% | 0 | Red |\n| **10** | Reported | 0% | 0 | Green |\n| **11** | Bounced | 56.3% | 36 | Red |\n\n### Action and Filtering Bar\n\nBelow the metrics, a utility bar contains search and bulk action capabilities:\n\n1.  **Search Input:** A text field labeled, \"Search for users by name or email,\" paired with a magnifying glass icon.\n2.  **Bulk Update (12):** A link with a refresh icon, labeled \"Bulk Update.\"\n3.  **Download CSV (13):** A link with a green download icon, labeled \"Download CSV.\"\n\n### Recipient Data Table\n\nThe lower section displays a detailed table listing individual recipients and their corresponding tracking status.\n\n**Key Column Headers:**\n\n*   Name and Email\n*   Scheduled (Date/Time, e.g., 06/17/2025, 9:34 AM EDT)\n*   Delivered\n*   Opened (Includes a tooltip/question mark icon)\n*   Clicked\n*   QR Code Scanned\n*   Replied\n*   Attachment Opened\n*   Macro Enabled\n*   Data Entered\n*   Reported\n*   Email Preview (14) (Displays a blue envelope icon for the visible data row).",
        "position": 10,
        "context": "ng>Users subtab, see the list below:"
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "and",
        "campaigns",
        "monitor",
        "phishing"
      ],
      "image_count": 10
    }
  }
}