{
  "article": {
    "id": 228373888,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/228373888.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/228373888.html",
    "author_id": 21027160967,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 50,
    "vote_count": 72,
    "section_id": 26411014901779,
    "created_at": "2016-09-28T18:19:51Z",
    "updated_at": "2025-11-19T19:01:02Z",
    "name": "Active Directory Integration (ADI) Configuration Guide",
    "title": "Active Directory Integration (ADI) Configuration Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-07T21:52:37Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "adi",
      "active directory",
      "active directory integration",
      "User Management",
      "localized",
      "answerbot",
      "answerbot_kmsat",
      "callback code",
      "callback phishing",
      "CBP",
      "answerbot_ksat"
    ],
    "body": "<p>You can use KnowBe4's Active Directory Integration (ADI) feature to integrate your organization's Active Directory (AD) with your KSAT console. After you configure ADI, users and groups will be automatically added, changed, and archived in your KSAT console based on information sent from your AD. It's important to note that this is a one-way process of synchronization, and no information will be sent back to your AD from your KSAT console.</p>\n<p>To learn about the benefits of configuring ADI for your organization, see our <a href='https://support.knowbe4.com/hc/en-us/articles/6162437423635'>Benefits of Setting Up Active Directory Integration (ADI)</a> article. If you prefer video tutorials to learn how to configure ADI, see our <a href='https://support.knowbe4.com/hc/en-us/articles/229045167'>Configuring Active Directory Integration (ADI)</a> video. Alternatively, if you are interested in using SCIM to sync your users, please check out our <a href='https://support.knowbe4.com/hc/en-us/articles/360052380374-SCIM-Configuration-Guide'>SCIM Configuration Guide</a>.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Depending on your organization's environment, you may need to use advanced configuration options. For more information about advanced configuration options, see our <a href='https://support.knowbe4.com/hc/en-us/articles/6151635869843'>Active Directory Integration (ADI) Advanced Configuration Guide</a>.</div>\n</div>\n<h2 id='h_01HAA5E9HGP2ZEFQGMXZBQMCG9'>How ADI Operates for Accounts with Existing Users</h2>\n<p>If you've already added users to your KSAT console, there are a few things you should know before configuring ADI. For more information, see the list below:</p>\n<ul>\n<li>Once you've configured ADI, the data that is synced from your AD is considered authoritative. The following actions will occur during syncs between your KSAT console and your AD:\n<ul>\n<li>Users who are not found in your AD will be archived in your KSAT console.</li>\n<li>If you've made changes to a user's information in your KSAT console, these changes will be overwritten by the data that is contained in your AD.</li>\n</ul>\n</li>\n<li>Prior to ADI, user accounts in the KSAT console are considered console-managed. When users are console-managed, you can edit user information by <a href='https://support.knowbe4.com/hc/en-us/articles/204873347'>uploading a CSV file</a> to your console or by editing <a href='https://support.knowbe4.com/hc/en-us/articles/360009588974'>user profiles</a> directly in your console.\n<ul>\n<li>Once you configure ADI and the first AD sync occurs, users are considered AD-managed. When users are AD-managed, you will need to edit user information in your AD and these changes are then pushed to the KSAT console during the next sync.</li>\n</ul>\n</li>\n<li>During the first AD sync, the KSAT console will automatically match console-managed user accounts with accounts in your AD. This process will convert your users from being console-managed to AD-managed. We've outlined how this process works below:\n<ol>\n<li>You will install and configure the ADI sync tool in your environment. For details, see the <a href='#h_01HAA5E9HG0WQCJ9T6RK3SZT0Z'>Installation and Configuration</a> section of this article.</li>\n<li>You will configure what information you want to sync from your AD. For details, see the <a href='#h_01HAA5E9HGZ9KWSGRKAHBN5AMC'>Defining Which OUs, Groups, and Users to Sync</a> section of this article.</li>\n<li>Then, the ADI sync service queries your AD or directories for user and group information and sends the results to KnowBe4's servers.</li>\n<li>KnowBe4's servers review the information sent from your AD and the servers automatically update the users and groups in your KSAT console according to the following logic:\n<ol>\n<li>If an AD user has an email address that matches an existing KSAT console account, then that KSAT console user account becomes AD-managed.</li>\n<li>If an AD user is not found in the KSAT console, then an AD-managed user account is created.</li>\n<li>After all AD users have been processed, any console accounts that have not become AD-managed will be archived.</li>\n</ol>\n</li>\n</ol>\n</li>\n</ul>\n<h3 id='h_01JXJDP507BE6NRM3028J5SHVN'>Protections that Secure ADI Auto-updates</h3>\n<p>There are a few protections that make sure ADI auto-updates are secure:</p>\n<ul>\n<li>The metadata about the installer file is downloaded using the HTTPS protocol.</li>\n<li>The installer file is downloaded using the HTTPS protocol.</li>\n<li>After downloading the installer file and before executing it, KnowBe4 ADI Sync checks the file's checksum and ensures that it has a valid digital signature from KnowBe4.</li>\n</ul>\n<p>Once you configure ADI, user information will stay up-to-date with the information in your organization's AD.</p>\n<h2 id='h_01HAA5E9HGTWKPG9786HW8YN0V'>Prerequisites</h2>\n<p>Before you configure ADI, make sure that your environment meets our basic requirements listed below:</p>\n<ol>\n<li>Your organization must have <strong>Microsoft Active Directory</strong> or <strong>Microsoft Entra ID</strong>. See the list below for more information:\n<ol>\n<li>If your organization has <strong>Microsoft Active Directory</strong>, your domain functional level must be Windows Server 2016 or later.</li>\n<li>If your organization has<strong> Microsoft Entra ID</strong>, you can sync Microsoft Entra ID Domain Services with your KSAT console. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000849407'>Active Directory Integration (ADI) with Microsoft Entra Domain Services</a> article.</li>\n</ol>\n</li>\n<li>We recommend that you install the ADI tool on an application server and not a user workstation. Make sure that the system where you will install ADI meets the following specifications:\n<ol>\n<li>The system uses Windows Desktop 10 (64 bit) or 11, or Windows Server 2016 or later.</li>\n<li>Make sure that the system can reach the server of the training instance for your account. For a list of instances, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354'>KnowBe4's Training Instances</a> article. The training instance is the server URL that KnowBe4's AD sync tool will need to contact through a POST request. You will need to allow outbound connections to remote servers on port 443 (SSL/HTTPS).</li>\n<li>The computer has at least two GB of RAM.</li>\n<li>The computer's system drive has at least one GB of available hard disk drive (HDD) space.</li>\n<li>User Account Control (UAC) is enabled in the computer's User Account Control settings.</li>\n</ol>\n</li>\n</ol>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Windows Server 2025 tightens LDAP security by requiring signing or encryption. Unsecured simple binds are blocked by default. Therefore, when using Windows Server 2025 Domain Controller (DC), LDAPS must be enabled on the DC and the \"Enable SSL\" option must be set to true during ADI Sync client configuration.</div>\n</div>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you are configuring ADI through a proxy, you will need to add an HTTP_PROXY variable to your Environment Variables. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115001905307'>Configure the ADI Sync Tool to Connect Through a Proxy</a> article.</div>\n</div>\n<p>See the next section for important steps you will need to take to prepare for your ADI configuration.</p>\n<h2 id='h_01HAA5E9HGQTP57T0D54AX88Q7'>Before You Begin: Required Steps</h2>\n<p>Before you can install and configure KnowBe4's AD sync tool on your local system, follow the steps below:</p>\n<ol>\n<li>Gather the following information about your AD:\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>If your users are located under more than one domain controller, you will need to gather the following information for each domain controller. You will also need to configure ADI for each of these domains. To learn more, see the <a href='https://support.knowbe4.com/hc/en-us/articles/6151635869843-Active-Directory-Integration-ADI-Advanced-Configuration-Guide#h_01HQNNGRBBT031SPXPVFR6S0J1'>Support for Multiple Domain Sources</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/6151635869843'>Active Directory Integration (ADI) Advanced Configuration Guide</a>.</div>\n</div>\n<ul>\n<li>Find the IP address or Fully Qualified Domain Name (FQDN) for the domain controller where your AD is located.</li>\n<li>Make sure that your AD domain controller can respond to LDAP requests. By default, all domain controllers are set up to respond to LDAP requests.\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>Your AD sync can communicate over LDAP. However, if you would rather, you can enable LDAPS on your domain controller before syncing your AD. By default, LDAPS is <em>not</em> enabled on most domain controllers. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/228466847'>FAQ: Active Directory Integration (ADI)</a>.</div>\n</div>\n</li>\n<li>Find the AD domain name. The AD domain name is the root domain that is controlled by your AD domain controller. See the image below for an example of an AD domain name.\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/ADI/ADDomainName.png'><img src='https://s3.amazonaws.com/helpimg/ADI/ADDomainName.png' alt='A screen capture of an Active Directory Users and Groups window showing the following example domain name: DevKB4-a.com.'></a></p>\n</li>\n<li>Make sure that you have the username and password for an AD administrator account that has the permissions to perform LDAP queries. By default, any account in the \"Domain Users\" group has these permissions. However, for additional security, we recommend using a service account that only has “read” permissions for your AD. To see the \"read\" permissions that are necessary for this service account, please see our <a href='https://support.knowbe4.com/hc/en-us/articles/6151635869843'>Active Directory Integration (ADI) Advanced Configuration Guide</a>.</li>\n</ul>\n</li>\n<li>Obtain your <strong>ADI Sync Token</strong> and download the ADI sync tool from your KSAT <strong>Account Settings</strong>. Follow the steps below:\n<ol type='a'>\n<li>Once you're logged in to your KSAT console, select your email address in the top-right corner of the page. Then, select <strong>Account Settings</strong>.</li>\n<li>Navigate to the <strong>User Provisioning</strong> section. Then select the <strong>Enable User Provisioning (User Syncing)</strong> check box.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/ADI/ADIDisabled.png'> <img src='https://helpimg.s3.amazonaws.com/ADI/ADIDisabled.png' alt=''> </a></p>\n</li>\n<li>Make sure that the <strong>Test Mode</strong> setting is enabled. Test Mode should only be turned off after you have completed your ADI setup and you have verified that ADI is operating correctly. While <strong>Test Mode</strong> is enabled, user provisioning or syncing does not occur. Instead, a report is generated to show what would have happened if the user provisioning took place. Test Mode allows you to resolve any potential issues without affecting the current users that you have in your console.\n<div class='callout-tip'>\n<div>\n<strong>Tip: </strong>Selecting the <strong>Show Group Domain</strong> check box can be a helpful feature if your users are split between multiple domain sources. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/228466847#GROUP_DOMAIN'>ADI FAQ</a>.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/ADI/ADIAccountSettingsAnnotated.png'> <img src='https://helpimg.s3.amazonaws.com/ADI/ADIAccountSettingsAnnotated.png' alt=''> </a></p>\n</li>\n<li>Copy your <strong>ADI Sync Token</strong> and save it locally. You will need this token to complete your setup. Your ADI Sync Token is 34 digits in length and looks similar to the following example: US9X140X4829E37XX545401X97912X604X.</li>\n<li>Select the <strong>download</strong> icon next to <strong>ADI Tool </strong>(ADISyncSetup.exe) to download the file for the ADI tool.</li>\n<li>Select the <strong>Save Changes</strong> button at the bottom of the <strong>Account Settings</strong> page.</li>\n<li>Decide which users you want to synchronize, and become familiar with where these user objects are located in your AD.</li>\n</ol>\n</li>\n<li>After you complete the steps in this section and the steps in the <a href='#h_01HAA5E9HG0WQCJ9T6RK3SZT0Z'>Installation and Configuration</a> section below, you will need to define where the user objects are located in your AD. You can sync user objects from one or more of the following: organization units (OUs), security groups, and distribution groups. To see additional details about defining the users that you want to sync, see the <a href='#h_01HAA5E9HGZ9KWSGRKAHBN5AMC'>Defining Which OUs, Groups, and Users to Sync</a> section of this article.\n<p>If you find that your user objects are <em>not</em> located in OUs, security groups, or distribution groups, see the information below:</p>\n<ul>\n<li>If the users that you would like to sync are located in the built-in users container instead of an OU: You cannot sync containers. As a workaround, you can create a security group, add those users to the security group, and then sync that group instead of the container.</li>\n<li>If you find that your AD is not organized in an ideal way for syncing with the KSAT console or if you are unsure: You can set up one or more groups in AD for the purpose of containing all of the user objects and groups you'd like to sync. Then, you will specify that you want to sync <em>only</em> those groups.</li>\n<li>If you have a root domain with child ADs, you can run the ADI installer for each child domain. Each child domain must use the same domain controller as the root domain.</li>\n</ul>\n</li>\n<li>Determine which field your users' email addresses should be pulled from in AD. By default, the ADI service will pull your users' proxy addresses to use as their KnowBe4 account email addresses.\n<ul>\n<li>If you need to use something other than proxy addresses, you will need to edit the <strong>emailAttrib</strong> field in your <strong>adisync.conf</strong> file. For example, if you are <em>not</em> using Microsoft Exchange or Microsoft 365 as your mail server, your proxy address field in AD is most likely blank. Edit the <strong>emailAttrib</strong> field after you <a href='#h_01HAA5E9HG0WQCJ9T6RK3SZT0Z'>perform the installation</a> but<em> before</em> you <a href='#h_01HAA5E9HHW2N2ES9R6Q5K99HD'>start the ADI sync service</a>. For instructions, see the <a href='https://support.knowbe4.com/hc/en-us/articles/6151635869843-Active-Directory-Integration-ADI-Advanced-Configuration-Guide#h_01HQNNGRBBAQ782REXJ6H17ARZ'>Changing Where to Pull Email Addresses from in Active Directory</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/6151635869843'>Active Directory Integration (ADI) Advanced Configuration Guide</a>.<br>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> The <strong>useMailAttrib</strong> field has been replaced with the <strong>emailAttribute</strong> field.</div>\n</div>\n</li>\n<li>Make sure all campaigns have their settings properly adjusted for the influx of users. Double-check your Smart Groups settings in campaigns as they can be affected by new users appearing through ADI sync.</li>\n</ul>\n</li>\n</ol>\n<p>Once you have gathered the information above, continue with the steps in the next section.</p>\n<h2 id='h_01HAA5E9HG0WQCJ9T6RK3SZT0Z'>Installation and Configuration</h2>\n<p>Once you have gathered the information outlined in the section above, you are ready to install and configure your ADI sync. Continue with the steps below:</p>\n<ol>\n<li>Run the Active Directory sync tool. This is the <strong>ADISyncSetup.exe</strong> file that you downloaded from your KSAT Account Settings in step 2 of the <a href='#h_01HAA5E9HGQTP57T0D54AX88Q7'>Before You Begin: Required Steps</a> section above. It can be installed anywhere in the environment as long as the system can communicate with a domain controller that accepts LDAP connections.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>We do not recommend installing the ADI tool on a domain controller.</div>\n</div>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>Your AD sync can communicate over LDAP. However, if you would rather, you can enable LDAPS on your domain controller before syncing your Active Directory. By default, LDAPS is <em>not</em> enabled on most domain controllers. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/228466847#LDAPS'>FAQ: Active Directory Integration (ADI)</a> article.</div>\n</div>\n<p>A command prompt will automatically open to the installation directory. The following is the default location of the installation directory on 64-bit platforms: <code>C:\\Program Files\\KnowBe4\\ADI Sync</code></p>\n</li>\n<li>In the command prompt window, you will be prompted to enter the information outlined below:\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/ADI/ADI_config_blurred_numbered.png'> <img src='https://helpimg.s3.amazonaws.com/ADI/ADI_config_blurred_numbered.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>Enter your 34 character ADI Sync Token</strong>: If this is the first time you are running this command, you will be prompted to enter your <strong>Active Directory Synchronization Token</strong>. This token is the string of characters that you copied from your KSAT Account Settings. For more information, see step 2 in the <a href='#h_01HAA5E9HGQTP57T0D54AX88Q7'>Before You Begin: Required Steps</a> section above.</li>\n<li>\n<strong>Enter Active Directory domain name</strong>: The domain name refers to the root domain for your AD. For an example, see the <a href='#h_01HAA5E9HGQTP57T0D54AX88Q7'>Before You Begin: Required Steps</a> section above.</li>\n<li>\n<strong>Enter Active Directory domain controller hostname or IP address</strong>: The AD's hostname or IP address refers to the IP address or Fully Qualified Domain Name (FQDN) for your domain controller where your AD is located.</li>\n<li>\n<strong>Enable SSL (true/false)</strong>: By default, LDAPS is not enabled on your domain controller and you will type \"false\", or press the <strong>Enter</strong> key on your keyboard to automatically select false. Alternatively, if you have enabled LDAPS for the purpose of this sync, type \"true\" instead.</li>\n<li>\n<strong>Enable SecurityCoach Fields (true/false):</strong> If you've purchased <a href='https://support.knowbe4.com/hc/en-us/articles/6654432814355'>SecurityCoach</a>, enter \"true\" to enable SecurityCoach fields. These fields will allow you to sync information for <a href='https://support.knowbe4.com/hc/en-us/articles/7156417916307'>user mapping</a>. For more information, see the <strong>Security Coach Fields</strong> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360015798533'>Edit Your CONF File for Active Directory Integration (ADI)</a> article. By default, these fields are disabled. To keep these fields disabled, press <strong>Enter</strong> on your keyboard.</li>\n<li>\n<strong>Enter Active Directory Port number [389]</strong>: Enter the appropriate LDAP or LDAPS port. By default, for LDAP the port is port <strong>389</strong> and for LDAPS the port is port <strong>636</strong>.</li>\n<li>\n<strong>Enter Username (user@domain)</strong>: Enter the username for the AD administrator account that has the necessary read permissions to perform LDAP queries. This username should be in the format of \"user@domain\".</li>\n<li>\n<strong>Enter Password</strong>: Enter the password for the AD administrator account that has the necessary read permissions to perform LDAP queries.</li>\n</ol>\n</li>\n<li>If the connection was successful, you will see a confirmation message that the ADI has been connected and configured for your domain, as shown in the example above.</li>\n<li>Press the <strong>Enter</strong> key on your keyboard to exit the command prompt window.\n<p>If there were issues reaching or authenticating with your domain controller, you will see error messages in the command prompt window and you will need to repeat the steps in this section with the correct configuration data. If you continue to experience errors, please <a href='https://support.knowbe4.com/hc/en-us/requests/new'>contact our support team</a>.</p>\n<p>Once your connection is successful, see the next section so you can specify the users and information that you want to sync with your KSAT console.</p>\n</li>\n</ol>\n<h2 id='h_01HAA5E9HGZ9KWSGRKAHBN5AMC'>Defining Which OUs, Groups, and Users to Sync</h2>\n<p>After you have completed the steps in the previous two sections, you will edit the <strong>&lt;your domain here&gt;.conf</strong> file to configure the information that you want to sync with your KSAT account. This configuration is required to sync users from your AD.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>When you are configuring the <strong>your domain here.conf</strong> file, it is helpful to have Active Directory Users and Computers (ADUC) open so the OU paths and groups are available to you.</div>\n</div>\n<p>Continue your ADI setup with the steps below:</p>\n<ol>\n<li>Make sure that you have edit permissions on the <strong>C:\\ProgramData\\KnowBe4\\ADI Sync\\Config</strong> folder.</li>\n<li>Find the <strong>&lt;your domain here&gt;.conf </strong>file in the installation directory, as shown below. Open the file in a text editor, such as Notepad.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/ADI/ADIDomainConf.png'> <img src='https://helpimg.s3.amazonaws.com/ADI/ADIDomainConf.png' alt=''> </a></p>\n<p>The <strong>&lt;your domain here&gt;.conf</strong> file is used to define the users, user information, and groups that you want to sync between your KSAT account and your AD. To see an example of this file, open this <a href='https://helpimg.s3.amazonaws.com/ADI/sample_domain.txt'>sample_domain</a> file.</p>\n<div class='callout-remember'>\n<div>\n<strong>Note: </strong>Make sure that you are editing the <strong>&lt;your domain here&gt;.conf</strong> file and <em>not</em> the <strong>adisync.conf</strong> file.</div>\n</div>\n</li>\n<li>Edit the <strong>&lt;your domain here&gt;.conf</strong> file to specify the criteria for your user and group synchronization. There are three sections of the <strong>&lt;your domain here&gt;.conf</strong> file that you can modify:\n<ul>\n<li>\n<strong>[sync.fields]</strong> (Optional): Edit this area to specify the user information fields that you want to sync from your AD. To learn more, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360015798533-Edit-Your-CONF-File-for-Active-Directory-Integration-ADI#h_01HQNP60G14SW966W3QJHG37NJ'>Syncing Other User Information to KnowBe4</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360015798533'>Edit Your CONF File for Active Directory</a> article.</li>\n<li>\n<strong>[sync.users]</strong> (Required): Edit this area to specify which users you want to sync from your AD. Make sure you include at least one OU, group, or user under the <strong>[sync.users]</strong> section of the .conf file.</li>\n<li>\n<strong>[sync.groups]</strong> (Optional): You can use this area to specify the groups that you would like to sync from your AD. These groups will be automatically created in your KnowBe4 console, and the applicable users will be added to the groups.</li>\n</ul>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If your OUs or Group names contain letters that are not part of the standard English alphabet, replace the quotation marks (\") with single quotes (') in the <strong>&lt;your domain here&gt;.conf</strong> file. Additionally, you will need to use a double backslash to escape special characters like commas, hashtags, and plus signs. For details, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360017646134'>Escape Characters with Active Directory Integration Guide</a>.</div>\n</div>\n</li>\n<li>Once you're finished, save the changes you've made to the <strong>&lt;your domain here&gt;.conf</strong> file.</li>\n</ol>\n<p>See the next section to start your ADI sync.</p>\n<h2 id='h_01HAA5E9HHW2N2ES9R6Q5K99HD'>Start Your ADI Sync</h2>\n<p>If you have completed all of the steps above, your KnowBe4 ADI Sync Service is now configured and you can start the ADI sync. Continue with the steps below:</p>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Before starting your sync, make sure that <strong>Test Mode</strong> is enabled in your KSAT <strong>Account Settings</strong>. For more information, see step 2 in the <a href='#h_01HAA5E9HGQTP57T0D54AX88Q7'>Before You Begin: Required Steps</a> section above.</div>\n</div>\n<p>You may start the sync by using the Windows Service Control Manager to start the KnowBe4 ADI Sync Service.</p>\n<p>The KnowBe4 ADI Sync Service will run immediately. While services are connected, syncs between your AD and the KSAT console will occur once every six hours.</p>\n<p>When <strong>Test Mode</strong> is enabled in your <strong>Account Settings</strong>, you will see a preview of how your AD will sync to KnowBe4. To view the Test Mode preview, navigate to <strong>Users</strong> &gt; <strong>Provisioning </strong>in your KSAT console.</p>\n<p>Keep <strong>Test Mode</strong> enabled until you are sure that you have set up ADI in a way that meets your organization's needs. Once you're happy with your ADI setup, navigate to your KSAT <strong>Account Settings</strong> and disable Test Mode. Your next ADI sync will provision your users automatically.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/228373888-Active-Directory-Integration-ADI-Configuration-Guide",
    "images": [
      {
        "url": "https://s3.amazonaws.com/helpimg/ADI/ADDomainName.png",
        "alt": "",
        "position": 1,
        "context": "See the image below for an example of an AD domain name."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/ADI/ADIDisabled.png",
        "alt": "The image displays a software configuration panel titled **User Provisioning**.\n\n**Status and Controls:**\n1.  **Status Indicator:** The feature is shown as **Disabled** (indicated in red text and preceded by a red Windows icon).\n2.  **Enable Checkbox:** A checkbox option is available to **Enable User Provisioning (User Syncing)**, followed by a help icon (?).\n3.  **Provisioning Method Selector:** A two-option segmented control allows selection between provisioning protocols: **ADI** (Active Directory Integration) is currently selected (highlighted in blue), and **SCIM** (System for Cross-domain Identity Management) is the unselected option. This control also includes a help icon (?).\n4.  **Action Button:** A button is provided to access configuration parameters, labeled **+ Active Directory Integration Settings**.",
        "position": 2,
        "context": "Then select the Enable User Provisioning (User Syncing) check box."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/ADI/ADIAccountSettingsAnnotated.png",
        "alt": "The image displays the **User Provisioning** configuration panel, with the status confirmed as **ADI Enabled**.\n\n**Configuration State:**\n*   The options **Enable User Provisioning (User Syncing)** and **Test Mode** are both checked.\n*   The provisioning method is set to **ADI** (Active Directory Integration), selected via a toggle interface, with **SCIM** listed as the alternative option.\n\n**Active Directory Integration Settings:**\n*   The header **Active Directory Integration Settings** is expanded.\n*   A checkbox labeled **Show Group Domain** is present but unchecked.\n*   The **ADI Sync Token** field displays a redacted alphanumeric token, paired with a blue action button labeled **Regenerate ADI Token**.\n\n**Resources:**\n*   A resource link is provided at the bottom for the **ADI Tool (ADISyncSetup.exe)**, indicated by document and download icons.",
        "position": 3,
        "context": "//support.knowbe4.com/hc/en-us/articles/228466847#GROUP_DOMAIN'>ADI FAQ."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/ADI/ADI_config_blurred_numbered.png",
        "alt": "This image displays the completion of a command-line utility configuration for the KnowBe4 Active Directory Integration (ADI) Sync tool.\n\n**UI and Context:**\nThe screen shows a Windows console window titled `C:\\Program Files\\KnowBe4\\ADI Sync\\adisync.exe`, indicating the utility is running directly from its installation directory.\n\n**Configuration Details (Sequential Input/Output):**\nThe process initiated because the `Global Configuration not found, creating new one.` The following critical parameters were defined:\n\n1.  **ADI Sync Token:** Entered (value redacted).\n2.  **Domain Name:** Set to `temasoft.com`.\n3.  **Domain Controller:** Set to `WIN-2019-DC1.temasoft.com`. The utility confirmed the DC runs `'Windows Server 2019 Standard'`.\n4.  **SSL:** Disabled (`false`).\n5.  **SecurityCoach Fields:** Enabled (`true`).\n6.  **LDAP Port:** Set to the default, `389`.\n7.  **Credentials:** Username (redacted) and Password (obfuscated with `********`) were entered.\n\n**Completion and Post-Configuration Instructions:**\nThe utility successfully reported: `Connecting to AD Server...` and `Connected and configured for domain: [domain redacted]`.\n\nFinal instructions were provided for post-configuration setup:\n\n1.  **Configuration File Edit:** Users must edit the file `'C:\\ProgramData\\KnowBe4\\ADI Sync\\Config\\temasoft.com.conf'` to specify Organizational Units, users, or groups for synchronization.\n2.  **Service Management:** Users must start or restart the Windows service with the display name `'KnowBe4 ADI Sync Service'` (service name `adsservice`).\n3.  **Exit Prompt:** The session concluded with `Configuration complete.` and `Press enter to exit.`",
        "position": 4,
        "context": "the command prompt window, you will be prompted to enter the information outlined below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/ADI/ADIDomainConf.png",
        "alt": "The image is a screenshot of the Windows File Explorer interface, displaying the contents of a local application configuration directory.\n\n**Context and Navigation:**\n\n*   **Path (Address Bar):** `This PC > Local Disk (C:) > ProgramData > KnowBe4 > ADI Sync > Config`\n*   **Window Title:** `Config`\n*   **Ribbon:** `File` tab is active, showing access to standard file operations.\n\n**File Listing Details:**\n\nThe file list is displayed with columns for Name, Date modified, Type, and Size. The following configuration files are visible:\n\n| Name | Date modified | Type | Size |\n| :--- | :--- | :--- | :--- |\n| adisync.conf | 4/19/2024 11:02 AM | CONF File | 1 KB |\n| **DevKB4-a.com.conf** (Highlighted) | 4/19/2024 11:02 AM | CONF File | 2 KB |\n| DevKB4-a.com.dat | 4/19/2024 10:55 AM | DAT File | 1 KB |\n| users.json | 4/25/2024 5:16 AM | JSON File | 3 KB |\n\n**Focus Element:**\n\nThe file **`DevKB4-a.com.conf`** is highlighted (selected by the operating system) and emphasized with an orange bounding box, indicating it is the target configuration file for user action or inspection. This file is 2 KB in size and has a `.conf` extension.",
        "position": 5,
        "context": "Open the file in a text editor, such as Notepad."
      }
    ],
    "metadata": {
      "category": "Security Awareness Training",
      "section": "Active Directory Integration",
      "topics": [
        "active",
        "adi",
        "awareness",
        "configuration",
        "integration",
        "security",
        "training"
      ],
      "image_count": 5
    }
  }
}