{
  "article": {
    "id": 236092968,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/236092968.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/236092968.html",
    "author_id": 368027116814,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 22,
    "vote_sum": -13,
    "vote_count": 35,
    "section_id": 360000154707,
    "created_at": "2016-12-09T16:33:21Z",
    "updated_at": "2025-06-05T18:19:12Z",
    "name": "Troubleshoot Login Issues",
    "title": "Troubleshoot Login Issues",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T16:53:27Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "can't log in",
      "trouble logging in",
      "forgot password",
      "forgot my password",
      "reset password",
      "forgotten password",
      "cant login",
      "cant log in",
      "cannot log in",
      "localized",
      "Login",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>If you're having difficulty logging in to your account, use this article to troubleshoot common issues. If you are an end-user, please see <a href='https://support.knowbe4.com/hc/en-us/articles/360035204974' target='_self'>this article</a> on our Knowledge Base.</p>\n<p>None of these scenarios describe your issue? <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener noreferrer'>Contact our support team</a> and we will assist you.</p>\n<h2 id='h_01HQNRRJ8HM1J4391YMA4V4REB'>I am an admin attempting to log in to my account, or I forgot my password.</h2>\n<p>Select the scenario that best describes your situation.</p>\n<ul class='js-toggles' role='list'>\n<li title='I have logged in before.'>\n<p>If you've just signed up with us, you will be sent an automated email from our system containing an activation link which you will need to click on to confirm your account and set your password. Once you set your password, you'll be able to log in to your management console.</p>\n<p>If you didn't receive it, check your Junk or Spam folder. To resend this activation link, visit your KnowBe4 training login page, enter your email address, and click the <strong>Didn't receive confirmation instructions?</strong> link. <span>If you're not sure what your training login page is, see our </span><a href='https://support.knowbe4.com/hc/en-us/articles/360043196354' target='_self'>KnowBe4's Training Instances</a><span> article for a full list of login links.</span></p>\n<p>If you still do not receive the email, contact our support team for assistance. Once you confirm your account and set your password, you'll be able to log in to your account to take your training.</p>\n</li>\n<li title='I have already confirmed my account but need to reset my password.'>\n<p>To reset your KSAT password, click the <strong>Forgot your password?</strong> link on the login page or use our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354' target='_self'>KnowBe4's Training Instances</a> article to find a direct link to your Reset Password page. Then, enter your work email address and click <strong>Send me reset password instructions</strong>. The password reset confirmation and instructions will be emailed to that email address.</p>\n<p>If you receive an error that says: \"This account is not yet confirmed\", you will need to click the activation link in order to confirm your account and set your password.</p>\n<p>Otherwise, you will receive an email to the email address you entered which will provide you a link to click on to set your new password. New password links will be active for approximately six hours.</p>\n<p>If you didn't receive the email, check your Junk or Spam folder. If you still do not receive the email, contact our support team for assistance.</p>\n</li>\n<li title='I entered my password incorrectly too many times and now I'm locked out of my account.'>\n<p>Your account will be locked for one hour after you enter your password incorrectly ten times. To unlock your account before an hour has passed, you will need to reset your password. To reset your KSAT password, click the <strong>Forgot your password?</strong> link on the login page or use our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354' target='_self'>KnowBe4's Training Instances</a> article to find a direct link to your Reset Password page.</p>\n</li>\n<li title='I am experiencing a different issue.'>\n<p>Can't find a helpful solution? <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_self'>Contact our support team</a> and we will assist you.</p>\n</li>\n</ul>\n<h2 id='h_01HQNRRJ8HV4SK9ZDPA3D3V7BQ'>I am a reseller/MSP attempting to log in to my account, or I forgot my password.</h2>\n<p>Select the scenario that best describes your situation.</p>\n<ul class='js-toggles' role='list'>\n<li title='I have logged in before.'>\n<p>If you've just signed up with us, you will be sent an automated email from our system containing an activation link which you will need to click on to confirm your reseller/MSP account and set your password. Once you set your password, you'll be able to log in at your KnowBe4 MSP/reseller login page.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> Your KnowBe4 MSP/reseller login page is the KnowBe4 instance where your console is hosted, followed by the subdirectory <strong>/management/login</strong>. For example, https://training.knowbe4.com/management/login. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354' target='_self'>KnowBe4's Training Instances</a> article for a full list of login links.</div>\n</div>\n<p>If you didn't receive it, check your Junk or Spam folder. To resend this activation link, visit your KnowBe4 training MSP/reseller page, enter your email address, and click the <strong>Didn't receive confirmation instructions?</strong> link. </p>\n<p>If you still do not receive the email containing this link, contact our support team for assistance. Once you confirm your account and set your password, you'll be able to log in and manage your reseller/MSP account.</p>\n</li>\n<li title='I have confirmed my account but I need to reset my password.'>\n<p>To reset your KSAT password, click the <strong>Forgot your password?</strong> link on the MSP/reseller login page or use our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354' target='_self'>KnowBe4's Training Instances</a> article to find a direct link to your Reset Password page. Then, enter your work email address and click <strong>Send me reset password instructions</strong>. The password reset confirmation and instructions will be emailed to that email address. </p>\n<p>If you receive an error that says \"This account is not yet confirmed\", you will need to click the activation link in order to confirm your account and set your password.</p>\n<p>Otherwise, you will receive an email to the email address you entered which will provide you a link to click on to set your new password. New password links will be active for approximately six hours.</p>\n<p>If you didn't receive the email, check your Junk or Spam folder. If you still do not receive the email, contact our support team for assistance.<a name='login'></a></p>\n</li>\n<li title='I entered my password incorrectly too many times and now I'm locked out of my account.'>\n<p>Your account will be locked for one hour after you enter your password incorrectly ten times. To unlock your account before an hour has passed, you will need to reset your password. To reset your KSAT password, click the <strong>Forgot your password?</strong> link on the MSP/reseller login page or use our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354' target='_self'>KnowBe4's Training Instances</a> article to find a direct link to your Reset Password page.</p>\n</li>\n<li title='I am experiencing a different issue.'>\n<p>Can't find a helpful solution? <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_self'>Contact our support team</a> and we will assist you.</p>\n</li>\n</ul>\n<h2 id='h_01HQNRRJ8HFZGBWYBN89S01HGA'>My user is having trouble logging in to their account. How do I reset their password?</h2>\n<p>You can manually change or reset your users' passwords by following the steps in <a href='https://support.knowbe4.com/hc/en-us/articles/115005868908' target='_self'>this article</a>.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/236092968-Troubleshoot-Login-Issues",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "issues",
        "login",
        "troubleshoot"
      ],
      "image_count": 0
    }
  }
}