{
  "id": 29586165576339,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/29586165576339.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/29586165576339.html",
  "author_id": 397832506533,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 2,
  "vote_count": 2,
  "section_id": 30042379444499,
  "created_at": "2024-05-21T17:37:31Z",
  "updated_at": "2025-10-27T20:03:26Z",
  "name": "Google User Provisioning (GUP) Guide",
  "title": "Google User Provisioning (GUP) Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-09-30T17:14:24Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [
    "01HASWC0TM4R1K4WRNG1YFNN8S"
  ],
  "label_names": [
    "localized",
    "answerbot",
    "answerbot_kmsat"
  ],
  "body": "<p>Google User Provisioning (GUP) is an automated method for importing users from your Google Workspace tenant directly into your KnowBe4 console. This integration allows you to use data from Google Workspace to provision users in your KnowBe4 console. Changes that you make to your users’ information and statuses in Google Workspace will sync automatically to your KnowBe4 console. Once you have configured the integration, you’ll be able to manage all your users from one place.</p>\n<p>This integration requires you to have access to a Google super-admin account. The admin account must have the permissions to configure the six Google scopes that are required by this integration. For the full list of required scopes, see the <a href='#h_01HZHK4XWS273NA90MS3P8BVY2'>What You Will Need</a> section of this article. If you are not a Google customer, KnowBe4 also offers other methods of automated user provisioning. For further information about alternative user provisioning methods, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360052380374.html'>SCIM Configuration Guide</a> or our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/228373888.html'>Active Directory Integration (ADI) Configuration Guide</a>.</p>\n<h2 id='h_01HZHK0BFY6VVBX05GSMTJ7ZP4'>How GUP Works</h2>\n<p>Using your Google <strong>Customer ID</strong> and your KnowBe4 <strong>Client ID</strong>, you can configure a direct connection between your Google Workspace environment and your KnowBe4 console. Once this connection has been established, you can configure which of your Google Workspace users and groups you would like to sync into your KnowBe4 console. Changes that you make to your users in Google Workspace will be reflected automatically in your KnowBe4 console.</p>\n<p>This sync is an automated process that occurs repeatedly throughout the day. Syncs will occur every six hours at minimum. The sync is a one-way process, and any changes made to users in your KnowBe4 console will not sync to your Google Workspace environment. Changes made to users directly in your KnowBe4 console will be overwritten by the data in Google Workspace. Any users in your KnowBe4 console who are not present in Google Workspace will be archived during the next GUP sync.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> You have the option to prevent any specific users from being managed by GUP. To prevent specific users from being managed by GUP, create a CSV file with a list of users that you don’t want to be managed by GUP. Enter “false” under the <strong>Provisioning Managed</strong> heading for those users.</div>\n</div>\n<h2 id='h_01HZHK1SW9Z685B81GY3M1R0H0'>Prerequisites</h2>\n<ul>\n<li>You must have admin access to your organization's KnowBe4 console.</li>\n<li>You must have super-admin access to Google Workspace.</li>\n</ul>\n<h2 id='h_01HZHK45DHHA6N5PA6GTGZ3D9H'>Configuring Your Google Workspace Connection</h2>\n<p>In order to configure GUP, you’ll need to connect your KnowBe4 console to your Google Workspace tenant.</p>\n<h3 id='h_01HZHK4XWS273NA90MS3P8BVY2'>What You Will Need</h3>\n<p>You will need to gather the KnowBe4 <strong>Client ID</strong> and list of six scopes from your KnowBe4 <strong>Account Settings</strong> in order to complete the connection to Google Workspace. This information can be found by navigating to your <strong>Account Settings</strong>, clicking <strong>User Management</strong> &gt; <strong>User Provisioning</strong>, and then toggling the <strong>Google</strong> button, as shown in the screenshot below:</p>\n<p><img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/WorkspaceConnectionScopes.png'></p>\n<p>Additionally, you will also need your Google Customer ID and Google super-admin email address when configuring the connection in your KnowBe4 <strong>Account Settings</strong>. This information is located in your Google Admin console. You can find it by logging in at <a href='https://admin.google.com'>admin.google.com</a>, and then clicking <strong>Account</strong> &gt; <strong>Account Settings</strong>. Your customer ID is shown at the top of the list.</p>\n<p><img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsCustomerIDAnnotated.png'></p>\n<p>Once you have the information listed above, you can begin configuring the Google Workspace connection.</p>\n<h3 id='h_01HZHYFVJKFQKQXGG6JZY9BZ2C'>Google Workspace Configuration</h3>\n<p>To connect Google Workspace and your KnowBe4 console, follow the steps below:</p>\n<ol>\n<li>Log in at <a href='https://admin.google.com'>admin.google.com</a>.</li>\n<li>From the home page of your Google Admin console, click <strong>Security</strong> &gt; <strong>Access and data control</strong> &gt; <strong>API controls</strong>.</li>\n<li>Click <strong>Manage Domain Wide Delegation</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageDomainWideDelegationAnnotated.png'>\n</li>\n<li>On the next screen, click <strong>Add New</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddNewAnnotated.png'>\n</li>\n<li>You will need to enter the KnowBe4 <strong>Client ID</strong> from your <strong>Account Settings</strong>, along with the list of six scopes.\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> Each scope will need to be separated by a comma.</div>\n</div>\n<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddNewClientID.png'> Once you have entered this information, click <strong>Authorize</strong>. You should now see KnowBe4's GUP listed in the <strong>API clients</strong> list.</li>\n</ol>\n<h3 id='h_01HZHZ96Z2A269REWT9WRKC59H'>KnowBe4 Account Settings Configuration</h3>\n<p>Once you have completed the above steps, you can configure the connection from your KnowBe4 console to Google Workspace.</p>\n<ol>\n<li>Log in to your KnowBe4 console.</li>\n<li>Navigate to your <strong>Account Settings</strong> by clicking your username, then clicking <strong>Account Settings</strong> in the drop-down menu.</li>\n<li>Click <strong>User Management</strong> &gt; <strong>User Provisioning</strong>, and then toggle the <strong>Google</strong> button.</li>\n<li>Enter your information into the <strong>Google Workspace Customer ID</strong> and <strong>Google Workspace Admin Email Address</strong> fields. Instructions for locating your <strong>Google Workspace Customer ID</strong> can be found in the <a href='#h_01HZHK45DHHA6N5PA6GTGZ3D9H'>Configuring Your Google Workspace Connection</a> section above. <img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsGoogleWorkspaceConnection.png'>Once you have entered the information, click <strong>Save</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsConnectionSaved.png'>If your connection was successful, you will see a “Connection saved” message, as shown in the screenshot above. You can then click <strong>Configure Google Provisioning User Scoping</strong> to begin configuring the users that you would like to import into your KnowBe4 console. For further instructions, see step 1 in the next section.</li>\n</ol>\n<h2 id='h_01HZHZZWHMY11VV5549DXYP53X'>Configure Google Provisioning</h2>\n<p>Now that you have successfully connected your KnowBe4 console to Google Workspace, you can begin provisioning your users. If you have not yet established the Google Workspace connection, see the <a href='#h_01HZHK45DHHA6N5PA6GTGZ3D9H'>Configuring Your Google Workspace Connection</a> section above.</p>\n<p>Prior to running your first sync, we strongly recommend keeping your KnowBe4 console in <strong>Test Mode</strong> in order to verify that you are happy with the results of your sync. <strong>Test Mode</strong> enables you to see the users who would be included in your sync before they are added to your KnowBe4 console. This will allow you to make any necessary adjustments to your configuration prior to any users actually being provisioned. For further information about placing your console into <strong>Test Mode</strong>, see the <strong>User Provisioning</strong> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/12731036715411.html'>KnowBe4 Console Account Settings: User Management</a> article.</p>\n<h3 id='h_01HZJ02EHKNNRH30CDYHCYAF4D'>User Scoping</h3>\n<p>To begin configuring your <strong>User Scoping</strong>, follow the steps below:</p>\n<ol>\n<li>After logging in to your KnowBe4 console, navigate to <strong>Users</strong> &gt; <strong>Provisioning</strong>.</li>\n<li>In the top-right corner, click the <strong>Configure Google Provisioning</strong> button.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ClickConfigureGoogleProvisioningAnnotated.png'>\n</li>\n</ol>\n<p>Before continuing, you’ll need to determine how you would like to sync your users into your KnowBe4 console. You’ll have the option to sync by domain and group membership, OU scoping, or a combination of both methods. We generally recommend that customers start by adding a domain and then configuring users and groups for syncing. This method is the only method that allows you to sync group membership information into your KnowBe4 console.</p>\n<p>If you would like to sync users by adding a domain and configuring groups for syncing, proceed to the <a href='#h_01J5BH8XZJB67NTA9SAWEA66F8'>Syncing By Domain and Group Membership</a> section below. If you would like to use OU scoping to sync your users, navigate to the <a href='#h_01J5BQJ99NWT8H8T4RERBGNA9K'>Syncing By OU Scoping</a> section.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> Both methods can be used simultaneously to sync users.</div>\n</div>\n<h3 id='h_01J5BH8XZJB67NTA9SAWEA66F8'>Syncing By Domain and Group Membership</h3>\n<p>You can use this method if you would like to sync groups of users or individual users. You can choose to include or exclude groups or users, as well as sync group membership information about your users into your KnowBe4 console.</p>\n<ol>\n<li>Click the <strong>+Add Domain</strong> button.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/EmptyStateText_OUScopingToggle_Annotated.png'>This will allow you to select a domain from which to import your users. In order to import a user into your KnowBe4 console, you will need to select the Google domain in which they currently reside. The list of currently available domains will appear in the drop-down menu. Once you have selected a domain, click <strong>Save</strong>.<br>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note</strong>: The domain must be an Allowed Domain on your account. For further information regarding adding an Allowed Domain, see our Add and Verify Domains article.</div>\n</div>\n<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddDomain.png'>\n</li>\n<li>You will now see the domain included in the <strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>User Scoping</strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'> section. Click the arrow next to the domain name to expand the drop-down menu.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/UserScoping_OUScopingToggle.png'></span><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Here, you’ll see options for configuring the users and groups you want to include in the sync. You also have the option to exclude groups and users from syncing. Excluding a group or user will take precedence over including them. For example, if you include a group for syncing but exclude a specific user who resides in that group, all users in the group will be provisioned except for that specific user.</span>\n<ol>\n<li>\n<strong>Manage Groups</strong>: This button allows you to select groups from your Google Workspace environment. You can specify which groups you would like to include for syncing, and you can also choose to exclude specific groups from the sync. This option may be useful if there are nested groups that you would like to exclude from a larger group. A nested group is a Google group that is a member of another group, and it will be included by default during the sync unless it is manually excluded.\n<p>Group names must be unique in order to sync into your KnowBe4 console, even if they are located in different domains.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> You will need to type the name of the group that you would like to include or exclude in order to select them from the drop-down menus. You must type at least two characters of the group name in order for it to appear in the menu.</div>\n</div>\n<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageGroups.png'>When you have finished configuring your included and excluded groups, click <strong>Save</strong>. </li>\n<li>\n<strong>Manage Users</strong>: This button allows you to select users from your Google Workspace environment. You can specify which users you would like to include for syncing, and you can also choose to exclude specific users from the sync. The <strong>Sync All Users in this Domain</strong> check box will allow you to provision all users who are associated with the domain. Users that have been excluded from syncing will not be provisioned when this check box is selected.\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> You will need to type the email address of the user that you would like to include or exclude in order to select them from the drop-down menus. You must type at least five characters of the user’s email in order for it to appear in the menu.</div>\n</div>\n<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageUsers.png'>When you have finished configuring your included and excluded users, click <strong>Save</strong>.</li>\n</ol>\n</li>\n<li> Once you have configured your groups and users, click <strong>Save Configuration</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/SaveConfiguration.png'>\n</li>\n<li>The button will change to <strong>Sync Now</strong>. If you will not need to configure OU scoping or <strong>Field Mapping</strong> in addition to your user and group settings, you can click this button to begin syncing your users from Google Workspace. If you would like to also configure OU scoping or <strong>Field Mapping</strong> in addition to your group membership configuration, continue to the sections below.</li>\n</ol>\n<h3 id='h_01J5BQJ99NWT8H8T4RERBGNA9K'>Syncing By OU Scoping</h3>\n<p>If you would like to configure GUP to sync users using OUs, click the <strong>Enable OU Scoping</strong> toggle switch. This will give you the ability to specify OUs from your Google Workspace environment for inclusion in your sync. You can use this method in addition to configuring users and groups for syncing, or you can use the OU scoping method on its own.</p>\n<p>OU scoping supports nesting when searching for users. For example, if you are including an OU for syncing, GUP will include all users who are part of that OU, as well as any users contained within OUs that are nested under it. If you sync users using only OU scoping, group membership information will not be synced to your KnowBe4 console. If you would like to sync group membership information from Google Workspace, you will need to specify user and group information as outlined in the <a href='#h_01J5BH8XZJB67NTA9SAWEA66F8'>Syncing By Domain and Group Membership</a> section above.</p>\n<p>To configure OU scoping for your users, follow the steps below:</p>\n<ol>\n<li>Click the <strong>Enable OU Scoping</strong> toggle switch.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/Enable_OU_Scoping_Toggle.png'>\n</li>\n<li>This will enable menus for <strong>Including</strong> or <strong>Excluding</strong> OUs. You can select the OUs that you would like to include or exclude in your sync.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/Including_Excluding_OUs.png'>\n</li>\n<li>Once you have configured the OUs for syncing, click <strong>Save Configuration</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/OU_Scoping_Save_Configuration.png'>\n</li>\n<li>When you are satisfied with your configuration choices, click <strong>Sync Now</strong> to run your sync.</li>\n</ol>\n<p>Alternatively, if you would like to configure field mapping for your users prior to running your first sync, see the <strong>Field Mapping</strong> section below before continuing with syncing.</p>\n<h3 id='h_01HZJ2PE28YARFT1YWNAR5S8W9'>Field Mapping</h3>\n<p>The GUP sync supports syncing standard Google user attributes into your KSAT console. Configuring the <strong>Field Mapping</strong> section for your users is optional. By default, the GUP sync will include and map the following Google attributes to their corresponding KSAT attributes:</p>\n<table style='width: 455px;'>\n<caption>Google User Provisioning Default Attributes</caption>\n<thead>\n<tr>\n<th style='width: 247.453px;' scope='col'>Google Directory Attribute</th>\n<th style='width: 200.547px;' scope='col'>KSAT Attribute</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style='width: 239.453px;'>givenName</td>\n<td style='width: 192.547px;'>First Name</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>familyName</td>\n<td style='width: 192.547px;'>Last Name</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>workPhone</td>\n<td style='width: 192.547px;'>Phone Number</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>externalID</td>\n<td style='width: 192.547px;'>Employee Number</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>orgTitle</td>\n<td style='width: 192.547px;'>Job Title</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>orgName</td>\n<td style='width: 192.547px;'>Organization</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>orgDepartment</td>\n<td style='width: 192.547px;'>Department</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Mobile Phone Number</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Location</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Division</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Custom Field 1</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Custom Field 2</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Custom Field 3</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Custom Field 4</td>\n</tr>\n</tbody>\n</table>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>Certain values such as the <strong>Manager Email</strong> and <strong>Manager Name</strong> field will sync by default if populated in your Google Workspace tenant.</div>\n</div>\n<p>If you would like to make adjustments to the default attributes that are included in the sync, follow the steps below:</p>\n<ol>\n<li>Navigate to the <strong>Configure Google Provisioning</strong> page, as shown in steps 1 and 2 in the <a href='#h_01HZJ02EHKNNRH30CDYHCYAF4D'>User Scoping</a> section above.</li>\n<li>In the <strong>Field Mapping</strong> section, click the drop-down arrow next to <strong>Mapping Rules</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingDropdown.png'>\n</li>\n<li>This action will expand the <strong>Field Mapping</strong> section.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExpanded.png'>\n<ol>\n<li>\n<strong>Google Directory Attribute</strong>: This column includes your users’ data and attributes as they appear in your Google Workspace environment. You can click the drop-down arrow next to the name of a <strong>Google Directory Attribute</strong> to open the drop-down menu that contains additional attributes for selection. The attribute that you select on the left side of the screen will be mapped to the adjacent <strong>KSAT Attribute</strong> on the right side. At this time, primary attribute types are the only attributes that are supported for syncing.</li>\n<li>\n<strong>KSAT Attribute</strong>: This column includes your users’ attributes as they will appear in their User Information subtab in your KnowBe4 console. Selections that are made in the <strong>Google Directory Attribute</strong> column will be mapped to these attributes.\n<p>For example, in the screenshot below, the “workPhone” attribute from Google Workspace will be mapped to the <strong>Phone Number</strong> attribute in your KnowBe4 console.<img style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;' src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExample1.png'></p>\n<p><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>You can choose to map any available </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Google Directory Attribute</strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'> to the </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>KSAT Attribute</strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'> of your choice by changing the </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Google Directory Attribute</strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'> in the drop-down menu, as shown in the example below.</span><img style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;' src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExample2.png'></p>\n</li>\n</ol>\n</li>\n<li>\n<span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Once you have made your </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Field Mapping </strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>selections, click the </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Save Configuration </strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>button at the top-right corner of the page.<br></span><img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/SaveConfiguration.png'>\n</li>\n<li>The button will change to <strong>Sync Now</strong>. You can click this button to run your sync, as shown in step 6 of the <a href='#h_01HZJ02EHKNNRH30CDYHCYAF4D'>User Scoping</a> section above.\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong>Once you are satisfied with the results of your GUP test mode syncs you will need to disable <strong>Test Mode</strong> in your <strong>Account Settings</strong> in order for your Google users to begin syncing to your KnowBe4 console.</div>\n</div>\n</li>\n</ol>\n<h2 id='h_01HZJCK5HWSKN524ZXRMM9NQY7'>Troubleshooting</h2>\n<p>In this section, you will find error messages related to GUP, along with potential causes.</p>\n<table style='height: 755px;' width='700'>\n<caption>GUP Error Messages</caption>\n<thead>\n<tr>\n<th style='width: 162.617px;' scope='col'>Error Message</th>\n<th style='width: 530.383px;' scope='col'>Cause</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style='width: 154.617px;'>Google Admin email connection is no longer valid.</td>\n<td style='width: 522.383px;'>\n<p>This error message can have several causes:</p>\n<ul>\n<li>The Google super-admin email address that was used to configure the Google Workspace connection has been archived in your Google Workspace tenant.</li>\n<li>The Google super-admin email address that was used to configure the Google Workspace connection no longer has super-admin permissions.</li>\n<li>One or more of the scopes that were used to configure the Google Workspace connection have been removed.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style='width: 154.617px;'>Google domain connection is no longer valid.</td>\n<td style='width: 522.383px;'>This error message occurs when the domain used in the provisioning configuration no longer exists in your Google Workspace tenant.</td>\n</tr>\n<tr>\n<td style='width: 154.617px;'>Invalid admin email.</td>\n<td style='width: 522.383px;'>This error message occurs when entering your Google super-admin email address in your KnowBe4 <strong>Account Settings</strong>. This message means that the email address formatting is incorrect.</td>\n</tr>\n<tr>\n<td style='width: 154.617px;'>Sync error.</td>\n<td style='width: 522.383px;'>\n<p>The <strong>Credentials</strong> tab will show if there’s an error in your sync. If no errors are present, the <strong>Domains</strong>, <strong>Credentials</strong>, and <strong>OU</strong> sync subtabs will be hidden.</p>\n<p><img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/UserProvisioningSyncReports.png'></p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>If you have any questions or experience any issues with your configuration, submit a ticket at <a href='https://support.knowbe4.com/hc/en-us/requests/new'>https://support.knowbe4.com/hc/en-us/requests/new</a>.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/29586165576339-Google-User-Provisioning-GUP-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/WorkspaceConnectionScopes.png",
      "alt": "This image displays a User Interface (UI) element, specifically a configuration page for directory integration settings.\n\n**UI Context:**\n\n*   The page header features three tabs: **ADI** (Active Directory Integration), **SCIM**, and the selected tab, **Google**.\n*   Below the tabs are expandable sections for configuration:\n    *   **+ Active Directory Integration Settings** (Status: **Disabled**)\n    *   **+ SCIM Settings** (Status: **Disabled**)\n    *   **- Google Workspace Settings** (Expanded)\n\n**Google Workspace Settings Content (Setup Process):**\n\nThe expanded \"Google Workspace Settings\" section contains a collapsible step-by-step procedure titled **- View Setup Process** (currently expanded). This procedure outlines steps required in the Google Workspace Admin console for API delegation.\n\nThe visible steps are:\n\n1.  Navigate to `admin.google.com`.\n2.  Instructions detailing navigation within the Google Workspace Admin console (click **Security**, then **More controls** if necessary).\n3.  Click **Overview**.\n4.  Click **API controls**.\n5.  Click **Manage Domain Wide Delegation**.\n6.  Click **Add New**.\n7.  **Enter the Client ID for KnowBe4** (followed by a red-acted field representing the Client ID) **and the following scopes:**\n\n**Required Scopes (Read-Only Permissions):**\n\nA dedicated text box lists six `https://www.googleapis.com` URLs, defining the required OAuth scopes for API access. All scopes are set to `readonly`.\n\nThe listed scopes are:\n\n*   `.../auth/admin.directory.group.readonly`\n*   `.../auth/admin.directory.group.member.readonly`\n*   `.../auth/admin.directory.user.readonly`\n*   `.../auth/admin.directory.domain.readonly`\n*   `.../auth/admin.directory.customer.readonly`\n*   `.../auth/admin.directory.orgunit.readonly`\n\n**Visual Annotations:**\n\nTwo prominent orange arrows are present:\n1.  The first arrow points directly at the redacted **Client ID** field in step 7.\n2.  The second arrow points at the text box containing the list of **scopes**.",
      "position": 1,
      "context": "count Settings, clicking User Management > User Provisioning, and then toggling the Google button, a"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsCustomerIDAnnotated.png",
      "alt": "The image displays the **Profile** view within the **Account settings** section of an administration console UI.\n\n**Header and Navigation:**\n*   The header contains a search bar labeled, \"Search for users, groups or settings.\"\n*   The breadcrumb navigation indicates the path: `Account settings > Profile`.\n*   The left-hand navigation menu shows **Account** expanded, with **Account settings** highlighted in blue, indicating the active section.\n\n**Main Content Area (Profile Info):**\n*   The primary content panel is dedicated to \"Profile info.\"\n*   Data fields displayed include:\n    *   **Customer ID:** Value is obfuscated (blurred). An orange arrow points directly to this blurred field value.\n    *   **Name:** Value is obfuscated.\n    *   **Contact info:** Accompanied by instructional text: \"Choose who to send service emails, payment notifications, and other emails to.\"\n    *   Sub-fields under Contact info: **Primary admin** and **Secondary email** (both email addresses are obfuscated).\n\n**Footer/Support:**\n*   The bottom of the panel includes a section titled **Support message**.\n*   Associated text reads: \"Information about contacting your support team. Learn more about age-based access settings.\" (The final phrase is a blue hyperlink).",
      "position": 2,
      "context": "Your customer ID is shown at the top of the list."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageDomainWideDelegationAnnotated.png",
      "alt": "This document describes the interface of the Google Admin console, specifically the **API controls** configuration page within the Security section.\n\n**UI Context and Navigation:**\n\n1.  **Top Bar:** Contains the \"Admin\" logo, a global search bar (\"Search for users, groups or settings\"), and standard utility icons (notifications, task manager, help).\n2.  **Left Sidebar (Navigation Tree):** The current view is nested under the **Security** main category. The `Access and data control` section is expanded, and the **API controls** item is highlighted, indicating the active page. Other controls under this section include Client-side encryption, Context-Aware Access, and Data protection.\n3.  **Breadcrumb:** The page location is confirmed by the breadcrumb trail: `Security > API Controls`.\n\n**Main Content Area: API controls**\n\nThe page is segmented into three primary configuration blocks:\n\n**1. App access control**\n\n*   **Purpose:** Manages application access to user data.\n*   **Overview - Google Services:**\n    *   Status: 0 restricted Google services\n    *   Status: 18 unrestricted Google services\n    *   Action Button: `MANAGE GOOGLE SERVICES` (Blue hyperlink)\n*   **Overview - Third-Party Apps:**\n    *   Status: 2 configured apps\n    *   Status: 2 accessed apps\n    *   Action Button: `MANAGE THIRD-PARTY APP ACCESS` (Blue hyperlink)\n\n**2. Settings**\n\n*   **Label:** Features a \"NEW\" tag next to the heading.\n*   **Description:** \"Manage settings for user messages, unconfigured third-party apps, internal apps, and more.\"\n\n**3. Domain wide delegation**\n\n*   **Description:** Explains that developers can register API clients to access user data (e.g., Gmail) without requiring individual user consent.\n*   **Action Button:** `MANAGE DOMAIN WIDE DELEGATION` (Blue hyperlink)\n*   **Visual Element:** A large, orange arrow points specifically to the `MANAGE DOMAIN WIDE DELEGATION` link, indicating it as the primary call to action or point of interest.",
      "position": 3,
      "context": "of your Google Admin console, click Security > Access and data control > API controls.\nClick Manage "
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddNewAnnotated.png",
      "alt": "This image displays a segment of a web application interface, identified in the header as the **Admin** console.\n\n**UI Context and Navigation:**\n*   **Header:** Features a menu icon, the \"Admin\" title, and a search bar labeled \"**Search for users, groups or settings**\".\n*   **Left Navigation Pane:** Includes standard menu items such as Home, Dashboard, Directory, Chrome browser, Devices, and Apps.\n*   **Breadcrumbs:** The current location is indicated by the path: `Security > API Controls > Domain-wide Delegation`.\n\n**Main Content Area:**\n*   **Information Box:** A blue information banner (with an 'i' icon) provides context: \"Developers can register their web applications and other API clients with Google to enable access to your users having to individually give consent or their passwords.\"\n*   **API Clients Section:** This section is titled \"**API clients**\" and features two primary action links:\n    1.  **Add new** (Currently highlighted by a large orange pointer, suggesting a user action).\n    2.  **Download client info**\n*   **Filter Control:** Below the action links is a button to manage views: `[+] Add a filter`.",
      "position": 4,
      "context": "ain Wide Delegation.\n\nOn the next screen, click Add New."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddNewClientID.png",
      "alt": "This image displays a modal dialog box titled **\"Add a new client ID\"** (white text on a blue header bar).\n\nThe body of the dialog contains three main input fields/options:\n\n1.  **Text Input Field 1:** Labeled **\"Client ID\"**.\n2.  **Checkbox Option:** Labeled **\"Overwrite existing client ID\"**, followed by a question mark icon (indicating contextual help is available).\n3.  **Text Input Field 2:** Labeled **\"OAuth scopes (comma-delimited)\"**.\n\nThe footer of the dialog box contains two action buttons:\n\n1.  **CANCEL** (Text button, uppercase).\n2.  **AUTHORIZE** (Text button, uppercase).\n\nThe overall interface is designed for adding or modifying OAuth client credentials and associated scopes.",
      "position": 5,
      "context": "nt Settings, along with the list of six scopes.\n\n\nNote:  Each scope will need to be separated by a c"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsGoogleWorkspaceConnection.png",
      "alt": "This image displays a configuration screen section for integrating or updating Google Workspace credentials.\n\n**UI Elements and Context:**\n\nThe interface consists of two distinct labeled text input fields for credential entry, followed by two action buttons.\n\n1.  **Input Field 1:**\n    *   **Label:** \"Google Workspace Customer ID\"\n    *   **Field Type:** Blank text input box.\n\n2.  **Input Field 2:**\n    *   **Label:** \"Google Workspace Admin Email Address\"\n    *   **Field Type:** Blank text input box.\n\n**Action Buttons:**\n\nThe bottom of the form displays two buttons aligned horizontally:\n\n1.  **Secondary Action Button (Left):** Labeled \"Cancel.\" Styled with a dark gray background and white text.\n2.  **Primary Action Button (Right):** Labeled \"Save.\" Styled with a prominent green background and white text, indicating the affirmative action to submit the entered data.",
      "position": 6,
      "context": "nstructions for locating your Google Workspace Customer ID can be found in the Configuring Your Goog"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsConnectionSaved.png",
      "alt": "This image displays the configuration interface for a Google Workspace connection, organized into three sections:\n\n**1. Connection Details (Inputs):**\n*   Two standard text input fields are displayed, showing previously configured and active connection data (the data is blurred/redacted).\n*   The corresponding labels are: \"Google Workspace Customer ID\" and \"Google Workspace Admin Email Address.\"\n\n**2. Action and Status Bar:**\n*   **Action Buttons:**\n    *   A primary action button, colored green, labeled **\"Edit Connection\"** and featuring a pencil icon.\n    *   A secondary action button, colored red, labeled **\"Remove Connection\"** and featuring a trash can icon.\n*   **Status Indicator:** A confirmation message, **\"Connection saved,\"** displayed next to the buttons, preceded by a green checkmark icon.\n\n**3. Auxiliary Provisioning Links:**\n*   Two hyperlinked navigation options related to provisioning management are listed:\n    *   **\"View Our Google Provisioning Guide,\"** preceded by a blue open-book icon.\n    *   **\"Configure Google Provisioning User Scoping,\"** preceded by a blue group-of-users icon.",
      "position": 7,
      "context": "Once you have entered the information, click Save."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ClickConfigureGoogleProvisioningAnnotated.png",
      "alt": "This image is a screenshot of the **KnowBe4 console's User Provisioning Sync Reports** section.\n\n**Header/Navigation:**\n*   The primary navigation bar shows the \"KnowBe4\" logo and key modules: DASHBOARD, PHISHING, TRAINING, **USERS** (highlighted blue), ASAP, PHYSICAL TESTS, SECOND CHANCE, MODSTORE, and REPORTS.\n\n**Page Context:**\n*   The main content area is titled **\"G User Provisioning Sync Reports\"** (with a 'G' icon indicating Google/G-Suite).\n*   A secondary tab bar beneath the title indicates the current active tab is **Provisioning**, with sibling tabs including Users, Groups, Import Users, Merge Users, Messages, and Security Roles.\n\n**Key UI Elements and Actions:**\n*   In the upper right corner of the content area, there is a prominent blue button labeled: **\"Configure Google Provisioning\"**. An orange arrow visually points toward this button.\n*   Below the tab bar, a status line shows: \"G Google Workspace Integration is enabled in Account Settings\" (where \"Account Settings\" is a hyperlink).\n\n**Report Structure (Partial):**\n*   The beginning of a synchronization report table is visible, showing a dropdown filter labeled **\"Service: All\"**.\n*   The column headers for the report table include: **Sync Received**, **Status**, **Groups** (with a sorting/sizing icon and a help icon), **Users** (with sorting/sizing and help icons), **Memberships** (with sorting/sizing and help icons), **Service** (with a help icon), and **Test Mode** (with a help icon).",
      "position": 8,
      "context": "gging in to your KnowBe4 console, navigate to Users > Provisioning.\nIn the top-right corner, click t"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/EmptyStateText_OUScopingToggle_Annotated.png",
      "alt": "This image displays the configuration page for Google Provisioning, specifically focusing on user scoping options.\n\n**Context and Navigation:**\n*   **Header:** \"Configure Google Provisioning.\"\n*   **Navigation:** A horizontal tab bar indicates the active tab is **Provisioning**, with other available sections being Users, Groups, Import Users, Merge Users, Messages, and Security Roles.\n*   **Action Link:** A link is provided at the top right: \"← Back to User Provisioning Sync Reports.\"\n\n**User Scoping Configuration:**\nThe page section, titled \"User Scoping,\" presents two primary controls and two explanatory panels detailing configuration methods:\n\n1.  **Controls:**\n    *   **Add Domain Button:** A button labeled \"+ Add Domain\" is available for immediate action (highlighted).\n    *   **OU Scoping Toggle:** A toggle switch labeled \"Enable OU Scoping\" is visible, currently in the disabled (off) state.\n\n2.  **Scoping Methods (Divided Layout):**\n\n    *   **Left Panel: User Scoping with Domains, Groups, and Users** (Icon: Globe)\n        *   *Purpose:* \"Use this option to sync users and group memberships.\"\n        *   *Instructions:*\n            1.  Click **Add Domain** and select the Google domain you want to sync.\n            2.  Configure groups and users for syncing.\n\n    *   **Right Panel: User Scoping with OUs** (Icon: Organizational structure/hierarchy)\n        *   *Purpose:* \"OU scoping can be applied along with your existing domain, group, and user configuration.\"\n        *   *Instructions:*\n            1.  Turn on the **Enable OU Scoping** toggle.\n            2.  Select Google OUs for syncing.",
      "position": 9,
      "context": "u can choose to include or exclude groups or users, as well as sync group membership information abo"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddDomain.png",
      "alt": "This image displays a standard modal dialog box titled **\"Add Domain\"**.\n\n**Interface Elements:**\n\n*   **Header:** The dialog title, **\"Add Domain,\"** is centered top-left. A standard close icon ('x') is positioned in the top right corner.\n*   **Input Field:** A label, **\"Select Domain,\"** precedes the main input element.\n    *   The input is a mandatory selection box or dropdown menu, indicated by a downward chevron icon on the right edge.\n    *   The field contains the placeholder text: **\"Select an allowed domain...\"**\n*   **Action Buttons (Footer):** Two action buttons are located in the bottom right corner:\n    *   **Cancel:** A gray, secondary action button.\n    *   **Save:** A blue, primary action button, confirming the domain selection.",
      "position": 10,
      "context": "For further information regarding adding an Allowed Domain, see our Add and Verify Domains article."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/UserScoping_OUScopingToggle.png",
      "alt": "This image displays a configuration screen for \"Google Provisioning,\" likely within a security or identity management application.\n\n**Header and Navigation:**\nThe main heading is \"G Configure Google Provisioning.\" A secondary navigation bar shows several tabs, with the **\"Provisioning\"** tab highlighted (active). Other tabs include \"Users,\" \"Groups,\" \"Import Users,\" \"Merge Users,\" \"Messages,\" and \"Security Roles.\"\n\n**User Scoping Section:**\nA section titled \"**User Scoping**\" is prominent.\n1.  **Add Domain:** A primary button labeled \"+ Add Domain\" is available.\n2.  **OU Scoping Toggle:** A gray, disabled toggle switch is present, labeled \"Enable OU Scoping.\"\n\n**Domain Configuration Panel:**\nA collapsible panel, currently expanded (indicated by an upward chevron), details settings for a specific domain:\n*   **Domain:** `phishing.guru`\n\nWithin this domain panel, two configuration cards detail scoping rules:\n\n1.  **Group Scoping:**\n    *   Text: \"Included Groups: 0\" and \"Excluded Groups: 0.\"\n    *   UI Elements: An orange circular icon with the letter \"a\" and a button labeled \"Manage Groups.\"\n2.  **User Scoping:**\n    *   Text: \"Included Users: 0\" and \"Excluded Users: 0.\"\n    *   UI Elements: An orange circular icon with the letter \"b\" and a button labeled \"Manage Users.\"",
      "position": 11,
      "context": "Click the arrow next to the domain name to expand the drop-down menu."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageGroups.png",
      "alt": "This screenshot displays a user interface panel for configuring group membership rules.\n\n**Heading:** The panel is titled **\"Manage Groups\"** in bold black text.\n\n**Input Fields:**\nThe interface presents two primary configuration fields, each utilizing a search-enabled dropdown selector:\n\n1.  **Included Groups:** Labeled with \"Included Groups:\", this field is an input box displaying the placeholder text \"Add Group...\" and features a right-aligned chevron icon, indicating a searchable, multi-select dropdown menu for defining groups that are subject to inclusion.\n2.  **Excluded Groups:** Labeled with \"Excluded Groups:\", this field is functionally identical to the first, also displaying the placeholder text \"Add Group...\" and featuring a right-aligned chevron icon, used for defining groups that are specifically excluded.\n\n**Action Buttons:**\nTwo action buttons are positioned in the lower right corner:\n\n*   **Cancel:** A gray, non-primary button used to discard changes.\n*   **Save:** A blue, primary button used to confirm and apply the group configuration changes.",
      "position": 12,
      "context": "You must type at least two characters of the group name in order for it to appear in the menu."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageUsers.png",
      "alt": "The image displays a user management configuration interface titled **\"Manage Users.\"**\n\nThe configuration options are structured as follows:\n\n1.  **Synchronization Control:** A checkbox labeled **\"Sync All Users in this Domain.\"** (The checkbox is currently unchecked.)\n2.  **User Inclusion List:**\n    *   Label: **\"Included Users:\"**\n    *   UI Element: An input field/combo box with the placeholder text **\"Add User...\"** and a right-aligned dropdown chevron, indicating user selection capability.\n3.  **User Exclusion List:**\n    *   Label: **\"Excluded Users:\"**\n    *   UI Element: An identical input field/combo box with the placeholder text **\"Add User...\"** and a right-aligned dropdown chevron.\n4.  **Action Buttons:** Located in the bottom right corner, the panel includes two buttons:\n    *   **Cancel** (Secondary/Gray)\n    *   **Save** (Primary/Blue)",
      "position": 13,
      "context": "You must type at least five characters of the user’s email in order for it to appear in the menu."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/SaveConfiguration.png",
      "alt": "This image displays the configuration interface for Google Provisioning, specifically focused on the **User Scoping** settings under the active **Provisioning** tab.\n\n**Context and Navigation:**\n*   **Page Title:** Configure Google Provisioning.\n*   **Breadcrumb/Exit:** A link is present for \"← Back to User Provisioning Sync Reports.\"\n*   **Main Tabs:** Navigation includes **Provisioning** (active tab), Users, Groups, Import Users, Merge Users, Messages, and Security Roles.\n\n**User Scoping Section:**\n*   **Title:** User Scoping.\n*   **Domain Management:** The interface shows one configured domain, \"phishing.guru.\" An associated action button is available: \"+ Add Domain.\"\n*   **Group Scoping:** Details show: **Included Groups: 1** and **Excluded Groups: 0**, alongside a blue primary button labeled **Manage Groups**.\n*   **User Scoping:** Details show: **Included Users: 1** and **Excluded Users: 0**, alongside a blue primary button labeled **Manage Users**.\n\n**Primary Action:**\n*   The essential commit action is the **Save Configuration** button (green outlined), located in the upper right corner of the configuration area. An orange overlaid arrow highlights this button.",
      "position": 14,
      "context": "ave finished configuring your included and excluded users, click Save.\n\n\n Once you have configured y"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/Enable_OU_Scoping_Toggle.png",
      "alt": "This technical description details a partial screenshot of a user provisioning configuration screen.\n\n**Context and Navigation:**\nThe primary heading is **\"G Configure Google Provisioning.\"** Below this, a horizontal navigation menu is displayed, with the **\"Provisioning\"** tab highlighted as the currently active view. Other visible tabs include Users, Groups, Import Users, Merge Users, Messages, and Security Roles.\n\n**User Interface Elements:**\nThe main section is titled **\"User Scoping.\"** This section contains two primary controls:\n\n1.  A button labeled **\"+ Add Domain.\"**\n2.  A toggle switch accompanied by the label **\"Enable OU Scoping.\"**\n\n**State:**\nThe **\"Enable OU Scoping\"** control is shown in the active state (illuminated blue), indicating that Organizational Unit (OU) scoping is currently enabled for provisioning.\n\n**Annotation:**\nAn overlaid orange arrow points specifically from the right edge of the image toward the **\"Enable OU Scoping\"** toggle and text.",
      "position": 15,
      "context": "yncing By Domain and Group Membership section above.\nTo configure OU scoping for your users, follow "
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/Including_Excluding_OUs.png",
      "alt": "This image displays the configuration page for Google Provisioning, specifically the **Provisioning** tab, which is active within a horizontal navigation menu listing modules like Users, Groups, and Security Roles.\n\n**Context and Settings:**\n\n*   **Header:** Configure Google Provisioning.\n*   **Active Tab:** Provisioning.\n*   **User Scoping Section:** Contains a button labeled **+ Add Domain** and a blue toggle switch confirming that **Enable OU Scoping** is active (ON position).\n\n**OU Scoping Panel (Expanded):**\n\n*   The panel titled **OU Scoping** is open.\n*   An information notification is present: \"In order to sync group memberships, you must sync domains.\"\n*   **Included OUs:** Displays one entry (data redacted) configured as an included Organizational Unit.\n*   **Excluded OUs:** Displays one entry, explicitly named **Google Provisioning - TEST**, configured as an excluded Organizational Unit.\n\nBoth Included and Excluded OU fields are input selectors displaying current selections as removable tags (marked with an 'X') and featuring a dropdown arrow for adding new OUs.",
      "position": 16,
      "context": "You can select the OUs that you would like to include or exclude in your sync."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/OU_Scoping_Save_Configuration.png",
      "alt": "This image displays a configuration screen titled \"**Configure Google Provisioning**\" within a UI framework.\n\n**Header and Navigation:**\n*   The main title is \"Configure Google Provisioning\" preceded by a stylized 'G' icon.\n*   A secondary link on the top right reads: \"← Back to User Provisioning Sync Reports\".\n*   A tabbed navigation bar is present, with the \"**Provisioning**\" tab currently selected/active. Other tabs include \"Users,\" \"Groups,\" \"Import Users,\" \"Merge Users,\" \"Messages,\" and \"Security Roles.\"\n\n**Configuration Panel (User Scoping):**\n*   The main section heading is \"**User Scoping**.\"\n*   Beneath the heading, there is an \"**+ Add Domain**\" button and a toggle labeled \"**Enable OU Scoping**\" (the toggle is active/blue).\n\n**OU Scoping Module (Organizational Unit Scoping):**\n*   This module is an expandable section titled \"**OU Scoping**\" (currently expanded).\n*   An informational notice states: \"In order to sync group memberships, you must sync domains.\"\n*   **Included OUs:** A text box/dropdown shows one entry (content blurred for privacy) followed by a dismiss 'X' and a dropdown arrow.\n*   **Excluded OUs:** A text box/dropdown shows one entry labeled \"**Google Provisioning - TEST**\" followed by a dismiss 'X' and a dropdown arrow.\n\n**Action Buttons:**\n*   Located in the upper right area of the content body are the configuration action buttons:\n    *   **Cancel** (outlined blue button).\n    *   **Save Configuration** (solid green outlined button, highlighted by an orange arrow pointing to it).",
      "position": 17,
      "context": "ync.\n\nOnce you have configured the OUs for syncing, click Save Configuration."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingDropdown.png",
      "alt": "The image displays the **KnowBe4** application interface, showing the \"Configure Google Provisioning\" page, accessible via the main navigation tab **USERS**.\n\n**UI Context and Navigation:**\n*   The primary page title is \"G Configure Google Provisioning.\"\n*   A link in the upper right reads: \"← Back to User Provisioning Sync Reports.\"\n*   The sub-navigation menu highlights the **Provisioning** tab, alongside other tabs including Users, Groups, Import Users, Merge Users, Messages, and Security Roles.\n\n**Configuration Sections:**\n1.  **User Scoping:**\n    *   This section allows domain definition. An active domain is listed in a dropdown field labeled \"Domain:\".\n    *   An action button, \"+ Add Domain,\" is present for adding additional scopes.\n    *   A prominent green button labeled \"**Sync Now**\" (with a refresh icon) is positioned in the top right of this configuration area.\n2.  **Field Mapping:**\n    *   This section contains a configuration dropdown labeled \"**Mapping Rules**.\"\n    *   A large orange arrow is visually annotating and pointing directly to the \"Mapping Rules\" dropdown element.\n\nThe page footer includes standard links: About, Privacy Policy, Need Help?, and the copyright notice \"© 2024 KnowBe4, Inc. All rights reserved.\"",
      "position": 18,
      "context": "in the User Scoping section above.\nIn the Field Mapping section, click the drop-down arrow next to M"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExpanded.png",
      "alt": "This image displays a **Field Mapping** configuration interface, specifically detailing the correlation between attributes from two different systems: **Google Directory Attribute** and **KSAT Attribute**.\n\n**UI Context and Controls:**\n\n*   The screen is titled **\"Field Mapping.\"**\n*   A blue tab bar highlights the active section: **\"Mapping Rules,\"** which includes an upward-pointing caret suggesting the section is currently expanded.\n*   A search box is present above the mappings, labeled **\"Search KSAT attributes...\"** followed by a magnifying glass icon.\n*   The primary interface is a two-column grid. All entries in the left column are editable via dropdown menus (indicated by a downward caret). A right arrow (`->`) separates the source and target fields, indicating the mapping direction (Google Directory -> KSAT).\n\n**Mapping Details (Source Attribute -> Target Attribute):**\n\nThe table shows 14 rows of attribute mappings:\n\n| Google Directory Attribute (Source) | KSAT Attribute (Target) |\n| :---------------------------------- | :---------------------- |\n| `givenName`                         | `First Name`            |\n| `familyName`                        | `Last Name`             |\n| `workPhone`                         | `Phone Number`          |\n| `externalId`                        | `Employee Number`       |\n| `orgTitle`                          | `Job Title`             |\n| `orgName`                           | `Organization`          |\n| `orgDepartment`                     | `Department`            |\n| `-- None --` (Unmapped)             | `Mobile Phone Number`   |\n| `-- None --` (Unmapped)             | `Location`              |\n| `-- None --` (Unmapped)             | `Division`              |\n| `-- None --` (Unmapped)             | `Custom Field 1`        |\n| `-- None --` (Unmapped)             | `Custom Field 2`        |\n| `-- None --` (Unmapped)             | `Custom Field 3`        |\n| `-- None --` (Unmapped)             | `Custom Field 4`        |",
      "position": 19,
      "context": "rong>Mapping Rules.\n\nThis action will expand the Field Mapping section."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExample1.png",
      "alt": "This image displays the configuration interface for data **Field Mapping** between two systems, labeled **Google Directory Attribute** (Source) and **KSAT Attribute** (Target).\n\n**UI Elements and Context:**\n\n1.  **Header and Context:** The screen is titled \"**Field Mapping**.\"\n2.  **Configuration Panel:** The mapping details are contained within a collapsible section labeled \"**Mapping Rules**\" (indicated by a blue upward chevron).\n3.  **Search Functionality:** A search bar is present above the mapping table, featuring the placeholder text \"**Search KSAT attributes...**\" and a search icon.\n4.  **Mapping Table Structure:** The rules are organized in a table with two columns: \"**Google Directory Attribute**\" and \"**KSAT Attribute**.\"\n5.  **Data Input Fields:** All fields under the \"Google Directory Attribute\" column are displayed within input boxes accompanied by a dropdown chevron, indicating that the source attribute can be selected or modified. A right arrow ($\\rightarrow$) denotes the mapping direction.\n\n**Specific Mappings Shown:**\n\n| Google Directory Attribute | KSAT Attribute |\n| :--- | :--- |\n| `givenName` | `First Name` |\n| `familyName` | `Last Name` |\n| **`workPhone`** (Highlighted) | **`Phone Number`** (Highlighted) |\n| `externalId` | `Employee Number` |\n\nThe mapping row for `workPhone` to `Phone Number` is visually highlighted with an orange border, suggesting the current row of focus or a designated example.",
      "position": 20,
      "context": "ped to these attributes.\nFor example, in the screenshot below, the “workPhone” attribute from Google"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExample2.png",
      "alt": "The image displays a configuration screen titled **\"Field Mapping,\"** focused on synchronizing user data attributes between a Google Directory source and a target KSAT system.\n\n**UI Elements and Structure:**\n\n1.  **Header:** The primary header is \"Field Mapping.\"\n2.  **Section Control:** A sub-header, **\"Mapping Rules\"** (blue hyperlink), indicates the current active view, accompanied by an upward-facing chevron signifying the section is expanded.\n3.  **Search Function:** A search input field labeled **\"Search KSAT attributes...\"** is present, paired with a magnifying glass icon for execution.\n4.  **Attribute Mapping Grid:** The primary content is a two-column data table defining the attribute translation: **\"Google Directory Attribute\"** (Source) and **\"KSAT Attribute\"** (Target).\n\n**Data Configuration (Mapping Rules):**\n\nEach row defines a mapping rule using a source dropdown menu linked via a right-pointing arrow (`→`) to the target attribute display.\n\n| Google Directory Attribute (Dropdown) | Link | KSAT Attribute (Target) |\n| :------------------------------------ | :--- | :---------------------- |\n| `givenName`                           | →    | `First Name`            |\n| `familyName`                          | →    | `Last Name`             |\n| **`mobilePhone` (Highlighted)**       | **→**| **`Phone Number` (Highlighted)**|\n| `externalId`                          | →    | `Employee Number`       |\n\nThe rule **`mobilePhone` → `Phone Number`** is visually highlighted by an orange border, indicating selection or focus within the interface.",
      "position": 21,
      "context": "Google Directory Attribute in the drop-down menu, as shown in the example below."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/SaveConfiguration.png",
      "alt": "This image displays the configuration interface for Google Provisioning, specifically focused on the **User Scoping** settings under the active **Provisioning** tab.\n\n**Context and Navigation:**\n*   **Page Title:** Configure Google Provisioning.\n*   **Breadcrumb/Exit:** A link is present for \"← Back to User Provisioning Sync Reports.\"\n*   **Main Tabs:** Navigation includes **Provisioning** (active tab), Users, Groups, Import Users, Merge Users, Messages, and Security Roles.\n\n**User Scoping Section:**\n*   **Title:** User Scoping.\n*   **Domain Management:** The interface shows one configured domain, \"phishing.guru.\" An associated action button is available: \"+ Add Domain.\"\n*   **Group Scoping:** Details show: **Included Groups: 1** and **Excluded Groups: 0**, alongside a blue primary button labeled **Manage Groups**.\n*   **User Scoping:** Details show: **Included Users: 1** and **Excluded Users: 0**, alongside a blue primary button labeled **Manage Users**.\n\n**Primary Action:**\n*   The essential commit action is the **Save Configuration** button (green outlined), located in the upper right corner of the configuration area. An orange overlaid arrow highlights this button.",
      "position": 22,
      "context": "sans-serif;'>Save Configuration button at the top-right corner of the page."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/Google_User_Provisioning/UserProvisioningSyncReports.png",
      "alt": "This image displays the **User Provisioning Sync Reports** interface, detailing synchronization activities, specifically focused on archived data from a Google integration.\n\n**Header and Navigation:**\n*   The page title is **G User Provisioning Sync Reports**.\n*   A top-right navigation link, **Back to User Provisioning**, is present.\n*   The primary horizontal navigation menu has **Provisioning** selected as the active tab. Other tabs include Users, Groups, Import Users, Merge Users, Messages, and Security Roles.\n*   The last successful sync time is noted as **Sync Received 09/03/2024, 9:39 AM**, followed by a link for **Sync and Error Details**.\n\n**Provisioning Sub-View:**\n*   A secondary row of navigation displays resource type counts: Groups (1), Users (1), Memberships (1), Domains (1), Credentials (1), and OU (2).\n*   The active filter button is **Archived (1)**.\n*   A light blue information banner provides context: **List of groups that existed and were archived by Google.**\n\n**Data Display and Controls:**\n*   A filter dropdown, **Sync Status: All**, is visible above the data table.\n*   The data table displays two columns: **Name** and **GUID**.\n*   The status bar at the bottom confirms: **Displaying all 1 rows**.\n\n**Footer:**\n*   The interface footer includes standard navigation links (About, Privacy Policy, Need Help?) and the copyright notice: **© 2024 KnowBe4, Inc. all rights reserved.**",
      "position": 23,
      "context": "If no errors are present, the Domains, Credentials, and OU sync subtabs will be hidden."
    }
  ],
  "metadata": {
    "category": "Security Awareness Training",
    "section": "Google User Provisioning (GUP)",
    "topics": [
      "awareness",
      "google",
      "gup",
      "provisioning",
      "security",
      "training"
    ],
    "image_count": 23
  }
}