{
  "article": {
    "id": 33016697488787,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/33016697488787.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/33016697488787.html",
    "author_id": 10164786027,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 3,
    "vote_count": 3,
    "section_id": 31157449158803,
    "created_at": "2024-09-03T14:18:00Z",
    "updated_at": "2025-10-29T17:05:12Z",
    "name": "AIDA Knowledge Refresher Guide",
    "title": "AIDA Knowledge Refresher Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-10-14T20:06:34Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [
      "01J4M3VRZ7JRWMDQV0RYJXAZ93"
    ],
    "label_names": [
      "localized",
      "AIDA",
      "AIDA training"
    ],
    "body": "<p>AIDA Knowledge Refreshers enable users to refine their cybersecurity skills and earn badges through bite-sized, scenario-based quizzes, providing a fun and quick way to revisit key takeaways from recent training.</p>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>Knowledge Refreshers are available for video modules only.</div>\n</div>\n<p>Knowledge Refreshers are available in the browser version of the Learner Experience. If this agent is enabled, it will appear for eligible content. For more information, view our <a href='https://support.knowbe4.com/hc/en-us/articles/35378557179027-Video-AIDA-Knowledge-Refreshers'>AIDA Knowledge Refreshers</a> video.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important: </strong>Knowledge Refreshers are only available for customers who have added AIDA. AIDA is available on the KnowBe4 console as an add-on to your Diamond-level subscription.</div>\n</div>\n<h2 id='h_01J7P7CX59EWWRQ7P3XC9CZJ39'>Enabling Knowledge Refreshers in AIDA Remedial Training</h2>\n<p>To enable Knowledge Refreshers in a remedial training campaign, log in to your KnowBe4 console and click the <strong>Training</strong> tab.</p>\n<ol>\n<li>Click the <strong>AIDA Training</strong> subtab.</li>\n<li>Make a selection:\n<ul>\n<li>If you have not configured remedial training, click <strong>Configure Training</strong>. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/31935234273939-AIDA-Automated-Training-Guide'>AIDA Automated Training Guide</a>.</li>\n<li>If you have already configured remedial training, click <strong>Edit Campaign</strong>. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/31935234273939-AIDA-Automated-Training-Guide'>AIDA Automated Training Guide</a>.</li>\n</ul>\n</li>\n</ol>\n<p>On the <strong>AIDA Configure Training</strong> page, scroll down to the <strong>Knowledge Refreshers</strong> section. For more information about the options, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_rt_enable_knowledge_refreshers.png'><img src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_rt_enable_knowledge_refreshers.png'></a></p>\n<ol type='a'>\n<li>\n<strong>Enable Knowledge Refreshers</strong>: Select this check box to enable knowledge refreshers in the Learner Experience. For more information, see <a href='#h_01J7P7Y7JZ64M22TQ9PTB8S3NQ'>Accessing Knowledge Refreshers in the Learner Experience</a>.</li>\n<li>\n<strong>Time between assignment completion and Knowledge Refresher</strong>: Select the number of days between when a user completes a training module and when the knowledge refresher for that module is available.</li>\n<li>\n<strong>Send Notification to the user when a new Knowledge Refresher is available</strong>: Select this check box to notify users when knowledge refreshers are available in their console.</li>\n</ol>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Not all AIDA-assigned training will contain Knowledge Refreshers.</div>\n</div>\n<h2 id='h_01J7P7Q9Z4BKS5JN80ENK8R1FF'>Enabling Knowledge Refreshers in a Training Campaign</h2>\n<p>Knowledge refreshers are already enabled for training campaigns. To access them, log in to your KnowBe4 console and click the <strong>Training</strong> tab.</p>\n<ol>\n<li>Click the <strong>+ Create Training Campaign</strong> button.</li>\n<li>Fill out the appropriate fields on the <strong>Create New Training Campaign</strong> page. See the <a href='https://support.knowbe4.com/hc/en-us/articles/204948207-Training-Campaigns-Guide'>Training Campaigns Guide</a> for more information.</li>\n<li>Scroll to the bottom of the page until you see the <strong>Knowledge Refreshers</strong> section.</li>\n</ol>\n<p>For more information about the options, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_tc_enable_knowledge_refreshers.png'><img src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_tc_enable_knowledge_refreshers.png'></a></p>\n<ol type='a'>\n<li>\n<strong>Enable Knowledge Refreshers</strong>: Select this check box to enable knowledge refreshers in the Learner Experience. See <a href='#h_01J7P7Y7JZ64M22TQ9PTB8S3NQ'>Accessing Knowledge Refreshers in the Learner Experience</a> for more information.</li>\n<li>\n<strong>Time between assignment completion and Knowledge Refresher</strong>: Select the number of days between when a user completes a training module and when the knowledge refresher for that module is available.</li>\n<li>\n<strong>Notify users when new Knowledge Refreshers are available</strong>: Select this check box to notify users when knowledge refreshers are available in their console.</li>\n</ol>\n<h2 id='h_01J7P7Y7JZ64M22TQ9PTB8S3NQ'>Accessing Knowledge Refreshers in the Learner Experience</h2>\n<p>There are two ways to access Knowledge Refreshers in the Learner Experience: from the <strong>Dashboard</strong> or the <strong>Training</strong> tab.</p>\n<h3 id='h_01J80BHVRRXJH9TBVPZC8QG9M3'>Dashboard Tab</h3>\n<p>Log in to the KnowBe4 Learner Experience. With AIDA enabled, you will see a tile for Knowledge Refreshers if a knowledge refresher is assigned.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refreshers_Dashboard2.png'><img src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refreshers_Dashboard2.png'></a></p>\n<p>Click the <strong>Go to Knowledge Refreshers</strong> button to open the <strong>Knowledge Refreshers</strong> page.</p>\n<h3 id='h_01J80BP1A11Z6R6EEAF7PMCRED'>Training Tab</h3>\n<p>Log in to the KnowBe4 Learner Experience and click the <strong>Training</strong> tab. With AIDA enabled, the <strong>Training</strong> tab now shows two subtabs: <strong>Training</strong> and <strong>Knowledge Refreshers</strong>. Click <strong>Knowledge Refreshers</strong> to open the <strong>Knowledge Refreshers</strong> page.</p>\n<div class='callout-note'>\n<strong>Note: </strong>You will only see the Knowledge Refreshers tab if a knowledge refresher has been assigned.</div>\n<p>For more information about the options, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refreshers.png'><img src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refreshers.png'></a></p>\n<ol type='a'>\n<li>\n<strong>Available</strong>: Knowledge Refreshers that are available for the user to take.</li>\n<li>\n<strong>Completed</strong>: Knowledge Refreshers that users have completed.</li>\n</ol>\n<p>Click on a Knowledge Refresher under <strong>Available</strong> to open it and start the short quiz.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refresher_question.png'><img src='https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refresher_question.png'></a></p>\n<p>After completing the quiz, the Knowledge Refresher is moved to <strong>Completed</strong>.</p>\n<h2 id='h_01JJMQN1TBTJHKMBM85435H7NR'>Accessing Knowledge Refreshers in the Mobile Learner App</h2>\n<p>If the AIDA add-on is part of your KnowBe4 subscription, AIDA Knowledge Refreshers can be seen on the <strong>Training</strong> page.</p>\n<div class='callout-note'>\n<strong>Note: </strong>AIDA Knowledge Refreshers must also be enabled in a training campaign to be displayed in the app.</div>\n<p>For more information about administering the mobile app, see the <a href='https://support.knowbe4.com/hc/en-us/articles/9776769113747-FAQ-KnowBe4-Learner-App-for-Admins'>FAQ: KnowBe4 Learner App for Admins</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_kr_mobile.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_kr_mobile.png'></a></p>\n<h2 id='h_01JCNW0892Q1TY6582ZXPBB0E8'>Training Campaign: User Progress Knowledge Refresher Column</h2>\n<p>If knowledge refreshers are enabled for your training campaign, you will see a <strong>Knowledge Refresher</strong> column in the <strong>Users</strong> subtab on the individual campaign overview page.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_knowledge_refreshers_column.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_knowledge_refreshers_column.png'></a></p>\n<h2 id='01JDA13SV8RA7JTJ9GJ0S4M9BJ'>Training Activity Reports: Knowledge Refresher Column</h2>\n<p>If knowledge refreshers are enabled for your training campaign, you can add the <strong>Knowledge Refresher</strong> column to the <strong>Training Activity Reports</strong>. The column will display whether or not a user has completed a knowledge refresher for their assigned training. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/4417261034259-Customize-and-View-Training-Activity-Reports'>Customize and View Training Activity Reports</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/KR_Column_Training_Activity_Report.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/KR_Column_Training_Activity_Report.png'></a></p>\n<h2 id='h_01JMFBNWN3SAZQXFXZWGYYK7WK'>Filtering the ModStore for Content Compatible with Knowledge Refreshers</h2>\n<p>The <strong>Content Features</strong> drop-down menu under <strong>Additional Filters</strong> on the <strong>ModStore</strong> tab allows you to filter by content compatible with knowledge refreshers.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_kr_content_features_filter.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_kr_content_features_filter.png'></a></p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/33016697488787-AIDA-Knowledge-Refresher-Guide",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_rt_enable_knowledge_refreshers.png",
        "alt": "This image displays a configuration section for \"Knowledge Refreshers,\" a feature indicated as using \"AIDA\" technology (in an orange tag).\n\nThe section title is **Knowledge Refreshers**, followed by a description: \"Help your learners remember their training by automatically creating and assigning short and fun quizzes.\"\n\nThe configuration options are presented as follows:\n\n1.  **Checkbox (a):** Labeled \"Enable Knowledge Refreshers,\" currently checked/enabled.\n2.  **Time Delay Configuration (b):** This subsection is indented under the enablement checkbox and is labeled \"Time between assignment completion and Knowledge Refresher.\" It uses radio buttons for selection, with **3 Days** currently selected. Other options are 7 Days, 14 Days, and 30 Days.\n3.  **Checkbox (c):** Labeled \"Send Notification to the user when a new Knowledge Refresher is available,\" currently checked/enabled. This checkbox is aligned with the time delay configuration, suggesting it is contingent upon or related to the enabling of Knowledge Refreshers.",
        "position": 1,
        "context": "ion about the options, see the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_tc_enable_knowledge_refreshers.png",
        "alt": "The image displays configuration settings for a feature labeled \"Knowledge Refreshers.\"\n\n**UI Elements and Context:**\n\n1.  **Feature Enablement (a):** The primary control is a checked checkbox labeled \"Enable Knowledge Refreshers.\" The section title, \"Knowledge Refreshers,\" appears to the left. A help icon (question mark) is located immediately after the enablement checkbox.\n2.  **Timing Interval (b):** Indented beneath the enablement control is the configuration section titled \"Time between assignment completion and Knowledge Refresher.\" This section contains four mutually exclusive options presented as radio buttons: \"3 Days,\" \"7 Days,\" \"14 Days,\" and \"30 Days.\" The \"3 Days\" option is currently selected (active radio button).\n3.  **Notification Preference (c):** A second configuration option is an independent, checked checkbox labeled \"Notify users when new Knowledge Refreshers are available.\" This setting is also visually indented, suggesting dependency on the feature being enabled.",
        "position": 2,
        "context": "ion about the options, see the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refreshers_Dashboard2.png",
        "alt": "This image displays a user interface for a security awareness and training platform, specifically the \"My Dashboard\" view. The UI is organized by two main navigation tabs and six data summary widgets.\n\n**I. Navigation:**\n*   **Active Tab:** My Dashboard (Highlighted in orange).\n*   **Inactive Tab:** Team Dashboard.\n\n**II. Data Widgets (Tiles):**\n\nThe dashboard presents six distinct data panels, providing an overview of user performance and engagement:\n\n1.  **Training Progress:**\n    *   Displays 40% completion via a horizontal progress bar.\n    *   Detail text states: \"You have completed 22 of 55 assignments.\"\n    *   Action Button: \"Go to Training.\"\n\n2.  **Phishing Test Results:**\n    *   Tracks two metrics with associated progress bars and counts out of 1723 total attempts:\n        *   Reported Phishing Emails: 31/1723.\n        *   Phishing Failures: 199/1723.\n    *   Both metrics include a rollover/tooltip help icon (?).\n\n3.  **Personal Risk Score:**\n    *   Shows a current score of **36.0** on a color-coded gauge ranging from 0 to 100 (Green, Yellow, Orange, Red).\n    *   Includes a clickable link: \"Why did my score change?\"\n    *   A descriptive paragraph details the score calculation: \"Your Risk Score is calculated using risk factors from various security types based on received data and your activity. Risky behavior increases your Risk Score, and secure behavior decreases it. Learn More.\"\n\n4.  **Unread Messages:**\n    *   Indicates **398** unread messages (via an envelope icon with a notification badge).\n    *   Action Button: \"View Messages.\"\n\n5.  **Knowledge Refresher:**\n    *   Indicates **1** available Knowledge Refresher (via a book/lightbulb icon with a notification badge).\n    *   Action Button: \"Go to Knowledge Refreshers.\"\n\n6.  **Badges Earned:**\n    *   Reports that the user has earned **14** badges (via a medal icon with a notification badge).\n    *   Action Button: \"Learn How to Earn Badges\" (styled as a secondary button).",
        "position": 3,
        "context": "edge Refreshers if a knowledge refresher is assigned."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refreshers.png",
        "alt": "The image displays the user interface for the \"Knowledge Refreshers\" section of a training platform (KnowBe4). The purpose of this screen is to track and manage short, supplemental cybersecurity training modules.\n\n### UI Structure and Navigation\n\n1.  **Tabs:** The top navigation shows two tabs: \"Training\" (inactive) and \"Knowledge Refreshers\" (active, indicated by a red dot counter).\n2.  **Information Banner:** A prominent red-to-dark-red gradient banner displays instructional text: \"Sharpen your cybersecurity skills with Knowledge Refreshers! These bite-sized quizzes revisit key takeaways from your recent training. They are a quick way to stay on top of your game and cybersecurity threats.\" The banner is prefixed by a lightbulb/book icon.\n\n### Section A: Available Modules\n\nThis section is labeled **\"a | Available 2\"** (the '2' is a red circle counter) and is collapsible. Each module listing features an orange lightbulb icon, an orange readiness dot, and a right-pointing chevron indicating an accessible link.\n\n*   **Module 1:**\n    *   *Topic:* Human Firewall\n    *   *Content:* Video: Reality Bytes: Human Error\n*   **Module 2:**\n    *   *Topic:* Passwords & Authentication\n    *   *Content:* Multi-Factor Authentication\n\n### Section B: Completed Modules\n\nThis section is labeled **\"b | Completed 4\"** (the '4' is a red circle counter) and is collapsible. Each completed module displays a gray lightbulb icon and a green checkmark followed by the text \"Completed\" on the right margin. All four modules are dated \"Sep 11, 2024.\"\n\n*   **Module 1:**\n    *   *Topics:* Human Firewall, Social Engineering, Phishing\n    *   *Content:* Basics of Phishing\n*   **Module 2:**\n    *   *Topics:* Incident Reporting, PII, Social Engineering\n    *   *Content:* Data Breaches and You\n*   **Module 3:**\n    *   *Topics:* Human Firewall, Spear Phishing, Social Engineering, Ransomware, Phishing\n    *   *Content:* Security Moments Series: Spot the Bad Link\n*   **Module 4:**\n    *   *Topics:* Social Media, Internet Use, Malware, Social Engineering\n    *   *Content:* Safe Surfing 101\n\n### Footer\n\nThe persistent footer identifies the platform: \"KnowBe4,\" and includes standard navigation links: \"About,\" \"Privacy Policy,\" \"Help Desk,\" and the copyright notice: \"© 2024 KnowBe4, Inc. All Rights Reserved.\"",
        "position": 4,
        "context": "nformation about the options, see the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/aida/KnowledgeRefreshers/aida_lx_knowledge_refresher_question.png",
        "alt": "This image displays a single screen from an interactive cybersecurity training module or quiz focusing on organizational risk and human error.\n\n**UI Elements and Context:**\n\n*   **Module Title:** \"Human Firewall\" is displayed at the top left.\n*   **Context/Reference:** A subtitle indicates the module source: \"\\[Video: Reality Bytes: Human Error]\".\n*   **Progress Indicator:** Five solid orange circular dots are located in the top right corner, likely representing the user's position within a sequence of questions (e.g., Q4/5).\n*   **Format:** The core content is a multiple-choice question presented as a scenario.\n\n**Text Content (Scenario and Options):**\n\n*   **Scenario Prompt:** \"Sarah, a new IT administrator at CloudTech Solutions, is tasked with modifying customer profile permissions. Unsure of the correct procedure but hesitant to ask for help, she decides to write her own script to automate the process. What is the most likely consequence of Sarah's actions?\"\n*   **Answer Options:** Four potential consequences are listed, each preceded by an empty radio button, indicating no selection has been made:\n    1.  The script will automatically encrypt all customer data\n    2.  Customer information becomes visible to other customers\n    3.  The script will crash the entire cloud infrastructure\n    4.  Customer profiles will be permanently deleted\n\n**Action Buttons (Footer):**\n\n*   **Secondary Action:** A light gray, rectangular button labeled \"Cancel\" is positioned on the bottom left.\n*   **Primary Action:** A coral/orange, rectangular button labeled \"Submit\" is positioned on the bottom right, signifying the final selection confirmation.",
        "position": 5,
        "context": ">Available to open it and start the short quiz."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_kr_mobile.png",
        "alt": "This image depicts the \"Training\" screen of a mobile application, likely an enterprise security or compliance training platform.\n\n**Header and Status Bar:**\n*   The top status bar displays the time (**9:41**) and standard connectivity icons (Cellular signal, WiFi, Battery).\n*   The main header area is colored orange and contains the title \"**Training**\" centered.\n\n**Training Completion Indicator:**\n*   A dark-colored widget beneath the header shows training progress.\n*   Text: \"**Training Completed**\"\n*   A progress bar indicates approximately 30% completion, labeled with the percentage value (**30%**) on the right.\n\n**Section 1: My Training (Required/In Progress)**\n*   Header: \"**My Training**\"\n*   This section displays horizontally scrollable training modules requiring action.\n    *   **Module 1 (In Progress):** Thumbnail features a person (likely an actor/host) and the title \"THE INSIDE MAN SEASON 2\" with Episode 1 details: \"A Different Tune (Mobile Devices)\".\n        *   Title text: \"**The Inside Man: Season 2 Ep 1**\"\n        *   Due date indicator (clock icon): \"**Due Tomorrow**\"\n    *   **Module 2:** Thumbnail shows two cartoon characters, one distracted and one working. Text overlay reads: \"Sharing is NOT always caring!\" and \"Identity Theft\".\n        *   Title text: \"**Sharing is NOT always caring!**\"\n        *   Due date indicator (clock icon): \"**Due in 5 days**\"\n    *   *A third module is partially visible on the far right.*\n\n**Section 2: Knowledge Refreshers (Optional/Supplemental)**\n*   Header: \"**Knowledge Refreshers**\"\n*   This section displays vertically stacked training cards, often shorter, topical lessons.\n    *   **Card 1 (Teal/Blue):** Text: \"**Phishing & Data Protection**\". Includes a right-arrow icon for navigation.\n    *   **Card 2 (Purple):** Text: \"**WiFi & Email Security**\". Includes a right-arrow icon for navigation.\n    *   *A third card, labeled \"Phishing & Data Protection,\" is partially visible on the far right.*\n\n**Section 3: Completed Training**\n*   Header: \"**Completed Training**\"\n*   This section displays modules that have been finished. A white checkmark overlay confirms completion.\n    *   **Completed Module 1:** Thumbnail features a man in a business suit and a large unlocked padlock icon (implying security content). A white checkmark is visible.\n    *   **Completed Module 2:** Thumbnail features an illustration of a hooked envelope (phishing lure) and a goldfish. A white checkmark is visible.\n\n**Footer Navigation Bar:**\n*   A fixed navigation bar is present at the bottom with four primary tabs:\n    *   **Training:** Currently selected (highlighted orange, graduation cap icon).\n    *   **Library:** (Magnifying glass icon)\n    *   **Messages:** (Envelope icon)\n    *   **Profile:** (Person icon)",
        "position": 6,
        "context": "ner-App-for-Admins'>FAQ: KnowBe4 Learner App for Admins article."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_knowledge_refreshers_column.png",
        "alt": "This image displays a User interface (UI) for monitoring training progress, specifically focusing on the \"Users\" tab for \"Quarterly Training\" assigned to the \"Accounting\" group.\n\n**Header and Navigation:**\n*   **Title:** \"Quarterly Training\" with the subtitle \"Groups: Accounting.\"\n*   **Breadcrumb/Action Link:** \"← Back to Training\" on the top right.\n*   **Tab Navigation:** Three tabs are visible: \"Overview,\" \"Users\" (currently active), and \"Survey Results.\"\n\n**Progress Summary (Metrics Boxes):**\nA row of status tiles shows completion statistics:\n1.  **All Users:** 1 (Active status indicator).\n2.  **Incomplete:** 0 (0%).\n3.  **Not Started:** 0 (0%).\n4.  **In Progress:** 0 (0%).\n5.  **Completed:** 1 (100%).\n6.  **Past Due:** 0 (0%).\n\n**Tools and Search:**\n*   A search box labeled \"Search for users by name or email\" is present.\n*   A toggle switch option is available: \"Include Archived Users.\"\n*   Action buttons are visible on the right: \"Bulk Update,\" a primary green button \"Generate CSV,\" \"Enroll Users,\" and a dropdown menu \"Actions.\"\n\n**Data Table (User Progress Detail):**\nThe main body is a data table tracking a single user, \"Jane Smith,\" across four content items:\n\n| Header | Sample Data (Jane Smith) |\n| :--- | :--- |\n| **Content Name** | Safe Surfing 101 / Security Culture and You / AI and Sensitive Info Don't Mix / Basics of Phishing |\n| **Enrollment Date** | 11/05/2024 (for all items) |\n| **Time Spent** | 02:53 / 05:59 / 01:51 / 02:30 |\n| **Time Remaining** | 21 days (for all items) |\n| **Status** | \"Completed\" (green badge, accompanied by a small trophy icon for all items) |\n| **Score** | 100% (for all items) |\n| **Knowledge Refresher** (Highlighted Column) | 3 items show \"✓ Completed\" (green text). 1 item (\"Basics of Phishing\") shows \"✗ Incomplete\" (red text). |\n\n**Footer:**\nThe table footer confirms: \"Displaying all 1 users.\"",
        "position": 7,
        "context": "> subtab on the individual campaign overview page."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/KR_Column_Training_Activity_Report.png",
        "alt": "This image displays the configuration and output of a **Training Activity Reports** user interface.\n\n**Header and Configuration:**\nThe report title is **\"Training Activity Reports,\"** with the scope set to **\"All Training Activity.\"** Action buttons include **\"Export as,\" \"Save Report,\"** and **\"Add Filter.\"**\n\n**Filters and Timeframe:**\nActive filters include:\n*   **Training Additional Criteria:** Campaign Training\n*   **Training Campaigns:** All Campaigns\n*   **Content Types:** All Content Types\n*   **User Groups:** All Groups\nThe Timeframe is set to **\"Enrolled On Date Range: Preset Range, Last 90 Days,\"** updated as of 11/20/2024.\n\n**Columns Selection Panel (Configuration):**\nA configuration panel is open, allowing users to select report columns. Key checked fields include `Time Remaining`, `Content Name`, `Content Type`, and several Enrollment statuses. Critically, the checkbox for **Knowledge Refresher** is selected under the Campaign category, ensuring this data point appears in the final report grid.\n\n**Report Output (Data Grid):**\nThe data grid displays 7 rows of activity, labeled by the **Manage Columns** button. The final column displayed is **Knowledge Refresher,** populated with status data:\n*   The first row, where Training Status is **Not Started**, shows a dash (`-`).\n*   The second row (Training Status: Completed) shows **Completed**.\n*   The third row (Training Status: Completed) shows **Incomplete**.\n\nThe table also provides detailed metrics including `Campaign Name`, `Content Name`, `Training Status`, `Enrolled On`, `Started On`, `Completed On`, `Time Spent`, and `Time Remaining` (e.g., 28 days).",
        "position": 8,
        "context": "and View Training Activity Reports article."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/aida/KnowledgeRefreshers/aida_kr_content_features_filter.png",
        "alt": "This image displays a content filtering interface categorized under \"Additional Filters.\"\n\n**Interface Structure:**\n\nThe filter panel presents six primary criteria fields arranged in two rows of three, all utilizing dropdown selection menus currently defaulted to \"All.\"\n\n*   **Row 1 Filters:** Languages, Duration, Targeted Training.\n*   **Row 2 Filters:** Publishers, Subscription Level, Content Features.\n\nBelow these fields is a toggle switch labeled, \"Hide content already in your library.\" The switch is currently in the off/inactive position.\n\n**Active Dropdown (Content Features):**\n\nThe \"Content Features\" dropdown menu is open, revealing a list of filter options presented as checkboxes (all unchecked):\n\n1.  **Knowledge Refresher:** This option is highlighted with an orange border, indicating potential hover or focus state. It includes a lightbulb icon (💡) and a red star icon (⭐) adjacent to the text.\n2.  Brandable Content\n3.  Adjustable Passing Score\n4.  Includes Quiz\n5.  Non-skip\n6.  Test Out\n\nThe interface content immediately below the filter panel includes the header text \"Compliance Plus Essentials.\"",
        "position": 9,
        "context": "er by content compatible with knowledge refreshers."
      }
    ],
    "metadata": {
      "category": "AIDA",
      "section": "AIDA Training",
      "topics": [
        "aida",
        "knowledge",
        "refresher",
        "training"
      ],
      "image_count": 9
    }
  }
}