{
  "article": {
    "id": 35666043660307,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/35666043660307.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/35666043660307.html",
    "author_id": 31899104510995,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 3,
    "vote_count": 3,
    "section_id": 35656808418195,
    "created_at": "2024-11-21T23:16:51Z",
    "updated_at": "2025-09-30T15:28:06Z",
    "name": "Defend - User Guide",
    "title": "Defend - User Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-30T15:28:06Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localizing",
      "answerbot_defend"
    ],
    "body": "<p>Defend is an email security tool that evaluates your inbound emails' context, relationships, and message content. This analysis happens before the emails reach your inbox to prevent inbound cyber threats and allows your admins to identify and act on any future breaches.</p>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong> The information contained in this guide is the default configuration of the Defend features. Your experience may vary depending on your organization's configuration choices.</div>\n</div>\n<h2 id='h_01JEXRA1NNTX0K3FAK7VGHRJQT'>Banners</h2>\n<p>Incoming emails from outside of your organization will have a colored banner inserted. These banners inform you of how the email has been classified. The color of the banner corresponds to the associated level of threat.</p>\n<p>There are four banner categories displayed below:</p>\n<ul class='js-toggles'>\n<li title='Productivity Banners'>\n<p>Productivity banners are gray and are applied to emails that Defend classifies as graymail or spam. These emails are usually non-malicious bulk emails such as newsletters, announcements, or advertisements. The purpose of these banners is to act as a visual cue for easy categorization and improved productivity.</p>\n<p>An example of a productivity banner is displayed in the screenshot below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Gray+banner.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Gray+banner.png' alt=''> </a></p>\n</li>\n<li title='Benign Banners'>\n<p>Benign banners are blue and are informative alerts that are not associated with detected threats. These banners are designed to provide additional context about an email and typically do not require any specific action. Benign banners may notify you about various email characteristics, including:</p>\n<ul>\n<li>New sender: The email is from someone who has never emailed you before.</li>\n<li>Financial content: The email contains financial information or references.</li>\n<li>External source: The email originates from outside your organization.</li>\n<li>Sensitive information: The email includes content that may be considered sensitive.</li>\n</ul>\n<p>These banners increase awareness and help you make informed decisions about handling an email. While no immediate action is usually necessary, the information provided can be valuable for assessing the email's relevance and importance.</p>\n<p>An example of a benign banner is displayed in the screenshot below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/External+Sender.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/External+Sender.png' alt=''> </a></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Blue+banner.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Blue+banner.png' alt=''> </a></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Sensitive+Information.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Sensitive+Information.png' alt=''> </a></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Financial+Banner.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Financial+Banner.png' alt=''> </a></p>\n</li>\n<li title='Suspicious Banners'>\n<p>Suspicious banners are amber and are applied to emails that contain suspicious elements, potentially indicating phishing or impersonation attempts. These banners serve as a cautionary alert, prompting you to exercise increased vigilance. When you encounter an amber banner, follow the tips below:</p>\n<ol>\n<li>Exercise caution before taking any action on the email.</li>\n<li>Carefully inspect the sender's email address to verify its authenticity.</li>\n<li>Be wary of clicking on any links within the email.</li>\n<li>Avoid downloading or opening attachments unless you are certain of their safety.</li>\n<li>If you need to reply, double-check that you're sending to the legitimate sender, not a similar-looking fraudulent address.</li>\n<li>When in doubt, verify the email's legitimacy through an alternative communication channel, such as a phone call or in-person confirmation.</li>\n<li>Report suspicious emails to your IT or security team for further investigation.</li>\n</ol>\n<p>An example of a suspicious banner is displayed in the screenshot below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Amber+banner.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Amber+banner.png' alt=''> </a></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Impersonation+Banner.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Impersonation+Banner.png' alt=''> </a></p>\n</li>\n<li title='Dangerous Banners'>\n<p>Dangerous banners are red and are applied to emails exhibiting strong indicators of phishing or other malicious intent. These banners represent the highest level of threat warning. When you encounter a dangerous banner, follow the tips below:</p>\n<ol>\n<li>Do not click on any links or download any attachments within the email.</li>\n<li>Refrain from replying to the email or engaging with the sender.</li>\n<li>Do not forward the email to others, as this may spread the potential threat.</li>\n<li>Report the email immediately to your IT security team.</li>\n<li>Delete the email from your inbox after reporting it unless instructed otherwise by your IT team.</li>\n</ol>\n<p>Remember, dangerous banners indicate a severe risk, and treating these emails as genuine threats is important. Your organization's security protocols should always be followed when dealing with dangerous-bannered emails.</p>\n<p>An example of a dangerous banner is displayed in the screenshot below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Red+banner.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Red+banner.png' alt=''> </a></p>\n</li>\n</ul>\n<h1 id='h_01K6DKFDKZXW9GV9HDKM4MPSRM'>Email Summary Page</h1>\n<p>All banners applied by Defend can be clicked on. This feature allows you to learn more about what was detected in the email. If you think an email has been categorized incorrectly, you can report it by selecting a reporting button at the bottom of the email summary page. For more information about what the email summary page displays, see the list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Email+Summary+Page.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Email+Summary+Page.png' alt=''></a></p>\n<ol type='a'>\n<li>\n<strong>What we found</strong>: This section provides an overview of what Defend found and the recommended action you should take. In this example, Defend identifies strong signs of phishing and recommends following your organization's policy for reporting phishing emails.</li>\n<li>\n<strong>Primary Reason</strong>: This area describes the primary reason the email raised concerns and triggered the banners.</li>\n<li>\n<strong>Threat dial</strong>: The colored threat dial displays the risk rating that Defend has assigned to this email. In this example, Defend has assigned the highest risk classification.</li>\n<li>\n<strong>Email information</strong>: This section displays advanced email information, including details such as the sender address, sender location, email security protocols, and your previous interaction history with the sender.</li>\n<li>\n<strong>Report this email</strong>: The reporting section allows you to report the email if you believe it has been classified incorrectly by Defend.</li>\n</ol>\n<h2 id='h_01K6DKQ3HGAN5YJ44HJPS5W0M8'>Link Protection</h2>\n<p>Defend includes link protection that helps safeguard you from malicious links in emails, even when they appear legitimate. This protection works by checking links in your emails in two ways:</p>\n<ol>\n<li>When an email arrives</li>\n<li>When you click on links in emails</li>\n</ol>\n<p>This dual approach helps protect you against links that may seem safe at first but later direct you to harmful websites. Attackers sometimes change where a link goes after an email is delivered, and Defend helps catch this trick by verifying links in real-time when you click them.</p>\n<p>When Defend detects a potentially harmful link that you've clicked, you'll see a warning screen instead of being taken directly to the website. This protective screen shows you the actual destination web address, indicates the specific signs of phishing that were detected, and highlights when the sender is being impersonated. This information helps you make an informed decision about whether it's safe to proceed to the website, protecting you from phishing attempts and other malicious sites that could compromise your security.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EM8d000006CN4s.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EM8d000006CN4s.jpg' alt=''> </a></p>\n<h2 id='h_01JEXRA1NNME05QMNC4WQ1JJ0V'>Graymail Management</h2>\n<p>Graymail is a non-malicious bulk email that you may have previously opted-in to receive. Depending on your organization's configuration, emails flagged as graymail will either:</p>\n<ul>\n<li>Appear in your inbox with a Graymail banner.</li>\n<li>Be sent to your _Graymail folder with a Graymail banner.</li>\n<li>Be sent to your Junk folder with a Graymail banner.</li>\n</ul>\n<p>You can click on a Graymail banner to go to the email summary page, where you can find more information about the email.</p>\n<p>If you believe the email has been incorrectly flagged as graymail, or you want to receive graymail from this sender to your inbox, click the <strong>Report as not Graymail</strong> button. This action will ensure future emails of this kind will not be sent to your <strong>_Graymail</strong> folder.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Graymail+Report.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Graymail+Report.png' alt=''> </a></p>\n<h2 id='h_01K30VXFW9JBYTBDBJV3DF25TR'>Languages</h2>\n<p>The default language for the Defend user experience is English. Select user groups can receive banners, email summaries, and link scanning in any of the following languages:</p>\n<ul>\n<li>English</li>\n<li>French</li>\n<li>German</li>\n<li>Spanish</li>\n<li>Italian</li>\n<li>Dutch</li>\n<li>Portuguese</li>\n<li>Norwegian</li>\n<li>Hungarian</li>\n</ul>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/35666043660307-Defend-User-Guide",
    "images": [
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Gray+banner.png",
        "alt": "The image displays a navigational UI element, characterized by a rounded rectangle with a muted gray background. This element is composed of three primary white foreground components:\n\n1.  **Icon:** A stylized, circular graphic on the left, featuring an outer shape with indentations and a concentric inner circle (dot).\n2.  **Text Label:** The bold, white, sans-serif text reading **Graymail** is centered next to the icon.\n3.  **Indicator:** A right-pointing chevron symbol (>) positioned on the far right, indicating a clickable link, navigation to a new view, or expansion capability.\n\nThe entire component functions as a clickable button or link labeled \"Graymail.\"",
        "position": 1,
        "context": "/p>\nAn example of a productivity banner is displayed in the screenshot below:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/External+Sender.png",
        "alt": "A rectangular UI banner, rendered in a solid teal/cyan color, features rounded corners and white text. The text reads \"External email\" and is preceded by a white, abstract icon resembling a stylized lens or eye, centered within two partial, opposing parentheses or bracket shapes. A right-pointing chevron (>) follows the text, indicating a hyperlink or navigation element. The banner functions as a visual warning or category label within an email or messaging application.",
        "position": 2,
        "context": ".\nAn example of a benign banner is displayed in the screenshot below:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Blue+banner.png",
        "alt": "**UI Element Description:** Action button or selection field rendered as a teal/bright blue rounded rectangle (pill-shaped).\n\n**Contents (White text and iconography):**\n\n1.  **Icon (Left):** A small, white, stylized circular icon (resembling a target or central point within a specific, segmented outer container).\n2.  **Label (Center):** The primary action text, set in white, san-serif font, reading: \"First time sender\".\n3.  **Indicator (Right):** A white, right-pointing chevron (`>`), serving as a navigational indicator suggesting transition to a subsequent screen or expanded menu.\n\n**Context:** This button is used to initiate a process flow tailored for users who have not previously utilized the sending function, confirming its status as an entryway for new users.",
        "position": 3,
        "context": "pimg.s3.us-east-1.amazonaws.com/Defend/Banners/External+Sender.png' alt=''>"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Sensitive+Information.png",
        "alt": "**Element Type:** Informational Banner / Clickable Security Callout\n**Visual Structure:** A horizontal bar with rounded corners, featuring a solid teal/cyan background.\n**Content (White, Sans-serif Text):** `Discusses sensitive information`\n**Left UI Element (Visual Identifier):** A white, stylized circular icon (resembling a security or privacy marker, consisting of a central dot within concentric rings and outer stabilizing notches).\n**Right UI Element (Action Indicator):** A right-pointing chevron (`>`), denoting a navigational link, expanded detail view, or call-to-action.\n**Function:** Alerts the user that the associated content contains data classified as sensitive and provides a visual cue for further details or security restrictions.",
        "position": 4,
        "context": "3.us-east-1.amazonaws.com/Defend/Banners/Blue+banner.png' alt=''>"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Financial+Banner.png",
        "alt": "This image depicts a horizontal, pill-shaped UI element, likely functioning as a content classification tag or navigational button, set against a medium teal background.\n\n**UI Elements and Text:**\n\n1.  **Icon:** A white, stylized circular icon is positioned on the far left, featuring symmetrical outer lobes enclosing a central ring and dot (often used to symbolize classification or financial data).\n2.  **Label Text:** The central text is white, high-contrast, and reads: **\"Contains topics of a financial nature\"**\n3.  **Indicator:** A white, right-facing chevron (`>`) is positioned on the far right, typically signifying that the element is clickable or expands to further details.\n\n**Context:** The element indicates that the associated content has been classified as financial in nature.",
        "position": 5,
        "context": "east-1.amazonaws.com/Defend/Banners/Sensitive+Information.png' alt=''>"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Amber+banner.png",
        "alt": "This image displays a security notification banner rendered as a rounded-corner capsule element.\n\n**UI Elements and Formatting:**\n*   **Background:** Solid mustard yellow/dark gold.\n*   **Text/Icons Color:** Dark gray/charcoal.\n*   **Context:** Email security warning (Phishing detection).\n\n**Content Breakdown (Left to Right):**\n1.  **Security Icon:** A dark gray shield-like icon centered around an exclamation point (`!`), signifying an alert or caution status.\n2.  **Warning Text:** The primary message, \"This email shows signs of phishing,\" displayed in a medium-weight, dark gray font.\n3.  **Action Indicator:** A right-pointing chevron (`>`) indicating that the banner is clickable for additional details or actions.",
        "position": 6,
        "context": "/ol>\nAn example of a suspicious banner is displayed in the screenshot below:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Impersonation+Banner.png",
        "alt": "This image depicts a security-focused **Informational Alert Banner**, characterized by a **Mustard Yellow/Dark Gold** background and **Dark Gray** text and glyphs. The banner has rounded corners, indicating a typical UI element (likely within an email client or web application).\n\n**Elements (Left to Right):**\n\n1.  **Warning Glyph:** A custom security icon featuring an exclamation point (`!`) centered within a stylized, abstracted shield or dual-parentheses shape.\n2.  **Advisory Text String:** The central message reads: \"This email shows signs of impersonation.\"\n3.  **Navigation Indicator:** A right-pointing **Chevron** (`>`), signifying that the banner is a clickable element leading to an expanded view or detailed contextual information.\n\n**Context:** The banner serves as a high-visibility warning to the user regarding potential phishing or spoofing activity detected in the associated content (e.g., an email body).",
        "position": 7,
        "context": "3.us-east-1.amazonaws.com/Defend/Banners/Amber+banner.png' alt=''>"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Red+banner.png",
        "alt": "A warning banner, typically displayed within an email client or security interface, is rendered as a single horizontal bar with a solid dark red background and white text.\n\n**UI Elements and Content:**\n1.  **Icon:** A white graphical icon is positioned at the far left. The icon depicts a symmetrical, stylized shape resembling an alert shield or an error indicator, featuring a prominent 'X' mark in the center.\n2.  **Text:** The main body text is displayed in bold, white, sans-serif font: **\"This email shows strong signs of phishing\"**\n3.  **Action Indicator:** A white right-pointing chevron (`>`) is positioned immediately after the text, indicating that the banner is a clickable element designed to reveal more information or take an action related to the warning.\n\n**Context/Function:**\nThis element serves as a high-priority, non-dismissible security notification, alerting the user that the associated content (likely an email) has been flagged by automated systems as potentially malicious or fraudulent (phishing). The use of the red background signifies a critical warning level.",
        "position": 8,
        "context": "ls.\nAn example of a dangerous banner is displayed in the screenshot below:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Email+Summary+Page.png",
        "alt": "The image displays a KnowBe4 email analysis report utilizing a dark theme interface.\n\n**Header and Overall Finding:**\nThe page is titled with the KnowBe4 logo. The primary section, \"What we found,\" indicates a high-risk classification: \"This email shows very strong signs of phishing.\" The **PRIMARY REASON** cited is: \"Your organization has marked the source of this email as dangerous.\" A link for further details (\"click here\") is provided. A risk meter (labeled **c**) is displayed as a circular gauge, segmented in blue (low), yellow (medium), and red (high). A pointer is positioned firmly in the high-risk (red) section.\n\n**Metadata Panel (d):**\nA horizontal panel provides four key pieces of email metadata, each paired with an icon:\n1.  **Sender:** `*****@gmail.com` (Envelope icon).\n2.  **Location:** `Basildon, United Kingdom` (Location Pin icon).\n3.  **Email Security:** `Full Authentication Pass` (Shield icon, includes context tooltip).\n4.  **History with you:** `Moderate contact` (Envelope icon, includes context tooltip).\n\n**Action Panel (Report this email - e):**\nThis section presents user actions in two columns:\n\n1.  **Analyze:** Allows the user to challenge the categorization. The associated button is **REPORT AS NOT PHISH** (Orange).\n2.  **Productivity:** Addresses Graymail and Spam classification. The text identifies the email as \"Graymail.\" Two action buttons are provided: **REPORT AS NOT GRAYMAIL** (Orange) and **REPORT AS SPAM** (Orange/Red).",
        "position": 9,
        "context": "ion about what the email summary page displays, see the list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/egress/0EM8d000006CN4s.jpg",
        "alt": "This image displays a security warning interface titled **Egress Defend Link Scanner**. The UI features white text on a dark navy background.\n\n**Header and Primary Context:**\nThe screen is headed by the application title, \"Egress Defend Link Scanner,\" followed by the main alert text: \"Warning, you have clicked on a link from a potentially dangerous email.\"\n\n**Scanned Link Details (Bulleted List):**\nThe scan results are presented in a three-point list format, each preceded by an icon (a stylized white upward chevron within a colored circular shield):\n\n1.  **Initial Link (Information):** Preceded by a teal/blue icon. Text reads: \"The link you have clicked is 'https://zyrosite.com/'\"\n2.  **Redirect Information (Warning):** Preceded by a teal/blue icon. Text reads: \"This link redirects to 'https://zyro.com' ensure that this is where you intended to go\"\n3.  **Severity Assessment (High Alert):** Preceded by a red icon, indicating high risk. Text reads: \"This email shows very strong signs of phishing\"\n\n**Actionable Element:**\nA single call-to-action button, labeled **\"Continue,\"** is positioned in the bottom right corner of the window. The button is displayed with a solid bright blue background, indicating it is the primary or default action, allowing the user to bypass the warning and proceed to the flagged URL.",
        "position": 10,
        "context": "ting you from phishing attempts and other malicious sites that could compromise your security."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Graymail+Report.png",
        "alt": "This image displays a User Interface (UI) segment using a dark theme, centered on user management of email classification.\n\n**Header and Context:**\nThe section is titled **Productivity**. Below the title is a explanatory paragraph: \"This email has been identified as Graymail. You can report it as not Graymail to receive future emails in your Inbox, or as Spam to send future emails to your Junk folder.\"\n\n**Actionable UI Elements (Buttons):**\nTwo stacked, blue call-to-action buttons are present for user feedback and classification adjustment:\n\n1.  **REPORT AS NOT GRAYMAIL** (Upper Button)\n2.  **REPORT AS SPAM** (Lower Button)",
        "position": 11,
        "context": "this kind will not be sent to your _Graymail folder."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "defend"
      ],
      "image_count": 11
    }
  }
}