{
  "article": {
    "id": 360014116634,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360014116634.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360014116634.html",
    "author_id": 10164786027,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 9,
    "vote_count": 17,
    "section_id": 7314544417683,
    "created_at": "2018-12-18T15:34:43Z",
    "updated_at": "2025-08-25T15:31:42Z",
    "name": "Learner Experience (LX) Guide",
    "title": "Learner Experience (LX) Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-08-15T21:45:31Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "training",
      "Learner Experience",
      "Popcorn",
      "new training interface",
      "popcorn theater",
      "popcorn theatre",
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>KnowBe4's Learner Experience (LX) offers customization ability and engaging and fun <a href='https://support.knowbe4.com/hc/en-us/articles/360016839214'>gamification</a> to your security awareness training plan.</p>\n<p>Your users can compete against their peers on leaderboards and earn badges while learning how to keep themselves and your organization safe from cyber attacks. An informative, optional tour is also provided to show your users around and make them feel comfortable with their new learning environment.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> The LX can also be accessed by using the KnowBe4 Learner App. The app allows your users to access their security awareness and compliance training anytime and anywhere. For more information about the app, see our <a href='https://support.knowbe4.com/hc/en-us/articles/9776769113747'>FAQ: KnowBe4 Learner App for Admins</a> article.</div>\n</div>\n<p>Read below to learn more about these features.</p>\n<h2 id='h_01HC01AKG962GJGDX4XZSCP34T'>Set Up Your Learner Experience</h2>\n<p>The below steps will explain how to set up your LX. Click <a href='https://support.knowbe4.com/hc/en-us/articles/360016839774-Video-Learner-Experience-LX-Account-Settings'>here</a> to view a short video explaining these steps.</p>\n<ol>\n<li>Log in to your KnowBe4 console.</li>\n<li>Click your email address in the top right corner and select <strong>Account Settings</strong>.</li>\n<li>To customize the look and feel of the Learner Experience, navigate to the <strong>Branding</strong> section.</li>\n<li>Here you can add a <strong>Company Logo</strong> and set a <strong>Brand Color</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/learner_experience/brandingsection.png'><img src='https://helpimg.s3.amazonaws.com/learner_experience/brandingsection.png' alt=' '></a></p>\n</li>\n<li>Navigate to the <strong>Learner Experience</strong> section.</li>\n<li>Under <strong>Learner Assistance</strong>, enable the custom help button option, if desired. For more information, see the <a href='#h_01HC01AKG9CZECDC3J8WE5FAW1'>Learner Assistance</a> section of this article.</li>\n<li>Enable the <strong>Learner Dashboard</strong> if desired. This can show users additional information, such as their Phish-prone Percentage, Personal Risk Score, Training History, and more. Learn more in the <a href='#h_01HC01AKG9M4PMA8GEH3T2ATZ8'>Learner and Team Dashboards</a> section.</li>\n<li>Click the checkbox next to <strong>Enable Badges</strong> if you’d like to try out our <strong>Badges</strong> feature.\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/enable_badges.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/enable_badges.png' alt=' '></a></p>\n</li>\n<li>Click the <strong>Leaderboard Type</strong> drop-down menu and select <strong>Group Leaderboard</strong> to try out the Leaderboard feature.\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/enable_leaderboards.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/enable_leaderboards.png' alt=' '></a></p>\n</li>\n<li>Select a <strong>Leaderboard Time Period.</strong> You can select from the following: <strong>Past 30 Days</strong>, <strong>Past 90 Days</strong>, <strong>Current Quarter</strong>, <strong>Current Year</strong>, or <strong>All Time</strong>. Any enrollment that was active during that time period will be included in the leaderboard rankings.\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/leaderboard_timeperiod.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/leaderboard_timeperiod.png' alt=' '></a></p>\n</li>\n<li>Select groups that you'd like to include in your leaderboard in the <strong>Groups to Include in Leaderboard</strong> drop-down menu. You can select between 3 and 25 groups.\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/leaderboard_groups.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/leaderboard_groups.png' alt=' '></a></p>\n</li>\n<li>Click <strong>Save Changes</strong> at the bottom of the page to save your changes.</li>\n</ol>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong> While in the LX, you can navigate back to your KnowBe4 admin console at any time by clicking your name (or email) in the top-right and selecting <strong>Return to Console</strong>.</div>\n</div>\n<h2 id='h_01HC01AKG95BPZXHH446VYF97N'>Customization</h2>\n<p>You can set a brand color for your LX and upload your company logo from within your <strong>Account Settings</strong>. We recommend that you match the brand color in your Account Settings to your organization’s logo to provide a familiar feeling for your end-users.</p>\n<p>Below are some examples of how you can brand your LX:</p>\n<p><strong>Example #1:</strong></p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/customization_1.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/customization_1.png' alt=' '></a></p>\n<p><strong>Example #2:</strong></p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/customization_2.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/customization_2.png' alt=' '></a></p>\n<p><strong>Example #3:</strong></p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/customization_3.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/customization_3.png' alt=' '></a></p>\n<h2 id='h_01HC01AKG9G6P37G1FSHDWZCHF'>Learner Experience</h2>\n<p>We offer the ability to customize your users' learning experience from gamification to localization. Create a unique learner experience that fits your organization's culture. We include a tour to help familiarize your users with the interface. Their first training assignment will be on the top of the list of assignments and after a course is completed, it will move down to the bottom.</p>\n<p>To help your users get started, you can send them our <a href='https://support.knowbe4.com/hc/en-us/articles/204469068-Enrolled-in-Training-A-4-Step-Guide-to-Getting-Started'>Learner Support: Quickstart Guide</a> or send them the link to <a href='https://support.knowbe4.com/hc/en-us/articles/360000159887-Video-Getting-Started-with-KnowBe4-Security-Awareness-Training'>this video</a>.</p>\n<h3 id='h_01HC01AKG9KNME4964AWBWQ01H'>Tour</h3>\n<p>Upon their first login, your users will be invited to take a quick tour to show them around their LX. They can skip the tour if they’d prefer.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>To disable the tour prompt for your organization, you can select the <strong>Disable Tour Prompt</strong> option in your <strong>Account Settings</strong>. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12734085457555'>KnowBe4 Console Account Settings: Training</a> article.</div>\n</div>\n<p>The first step of the tour will vary slightly depending on if you selected to use leaderboards or badges along with the LX. See below:</p>\n<table>\n<tbody>\n<tr>\n<td>If Leaderboards and Badges are enabled:</td>\n<td>If Leaderboards or Badges are not enabled:</td>\n</tr>\n<tr>\n<td>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/tour_fun.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/tour_fun.png' alt=' '></a></p>\n</td>\n<td>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/tour_standard.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/tour_standard.png' alt=' '></a></p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>The tour can be re-launched at any time. To do so, your users will click their name (or email) in the top-right and select <strong>Launch Tour</strong> in the drop-down menu.</p>\n<p>Users who log in after three months of inactivity will be prompted to take the tour again, to refresh their memory of how to use the interface and introduce any new features that may have come out since they last logged in.</p>\n<p>A short, optional <strong>User Profile</strong> tour is also available when the user navigates to their <strong>Profile </strong>from the top-right drop-down menu. This tour does not launch automatically--from their User Profile, your users can launch the tour by clicking the <strong>Show me around</strong> button. Click <a href='https://support.knowbe4.com/hc/en-us/articles/360010801173-Video-User-Profile-Guide'>here</a> to view a short video explaining the user profile area.</p>\n<h3 id='h_01HC01AKG93QNP1YAQBXANWZWA'>Localization</h3>\n<p>Users can set their <strong>Training Language</strong> by clicking their name in the top-right corner and then clicking the language at the bottom of the drop-down menu. The LX interface will be localized for the selected language. For more information on your users' <strong>Training Language</strong>, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060622513'>Localization Guide</a>.</p>\n<p>If a training course is available in the selected language, this setting will update the default language of that course. If a training course has already been started in a different language, there will be no change to that course.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/learner_experience/localization.gif'><img src='https://helpimg.s3.amazonaws.com/learner_experience/localization.gif' alt=' '></a></p>\n<h3 id='h_01HC01AKG9M4PMA8GEH3T2ATZ8'>Learner and Team Dashboards</h3>\n<p>The Learner and Team Dashboards are customizable dashboards that provide information such as training progress, optional learning, phishing results, and risk scores.</p>\n<p>The<strong> Learner Dashboard</strong> is specific to the individual user who is logged in to the LX. For information about the Learner Dashboard, view our <a href='https://support.knowbe4.com/hc/en-us/articles/360051484394'>Learner Dashboard Overview</a> article.</p>\n<p>The <strong>Team Dashboard</strong> is designed for managers to view statistics for the users on their team and the team as a whole. For more information about the Team Dashboard, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5632850730643'>Team Dashboard Overview for Admins</a> article.</p>\n<h3 id='h_01HC01AKG96F23MFRCWTMN76CG'>Learner Library</h3>\n<p>If you have enabled <strong>Optional Learning</strong> in your <a href='https://support.knowbe4.com/hc/en-us/articles/226457887#LX'><strong>Account Settings</strong></a>, the <strong>Library</strong> tab of the LX will be visible to all users. On the <strong>Library</strong> tab, your users can view and complete the optional content of their choice. Users can also download a completion certificate for each piece of optional content completed.</p>\n<p>Depending on your settings, users will have access to modules preselected by their admin and AIDA. Users will only see the preselected library when you enable the <strong>Optional Training Campaign</strong> feature in your account settings, which is available to all paid accounts. For more information, please see the <a href='https://support.knowbe4.com/hc/en-us/articles/1500002656002-Optional-Learning-Guide'>Optional Learning Guide</a>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/learner_experience/OptionalCampaignLibrary.gif'><img src='https://helpimg.s3.amazonaws.com/learner_experience/OptionalCampaignLibrary.gif' alt=' '></a></p>\n<p>Users will see recommended training content if you enable the <strong>AIDA Recommended Optional Learning</strong> feature, which is available to Diamond level accounts.</p>\n<p>For more information about the optional learning features, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500002656002'>Optional Learning Guide</a>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/learner_experience/AIDARecommendedLibrary.gif'><img src='https://helpimg.s3.amazonaws.com/learner_experience/AIDARecommendedLibrary.gif' alt=' '></a></p>\n<h3 id='h_01HC01AKG9XPVT9HP4JWVRKG3A'>Messages</h3>\n<p>The <strong>Messages</strong> tab is hidden by default. This tab can be enabled by using the <strong>User Messaging</strong> feature. Once a message has been created, users will be able to see the Messages tab. They will also see a tile on their <strong>Dashboard</strong> notifying them about any unread messages.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> Once the <strong>Messages</strong> tab is enabled, it cannot be hidden again.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/learner_experience/User+Messaging/UserMarkAsRead.gif'><img src='https://helpimg.s3.amazonaws.com/learner_experience/User+Messaging/UserMarkAsRead.gif' alt=' '></a></p>\n<p>Once a user has read a message, they can click <strong>Mark as Read</strong> to move the message to the <strong>Read Messages</strong> section at the bottom of the page. Users can review any message in the Read Messages section by clicking on the message subject.</p>\n<p>For more information about messages, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4416416555155'>User Messaging Guide</a>.</p>\n<h3 id='h_01HC01AKG9CZECDC3J8WE5FAW1'>Learner Assistance</h3>\n<p>To support users during training, the LX includes a <strong>Need Help?</strong> button in the bottom-right corner of the page. By default, this button leads to our Knowledge Base. You have the option to change the destination of this button to a URL or contact email that you would like users to use when they need assistance with their training.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> Customizing the <strong>Need Help?</strong> button will also change the <strong>Help Desk</strong> link in the footer of the page to the same URL or contact email.</div>\n</div>\n<p>Follow the steps below to customize the learner assistance links.</p>\n<ol>\n<li>From your KnowBe4 console, click your email address in the top-right corner of the page and select <strong>Account Settings</strong>.</li>\n<li>Navigate to the <strong>Learner Experience</strong> section of your Account Settings.</li>\n<li>Under <strong>Learner Assistance</strong>, select the check box labeled <strong>Enable Customized Need Help Button</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/learner_experience/CustomizedHelp.png'><img src='https://helpimg.s3.amazonaws.com/learner_experience/CustomizedHelp.png' alt=' '></a></p>\n</li>\n<li>Once you've enabled this setting, enter the URL or email link that you would like to direct users to. See the list below for requirements and options.\n<ul>\n<li>To direct users to a webpage, you must enter a full URL. Shortened versions of the URL may result in an error. For example, <strong>https://support.knowbe4.com</strong> is a full URL.</li>\n<li>To allow users to send an email using their default mail client, enter the <strong>mailto: </strong>HTML tag, followed by the email address of your choice. For example, <strong>mailto:AdminName@YourDomain.com</strong>\n</li>\n<li>To have users send an email using Outlook Online, copy the URL below. Then, replace <strong>[[Email Address]]</strong> with the email address of your choice. <code>https://outlook.office.com/owa/?path=/mail/action/compose&amp;to=<strong>[[Email Address]]</strong></code>\n</li>\n<li>To prefill the subject line, add the text below to the end of the URL. Then, replace <strong>[[Subject\"]]</strong> with the subject of your choice. <code>&amp;subject=<strong>[[Subject]]</strong></code>\n</li>\n<li>To have users send an email using Google Workspace (formerly G Suite), copy the URL below. Then, replace <strong>[[Email Address]]</strong> with the email address of your choice. <code>https://mail.google.com/mail/?view=cm&amp;fs=1&amp;to=<strong>[[Email Address]]</strong></code>\n</li>\n<li>To prefill the subject line, add the text below to the end of the URL. Then, replace <strong>[[Subject]]</strong> with the subject of your choice. <code>&amp;su=<strong>[[Subject]]</strong></code>\n</li>\n</ul>\n</li>\n</ol>\n<h3 id='h_01HC01AKGAEVWT2ZG9X1YSGK4E'>Gamification</h3>\n<p>KnowBe4’s LX offers optional gamification, in the form of leaderboards and badges, so your users will be incentivized and motivated to take their assigned training.</p>\n<p>Gamification is the addition of gaming features or principles to something that typically does not have a gaming element--in our case, security awareness training and e-learning content. Gaming features can include badges, points, rankings, rewards, and more.</p>\n<p>Gamification has been shown to improve user engagement by increasing people’s inherent ambition to compete, achieve, or master. When people are motivated to complete a task, they learn better and retain more information.</p>\n<p>KnowBe4’s addition of gamification includes leaderboards and badges. Leaderboards allow users to see how they rank up against their peers, promoting friendly competition. Badges will provide users with unexpected rewards after their training to remind them that they’ve accomplished something important. Continue to read below for more details about leaderboards and badges.</p>\n<p>Click <a href='https://support.knowbe4.com/hc/en-us/articles/360016839214-Video-Gamification'>here</a> to watch a short, animated video explaining gamification in the KnowBe4 console. Want to learn more about gamification in general? See <a href='https://en.wikipedia.org/wiki/Gamification' target='_blank' rel='noopener'>Wikipedia: Gamification</a>.</p>\n<h3 id='h_01HC01AKGAYN7CRFDY643EYHNV'>Leaderboards</h3>\n<p>The <strong>Leaderboard</strong> tab encourages users to compete with their colleagues and show off their security awareness skills. You can enable a group leaderboard based on training completion or an individual leaderboard based on the usage of the Phish Alert Button (PAB). To learn more about these leaderboards, continue reading this article. To learn how to enable leaderboards, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12734085457555'>KnowBe4 Console Account Settings: Training</a> article.</p>\n<p>If you would like to educate your users on how the leaderboards work, we recommend sharing the resources listed below.</p>\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360012723514'>Learner Support: Leaderboard Guide</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360016839414'>Video: Cyber Hero Training: Leaderboards</a></li>\n</ul>\n<h4 id='h_01HKB00CE28BT0ZY0JCFA1VYSC'>Individual Leaderboard</h4>\n<p>On the individual leaderboard, users compete with their colleagues on how well they use the Phish Alert Button (PAB). Users earn points based on the percentage of simulated phishing emails they report and how quickly they’re reported. For more information about this point system, see the <strong>Detailed Point Calculation</strong> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360012723514-Learner-Support-Leaderboards-Guide'>Learner Support: Leaderboards Guide</a>.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important: </strong>If you delete a campaign, the points users earned from it will be deducted from the user’s total points on the leaderboard. The updated point totals may take up to 24 hours to display on the leaderboard.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/learner_experience/individual_leaderboard.png'><img src='https://helpimg.s3.amazonaws.com/learner_experience/individual_leaderboard.png' alt=' '></a></p>\n<h4 id='h_01HKB037SWAN2GJXQ7SS7W5NV2'>Group Leaderboard</h4>\n<p>On the group leaderboard, users work in groups to complete all of their assigned training on time. Groups are ranked according to the percentage of training completed. This percentage is calculated by dividing the number of completed training assignments for each group member by their total number of training assignments.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/leaderboard.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/leaderboard.png' alt=' '></a></p>\n<p>Before enabling the group leaderboard, be sure to create the <a href='https://support.knowbe4.com/hc/en-us/articles/115010243207-How-to-Create-a-Group'>user groups</a> you would like to use. You can create groups based on any criteria you would like. Some common groupings are by manager, department, office, or region. If you’re a Platinum or Diamond customer, we suggest using <a href='https://support.knowbe4.com/hc/en-us/articles/8293053887251/'>Smart Groups</a> to create your leaderboard groups.</p>\n<p>Users who are not in the selected groups will not have the leaderboard tab in their LX. If a user is in multiple groups, the group with the highest score will display on their leaderboard.</p>\n<h2 id='h_01HC01AKGAKP8K2EAKSSB9859N'>Badges</h2>\n<p>Badges add engagement to your security awareness training plan by providing an incentive for your users to meet specific achievements while taking their training.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/badges.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/badges.png' alt=' '></a></p>\n<p>Each badge has requirements associated with it. Once a user meets these requirements, they’ll receive a pop-up indicating they earned a badge. They can click the <strong>Badges</strong> tab to see what badges they’ve received and what badges are still available.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/badges_notifications.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/badges_notifications.png' alt=' '></a></p>\n<p>You must enable badges in your <strong>Account Settings</strong> to turn them on in the LX. By default, all badges will be available to earn. You can select or deselect badges in your Account Settings to enable or disable them in the LX.</p>\n<div class='callout-note'>\n<div>\n<strong>Note: </strong>Badges are not earned retroactively. Users can only earn a badge while it is enabled.</div>\n</div>\n<p>To learn about the available badges and how users can earn them, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360011915933-How-Do-I-Earn-Badges-'>Learner Support: Badges Guide</a> article. You can also share that article with your users to encourage them to earn badges.</p>\n<h3 id='h_01HC01AKGA62B0G3432NGVFYHK'>Surveys</h3>\n<p>You have the option to enable surveys for your user to take after they complete training content. The feedback provided can be used to help you evaluate the effectiveness of your training campaigns. For more information on surveys and the best way to utilize them, please see our article on How to Use Surveys.</p>\n<h2 id='h_01HC01AKGA4N6KK4V7197QRBG0'>Sample Templates for Stakeholders and Users</h2>\n<p>If you used the previous version of KnowBe4's training environment, you will want to consider:</p>\n<ol>\n<li>Informing <a href='#h_01HC01AKGATQQNGW0TQ0144NX1'>stakeholders</a> in your security awareness plan of this new learning environment, and,</li>\n<li>Notifying <a href='#h_01HC01AKGAJ2V7ASDCQYP5BFH8'>users</a>, especially those that have taken training through the KnowBe4 console in the past, that the Learner Experience has changed.</li>\n</ol>\n<h3 id='h_01HC01AKGATQQNGW0TQ0144NX1'>Template for Stakeholders</h3>\n<p>Ensure you read through the template before sending, as some of the proposed text may not apply for your organization. Make any changes as appropriate for your organization.</p>\n<p>As you may be aware, [[company_name]] partners with KnowBe4, a leader in the cybersecurity industry, to deploy security awareness training. KnowBe4 has optional gamification, in the form of badges and leaderboards, as part of its learner experience.</p>\n<p>Gamification has been shown to improve engagement by supporting a user’s natural ambition to compete, achieve, or master. When people are intrinsically motivated to complete a task, they learn better and retain more information. Click <a href='https://support.knowbe4.com/hc/en-us/articles/360016839214-Video-Gamification'>here</a> to watch a short, animated video explaining KnowBe4's addition of gamification.</p>\n<p>[[company_name]] will be using the gamification option and will have badges and leaderboards turned on for our account. We are excited to see how this gamification will motivate our users and support our defense-in-depth plan.</p>\n<p>Please reach out if you have any questions.</p>\n<p>[[Your Name]]</p>\n<h3 id='h_01HC01AKGAJ2V7ASDCQYP5BFH8'>Template for Users</h3>\n<p>Ensure you read through the template before sending, as some of the proposed text may not apply to your organization. Make any changes as appropriate for your organization.</p>\n<p>Hi all,</p>\n<p>Next time you log in for assigned training, you’ll notice some fun changes to your online learning environment. KnowBe4, the organization we partner with for training, has added gamification features that you’ll want to check out.</p>\n<ul>\n<li>Leaderboards - The leaderboard will show you how you rank up against your peers. Completely finish all of your training assignments to boost your group’s spot on the leaderboard.\n<ul>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360012723514-How-Do-Leaderboards-Work-'>Learner Support: Leaderboards Guide</a></li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360016839414-Video-Cyber-Hero-Training-Leaderboards'>Cyber Hero Training: Leaderboards</a> (Video)</li>\n</ul>\n</li>\n<li>Badges - You can now collect badges as part of your training assignments. Build up your Cyber Hero trophy case by meeting the requirements of each badge.</li>\n</ul>\n<p>We will notify you when you’re enrolled in training. Have fun, and be sure to let us know what you think.</p>\n<p>Thank you,</p>\n<p>[[Your Name]]</p>\n<h2 id='h_01HC01AKGAY6R3DMTC5BMT6Q3V'>Training Notifications</h2>\n<p>Training notifications are available to support your <strong>Cyber Hero</strong> LX. These can be found by navigating to <strong>Training</strong> &gt; <strong>Notification Templates</strong> &gt; <strong>System Templates</strong> and searching for <strong>Cyber Hero</strong> in the training notification search bar.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/cyberhero.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/cyberhero.png' alt=' '></a></p>\n<p>If you're not using badges and leaderboards as part of your user training, we recommend using our standard notifications--i.e., those <em>not</em> labeled with <strong>(Cyber Hero)</strong>.</p>\n<p>We also recommend including a link to one or more of the following videos, which will explain how your users can access and complete their training:</p>\n<ul>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360000159887'>Getting Started with KnowBe4 Security Awareness Training</a> (Use if gamification is <strong>disabled</strong>)</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360016838514'>Getting Started with Cyber Hero Training</a> (Use if gamification is <strong>enabled</strong>)</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360016989013'>Cyber Hero Training: Badges</a> (Use if Badges are <strong>enabled</strong>)</li>\n<li>\n<a href='https://support.knowbe4.com/hc/en-us/articles/360016839414'>Cyber Hero Training: Leaderboards</a> (Use if Leaderboards are <strong>enabled</strong>)</li>\n</ul>\n<h2 id='h_01HC01AKGA2JJ3DBC7N3P1A19S'>FAQ</h2>\n<p><strong>Why is gamification useful?</strong></p>\n<p>Gamification has been shown to improve user engagement by increasing people’s inherent ambition to compete, achieve, or master. When people are intrinsically motivated to complete a task, they learn better and retain more information. Click <a href='https://support.knowbe4.com/hc/en-us/articles/360016839214-Video-Gamification'>here</a> to watch a short, animated video explaining gamification.</p>\n<p><strong>Can I see what badges my user has received, or where they rank on the leaderboards?</strong></p>\n<p>No, user badges and leaderboards are only visible to users and will not be viewable by admins or available in reports.</p>\n<p><strong>How can I access my training from the admin console? </strong>Click your email address in the top-right corner of the page and click <strong>My Training</strong>.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/adminconsole_mytraining.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/adminconsole_mytraining.png' alt=' '></a></p>\n<p><strong>How can I return to my admin console while in the user learning experience?</strong></p>\n<p>Click your name or email address in the top-right and click <strong>Return to Console</strong>.</p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/learner_experience/return_to_console.png'><img src='https://s3.amazonaws.com/helpimg/learner_experience/return_to_console.png' alt=' '></a></p>\n<p><strong>How are leaderboard ranking determined?</strong></p>\n<p>Each group's ranking is determined by the percentage of assigned training completed by the group members. All groups that have a 100% completion rate will be ranked depending on how fast all users within that group completed the training.</p>\n<p><strong>How is the language for individual courses determined</strong></p>\n<p>If a course is not available in the language you selected for the interface, our system takes other factors into consideration when it comes to setting the default language for each course. These factors include the default language your administrator set, the language set in your browser, as well as what other languages you have selected for courses you have taken previously. However, the language you set for your LX, using the language drop-down menu on the top left of the LX, will override all other factors as long as you have not previously set it. Courses you have already started will remain defaulted to the language you originally started the course in.</p>\n<p><strong>How long are completed modules available in the user's ‘Training’ tab in the Learner Experience?</strong></p>\n<p>Modules are only listed in the user’s Training tab in the Learner Experience while a campaign is active.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360014116634-Learner-Experience-LX-Guide",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/learner_experience/brandingsection.png",
        "alt": "This image displays a UI configuration panel titled **Branding**. The section provides three distinct fields for defining corporate visual identity elements.\n\n**Section Header:** Branding\n\n**UI Elements (Top to Bottom):**\n\n1.  **Field 1: Company Logo URL**\n    *   **Label:** \"Company Logo URL\"\n    *   **Help Indicator:** Question mark icon (?) adjacent to the label.\n    *   **Input Type:** Empty, wide text input box for URL entry.\n    *   **Function:** Allows input of an external link for the company logo.\n\n2.  **Field 2: Company Logo**\n    *   **Label:** \"Company Logo\"\n    *   **Help Indicator:** Question mark icon (?) adjacent to the label.\n    *   **Input Type:** Standard file input button labeled \"Choose File.\"\n    *   **Function:** Facilitates local file upload for the company logo asset.\n\n3.  **Field 3: Brand Color**\n    *   **Label:** \"Brand Color\"\n    *   **Help Indicator:** Question mark icon (?) adjacent to the label.\n    *   **Input Type:** Combined color picker and text field.\n    *   **Value:** Text input displays the hexadecimal color code `#f26721`.\n    *   **Visual Indicator:** An integrated, small square color swatch is positioned to the right of the input, displaying the corresponding orange brand color.\n    *   **Function:** Sets the primary brand color, configurable via hex code entry or an implied color selection utility.",
        "position": 1,
        "context": "ere you can add a Company Logo and set a Brand Color."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/enable_badges.png",
        "alt": "The image displays a multi-select input interface titled **\"Badges Available to Users\"** (with an accompanying help icon).\n\n**Input Field and Selected Items:**\nThe input field contains five pre-selected items displayed as removable tags, each with a close (X) icon:\n1. Pioneer Badge\n2. Lightning Fast Badge\n3. New Recruit Badge\n4. Night Owl Badge\n5. Cyber Hero Badge\n\nA placeholder text, \"Select option,\" prompts the user for new input. An upward caret suggests the list is partially visible or scrollable.\n\n**Dropdown Options (Selection List):**\nA list of available badge options is displayed beneath the input field. Options are categorized by selection status:\n\n*   **Actively Highlighted/Hovered:** The option **\"Graduate Badge\"** is highlighted in blue, indicating active focus. The right side displays the selection prompt: **\"Press enter to select,\"** accompanied by a hand cursor icon.\n*   **Selected (and Listed Above):** Several options are listed with the status **\"Selected\"** in light gray text on the right edge. These badge names are typically displayed in bold font:\n    *   Cyber Hero Badge\n    *   Lightning Fast Badge\n    *   New Recruit Badge\n*   **Available (Unselected):**\n    *   Early Bird Badge\n    *   Hat Trick Badge",
        "position": 2,
        "context": "rong>Enable Badges if you’d like to try out our Badges feature."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/enable_leaderboards.png",
        "alt": "The image displays a user interface (UI) snippet focused on selection control. The context is established by the label **\"Leaderboard Type\"**.\n\nThe primary UI element is an expanded dropdown menu or filterable combobox.\n\n1.  **Input Field:** The top section of the control features the placeholder text **\"Select option\"** in gray, accompanied by a visible vertical text insertion cursor. A small, dark upward-pointing triangular indicator is present on the right, confirming the expanded state of the list.\n2.  **List Options:** The menu displays two options, separated by horizontal dividers:\n    *   **No Leaderboard** (Standard unselected text).\n    *   **Group Leaderboard** (Active/Focus State). This option is highlighted using a solid dark gray background and bold white text, indicating it is currently selected or under cursor focus.",
        "position": 3,
        "context": "u and select Group Leaderboard to try out the Leaderboard feature."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/leaderboard_timeperiod.png",
        "alt": "This image displays an active dropdown menu for selecting the time duration of a leaderboard, labeled \"Leaderboard Time Period (?)\" at the top.\n\n**UI Elements and Text:**\n\n1.  **Context Label:** The control is titled \"Leaderboard Time Period,\" followed by a standard help icon (question mark inside a circle).\n2.  **Input Field:** A selection box is open, showing the placeholder text \"Select option\" and an active flashing text cursor. A small upward-pointing caret (triangle) is visible on the right edge of the input field, indicating the menu is expanded.\n3.  **Dropdown Menu:** The expanded list displays five distinct time period options for selection:\n    *   Past 30 Days\n    *   Past 90 Days\n    *   Current Quarter\n    *   **Current Year** (This option is highlighted/focused, presented in bold white text against a solid dark gray background.)\n    *   All Time\n4.  **State:** The \"Current Year\" option is actively highlighted, denoting either a mouse hover state or the currently selected value.\n5.  **Truncation:** A partially visible blue element, likely a button or another UI control, is truncated at the very bottom edge of the image, below the \"All Time\" option.",
        "position": 4,
        "context": "was active during that time period will be included in the leaderboard rankings."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/leaderboard_groups.png",
        "alt": "This image displays a user interface element for defining inclusion criteria, specifically targeting group selection for a \"Leaderboard.\"\n\n**UI Elements and Context:**\n\n1.  **Field Label:** The element is labeled \"**Groups to Include in Leaderboard**.\"\n2.  **Help Indicator:** A gray circular question mark icon (`(?)`) is positioned next to the label, indicating the availability of a tooltip or help documentation.\n3.  **Input Control:** A rectangular input field functions as a tokenized multi-select dropdown.\n4.  **Selected Values (Tokens):** Three groups are currently selected and displayed as distinct, bordered tokens within the input field:\n    *   **Designers**\n    *   **Human Resources**\n    *   **IT**\n5.  **Token Interaction:** Each selected token is followed by a close icon (**X**), allowing the user to remove the corresponding group from the selection list.\n6.  **Dropdown Indicator:** A downward-pointing chevron icon is located on the right side of the input field, confirming that clicking the control will display additional group options for selection.",
        "position": 5,
        "context": "You can select between 3 and 25 groups."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/customization_1.png",
        "alt": "This screen captures a web application's gamified leaderboard UI.\n\n**Header and Navigation:**\nThe top bar features the \"Greens Food Suppliers\" logo on the left. Primary navigation links include \"Training,\" \"Leaderboard,\" and \"Badges.\" The user is identified as \"Aaron Anderson\" in the top right corner.\n\n**Page Context:**\nThe main title is \"Greens Food Suppliers Leaderboard.\" Subtext provides instructions: \"See how your group ranks below! Improve your group's rank on the leaderboard by completing all of your training assignments.\"\n\n**Leaderboard Content:**\nThe core of the page displays the top three group rankings in three centered modules, using consistent green line-art iconography to indicate placement.\n\n1.  **IT (1st Place):** Displayed centrally, indicated by a large green trophy icon labeled '1'. A positive notification bubble overlay reads: \"Congrats! Your group is 1st.\" The progress indicator beneath the group name shows \"25% Training Complete.\"\n2.  **HR (2nd Place):** Displayed on the left, indicated by a green ribbon medal icon labeled '2'. The progress indicator shows \"25% Training Complete.\"\n3.  **Admins (3rd Place):** Displayed on the right, indicated by a green hanging medal icon labeled '3'. The progress indicator shows \"13% Training Complete.\"",
        "position": 6,
        "context": "are some examples of how you can brand your LX:\nExample #1:"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/customization_2.png",
        "alt": "This image displays the **Badges** achievement dashboard within an application environment branded as \"Cheshire County.\" The interface uses a light color palette with accent colors (coral/salmon) for achievement icons.\n\n**A. Header and Navigation:**\n\n*   **Branding:** Logo and text display \"Cheshire County.\"\n*   **Primary Navigation:** Tabs/links include \"Training,\" \"Leaderboard,\" and \"Badges.\"\n*   **User Context:** The user is identified as \"Aaron Anderson\" with an associated profile icon.\n\n**B. Content Title and Summary:**\n\n*   **Main Heading:** \"Your Achievements.\"\n*   **Introductory Text:** The system provides positive reinforcement (\"Good work, Cyber Hero!\") and confirms the user has currently \"earned 4 badges.\"\n\n**C. Badge Modules (Displayed Achievements):**\n\nThree distinct achievement cards are displayed side-by-side. Each card contains a coral-colored icon, a title, a brief description, and the date earned.\n\n| Badge Title | Icon Description | Achievement Criteria | Date Earned |\n| :--- | :--- | :--- | :--- |\n| **Pioneer** | Flag with a star. | Being one of the first to start working on an assignment. | 10 December 2018 |\n| **Lightning Fast** | Cloud with a lightning bolt. | Being the first to complete an assignment. | 10 December 2018 |\n| **New Recruit** | Video player screen with radiating lines. | Reporting for Cyber Hero Duty/Welcome (initial login/training completion). | 10 December 2018 |",
        "position": 7,
        "context": "er_experience/customization_1.png' alt=' '>\nExample #2:"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/customization_3.png",
        "alt": "This image displays the user interface for a training portal, focusing on the details of a specific security awareness course.\n\n**UI Structure and Navigation:**\n\n1.  **Header:** The top navigation bar features the company branding, \"CROFT'S ACCOUNTANTS,\" aligned left. Primary navigation links include \"Training,\" \"Leaderboard,\" and \"Badges.\" On the right, the logged-in user is identified as \"Aaron Anderson,\" followed by a dropdown menu indicator.\n2.  **Content Area (Training Module Card):** The main section presents a single, large card detailing a training course.\n\n**Training Module Details:**\n\n*   **Thumbnail:** A cover image on the left displays hands typing on a keyboard, overlaid with the title and duration (\"2019 KnowBe4 Security Awareness Training,\" \"30 Minutes\").\n*   **Metadata Tags:** Two contextual tags are displayed above the title:\n    *   A video icon followed by \"30 minutes.\"\n    *   A timer icon followed by \"15 days left\" (indicating the completion deadline).\n*   **Title:** The course title is \"2019 KnowBe4 Security Awareness Training.\"\n*   **Description:** A truncated paragraph provides context: \"Learn from real-world scenarios showing you strategies and techniques hackers use to take control of your organization. You'll also learn about the seven areas of an email that can contain red flag...\"\n*   **Action Button:** A prominent purple rectangular button labeled \"**Start**\" is presented below the description.\n*   **Language Selector:** Next to the Start button, a globe icon precedes the text \"English - United States\" with a dropdown indicator.\n*   **Category Footer:** The bottom of the card displays \"2019 Security Awareness Initiative.\"",
        "position": 8,
        "context": "er_experience/customization_2.png' alt=' '>\nExample #3:"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/tour_fun.png",
        "alt": "This image is a centralized, white modal dialog displayed over a grayed background, representing an initial user onboarding screen for a cybersecurity training application.\n\n**Context and Theme:** The screen utilizes a gamified theme, identified by the main header and supporting illustration, positioning the user as a \"Cyber Hero.\" A small, visible tag labeled \"primary\" is present in the top-left corner of the viewing frame, likely a UI development label.\n\n**Visual Elements and Layout:**\n1.  **Illustration:** Five stylized, orange figures wearing capes and superhero/ninja gear are centered at the top of the modal.\n2.  **Header:** A bold, large-font header reads: \"Welcome to Your Cyber Hero Journey.\"\n\n**Text Content (Instructional and Contextual):**\n1.  **Paragraph 1:** \"Cybercriminals know it’s easier to trick people than break through security technology. This means we’re all at risk.\"\n2.  **Paragraph 2:** \"To help you become a Cyber Hero, you’ve been enrolled in 5 assignments.\"\n3.  **Instructional Line:** \"You can get started right away, or click Show me around for a quick tour.\"\n\n**Actionable UI Elements:**\n1.  **Primary Call-to-Action (CTA):** A prominent, rectangular orange button labeled \"Show me around.\" This action initiates the guided tour.\n2.  **Secondary Action:** A link positioned below the primary button, preceded by the text \"Want to jump right in?\" The link text, highlighted in an orange/brown color, is \"Skip Tour.\" This action bypasses the tour and proceeds directly to the main application interface.",
        "position": 9,
        "context": "d Badges are enabled:\nIf Leaderboards or Badges are not enabled:"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/tour_standard.png",
        "alt": "This is a description of a centralized welcome modal dialog, intended to introduce a user to a cybersecurity training program.\n\n**Context:** New user onboarding/first-time login experience.\n\n**UI Elements and Content:**\n\n1.  **Icon:** A prominent visual illustration is displayed at the top, featuring an orange outline of a laptop with a large padlock centered on the screen, surrounded by stylized circuit lines.\n2.  **Header:** The title is centered and reads: \"**Welcome to Your Training**\" (Dark, bold text).\n3.  **Body Text (Rationale):** Descriptive text providing context for the training: \"Cybercriminals know it's easier to trick people than break through security technology. This means we're all at risk.\"\n4.  **Enrollment Status:** A statement detailing the user's enrollment: \"To help protect yourself and your organization, you've been enrolled in **7 assignments**.\"\n5.  **Instruction Text:** A final explanatory line setting up the navigation choices: \"You can get started right away, or click **Show me around** for a quick tour.\"\n6.  **Primary Call-to-Action (CTA):** A centered, rectangular button with an orange background.\n    *   **Button Text:** \"**Show me around**\"\n7.  **Secondary Action (Alternative CTA):** A text link located below the primary button.\n    *   **Link Prompt:** \"Want to jump right in?\"\n    *   **Link Text:** \"**Skip Tour**\" (Presented in the same orange color as the icon/button).\n\n**Functionality:** The modal offers the user two options: initiate a guided product tour (`Show me around`), or bypass the tour and proceed directly to the content (`Skip Tour`).",
        "position": 10,
        "context": "s://s3.amazonaws.com/helpimg/learner_experience/tour_fun.png' alt=' '>"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/learner_experience/localization.gif",
        "alt": "This document describes the primary user interface (UI) of the KnowBe4 Learner Dashboard.\n\n**1. Header and Global Navigation:**\n*   **Application Identity:** The top left displays the product logo, \"KnowBe4,\" with the tagline \"Human error. Conquered.\"\n*   **Primary Tabs:** The global navigation bar contains the following tabs: Dashboard (active/highlighted), Training, Library, Leaderboard, Badges, and Messages. The Messages tab displays an unread count badge of **26**.\n*   **User Context:** The top right displays the application name (\"KnowBe4 Learner App\") and the logged-in user's profile, \"Zack Westfield.\"\n\n**2. Dashboard Sub-Navigation:**\n*   The content area features two toggles/buttons for viewing scopes: **My Dashboard** (currently selected/orange fill) and **Team Dashboard** (unselected/white fill).\n\n**3. Content Widgets (Four Primary Blocks):**\nThe dashboard is composed of four data and status widgets:\n\n*   **Training Status Widget (Top Left):**\n    *   **Status:** Required training is completed.\n    *   **Text:** \"You have completed all of your required training! Keep an eye on your inbox for upcoming assignments. Until then, check out the Library tab for more training content.\"\n\n*   **Unread Messages Widget (Top Right):**\n    *   **Status:** Indicates **26** unread messages.\n    *   **Call-to-Action (CTA):** A prominent orange button labeled \"**View Messages**.\"\n\n*   **Phishing Test Results Widget (Bottom Left):**\n    *   **Title:** Phishing Test Results.\n    *   **Status:** No simulated phishing emails have been received.\n    *   **Text:** \"You haven’t received any simulated phishing emails—yet! Remember to always think before you click.\"\n\n*   **Personal Risk Score Widget (Bottom Right):**\n    *   **Title:** Personal Risk Score.\n    *   **Data Display:** A horizontal gauge ranging from 0 to 100, segmented visually with Green (low risk), Yellow, Orange, and Red (high risk).\n    *   **Current Score:** The displayed score is **38.8**.\n    *   **Contextual Links:** A link is present: \"Why did my score change?\"\n    *   **Description:** Provides context on score calculation: \"Your Risk Score is calculated using risk factors from various security types based on received data and your activity. Risky behavior increases your Risk Score, and secure behavior decreases it. Learn More.\"\n\n**4. Persistent UI Element:**\n*   A fixed, floating help button is present in the bottom right corner labeled \"**Need Help?**\"",
        "position": 11,
        "context": "already been started in a different language, there will be no change to that course."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/learner_experience/OptionalCampaignLibrary.gif",
        "alt": "This image displays the **KnowBe4** user interface (UI), specifically the **Library** section of the learning platform.\n\n### UI Structure and Navigation\n\n*   **Branding and Global Navigation:** The header features the KnowBe4 logo and the navigation links: Dashboard, Training, **Library** (currently active and underlined), Leaderboard, and Badges.\n*   **User Identification:** The top right corner identifies the logged-in user as \"Aaron Anderson.\"\n*   **Content Display:** The main body of the page presents content modules in a four-column grid layout, displaying eight modules from \"The Inside Man: Season 3\" series.\n\n### Content Module Details (The Inside Man: Season 3)\n\nEach content module follows a standard card design, featuring a key image thumbnail and associated metadata.\n\n*   **Video Module Type:** All eight displayed cards are identified as \"Video Module\" (indicated by a video camera icon) in the footer.\n*   **Progress Indicator:** The first module (Episode 1) includes an orange \"In Progress\" status badge overlaid on the top left of the thumbnail.\n*   **Module Title Structure:** Each card contains the episode number, main title, and security topic (in parentheses) overlaid on the image, followed by the full title in the footer.\n\n| Episode | Overlay Title (Topic) | Full Footer Title (Excerpt) | Status |\n| :--- | :--- | :--- | :--- |\n| **Ep 1** | Getting In (physical security) | The Inside Man: Season 3 Ep 01 - Getting In | In Progress |\n| **Ep 2** | Challenge Accepted (phishing / passwords) | The Inside Man: Season 3 Ep 02 - Challenge Acce... | |\n| **Ep 3** | Things Unsaid (disclosing information in public) | The Inside Man: Season 3 Ep 03 - Things Unsaid | |\n| **Ep 4** | Credit Where Credit is Due (social media) | The Inside Man: Season 3 Ep 04 - Credit Where C... | |\n| **Ep 5** | The Truth Shall Set You Free (personal information) | [Not fully visible] | |\n| **Ep 6** | Family Ties (PIN security) | [Not fully visible] | |\n| **Ep 7** | You Can’t Choose Your Family (security consciousness) | [Not fully visible] | |\n| **Ep 8** | Escaping the Past (deepfake / ceo fraud) | [Not fully visible] | |",
        "position": 12,
        "context": "rticles/1500002656002-Optional-Learning-Guide'>Optional Learning Guide."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/learner_experience/AIDARecommendedLibrary.gif",
        "alt": "This image displays a dashboard from a Learning Management System (LMS), focused on presenting optional training content.\n\n**I. Page Context and Filtering:**\nThe primary heading is, \"Continue learning with the optional training content below.\" Below this, a three-column filter and search bar is displayed:\n1.  **Content Types:** Dropdown input with placeholder \"Select options.\"\n2.  **Topics:** Dropdown input with placeholder \"Select options.\"\n3.  **Search:** Text input field with placeholder \"Search\" and a trailing magnifying glass icon.\n\n**II. Recommended Content Section:**\nThe section heading is \"Recommended for You.\" Content is displayed in a horizontal carousel format, with left and right navigation arrows visible on the edges of the content cards. Four cards are visible:\n\n| Card Position | Title | Status/Highlight | Content Type | Summary of Visual |\n| :--- | :--- | :--- | :--- | :--- |\n| 1 (Leftmost) | Phishing Foundations | None (Assumed New) | Training Module (Graduation Cap Icon) | Image of hands typing on a laptop. |\n| 2 | Creating Strong Passwords - Security Awareness ... (Truncated) | **In Progress** (Orange banner and border) | Training Module (Graduation Cap Icon) | Cartoon depiction of a winking padlock. |\n| 3 | Links and Attachments: Think Before You Click | None (Assumed New) | Training Module (Graduation Cap Icon) | Stylized image of a laptop with a magnifying glass query icon. |\n| 4 (Rightmost) | Phishing: Don't Get Reeled In | **In Progress** (Orange banner) | Mobile-First Module (Mobile Phone Icon) | Blue background with text and a cartoon fish caught on a hook. |\n\n**III. Subsequent Content and UI Elements:**\n*   A subsequent section heading is partially visible: \"Recommended by Your Organization.\"\n*   A fixed, floating help button is present in the bottom right corner: a dark, rounded rectangle labeled, \"Need Help?\" (accompanied by an 'i' information icon).",
        "position": 13,
        "context": "rt.knowbe4.com/hc/en-us/articles/1500002656002'>Optional Learning Guide."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/learner_experience/User+Messaging/UserMarkAsRead.gif",
        "alt": "This image displays the user dashboard interface for the KnowBe4 application.\n\n**Header and Navigation:**\nThe primary navigation bar includes links for: Dashboard (currently selected), Training, Library, Leaderboard, Badges, and Messages. The \"Messages\" link features an alert badge indicating 1 new notification. The logged-in user is identified as \"MarshaMallow@kb4u-demo.com.\"\n\n**Dashboard Widgets:**\nThe dashboard is composed of four primary metric widgets:\n\n1.  **Training Progress:**\n    *   Status: \"Completed 0%\" via progress bar.\n    *   Detail Text: \"You have completed 0 of 12 assignments.\"\n    *   Call-to-Action (CTA): \"Go to Training\" button.\n\n2.  **Message Alert:**\n    *   Notification Text: \"You have 1 unread message.\"\n    *   CTA: \"View Messages\" button.\n\n3.  **Phishing Test Results:**\n    *   Metric: \"Reported Phishing Emails.\"\n    *   Status: Indicates 0/2 completed.\n\n4.  **Personal Risk Score:**\n    *   Visualization: A radial gauge displays the risk score on a scale from 0 to 100, categorized by color (green to red/brown).\n    *   Current Value: **32.4** is prominently displayed.",
        "position": 14,
        "context": "Messages tab is enabled, it cannot be hidden again."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/learner_experience/CustomizedHelp.png",
        "alt": "This image displays a configuration section for \"Learner Assistance\" settings within a user interface.\n\n**Key UI Elements and Text:**\n\n1.  **Section Header:** The top of the image features the bold title \"Learner Assistance.\"\n2.  **Configuration Option (Checkbox):** Below the header is a configuration line featuring a checkbox labeled \"Enable Customized Need Help Button.\"\n    *   The checkbox is checked (activated), indicated by a blue checkmark.\n    *   A gray question mark icon ($\\text{?}$) follows the text, indicating a tooltip or help documentation is available for this feature.\n3.  **Input Field:** Below the checkbox is a rectangular input text box, currently empty.\n    *   The placeholder text inside the box is: \"Enter a URL or mailto:name@domain\".\n\n**Context:** The interface allows the user to enable a customized help button and configure its destination, which can be either a web address (URL) or an email address using the `mailto:` protocol.",
        "position": 15,
        "context": "rong>, select the check box labeled Enable Customized Need Help Button."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/learner_experience/individual_leaderboard.png",
        "alt": "This image displays a Leaderboard interface, likely associated with a security or phishing awareness program, detailing user rankings based on \"Points.\"\n\n**Structure and UI Elements:**\n\n1.  **Top Ranking Display (Left Column):**\n    *   Three distinct cards highlight the top three users.\n    *   **Rank 1:** Card features a yellow header with a trophy icon (labeled '1'). User: Marsha Mellow (26,414 Points).\n    *   **Rank 2:** Card features a blue header with a medal icon (labeled '2'). User: Sandy Beach (25,260 Points).\n    *   **Rank 3:** Card features an orange header with a medal icon (labeled '3'). User: Patty O'Furniture (24,492 Points).\n\n2.  **Leaderboard List (Right Column):**\n    *   A ranked list displays columns for \"Ranking,\" \"Name,\" and \"Points.\"\n    *   A blue hyperlink, \"Load More,\" is present at the top and bottom of the list section.\n    *   **Self-Identification:** The row for rank 155, Paige Turner (9,610 Points), is highlighted in light purple, indicating the current user. This is confirmed by an orange badge labeled \"You\" adjacent to the point total.\n    *   The list displays rankings sequentially, including tie ranks (e.g., multiple users at rank 155, 9,610 points, and rank 156, 9,608 points).\n\n3.  **Context and Explanatory Text (Bottom Left):**\n    *   **Header:** \"How are points calculated?\"\n    *   **Body Text:** \"Leaderboard points are based on how effectively you use the Phish Alert Button (PAB) during a given timeframe. Points are calculated by the percentage of test emails you have reported. Then, bonus points are awarded for speed. The sooner you report a test email, the more bonus points you earn!\"\n    *   **Call-to-Action:** A white button labeled \"Learn More About Leaderboards.\"",
        "position": 16,
        "context": "point totals may take up to 24 hours to display on the leaderboard."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/leaderboard.png",
        "alt": "This image displays a gamified training leaderboard interface titled **\"KB4-Tutorials Leaderboard.\"**\n\n**Header and Context:**\nThe primary heading is \"KB4-Tutorials Leaderboard.\" A descriptive subtitle instructs the user: \"See how your group ranks below! Improve your group's rank on the leaderboard by completing all of your training assignments.\"\n\n**Top Rank Visualization:**\nThree vertical cards display the top ranks, featuring orange line-art icons and group metrics:\n1.  **IT (2nd Place):** Displays a 2nd place medal icon. A promotional callout box is positioned above this card, stating: \"Congrats! Your group is 2nd.\" The card indicates \"IT\" and \"14% Training Complete.\"\n2.  **HR (1st Place):** Displays a 1st place trophy icon. The card indicates \"HR\" and \"19% Training Complete.\"\n3.  **Admins (3rd Place):** Displays a 3rd place medal icon. The card indicates \"Admins\" and \"13% Training Complete.\"\n\n**Detailed Leaderboard Table:**\nBelow the visualizations, a data table lists the group rankings with three columns: **Rank, Name, and Percentage Complete.** A question mark icon is present next to the \"Percentage Complete\" header, indicating a tool tip or help functionality.\n\nThe table data is as follows:\n| Rank | Name | Percentage Complete |\n| :--- | :--- | :--- |\n| 1 | HR | 19% |\n| 2 | IT | 14% |\n| 3 | Admins | 13% |\n\n**Highlighting and Identification:**\nThe row corresponding to the user's group (Rank 2, IT) is highlighted with a salmon background color. An orange tag labeled **\"Your Group\"** is prominently displayed immediately following the group name \"IT\" to clearly identify the user's rank within the table.",
        "position": 17,
        "context": "aining assignments for each group member by their total number of training assignments."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/badges.png",
        "alt": "This image displays a **Your Achievements** user interface screen, designed to track gamified progress through assignments.\n\n**Header and Context:**\nThe screen title is \"Your Achievements.\" Instructional text confirms the user's current status: \"Good work, Cyber Hero! You've earned 3 badges! Check out your heroic achievements below and find out how you can collect more badges.\"\n\n**UI Layout:**\nThe achievements are presented in a 2x3 grid of white modules. Badges are visually differentiated by state:\n1.  **Earned Badges (Top Row):** Orange line-art icons, positive descriptions, and a specific date earned.\n2.  **Unearned Badges (Bottom Row):** Grey line-art icons, descriptive text explaining the requirement, and the status \"Not earned yet.\"\n\n**Details of Earned Badges (State: Earned 07 January 2019):**\n\n| Position | Title | Icon Description | Requirement/Description Text | Status |\n| :--- | :--- | :--- | :--- | :--- |\n| Top Left | **Pioneer** | Flag with a star | \"Being one of the first to start working on this assignment...\" | Earned 07 January 2019 |\n| Top Center | **Cyber Hero** | Superhero mask/eyeshield | \"completed your first assignment...\" | Earned 07 January 2019 |\n| Top Right | **New Recruit** | Play button inside a circle | \"Reporting for Cyber Hero Duty! Welcome, Hero...\" | Earned 07 January 2019 |\n\n**Details of Unearned Badges (State: Not earned yet):**\n\n| Position | Title | Icon Description | Requirement/Description Text | Status |\n| :--- | :--- | :--- | :--- | :--- |\n| Bottom Left | **Early Bird** | Bird profile | \"work on your cyber skills before the birds start singing.\" | Not earned yet |\n| Bottom Center | **Graduate** | Graduation cap/mortarboard | \"downloading your training completion certificate.\" | Not earned yet |\n| Bottom Right | **Hat Trick** | Three vertical connected steps | \"complete three assignments in any 24 hour period.\" | Not earned yet |",
        "position": 18,
        "context": "iding an incentive for your users to meet specific achievements while taking their training."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/badges_notifications.png",
        "alt": "This image displays a promotional or completion modal dialog within a digital interface, confirming user achievement in a training module.\n\n**UI Elements and Context:**\n\n1.  **Type:** Modal Dialog / Gamification Achievement Pop-up.\n2.  **Visual Header:** Three orange, line-art icons are displayed horizontally, indicating achievements or badges. The icons represent (1) a flag/pennant with a star, (2) an eyemask/superhero mask (with a '+' embellishment), and (3) a video clip/play button icon (with radiating/sparkle lines).\n3.  **Primary Text Heading (Bold):** \"Congratulations!\"\n4.  **Body Text:** \"You've earned 3 badges while completing your training!\"\n5.  **Call to Action (Primary):** A prominent, solid orange rectangular button.\n    *   **Text:** \"Show me my badges\"\n6.  **Call to Action (Secondary/Dismissal):** A text link positioned below the primary button.\n    *   **Text:** \"Later\" (displayed in orange text)\n\n**Function:** The modal informs the user of successful completion of a training activity and offers immediate navigation to view the earned digital badges.",
        "position": 19,
        "context": "> tab to see what badges they’ve received and what badges are still available."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/cyberhero.png",
        "alt": "This image displays the **Notification Templates** section of an administrative web interface, specifically viewing the **System Templates** sub-menu.\n\n**1. Navigation and Context:**\n\n*   **Primary Navigation:** `Campaigns`, **Notification Templates** (active), `Policies`, `Store Purchases`, `My Training`, `Reports`.\n*   **Secondary Navigation:** `My Templates`, `Categories`, **System Templates** (active).\n\n**2. Filtering and Search:**\n\n*   **Left Sidebar (Template Filters):** Lists categories with numerical counts (e.g., `All Templates` [77], `Welcome Notification (User)` [14], `Remind After Enrolled (User)` [8]).\n*   **Search/Action Bar (Top Right):** Contains a search input field pre-filled with the text **\"Cyber Hero\"** (highlighted by an arrow), followed by a **Go** button and an **Import** button.\n*   **Visibility Control:** A link labeled **\"Show hidden items\"** is displayed above the data grid.\n\n**3. Data Grid Structure:**\n\nThe main area is a sortable data grid listing notification templates, with the following column headers:\n\n*   (Selection Checkbox)\n*   **Subject** (Sortable)\n*   **Updated** (Sortable)\n*   **Category** (Sortable)\n*   **Actions**\n\n**4. Data and Search Results:**\n\nThe results reflect a filter for \"Cyber Hero.\" The first listed template row contains:\n\n*   **Subject:** `You've been enrolled in Security Awareness Training (From KnowBe4) (Cyber Hero)` (Blue, linked text, highlighted by an arrow).\n*   **Updated:** `01/14/2019`.\n*   **Category:** `Welcome Notification (User)`.\n*   **Actions:** An Eye icon (View) and an active toggle switch (Enabled).\n\nSubsequent rows also demonstrate context-specific template subjects, such as `Please complete your assigned training (Logo) (From Company Domain) (Cyber Hero)`.",
        "position": 20,
        "context": "g> and searching for Cyber Hero in the training notification search bar."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/adminconsole_mytraining.png",
        "alt": "This image captures an active user profile dropdown menu located in the upper right quadrant of a web application interface.\n\n**Contextual Header Elements:**\nThe menu is anchored to the user's email address, `admin@kb4-demo.com`, and is adjacent to a blue question mark help icon. Partially visible navigation tabs include \"DSTORE\" and \"REPORTS.\"\n\n**Dropdown Menu Structure and Content:**\nThe dropdown list provides user information and functional links:\n\n1.  **User Identity:** `Aaron Anderson` (Bold text) and the associated email `admin@kb4-demo.com`.\n2.  **Account Settings** (accompanied by a Gear icon).\n3.  **My Training** (accompanied by a Graduation Cap icon).\n4.  **Go To PhishER** (accompanied by a Fish icon).\n5.  **Hide Account Mgmt Banner** (accompanied by an Eye/Slash icon).\n6.  **Sign Out** (accompanied by a Log Out/Arrow icon).\n7.  **English (United States)** (accompanied by a Globe icon).\n\n**Instructional Indicator:**\nA large orange arrow is superimposed over the image, pointing specifically to the **My Training** menu item, indicating instructional focus on this element.",
        "position": 21,
        "context": "in the top-right corner of the page and click My Training."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/learner_experience/return_to_console.png",
        "alt": "The image displays a partial view of a top-right navigation bar element, specifically showing a user profile dropdown menu activated under the identifier \"Juniper Berry.\" A language selector (\"English (US)\") is also visible.\n\nThe dropdown menu includes six sequential options, each with an associated icon: Profile, Account Settings, Launch Tour, Return to Console, Go to PhishER, and Sign Out.\n\nAn orange instructional callout box overlays the menu, pointing directly to the \"Return to Console\" option. The callout provides the following instruction: \"Return to your admin console by clicking your name or email address in the top-right, then clicking **Return to Console**.\" The target menu option is bolded within the instruction text.",
        "position": 22,
        "context": "e or email address in the top-right and click Return to Console."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "experience",
        "learner"
      ],
      "image_count": 22
    }
  }
}