{
  "article": {
    "id": 360046848054,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360046848054.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360046848054.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 4,
    "vote_count": 8,
    "section_id": 360011640414,
    "created_at": "2020-04-27T16:24:32Z",
    "updated_at": "2024-10-24T16:10:18Z",
    "name": "PhishER Email Storage and Processing Overview",
    "title": "PhishER Email Storage and Processing Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-09-25T22:02:56Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot",
      "answerbot_phisher"
    ],
    "body": "<p>In this article, you can learn how KnowBe4 safely stores and processes data from emails in your PhishER platform. For more information about KnowBe4's data protection policy, visit our <a href='https://www.knowbe4.com/security' target='_blank' rel='noopener noreferrer'>Security Statement</a> page.</p>\n<h2 id='h_01H9GQBJ4MZQGBVP71R8BVX7NE'>PhishER</h2>\n<p>Your use of PhishER does not allow KnowBe4 to access your emails or inspect your emails for any reason. You're also not required to share reported phishing emails with the KnowBe4 team for threat research or machine learning purposes.</p>\n<p>To use PhishER, copies of your users' reported emails must exist in the PhishER platform. If a user submits a confidential email to your PhishER platform, you can delete the email and all copies of it in your platform. Once you delete the email in your platform, it will be deleted from PhishER entirely.</p>\n<p>If you use our Phish Alert Button (PAB) with your PhishER platform and have enabled the <strong>Send Us a Copy </strong><a href='https://support.knowbe4.com/hc/en-us/articles/208969608#ENABLING'>setting</a>, you can also <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_self'>submit a support ticket</a> to request that we delete the confidential email from our systems. Please include the reporting user’s email address and the subject line of the reported email in your support ticket. For more information about using the PAB with your PhishER platform, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/360024367893' target='_self'>Sharing Reported Phishing Emails with KnowBe4 Using the Phish Alert Button (PAB)</a> article.</p>\n<h2 id='h_01H9GQBJ4MV885A62RBY6EBM7M'>PhishML</h2>\n<p>KnowBe4 will only perform additional processing on emails if you've enabled PhishML in your PhishER settings. For more information about enabling PhishML, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/360043312933' target='_self'>How to Use PhishML</a> article.</p>\n<p>When PhishML is enabled, it takes pieces from emails reported to your PhishER platform. Then, PhishML anonymizes those pieces temporarily and uses the pieces to determine if the email is a threat.</p>\n<p>PhishML does not store any emails, parts of emails, or email metadata.</p>\n<p>You're also not required to enable the <strong>Send Us a Copy </strong><a href='https://support.knowbe4.com/hc/en-us/articles/208969608#ENABLING'>setting</a> in your KSAT account settings. If you enable this setting, PhishML uses information from the reported emails to improve its accuracy.</p>\n<h2 id='h_01H9GQBJ4MT8KCDDV5D15WXZ0H'>PhishRIP</h2>\n<p>If you've enabled PhishRIP, it will operate in your PhishER platform and your Microsoft 365 or Google Workspace environment. PhishRIP requires you to grant specific permissions in your Microsoft 365 or Google Workspace environment to the PhishRIP app. These permissions allow PhishRIP to search, quarantine, and delete emails. KnowBe4 does not require additional email data sharing or data retention permissions to operate PhishRIP.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360046848054-PhishER-Email-Storage-and-Processing-Overview",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "and",
        "overview",
        "phisher",
        "processing",
        "storage"
      ],
      "image_count": 0
    }
  }
}