{
  "id": 360010802673,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360010802673.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360010802673.html",
  "author_id": 383255683393,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 2,
  "vote_sum": 32,
  "vote_count": 44,
  "section_id": 360002819533,
  "created_at": "2018-10-17T21:57:46Z",
  "updated_at": "2025-11-26T20:32:31Z",
  "name": "PhishER Product Manual",
  "title": "PhishER Product Manual",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-11-26T20:32:31Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "phisher",
    "PhishER",
    "phisher product manual",
    "phish er",
    "phishRIP",
    "localized",
    "answerbot",
    "answerbot_phisher"
  ],
  "body": "<p>KnowBe4's <strong>PhishER</strong> is a Security Orchestration, Automation, and Response (SOAR) platform that manages emails that your users report. Using PhishER, your organization can identify potential email threats to strengthen your security measures and defense-in-depth plan.</p>\n<p>PhishER is available as a standalone platform but it works best when combined with the KSAT console. PhishER can also integrate with third-party analysis tools like VirusTotal and Syslog to provide your organization with security scans and evaluations.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>To view a PhishER product demo, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360000937648.html'>KnowBe4 Product Demos</a> article.</div>\n</div>\n<h2 id='iv_01H7JX0632C1Q5MZHSV57X54CC'>PhishER Workflow</h2>\n<p>Below is a diagram of the PhishER workflow. We recommend reviewing this workflow before getting started so you can better understand PhishER.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/QuickstartGuide/PhishER_Process_Expanded.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/QuickstartGuide/PhishER_Process_Expanded.png' alt=' '></a></p>\n<p>For more information about this workflow, see the list below:</p>\n<ol>\n<li>When your users report suspicious emails, the emails are sent to the PhishER <strong>Inbox</strong>.</li>\n<li>Using your customized rules, PhishER analyzes the email components for malicious content or red flags. Then, PhishER assigns tags to emails that meet your rule criteria.</li>\n<li>Tags trigger PhishER to perform your specific actions. Based on your organization's customized rules and actions, PhishER will automatically disposition each email. Dispositioning helps you prioritize reported emails and respond quickly to real phishing attacks.</li>\n<li>If you have enabled the PhishER Blocklist, you can use information about malicious or spam emails to block similar emails from reaching your users' inboxes. If you have a PhishER Plus subscription and have enabled the Global Blocklist, you can use crowd-sourced information to block similar emails.</li>\n<li>If you have enabled PhishRIP, you can remove similar malicious or spam emails that have reached your users' inboxes already. If you have a PhishER Plus subscription and have enabled Global PhishRIP, you can use crowd-sourced information to remove similar emails.</li>\n<li>If you have enabled PhishFlip, you can reuse reported emails to create KSAT phishing templates and campaigns. PhishFlip removes malicious elements from the reported emails before sending phishing tests to your users.</li>\n</ol>\n<h2 id='iv_01H7JX0632T8RVP55CXTR7F4HN'>Prerequisites</h2>\n<p>When using PhishER and KSAT together, you will need to purchase the same number of seats for both products. If you purchase additional seats for either product during your subscription term, you will need to purchase seats for the other products as well.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Additional minimum subscription purchasing requirements may apply.</div>\n</div>\n<p>All PhishER customers will need to have an email forwarding system so that all users' reported emails can be forwarded to your PhishER <strong>Inbox</strong> for analysis. We recommend that you install the Phish Alert Button (PAB) for your organization, but you also have the option to allow your users to manually forward emails to a reporting email address. For more information about these methods, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/208969608.html'>Phish Alert Button (PAB) Product Manual</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</p>\n<h2 id='iv_01H7JX0632ZN5X29DZX4S6G9PK'>Creating Your Account</h2>\n<p>First, you'll need to create a PhishER account.</p>\n<p>To create your account, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 account.</li>\n<li>Click your name at the top-right corner of the page. From the drop-down menu that opens, select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Integrations</strong> &gt; <strong>PhishER</strong>.</li>\n<li>Click the <strong>Create PhishER Account</strong> button.</li>\n</ol>\n<h2 id='iv_01H7JX0632JF5GFMXYXRBCN5R9'>Accessing PhishER</h2>\n<p>Once you've created a PhishER account for your organization and PhishER is <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014171474.html'>enabled in your account</a>, the <strong>Go to PhishER</strong> button will display on your KnowBe4 <strong>Account Settings</strong> page. Selecting this button will take you directly to your PhishER console. Or, you can access your PhishER console by navigating to the corresponding URL for your KnowBe4 instance. For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/gotoButton01.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/gotoButton01.png' alt=' '></a></p>\n<ul>\n<li>\n<strong>United States</strong>: https://phisher.knowbe4.com</li>\n<li>\n<strong>Canada</strong>: https://ca.phisher.knowbe4.com</li>\n<li>\n<strong>European Union</strong>: https://eu.phisher.knowbe4.com</li>\n<li>\n<strong>Germany</strong>: https://de.phisher.knowbe4.com</li>\n<li>\n<strong>United Kingdom</strong>: https://uk.phisher.knowbe4.com</li>\n</ul>\n<p>You can also access PhishER from the navigation menu in the top-left corner of your KSAT or KnowBe4 Security Center (KSC) console. See the sections below for more information.</p>\n<p>A GIF showing how to navigate from KSAT to PhishER is displayed below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/NavigationMenuPhishER_KSAT.gif'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/NavigationMenuPhishER_KSAT.gif' alt=' '> </a></p>\n<p>A GIF showing how to navigate from KnowBe4 Security Center (KSC) to PhishER is displayed below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/NavigationMenuPhishER_KSC.gif'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/NavigationMenuPhishER_KSC.gif' alt=' '> </a></p>\n<h2 id='iv_01H7JX0632E2PSY3GH3Y49S9EP'>Setting Reporting Email Addresses</h2>\n<p>You will need to set up at least one <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/16567660822163.html'>reporting email address</a> to forward emails to your <strong>Inbox</strong>. If your organization uses the PAB, you'll need to set up a reporting email address for each PAB instance.</p>\n<p>To set reporting email addresses, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 account.</li>\n<li>Click your name at the top-right corner of the page. From the drop-down menu that opens, select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Integrations</strong> &gt; <strong>Phish Alert</strong> and open the settings for a PAB instance.</li>\n<li>In the <strong>Send Non-Simulated Phishing Emails to</strong> field, enter your reporting email addresses. For more information about this field, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/208969608.html'>Enable and Configure PAB</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/208969608.html'>Phish Alert Button (PAB) Product Manual</a>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/forwardPAB.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/forwardPAB.png' alt=' '></a></p>\n</li>\n<li>Click the <strong>Save Phish Alert Settings </strong>button.</li>\n<li>At the bottom of the page, click the <strong>Save Changes </strong>button.</li>\n</ol>\n<h2 id='iv_01H7JX06324522PN7XKH9JEXFW'>Dashboard</h2>\n<p>When you open your PhishER platform, the <strong>Dashboard</strong> page will display. On this page, you can view a quick overview of your PhishER platform. For more information about this page, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/dashboardScreen.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/dashboardScreen.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Search</strong>: You can use this search bar to filter your dashboard using Lucene queries. The dashboard will display an overview of information about all the messages that match the criteria.</li>\n<li>\n<strong>Edit Dashboard Layout</strong>: You can click this icon to add and remove widgets from your dashboard. You can drag, drop, and resize each widget to create a custom layout. When you click this icon, the <strong>Reset Dashboard Layout</strong> and <strong>Add Widget </strong>buttons will display.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/DashboardWidget.gif'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/DashboardWidget.gif' alt=' ' width='387' height='399'></a></p>\n</li>\n<li>\n<strong>Last 30 days</strong>: By default, the dashboard displays data and activity over the last 30 days. However, you can adjust the dashboard view to display a different date range by clicking the <strong>Last 30 days </strong>button. If you click this button, the date range pop-up window will open.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/customDateRange.gif'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/customDateRange.gif' alt=' ' width='431' height='215'></a></p>\n</li>\n<li>\n<strong>Reported Messages</strong>: This section displays the number of reported messages that have been forwarded to your PhishER <strong>Inbox</strong>.</li>\n<li>\n<strong>Automatically Resolved</strong>: This section displays the number of messages that were dispositioned based on your enabled rules and actions.</li>\n<li>\n<strong>Manually Resolved</strong>: This section displays the number of messages that were dispositioned without your active rules and actions.</li>\n<li>\n<strong>Unresolved</strong>: This section displays the number of messages that have not been dispositioned.</li>\n<li>\n<strong>Received Messages</strong>: This bar graph displays the number of reported messages forwarded to your PhishER <strong>Inbox</strong>. The data shows the number of messages reported each day or hour.</li>\n<li>\n<strong>Messages Summary</strong>: This pie chart shows a comparison of messages in the <strong>Automatically Resolved</strong>, <strong>Manually Resolved</strong>, and <strong>Pending Review</strong> statuses.</li>\n<li>\n<strong>Reported Messages by Category</strong>: This line chart shows how messages have been dispositioned. Messages can be dispositioned as <strong>Clean</strong>, <strong>Spam</strong>, or <strong>Threat</strong>. Each message is dispositioned as <strong>Unknown</strong> by default until PhishER or an admin dispositions it into one of the other categories.</li>\n<li>\n<strong>Categories</strong>: This pie chart shows a comparison of messages that are being dispositioned.</li>\n<li>\n<strong>Reported Messages by Priority</strong>: This line chart displays the priority of the reported messages. A message can be assigned one of the following priorities: <strong>Unknown</strong>, <strong>Low</strong>, <strong>Medium</strong>, <strong>High</strong>, or <strong>Critical</strong>. The data shows the number of messages reported each day or hour for each priority type.</li>\n<li>\n<strong>Priorities</strong>: This pie chart shows a comparison of how messages are prioritized.</li>\n</ol>\n<h2 id='iv_01H7JX0632YGCW8GPNB82H2JCY'>Rooms</h2>\n<p>The <strong>Rooms</strong> tab contains multiple filtered views of the messages in your PhishER <strong>Inbox</strong>. Each filtered view will be based on your saved queries and system-generated filters. You can view a filtered <strong>Inbox</strong>, <strong>Dashboard</strong>, and <strong>Report</strong> when clicking on the icons next to each system-generated filter.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/roomsPhishER.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/roomsPhishER.png' alt=' '></a></p>\n<p>If you click on a specific group of messages in a room, you will be taken to a filtered view of your <strong>Inbox</strong> that displays all the messages from the group. A group of messages is created in a room if a minimum of two messages meets the room criteria.</p>\n<p>For more information about rooms, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013805414.html'>How to Create and Manage PhishER Rooms</a> article.</p>\n<h2 id='iv_01H7JX06324QQEP4M52H0FP8AF'>Inbox</h2>\n<p>You can view all of your users' reported messages from the <strong>Inbox</strong> tab. These messages include all of the emails that your users have reported by using the PAB or manually forwarding emails to a reporting email address. From this tab, you can filter through messages and save customized filter settings as a room. You can also perform actions and change the dispositioning of messages.</p>\n<p>Using third-party analysis tools, PhishER organizes messages into different components, including the message's raw data, headers, attachments, and body. When you click an individual message, the <strong>Message Details</strong> page displays detailed information about the message, such as its components. From this page, you can also perform actions on the message and use a <strong>Discussion</strong> feature to communicate with your admins about the message.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Inbox.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Inbox.png' alt=' '></a></p>\n<p>For more information about the <strong>Inbox</strong>, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/13169303385619.html'>How to Use Your PhishER Inbox</a> article.</p>\n<h2 id='iv_01H7JX063357S51XS75K4T4T9F'>Rules</h2>\n<p>You can view all of your PhishER rules from the <strong>Rules</strong> tab. A rule is a logical expression used to disposition emails forwarded to the PhishER <strong>Inbox</strong>. To disposition emails, all rules must follow <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013116053.html'>YARA rule logic</a>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Rules.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Rules.png' alt=' '></a></p>\n<p>Based on the rule, a tag will be added to the emails as they are forwarded to the PhishER <strong>Inbox</strong>. The <strong>Rules</strong> tab includes the <strong>Rules List</strong> page, which has the following subtabs:</p>\n<ul>\n<li>\n<strong>Custom Rules</strong>: This subtab lists the rules your organization creates from scratch using the PhishER rule editor.</li>\n<li>\n<strong>System Rules</strong>: This subtab lists the default set of rules provided by KnowBe4.</li>\n<li>\n<strong>Global Variables</strong>: This subtab lists the global variables your organization creates for custom rules. If you use multiple rules with the same strings, you can use global variables to update all of these rules at once.</li>\n</ul>\n<p>For more information about rules, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013025854.html'>How to Create and Manage PhishER Rules</a> article.</p>\n<h2 id='iv_01H7JX0633A2JVCGYQGBEGV1MT'>Actions</h2>\n<p>You can view all of your PhishER actions from the <strong>Actions</strong> tab. When a message is assigned a tag, the tag will indicate how the message should be processed in PhishER. Then, the action will start the steps in that process. For example, you can create an action to assign a category of <strong>Spam</strong> to all matching messages. The <strong>Actions</strong> tab includes the <strong>Actions List</strong> page, where you can create and manage all the actions in your PhishER platform.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/ActionsList.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/ActionsList.png' alt=' '></a></p>\n<p>For more information about actions, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/13195730767635.html'>How to Create and Manage PhishER Actions</a> article.</p>\n<h2 id='iv_01H7JX06335YQGQSVHSKEQNKNM'>Reports</h2>\n<p>You can view all of your PhishER reports from the <strong>Reports</strong> tab. Each subtab displays a report with the most common information found in your users' reported emails. By default, each report displays data and activity from the last 30 days, but you can adjust this date range by clicking the <strong>Last 30 Days</strong> button in the top-right corner of the page.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports.png' alt=' '></a></p>\n<p>The <strong>Reports</strong> tab includes the following subtabs:</p>\n<ul>\n<li>\n<strong>Attachments</strong>: This subtab displays the most common attachment types in users' reported emails.</li>\n<li>\n<strong>Reporters</strong>: This subtab displays the most common users who report emails.</li>\n<li>\n<strong>Senders</strong>: This subtab displays the most common sender domains associated with users' reported emails.</li>\n<li>\n<strong>Domains and URLs</strong>: This subtab displays the most common domains and URLs in users' reported emails.</li>\n<li>\n<strong>Tags</strong>: This subtab displays the most common tags applied to users' reported emails.</li>\n</ul>\n<p>For more information about reports, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/13195275591955.html'>How to Use PhishER Reports</a> article.</p>\n<h2 id='iv_01H7JX06331BTM57EQB3JVPN9E'>Blocklist</h2>\n<p>The PhishER Blocklist feature helps your Microsoft 365 mail server prevent malicious or spam emails from reaching your users’ inboxes. You can view all of your blocklist entries from the <strong>Blocklist</strong> tab's <strong>Your Syncing Entries</strong> subtab. When you review users' reported emails, you can update your blocklist to send information about threats or spam to your mail server.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Blocklist/BlocklistTab.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Blocklist/BlocklistTab.png' alt=' '></a></p>\n<p>For more information about blocklists, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/12913849104147.html'>How to Use the PhishER Blocklist</a> article.</p>\n<h2 id='iv_01H7JX0633VF56097S8PP8G82F'>PhishRIP</h2>\n<p>PhishRIP is a PhishER email quarantine feature that allows your organization to search for users' reported emails across all of the inboxes connected to your Microsoft 365 or Google Workspace instance. You can view all of your PhishRIP search results, or queries, from the <strong>PhishRIP</strong> tab. Using PhishRIP, you can prevent active phishing attacks by removing potential email threats from your users' inboxes.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/PhishRIPqueries.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/PhishRIPqueries.png' alt=' '></a></p>\n<p>When you select an individual message in your <strong>Inbox </strong>and click the <strong>Run</strong> drop-down menu, you can trigger actions that will run on the messages that are found by PhishRIP queries.</p>\n<p>For more information about PhishRIP, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360045742834.html'>How to Use PhishRIP</a> article.</p>\n<h2 id='iv_01H7JX0633WBW4BHGM5DG5A1H8'>PhishFlip</h2>\n<p>PhishFlip is a PhishER feature that allows your organization to reuse users' reported emails in phishing campaigns in your KSAT console. PhishFlip will remove all of the malicious elements from the reported emails so that they are safe to send to your users as phishing templates.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>To access the PhishFlip feature, you must have <strong>Full</strong> PhishRIP security role access enabled in your PhishER platform.</div>\n</div>\n<p>Once PhishFlip is enabled on your PhishER platform, you can create KSAT phishing templates from users' reported emails. Then, you can use the phishing templates to create phishing campaigns in your KSAT console. You can also create automatic PhishFlip campaigns containing specific reported emails from your PhishER platform.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/PhishFlip/phishflip_method1.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/PhishFlip/phishflip_method1.png' alt=' '></a></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/PhishFlip/phishflip_campaign_actions.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/PhishFlip/phishflip_campaign_actions.png' alt=' ' width='383' height='364'></a></p>\n<p>For more information about PhishFlip, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500005846941.html'>How to Use PhishFlip</a> article.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360010802673-PhishER-Product-Manual",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/QuickstartGuide/PhishER_Process_Expanded.png",
      "alt": "This technical diagram illustrates a six-step workflow for automated email threat analysis and remediation, likely pertaining to a PhishER security product. The steps are vertically organized, with three mandatory phases followed by three optional advanced features.\n\n**Structural Overview:**\nThe diagram uses numbered headings (1-6) on the left margin, outlining the primary process categories: REPORT, IDENTIFY, DISPOSITION, BLOCKLIST (OPTIONAL), PHISHRIP (OPTIONAL), and PHISHFLIP (OPTIONAL). The process flow is represented horizontally using sequential boxes (Steps 1 & 2) or single actions (Step 3). Steps 4, 5, and 6 use parallel dashed boxes to differentiate between local and global threat intelligence actions.\n\n**Step-by-Step Flow:**\n\n1.  **REPORT:** A three-part sequence beginning with the icon of an envelope with an 'X': \"User receives an email\" → \"User reports the email\" (Fishing hook icon) → \"PhishER inbox receives the email\" (Fish with 'ER' icon).\n2.  **IDENTIFY:** A two-part sequence: \"Rules are run against the email\" (Clipboard icon) → \"A tag is assigned to the email\" (Tag icon).\n3.  **DISPOSITION:** A single action: \"Custom actions are run for the email\" (Gears icon).\n4.  **BLOCKLIST (OPTIONAL):** Parallel actions:\n    *   (Local) \"Blocklist blocks emails with similar red flags\" (No entry sign icon).\n    *   (Global, labeled PhishER Plus) \"Global Blocklist uses KnowBe4's crowd-sourced email threats to block similar emails\" (Globe/Document icon).\n5.  **PHISHRIP (OPTIONAL):** Parallel actions for automated removal:\n    *   (Local) \"PhishRIP removes similar emails from users' inboxes\" (Fish skeleton icon).\n    *   (Global, labeled PhishER Plus) \"Global PhishRIP uses crowd-sourced email threats to remove similar emails from users' inboxes\" (Globe/Fish skeleton icon).\n6.  **PHISHFLIP (OPTIONAL):** A single action: \"PhishFlip turns emails into KMSAT phishing templates and campaigns\" (Swirling fish/Yin-Yang style icon).\n\nThe diagram concludes visually with an orange fishing hook icon extending downward from the main workflow line.",
      "position": 1,
      "context": "getting started so you can better understand PhishER."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/gotoButton01.png",
      "alt": "The image displays a two-part user interface element providing access to a system named PhishER.\n\n1.  **Primary UI Element (Button):** A rectangular button with rounded corners and a solid green background is positioned at the top. The button is labeled in white text: **\"Go to PhishER\"**.\n\n2.  **Supporting Text/Instructions:** Below the button, explanatory text is provided in two lines of standard black font.\n    *   **Content:** The text begins with \"Note: Clicking Go to PhishER will open the PhishER interface in a new tab. Alternatively, you can go to **https://phisher.knowbe4.com** directly.\"\n    *   **Hyperlink:** The URL `https://phisher.knowbe4.com` is explicitly formatted as a hyperlink (displayed in blue text) indicating a direct navigation option.",
      "position": 2,
      "context": "For more information, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/NavigationMenuPhishER_KSAT.gif",
      "alt": "This technical description details a screenshot of the knowbe4 platform's user interface, specifically the main Dashboard view.\n\n**Header and Navigation Bar:**\nThe top navigation bar displays the **knowbe4** logo. The primary navigation links include: **DASHBOARD** (highlighted in blue as the currently active section), **PHISHING** (with a dropdown chevron), **TRAINING**, **USERS**, and **ASA** (partially visible).\n\n**Page Context:**\nThe main content area is titled **Dashboard** (large, bold font).\n\n**Primary Widget: Organization's Risk Score**\nA large panel is titled **Organization's Risk Score**. Inside this panel, a light blue notification banner is present, containing the call-to-action text:\n> \"Opt-in to migrate to Risk Score v2 across the console, including the main dashboard, all re[...]\" (text is truncated).\n\n**Secondary Element: Risk Score History**\nA subsection or chart area within the widget is titled **Risk Score History**. The description below the title reads:\n> \"Displays the Organization's combined Risk Sc[...]\" (text is truncated).\n\nA partial view of a graph is visible, showing Y-axis numerical labels **100** and **75**. A cursor icon (pointer hand) is visible above the main content panel.",
      "position": 3,
      "context": "te from KSAT to PhishER is displayed below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishER/GettingStarted/ProductManual/NavigationMenuPhishER_KSC.gif",
      "alt": "This image captures a partial view of a dark-mode web interface for the **KnowBe4 Security Center**.\n\n**Header and Context:**\nThe upper left displays the stylized \"knowbe4\" logo adjacent to a 9-dot application switcher icon. The contextual header identifies the current view: \"Egress Software Technologies\" followed by the page title: \"KnowBe4 Security Center - Home.\"\n\n**Navigation Pane (Vertical Sidebar):**\nA persistent vertical navigation pane occupies the left side. The currently active page, **Home**, is highlighted with an underline and a house icon. Below this are five expandable top-level modules, each featuring a chevron dropdown icon:\n1. Human Risk Management\n2. Defend\n3. Prevent\n4. Protect\n5. Settings\nA static link labeled **Help** (with a question mark icon) is positioned at the base of the menu.\n\n**Main Content and Alerts:**\nThe main content area features a large, bold heading: **Human Risk Management**. A descriptive subtitle is partially visible beneath it: \"Identify and manage human risk acros[s...].\"\nIn the top right corner, a small, dark turquoise system alert box is visible, containing a diamond/exclamation icon and partially visible text indicating a status message, likely related to an **Update**.",
      "position": 4,
      "context": "Center (KSC) to PhishER is displayed below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/forwardPAB.png",
      "alt": "This image displays a User Interface (UI) panel for configuring PAB (Phish Alert Button) settings within a security platform.\n\n**Overall Context:**\nThe configuration panel is titled “Your PAB Settings.”\n\n**Configuration Fields:**\n\n*   **Setting Name:** An input field pre-filled with the value \"Your PAB.\"\n*   **Icon:** A section allowing icon selection, featuring a \"Browse...\" button and displaying a default line-art icon of an envelope (email) overlaid with an orange fishing hook, symbolizing phishing. A contextual help icon (?) is adjacent to the \"Icon\" label.\n*   **License Key:** An input field containing an obfuscated string value.\n*   **Validation Option:** A checkbox labeled \"Limit CRID Validation,\" accompanied by a contextual help icon (?).\n\n**Non-Simulated Email Configuration (Highlighted Section):**\nThe primary section, visually distinguished by an orange border, manages the reporting of non-simulated phishing emails:\n\n*   **Label:** \"Send Non-Simulated Emails to:\"\n*   **Action Button:** A blue button labeled \"Add PhishER Address\" is provided for adding recipients.\n*   **Input Field:** A large, empty text input area is available for recipient email addresses.\n*   **Instruction:** Below the input, the guideline \"Separate multiple email addresses with a comma\" is displayed.\n*   **Reporting Checkbox:** A final checkbox option, \"Send Us a Copy,\" is available, also featuring a contextual help icon (?).",
      "position": 5,
      "context": "n-us/articles/208969608.html'>Phish Alert Button (PAB) Product Manual."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/dashboardScreen.png",
      "alt": "This image displays a system **Dashboard** focused on message reporting and resolution statistics.\n\n**Header/Navigation:**\n*   **Title:** \"Dashboard\"\n*   **Search Bar:** Contains placeholder \"Search...\" and a magnifying glass icon for submission.\n*   **User/Profile Icon (a):** A circular orange icon labeled 'a'.\n*   **Utility Icons (b):** Three circular icons (two orange, one white grid) labeled 'b'.\n*   **Date Filter (c):** A button labeled \"Last 30 Days\" with a calendar icon, labeled 'c'.\n\n**Summary Metrics (Top Row):** Four distinct white cards displaying key performance indicators (KPIs):\n*   **Reported Messages (d):** Total 2,112 (black text).\n*   **Automatically Resolved (e):** Total 1,303 (green text).\n*   **Manually Resolved (f):** Total 762 (blue text).\n*   **Unresolved (g):** Total 47 (gray text).\n\n**Detailed Analytics Panels (Grids):**\n\n**Column 1 (Time Series Data):**\n*   **Received Messages (h):** A bar chart showing daily message volume over approximately four weeks (Dec 24 - Jan 18), with Y-axis ranging 0-100.\n*   **Reported Messages by Category (j):** A multi-line chart tracking four categories (Unknown, Clean, Spam, Threat) over time. The 'Spam' category (blue line) dominates the display, ranging mostly between 75 and 85 messages per day.\n*   **Reported Messages by Priority (l):** A multi-line chart tracking five priority levels (Unknown, Low, Medium, High, Critical) over time, with Y-axis ranging 0-80. The 'Unknown' and 'Low' priorities show the highest daily counts.\n\n**Column 2 (Compositional Data):**\n*   **Messages Summary (i):** A donut chart illustrating resolution methods:\n    *   Automatically (Green, largest segment)\n    *   Manually (Light Blue)\n    *   Unresolved (Gray, smallest segment)\n*   **Categories (k):** A donut chart showing the overall distribution of message categories:\n    *   Unknown, Clean, Spam (Purple, largest segment), Threat (Red).\n*   **Priorities (m):** A donut chart showing the overall distribution of message priorities:\n    *   Unknown, Low, Medium, High, Critical (Red, smallest segment).",
      "position": 6,
      "context": "e information about this page, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/DashboardWidget.gif",
      "alt": "This image displays the main **Dashboard** view of a security platform, characterized by a clean, white grid layout and a dark vertical navigation bar.\n\n**Header and Controls:**\nThe top header bar features the application logo and the title \"Dashboard.\" A search input field is present, along with three key action buttons on the right: \"Reset Dashboard Layout\" (orange), \"Add Widget\" (orange), and a control labeled \"Last 30 Days\" (date range selector).\n\n**Vertical Navigation Bar (Sidebar):**\nThe dark gray/blue sidebar contains core navigation links. **Dashboard** is currently highlighted. Other links include: Rooms, Inbox, Rules, Actions, Reports, and PhishRIP. Settings (gear icon) and User profile icons are located at the bottom of the sidebar.\n\n**Dashboard Widgets (Metrics and Data):**\nThe dashboard is composed of configurable widgets, most of which currently display zero data:\n\n1.  **Top Metrics (Summary Cards):** Three summary cards display key resolution statuses, all showing a value of **0**:\n    *   AUTOMATICALLY RESOLVED (Green text)\n    *   MANUALLY RESOLVED\n    *   UNRESOLVED\n\n2.  **Left Column (Graph Widgets):** Three line graph widgets display message volume over time (Dec 25 to Jan 22). The data lines are flat at zero across all three panels:\n    *   Received Messages\n    *   Reported Messages by Category\n    *   Reported Messages by Priority\n\n3.  **Right Column (Legend/Summary Widgets):** Three legend widgets define the color-coding and classification system used across the platform:\n    *   Messages Summary (Legend for Automated, Manually Resolved, Unresolved).\n    *   Categories (Legend listing Unknown, Clean, Spam, Threat).\n    *   Priorities (Legend listing Unknown, Low, Medium, High, Critical).\n\nAll graph and summary widgets include a small context menu icon in the top-right corner.\n\n**Footer:**\nThe bottom of the interface contains the copyright notice: \"© 2021 KnowBe4, Inc. All Rights Reserved.\"",
      "position": 7,
      "context": "Layout and Add Widget buttons will display."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/customDateRange.gif",
      "alt": "This image depicts a Date Range Selector component used within a user interface (UI) to filter data by time period.\n\n**Layout and Structure:**\nThe interface is structured into two main vertical panes: a left panel for preset time ranges and a right panel displaying a dual-month calendar view.\n\n**Left Panel (Time Presets):**\nThis navigation column lists five filtering options:\n1. **LAST 24 HOURS** (Currently highlighted with an orange background and text, indicating selection or hover state. A hand cursor overlays this option.)\n2. **LAST 7 DAYS**\n3. **LAST 30 DAYS**\n4. **LAST 90 DAYS**\n5. **CUSTOM** (Accompanied by a calendar icon.)\n\nAt the base of the left panel is a prominent, orange primary action button labeled **Apply**.\n\n**Right Panel (Calendar View):**\nThis section displays two consecutive calendars: **April 2019** (left) and **May 2019** (right).\n*   Navigation is provided via a left chevron (`<`) for previous months and a right chevron (`>`) for subsequent months.\n*   The date **29** in May 2019 is highlighted with an orange circular outline, signifying an active date selection point.\n\n**Bottom Controls:**\nThe footer of the component contains control actions:\n*   A text link labeled **Clear** (for resetting the selection).\n*   A date input field displaying placeholder text formatted as a date range: **m/d/yy - m/d/yy**.",
      "position": 8,
      "context": "If you click this button, the date range pop-up window will open."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/roomsPhishER.png",
      "alt": "This image displays the **Saved Queries** view within the **Rooms** module of a security intelligence application dashboard.\n\n**UI Structure and Navigation:**\n\n1.  **Top Navigation Bar:** Contains the current page title, **Saved Queries**, a global search input labeled **Search...**, and a **Refresh** button (with a corresponding icon).\n2.  **Left Sidebar Navigation:** The primary navigation panel features major modules. The **Rooms** module is currently selected and highlighted.\n3.  **Secondary Navigation (Rooms Menu):** A nested list beneath the main module defines the context:\n    *   **USER GENERATED** header.\n    *   The active page link, **Saved Queries**, is highlighted in dark blue.\n    *   **SYSTEM GENERATED** header.\n    *   Sub-links include **Subject Lines**, **Sender Address**, **Attachment Names**, and **URL Domains**.\n\n**Main Content Area (Query Metrics):**\n\nThe main content area presents five visible query results organized into white metric cards. Each card displays the query title, the corresponding count (large numerical metric), and a set of four standardized action icons separated by a vertical orange divider.\n\n**Query Card Data:**\n\n| Query Title | Count | Action Icons |\n| :--- | :--- | :--- |\n| **PhishRIPSourceM...** | **488** | Archive, Options (Ellipsis), Analytics (Chart), Share (User) |\n| **Phish ML** | **83** | Archive, Options (Ellipsis), Analytics (Chart), Share (User) |\n| **Fritz Reported** | **134** | Archive, Options (Ellipsis), Analytics (Chart), Share (User) |\n| **CEO Fraud** | **9** | Archive, Options (Ellipsis), Analytics (Chart), Share (User) |\n| **Has Attachments** | **511** | Archive, Options (Ellipsis), Analytics (Chart), Share (User) |",
      "position": 9,
      "context": "ng> when clicking on the icons next to each system-generated filter."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Inbox.png",
      "alt": "This document describes the user interface (UI) for the \"Inbox\" data management view, focusing on its navigational elements, filtering widgets, and data presentation grid.\n\n**1. Application Context and Global Controls**\n\n*   **View Title:** The main content area is titled \"**Inbox**.\"\n*   **Navigation:** A vertical dark-themed navigation bar (navbar) is present on the left. The Inbox icon (envelope graphic) is highlighted, indicating the current active view.\n*   **Global Actions (Top Right):** Two functional buttons are available:\n    *   **Download CSV:** Exports the current dataset (orange outline, download icon).\n    *   **Refresh:** Updates the data grid (orange outline, refresh icon).\n\n**2. Query and Filtering Controls**\n\nThe upper portion of the content area contains search and filtering widgets:\n\n*   **Search Bar:** A prominent text input box labeled \"**Search...**\" for keyword lookups.\n*   **Query Action:** An orange button labeled \"**Save query as room**\" is positioned next to the search bar.\n*   **Filter Widgets:** Categorized button chips allow selection of specific data subsets:\n    *   **Filter by Category:** Includes categories defined by color: **Unknown** (Grey), **Threat** (Red), **Clean** (Green), **Spam** (Purple).\n    *   **Filter by Status:** Includes status options: **Received**, **In Review**, **Resolved**.\n    *   **Filter by Priority:** A dedicated widget containing multiple chevron and question mark icons used for setting or filtering based on priority level.\n*   **Configuration:** A gear (settings) icon is provided for view configuration adjustments.\n\n**3. Data Grid Presentation**\n\nThe main area is a list view or data grid displaying 200 records out of a total of 2966 (**1-200 of 2966**).\n\n*   **Select/Action Column:** Each row begins with an unchecked checkbox for bulk actions.\n*   **Column Headers:** The grid uses the following sortable column headers. The **From** column is currently active for sorting (indicated by an underline and a down arrow icon for descending order).\n    1.  **Category**\n    2.  **From**\n    3.  **From (Email)**\n    4.  **Subject**\n    5.  **Reported At**\n*   **Data Rows:**\n    *   **Category Tag:** All visible sample entries use a grey tag labeled \"**Unknown**.\"\n    *   **Content Examples:** Entries display sources such as \"Zoom,\" \"Youtube,\" and \"Yahoo News,\" along with corresponding email addresses, subject lines (e.g., \"Your meeting attendees are waiting!\"), and precise reporting timestamps.\n    *   **Attachment Indicator:** Row 2 shows a small paperclip icon next to the \"Reported At\" timestamp, indicating an attachment associated with that item.",
      "position": 10,
      "context": "cussion feature to communicate with your admins about the message."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Rules.png",
      "alt": "This image displays the administrative interface for managing rules within a system, titled **\"Rules List.\"**\n\n**1. Application Header and Global Actions:**\n*   The primary page title is \"Rules List.\"\n*   Two action buttons are located in the top-right corner: a solid orange button labeled **\"Apply Changes\"** and a secondary button labeled **\"New Rule.\"**\n\n**2. Sidebar Navigation:**\n*   A dark navy vertical sidebar is visible on the left.\n*   The currently active navigation state is indicated by a highlighted icon representing the \"Rules List\" section (a ruler/measurement icon).\n\n**3. Filtering and Tab Navigation:**\n*   A search bar is positioned at the top of the rules panel, displaying placeholder text **\"Search...\"**\n*   A dropdown button labeled **\"Filter By Status\"** is available for list refinement.\n*   The content is divided into three tabs: **\"Custom Rules\"** (currently active/selected), **\"System Rules,\"** and **\"Global Variables.\"**\n\n**4. Rules Data Grid:**\nThe main area is a table listing custom rules with the following columns: **Name, Description, Rule Target, Status, Updated At, Matched Count, Tags, and Actions.**\n\n| Name | Description | Rule Target | Status | Updated At | Matched Count | Tags | Actions |\n| :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- |\n| Custom Test | Looking for Testtagg | Raw | Disabled (Gray) | Nov 16, 2022, 10:13 AM | 80 | TESTTAG, GRAM | Delete Icon |\n| Find \"Test\" | looking for \"test\" | Raw | Enabled (Green) | Nov 16, 2022, 2:44 PM | 2403 | NEWP | Delete Icon |\n| Custom NAPL | looking for \"NAPL\"! | Body | Enabled (Green) | Jan 10, 2023, 10:41 AM | 10 | NAPL | Delete Icon (Highlighted) |\n| PERautotag1 | Test to verify Action 7, 8, 10, 11, 13, 14 | Raw | Disabled (Gray) | May 12, 2021, 4:50 PM | 8 | BLERGG | Delete Icon |\n\n*   The **Status** column utilizes a toggle switch UI element, indicating whether the rule is currently active or disabled.\n*   The **Tags** column displays applied metadata labels (e.g., TESTTAG, NEWP, NAPL).\n*   The **Actions** column universally contains a trash can icon for deleting the rule.",
      "position": 11,
      "context": "r/api/v2/help_center/en-us/articles/360013116053.html'>YARA rule logic."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/ActionsList.png",
      "alt": "This image depicts the \"Actions List\" configuration page within a web application interface, dedicated to managing prioritized security or workflow rules.\n\n**Interface Elements:**\n\n*   **Navigation:** A dark vertical sidebar indicates the current view is focused on an item symbolized by horizontal double arrows (representing actions or workflow).\n*   **Header:** The page title is \"Actions List.\"\n*   **Action Buttons (Top Right):** Two call-to-action buttons are present: a solid orange button labeled **\"Save Action Order\"** and an outlined button labeled **\"New Action.\"**\n*   **Instruction Banner:** A light blue notification banner informs the user: **\"Actions are performed in order. Drag each action to its appropriate order.\"** This confirms the sequential execution of the rules listed below.\n\n**Data Table Structure:**\n\nThe primary content is a sortable list displayed in a table format with seven columns:\n\n1.  **Drag Handle:** A three-line \"hamburger\" icon indicating the row can be dragged for reordering.\n2.  **Name:** The descriptive title of the action.\n3.  **Description:** A brief summary of the action's function.\n4.  **Status:** The current operational state, indicated by colored pill labels.\n5.  **Last Updated At:** Timestamp of the last modification.\n6.  **Trigger Tags:** Keyword labels associated with the action trigger.\n7.  **Actions:** Management icons (currently only a trash can icon for deletion is visible).\n\n**Listed Actions (Top Four Rows):**\n\n| Name | Status | Trigger Tags | Last Updated At |\n| :--- | :--- | :--- | :--- |\n| **File Attachment Spam** | **Active** (Green) | SPAM | Dec 15, 2022 at 3:14 PM |\n| **PML:SPAM (Low Priority Messages)** | **Inactive** (Red/Pink) | PML:SPAM | Sep 30, 2022 at 4:56 PM |\n| **PML:CLEAN (Medium Priority Messages)** | **Inactive** (Red/Pink) | PML:CLEAN | Sep 30, 2022 at 4:58 PM |\n| **PML:THREAT (High Priority Messages)** | **Inactive** (Red/Pink) | PML:THREAT | Sep 30, 2022 at 4:59 PM |\n\nThe first action, \"File Attachment Spam,\" is the only action currently marked as **Active**, while the three \"PML\" actions are **Inactive**.",
      "position": 12,
      "context": "e you can create and manage all the actions in your PhishER platform."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports.png",
      "alt": "This image displays the \"Reports\" section of a security platform interface, specifically detailing attachment statistics.\n\n**1. Global Navigation and Header:**\nThe main header displays the title \"Reports.\" A search bar is located on the right, and three actionable buttons define the data view: \"Download CSV,\" a dropdown menu set to \"Top 10,\" and a date range selector set to \"Last 30 Days.\"\n\n**2. Sidebar Navigation:**\nThe vertical sidebar shows primary navigation links. The \"Reports\" link is currently active (highlighted dark blue). Within the \"Reports\" context menu, under the heading \"MOST COMMON,\" the \"Attachments\" subsection is selected. Other available reports include Reporters, Senders, Domains and URLs, and Tags.\n\n**3. Data Visualization Panel (Chart):**\nThe primary content area features a panel titled \"Most Common Attachment Types,\" displaying a horizontal bar chart.\n*   The Y-axis lists file extensions: `.eml`, `.jpeg`, `.pdf`, `.html`, `.png`, and `.vcf`.\n*   The X-axis represents the message count, scaled from 0 to 10.\n*   The chart indicates that `.eml` and `.jpeg` are the most common (count 10), followed by `.pdf` (count 4), `.html` and `.png` (count 3), and `.vcf` (count 1).\n\n**4. Data Table Panel:**\nBelow the chart, a detailed data table provides the metrics for the displayed file extensions. A configuration gear icon is present in the top right corner of this panel.\n\nThe table columns are:\n1.  **File Extension** (Rows prefixed by active checkboxes)\n2.  **Message Count**\n3.  **Unknown**\n4.  **Clean**\n5.  **Spam**\n6.  **Threat**\n\n**Key Data Points from the Table:**\n| File Extension | Message Count | Unknown | Clean | Spam | Threat |\n| :------------- | :------------ | :------ | :---- | :--- | :----- |\n| .eml           | 10            | 0       | 10    | 0    | 0      |\n| .jpeg          | 10            | 0       | 10    | 0    | 0      |\n| .pdf           | 4             | 0       | 4     | 0    | 0      |\n| .html          | 3             | 0       | 3     | 0    | 0      |\n| .png           | 3             | 1       | 1     | 1    | 0      |\n| .vcf           | 1             | 0       | 1     | 0    | 0      |",
      "position": 13,
      "context": "Last 30 Days button in the top-right corner of the page."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/Blocklist/BlocklistTab.png",
      "alt": "This image displays the \"Blocklist: Your Syncing Entries\" user interface within a cybersecurity or email management platform.\n\n**UI Layout and Navigation:**\n\n*   **Header:** The main title is \"Blocklist\" with a subtitle \"Your Syncing Entries.\"\n*   **Top Right Actions:** Two button controls are present: \"Create Blocklist Entry\" (primary action, orange text on white) and \"Refresh\" (secondary action with a circular arrow icon).\n*   **Left Navigation Pane:** A vertical menu shows three options:\n    *   **Your Syncing Entries** (Currently selected, dark blue background).\n    *   Your Ignored Entries.\n    *   Audit Log.\n*   **Main Content Area Description:** A introductory text states: \"This page shows a list of all entries that are syncing to your Microsoft 365 mail server, including the entries that the Threat Research Lab team adds to the Global Blocklist.\"\n\n**Data Filtering Controls:**\n\nThree sets of filter tabs are displayed above the main data table:\n\n1.  **Filter by Attribute:**\n    *   **Sender** (Currently selected/highlighted in orange).\n    *   URL.\n    *   File Hash.\n2.  **Filter by Status:**\n    *   Pending.\n    *   Active.\n    *   Incomplete.\n    *   Failed.\n3.  **Filter by Entry Type:**\n    *   Global Entries.\n    *   Custom Entries.\n\n**Data Table Structure (Blocklist Entries):**\n\nThe table presents the blocklist entries with the following six columns:\n\n1.  **Value:** Contains the blocked entity (e.g., email address, partially visible: `keithTestSender84@test.com`).\n2.  **Status:** Indicates the synchronization state (e.g., \"Pending,\" \"Active\").\n3.  **Created By:** Shows the user or system that initiated the entry (e.g., \"Admin\").\n4.  **Created On** (Sorted column, indicated by the up arrow icon): Timestamp of creation (e.g., \"May 31, 2023 at 9:38 AM\").\n5.  **Expires On:** Date and time the blocklist entry is set to expire (e.g., \"Jul 31, 2023 at 12:59 AM\").\n6.  **Actions:** Contains controls for entry manipulation (represented by a trash can icon for deletion).\n\n**Table Data Sample:**\n\nThe top three visible rows show entries with statuses \"Pending,\" \"Active,\" and \"Active,\" all created by \"Admin\" on May 31, 2023, and set to expire on July 31, 2023.",
      "position": 14,
      "context": "an update your blocklist to send information about threats or spam to your mail server."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/PhishRIPqueries.png",
      "alt": "This image displays the **PhishRIP Queries** management interface, structured as a two-column application view.\n\n**Context and Navigation:**\n*   The header identifies the current view as \"PhishRIP Queries.\"\n*   A dark-themed left sidebar provides navigation via vertical icons (including a highlighted fish skeleton icon indicating the active 'Queries' section).\n\n**Query Management Interface:**\nThe main content area is a data grid for reviewing historical queries.\n\n*   **Search and Pagination:** A horizontal search bar labeled \"Search...\" is present, along with a pagination summary indicating \"1-25 of 10000\" records are displayed.\n*   **Filtering Controls:** Two primary filter groups are available above the table:\n    *   **Filter by Status:** Includes tab selections for \"Processing,\" \"Completed,\" and \"Failed.\"\n    *   **Filter by Resolution:** Includes tab selections for \"Resolved\" and \"Unresolved.\"\n    *   A gear icon is present next to the resolution filters, indicating view configuration options.\n\n**Data Grid Structure:**\nThe query results are presented in a sortable table format with the following header columns:\n\n| Column Header | Description/Data Type |\n| :--- | :--- |\n| Checkbox | Batch selection control. |\n| ID | UUID identifying the query instance. |\n| Started | Timestamp (Date and Time). |\n| Completed | Timestamp (Date and Time). |\n| SourceID | UUID referencing the source system. |\n| AttackID | UUID or hash identifying the attack instance. |\n| Found | Integer count of findings (Currently sorted descending). |\n| Opened | Integer count of opened items. |\n| Originator | User or system responsible for the query (Column empty in visible data). |\n| Status | Text field (e.g., \"Completed\"). |\n| Resolution | Text field (e.g., \"Unresolved\"). |\n\n**Sample Data:**\nThe visible rows show consistent data across the first three entries, indicating:\n*   Queries completed on May 20, 2020.\n*   All visible queries possess a **Status** of \"Completed\" and a **Resolution** of \"Unresolved.\"\n*   The metrics **Found** (12) and **Opened** (2) are identical for the displayed records.",
      "position": 15,
      "context": "cks by removing potential email threats from your users' inboxes."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/PhishFlip/phishflip_method1.png",
      "alt": "This image displays a segment of a web application interface, likely a message or security incident queue management system, focused on available actions and filtering controls.\n\n**I. Action and Tagging Bar:**\nThe top left features an active, orange **\"Run\"** button with a downward chevron, indicating an open dropdown menu. Adjacent to this is a text field labeled **\"+ Add new tag.\"**\n\n**II. Action Dropdown Menu (Under \"Run\"):**\nThe open menu offers execution actions categorized into two sections:\n1.  **Replay:**\n    *   All Rules\n    *   All Rules and All Actions\n2.  **PhishRIP:**\n    *   Find Similar Messages\n    *   **Create KMSAT Template** (This item is highlighted by an overlayed orange directional arrow.)\n\n**III. Filtering and Quick Actions:**\nFiltering controls are presented horizontally:\n*   **Set Category:** Buttons include \"Unknown,\" \"Clean,\" \"Spam,\" and \"Threat.\"\n*   **Set Status:** Buttons include \"Received,\" \"In Review,\" and \"Resolved.\"\n*   **Set Priority:** Contains five buttons for priority adjustment, ranging from \"?\" to a double up arrow.\n*   **QuickActions:** A list of dedicated action buttons including \"Themeli's Test...\", \"Josh's PhishRI...\", \"Return to Defa...\", \"Send to OG R...\", \"Next Message,\" and \"test quick.\"\n\n**IV. Data Grid (Table View):**\nThe lower portion shows the header row and the beginning of a data entry:\n*   **Headers:** Subject, Reported At (with active sort/filter arrow), Reported By, Status, and Tags.\n*   **Row Entry:**\n    *   **Subject:** FaxNotification Delivery from 9099203720 (truncated)\n    *   **Reported At:** Jul 9, 2019, 12:42 PM (accompanied by a paperclip icon).\n    *   **Reported By:** Becky Enriquez\n    *   **Status:** In Review",
      "position": 16,
      "context": "hishFlip campaigns containing specific reported emails from your PhishER platform."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishER/PhishFlip/phishflip_campaign_actions.png",
      "alt": "This image details Step 7 of a configuration process, titled \"Find Similar Messages,\" within a security management application.\n\n**Context and UI Elements:**\n\n1.  **Section Header:** The step is designated by an orange circled number **(7)** and the title **Find Similar Messages**.\n2.  **Match Criteria:** A list under the heading **Match Criteria:** provides five unchecked standard checkboxes used to filter message similarity: **Subject**, **Sender**, **Recipients**, **Attachments**, and **Body**.\n3.  **Timeframe Selector:** The search period is controlled by a dropdown menu following the text \"Find messages received in the,\" which is currently set to **Last 24 Hours** (displayed in an orange-bordered field).\n4.  **Automatic Actions:** Two required or default actions are pre-selected via checked orange checkboxes:\n    *   **Automatically quarantine all found messages**\n    *   **Automatically PhishFlip all found messages** (An orange directional arrow explicitly highlights this option.)\n5.  **Template Creation Option:** The final configuration option is an unchecked checkbox labeled **Create a KMSAT Phishing Template**, followed by a circular information icon (**i**). The text for this option appears slightly grayed out.",
      "position": 17,
      "context": "mg.s3.amazonaws.com/PhishER/PhishFlip/phishflip_method1.png' alt=' '>"
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "manual",
      "phisher",
      "product"
    ],
    "image_count": 17
  }
}