{
  "article": {
    "id": 360042770574,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360042770574.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360042770574.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 7,
    "vote_count": 7,
    "section_id": 360000156868,
    "created_at": "2020-02-11T18:33:18Z",
    "updated_at": "2024-04-18T22:23:00Z",
    "name": "FAQ: Weak Password Test",
    "title": "FAQ: Weak Password Test",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-04-18T22:23:00Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "Lead Generator",
      "answerbot"
    ],
    "body": "<p>Below are some commonly-asked questions about KnowBe4's Weak Password Test. If you don't see the answer you need, <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener noreferrer'>submit a ticket to our support team</a>.</p>\n\n<h2 id='h_01HVRTDC5K2T154WH11QK2N2P8'>1. Can I see what my user used for their password?</h2>\n<p>No. The passwords are hashed and cannot be displayed.</p>\n\n<h2 id='h_01HVRTDFHRXHVAH91RR1R44QZ0'>2. Are any log files generated during the test?</h2>\n<p>No logs are created during this test. However, you can save your results by exporting them to an Excel or PDF file.</p>\n<h2 id='h_01HVRTDJGBKVR8ZPR1XKN2D5YN'>\n3. I received an error message and my test did not run. What do I do?</h2>\n<p>If you received an error and could not complete the test, use the chart below to understand what the issue might be.</p>\n<table>\n<tbody>\n<tr>\n<td class=''><strong>Error Message</strong></td>\n<td class=''><strong>Issue</strong></td>\n</tr>\n<tr>\n<td>The Active Directory account you are attempting to run the test with does not have Replicating Directory Changes Permissions. Please view the required Prerequisites in our manual, linked below.</td>\n<td>The account you are using for the test does not have the proper permissions. Make sure you've created an account with Replicating Directory Changes AND Replicating Directory Changes - All Permissions. See the prerequisites listed in the <a href='https://support.knowbe4.com/hc/en-us/articles/115006118227' target='_self'>Weak Password Test Product Manual</a>.</td>\n</tr>\n<tr>\n<td>Test was unable to run due to invalid user name and/or password. Please check your credentials and try the test again.</td>\n<td>We were unable to connect to your Active Directory using the credentials you provided. Make sure your user name and password are correct and try to run the test again.</td>\n</tr>\n<tr>\n<td>Server is unavailable. Please check your Domain DNS Name and try the test again.</td>\n<td>This means your Domain DNS name is incorrect, or incorrectly formatted. Make sure you use the format of domain.com or domain.local and attempt to run the test again.</td>\n</tr>\n<tr>\n<td>Server is unavailable. Please check your Domain Controller and try the test again.</td>\n<td>This means your Domain Controller IP is incorrect, or incorrectly formatted. Double check the IP and attempt to run the test again.</td>\n</tr>\n<tr>\n<td>The license validation failed.</td>\n<td>This is likely to mean one of two things: a) either the license key you are using is invalid, or b) you are attempting to validate the license key through a proxy and it is failing as a result of that. If the error is due to a proxy, allow connections to the domain found below in your proxy settings to allow the validation of your license key to occur: https://api.wpt.knowbe4.com/v1/licenses</td>\n</tr>\n</tbody>\n</table>\n\n<h2 id='h_01HVRTDPG5GECXPKG1VWRY4A56'>4. What is the Weak Passwords dictionary and where can I find it?</h2>\n<p>The Weak Passwords dictionary contains over 11 million weak and compromised passwords from past data breaches. Hackers use similar dictionaries to attempt to crack your organization's passwords.To find the Weak Passwords dictionary, navigate to the Weak Password Test installation folder by following this path: “C:\\ProgramFiles (x86)\\KnowBe4\\Weak Password Test”. Then, open the <strong>data.bin</strong> file to view the Weak Passwords dictionary.</p>\n\n<h2 id='h_01HVRTDVGY6J8J5CTA38VJ7WKM'>5. Can I run this test multiple times?</h2>\n<p>Absolutely. If you want to run the test again, click the <strong>Rerun Test</strong> button. Make sure to download an Excel or PDF file of your current results before running a new test.</p>\n\n<h2 id='h_01HVRTE0RAD4C67Y26302H0X9V'>6. Can I run this test if I'm using Azure?</h2>\n<p>Unfortunately, this test is not compatible with Azure at this time.</p>\n\n<h2 id='h_01HVRTE5QAVBF13PCJS379HZGT'>7. My anti-virus flagged the Weak Password Test as dangerous. Is it?</h2>\n<p>No, the Weak Password Test is not dangerous. The Weak Password Test’s behavior mimics that of a password-cracking tool used by hackers, which is why your antivirus may have flagged it as potentially dangerous.</p>\n\n<h2 id='h_01HVRTEF2MADQKBA24RX6X9A4K'>8. I had several users fail the test. What do I do now?</h2>\n<p>We recommend that you train your users on proper password practices with security awareness training. While we cannot advise you on the specifics of how to remedy all of the password vulnerabilities in your organization, KnowBe4 offers training modules about password security that you can assign to your users. These modules include <strong>Creating Strong Passwords- Security Awareness Training</strong>, <strong>How to Create Strong Passwords with Quiz</strong>, <strong>Password Security</strong>, and more. For more information about ModStore training content, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115001221467' target='_self'>ModStore and Library Guide</a> article.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360042770574-FAQ-Weak-Password-Test",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "faq",
        "password",
        "test",
        "weak"
      ],
      "image_count": 0
    }
  }
}