{
  "id": 360001532207,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360001532207.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360001532207.html",
  "author_id": 21027160967,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 18,
  "vote_sum": 0,
  "vote_count": 0,
  "section_id": 4406704411027,
  "created_at": "2018-06-14T22:08:07Z",
  "updated_at": "2024-09-24T12:27:35Z",
  "name": "KCM GRC Executive Reporting Guide",
  "title": "KCM GRC Executive Reporting Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2024-09-24T12:27:35Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "KCM",
    "Scope",
    "Executive Report",
    "KCM Executive Reporting",
    "KCM Executive Report",
    "Scopes",
    "Scope Report",
    "kcm grc",
    "KCM GRC",
    "GRC",
    "grc",
    "KCM General",
    "answerbot_kcmgrc"
  ],
  "body": "<p>Our Executive Reporting feature is a great way to keep your executives, or senior management group, up-to-date on the status of your compliance efforts. </p>\n<p>By using KCM GRC's Executive Reporting, you as the KCM GRC Account Administrator can easily and automatically relay the status of one or more Scopes to your management team in an illustrative report. This feature prevents you from having to create additional user accounts simply for your executive team to view the progress of your Scopes.</p>\n<p><a name='IncludedInReport'></a>You will be able to automate an email containing a report in PDF format, for one or more individuals at a frequency that you choose–either daily, weekly, monthly, quarterly, or annually.</p>\n<h2 id='h_01J8J00FNK1WK176DNS4XM6HGK'>What Is Included in the Executive Report?</h2>\n<p>Below you'll find screenshots of the PDF report that will be automatically sent to your executive team, or anyone you'd like, in your organization. This illustrative report contains ample details for the Scopes of your choice. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_01.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_01.png' alt=' '></a></p>\n<p><strong>1)</strong> <strong>Logo:</strong> The header of the report will include your organization's logo if you've added a URL to the <strong>Logo URL</strong> field found under your Account Settings. </p>\n<p><strong>2)</strong> <strong>Report Name:</strong> The <strong>Name</strong> you've assigned to this Executive Report will show here. You specify the report's name within the console, <a href='#SetUpReport'>when creating the report</a>.  </p>\n<p><strong>3)</strong> <strong>Scope(s) for this Report:</strong> The Scope(s) you've chosen to include in the report will be listed here. </p>\n<p><strong>4) GAP Coverage:</strong> The percentage of Requirements that have Controls associated with, or mapped to them, vs. the number of Requirements that are not mapped to Controls. This applies to Requirements that are included in the Scope(s) you've selected for this report.</p>\n<p><strong>5) Requirements Coverage Breakdown:</strong> This is an overview of the status of the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115016129608.html' target='_blank' rel='noopener'>Scope Requirements Self-Assessment</a> that you may have completed for the Scope(s) you've included in the Executive Report. If you've selected the <strong>N/A</strong> option for any of the Requirements in your Scope, that percentage will be represented here, in blue. For more information on the Scope Self-Assessment, see our KCM GRC: Glossary of Terms, <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115016129608.html' target='_blank' rel='noopener'>here</a>. </p>\n<p>The <strong>Gap Coverage</strong> and <strong>Requirements Coverage Breakdown</strong> covered in this PDF report are supplemental data that you cannot see in the console for a singular Scope. Currently, these two percentages are only available for Administrators to view within the console–under Global Dashboard–as an account-wide percentage. </p>\n<p><strong>6) Covered Requirements: </strong>This is a further breakdown of your <strong>Gap Coverage </strong>for the Scope(s) included in your report. It defines the number of Requirements that do or do not have Controls. </p>\n<p>Ideally, you'll have all of your Requirements mapped to Controls, in order to accomplish your compliance (or general) objectives.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_02.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_02.png' alt=' '></a></p>\n<p><strong>7) Task Completion Percentage:</strong> This represents the number of Tasks that have or have not been satisfied as part of the Scope(s) you've selected for the report. If a Task has not been satisfied it will fall within the <strong>Unmet</strong> percentage of the pie chart. <strong>Unmet</strong> Tasks consist of any that are in <strong>Active</strong> (open) or <strong>Failed</strong> status; as well as Tasks that are awaiting approval.</p>\n<p><strong>8) Number of Past Due Tasks:</strong> This is a count of the Tasks that are within a 1-7 day window past the due date. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_03.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_03.png' alt=' '></a></p>\n<p><strong>9) Task Completion Progress:</strong> <a name='ReportFrequencyDetails'></a> This line graph represents the progress of the Task completions since the last time the Executive Report was generated.However, the very first Executive Report for each different <em>report frequency</em> option will include more data in the line graph–compared to the subsequent reports. See below for details.</p>\n<table>\n<tbody>\n<tr>\n<td class='' colspan='4'><span class='wysiwyg-font-size-large'><strong>Report Frequency Details</strong></span></td>\n</tr>\n<tr>\n<td class=''><strong>Report Frequency</strong></td>\n<td class=''><strong>When Initial Report Sends</strong></td>\n<td class=''><strong>Initial Progress Chart Data</strong></td>\n<td class=''>\n<strong><strong>Subsequent </strong></strong><strong>Progress Chart Data</strong>\n</td>\n</tr>\n<tr>\n<td>Daily</td>\n<td>As soon as possible (by 12:00 am UTC) </td>\n<td>Prior 15 days from when the report was created</td>\n<td>Prior day</td>\n</tr>\n<tr>\n<td>Weekly</td>\n<td>The following Sunday</td>\n<td>Prior 5 weeks from when the report was created</td>\n<td>Prior week</td>\n</tr>\n<tr>\n<td>Monthly</td>\n<td>The 1st of the following month </td>\n<td>Prior 5 months from when the report was created</td>\n<td>Prior month</td>\n</tr>\n<tr>\n<td>Quarterly</td>\n<td>The first day of the following quarter (Jan.1, April 1, July 1, or Oct. 1) </td>\n<td>Prior 2 quarters from when the report was created</td>\n<td>Prior quarter</td>\n</tr>\n<tr>\n<td>Annually</td>\n<td>January 1st of the following year </td>\n<td>Prior 5 years from when the report was created</td>\n<td>Prior year</td>\n</tr>\n</tbody>\n</table>\n<p><a name='SetUpReport'></a></p>\n<h2 id='h_01J8J00FNKKB91DX8Q24DQQM4Y'>How Do I Set up an Executive Report? </h2>\n<p>If you're an admin in your KCM GRC account, you can set up an Executive Report by clicking <strong>Metrics </strong>on the left-hand side navigation panel. Then click <strong>Executive Report </strong>under the Additional Reports section at the bottom of the Metrics page.Click the <strong>Create Executive Report</strong> button at the top-right of the Executive Reports overview page, as shown below.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_04.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_04.png' alt=' '></a><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_05.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_05.png' alt=' '></a></p>\n<p><strong>1) Name: </strong>Title for the report you're creating. This name will display in the PDF report you're sending to your executive or management team.</p>\n<p><strong>2) Select Existing KCM GRC User Email Addresses:</strong> This drop-down menu will include all users who have KCM GRC accounts. </p>\n<p><strong>3) Enter Non-KCM GRC User Email Addresses:</strong> Here you can input any email addresses you'd like, in order to send these reports to your management or executive team members, board members, and so on. To add multiple recipients to the report, use the <strong>+ Add Email Field</strong> button to add additional input fields.</p>\n<p><strong>4) Frequency of the Report:</strong> The option you select here will determine both the frequency in which the report is sent, as well as how much data is included in the report. See the <a href='#ReportFrequencyDetails'>Report Frequency Details</a> table above, for more information on report frequencies. </p>\n<p><strong>5) Start Date:</strong> This is the date you want the report to begin generating <em>on or after–</em>dependent on the report frequency, see the <a href='#ReportFrequencyDetails'>Report Frequency Details</a> table for more information.</p>\n<p><strong>6) End Report Options:</strong> You can choose an end date to cease any generations of further reports. If you choose <strong>No End Date</strong> the reports will continue to generate indefinitely, unless you update the report and add an end date. </p>\n<p><strong>7) Scopes to Include in Report:</strong> This drop-down menu will include all of the Scopes you've created in your account. You can select one or more Scopes to include in your Executive Report. <a name='FAQ'></a></p>\n<h2 id='h_01J8J00FNKA45B8Y698FH9YXGC'>Frequently Asked Questions</h2>\n<p><strong>1) Can I edit or update my Executive Report Settings?</strong></p>\n<p>Yes. You can edit any existing Executive Report by clicking <strong>Metrics </strong>on the left-hand side navigation panel. From the Metrics page, click <strong>Executive Report</strong>, under the Additional Reports section.Once you've arrived at the Executive Reports overview screen, click on the <strong>pencil</strong> icon to the right of the report you'd like to update.</p>\n<p><strong>2) What if a KCM GRC user that I've disabled is an Executive Report recipient? </strong></p>\n<p>If you archive a KCM GRC user this <strong>does not</strong> remove them from the Executive Reports recipient list. Instead, the email address of the user will be transferred to the <strong>Non-KCM GRC User Email Addresses</strong> recipient list. In order to remove this user from the report recipients, you'll have to <em>update</em> (see <a href='#FAQ'>FAQ #1</a>) or <em>view</em> the campaign and delete the user from the report.You can <em>view</em> the campaign by clicking on the <strong>eye</strong> icon to the right of the report you'd like to update; then click the <strong>trash can</strong> icon next to the disabled user's email address, as shown below.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_06.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_06.png' alt=' '></a></p>\n<p><strong>3) I set up my Executive Report, why haven't the recipients received it? </strong></p>\n<p>Any report that you've set up for a <em>Daily</em> frequency will be generated at 12:00 am UTC. All other report frequency options are generated on the next applicable calendar-based interval. See the <a href='#ReportFrequencyDetails'>Report Frequency Details</a> table above for more information.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360001532207-KCM-GRC-Executive-Reporting-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_01.png",
      "alt": "This document is an \"Executive Report\" titled \"Audit Remediation Report,\" branded with the KCM logo. It provides a technical summary of compliance coverage and control status.\n\n**Key UI Elements and Data Fields:**\n\n1.  **Header:** Displays the report title \"Executive Report\" and subtitle \"Audit Remediation Report.\"\n2.  **Scope:** Defines the context as \"Audit Remediation Tracking.\"\n3.  **Gap Coverage:** Reports the high-level metric: **55.56% of Requirements with Controls.** This is visualized with a horizontal bar chart split into a green segment (covered) and a red segment (gap).\n4.  **Requirements Coverage Breakdown:** Presents granular percentages, visualized via a multi-segment horizontal stacked bar chart:\n    *   41.67% No Answer\n    *   6.25% Not Met\n    *   6.25% Not Applicable\n    *   45.83% Met\n5.  **Covered Requirements (Raw Counts):** Lists the total number of requirements based on control mapping status, identified by corresponding color indicators (Green/Red):\n    *   25 Have Controls Mapped (Green indicator)\n    *   20 Do Not Have Controls Mapped (Red indicator)",
      "position": 1,
      "context": "This illustrative report contains ample details for the Scopes of your choice."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_02.png",
      "alt": "This image is a technical document fragment titled **\"Executive Report: Audit Remediation Report.\"**\n\n**Header and Branding:**\nThe header features the stylized **KCM** logo in black, followed by a large orange checkmark or swoosh. A horizontal rule separates the header from the content.\n\n**Content Section 1: Task Completion Percentage**\nThis section is identified by the indicator **(7) Task Completion Percentage** (bolded text with an orange circled number 7).\nIt displays a large 2D pie chart illustrating task completion status:\n*   **Met Status:** Represented by the large green segment, labeled **\"Met: 88.0%\"**.\n*   **Unmet Status:** Represented by the smaller red segment, labeled **\"Unmet: 12.0%\"**.\n\n**Content Section 2: Past Due Tasks**\nThis section is identified by the indicator **(8) Number of Past Due Tasks:** (bolded text with an orange circled number 8).\nThe quantitative result is explicitly stated as **0**.",
      "position": 2,
      "context": "apped to Controls, in order to accomplish your compliance (or general) objectives."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_03.png",
      "alt": "This image displays a data visualization component titled **\"Task Completion Progress\"**.\n\n**Context and UI Elements:**\n\n*   A UI marker, consisting of an orange circular icon containing the number **9**, is positioned below the main title.\n*   The primary visualization is titled **\"Progress Chart.\"**\n\n**Chart Structure and Data:**\n\n*   **Type:** Area line chart (tracking two data series).\n*   **Y-Axis:** Labeled **\"Number of Tasks,\"** scaled from 0 to 300 in increments of 50.\n*   **X-Axis:** Labeled **\"Timeline,\"** displaying dates from **01/01/2018** to **06/18/2018** at approximately bi-weekly intervals.\n\n**Legend and Data Series:**\n\nThe chart tracks two key metrics identified in the legend on the right:\n\n1.  **Total Tasks (Orange):** Represented by an orange line and the upper shaded area. The count increases gradually from approximately 200 in January 2018 to approximately 255 by June 2018, showing a significant upward jump around June 4th.\n2.  **Complete Tasks (Cyan):** Represented by a cyan line and the constant bottom shaded area. This count remains static throughout the timeline at approximately 70 tasks.",
      "position": 3,
      "context": "This is a count of the Tasks that are within a 1-7 day window past the due date."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_04.png",
      "alt": "The image displays a segment of a web application interface, specifically the \"Executive Reports\" view, indicated by the breadcrumb navigation: **My Dashboard > Reporting and Statistics > Executive Reports**.\n\n**Key UI Elements and Text:**\n\n1.  **Primary Action Button:** The main element is a blue button labeled **Create Executive Report**, emphasized by a thick orange outline and an instructional orange arrow pointing towards it.\n2.  **Secondary Action Button:** A **Back** button is positioned adjacent to the primary action button.\n3.  **Data Control:** A control element allows the user to specify the number of visible records: **Show [Dropdown: 100] Rows**.\n4.  **Data Table Structure:** The top row of a data grid displays column headers, including sort controls: **Start Date**, **End Date**, and **Frequency**.\n5.  **Data Row Example:** A sample record is partially visible, showing values: **06/14/2018 12:00 AM** (Start Date), **No End Date** (End Date), and **Daily** (Frequency).\n6.  **Row Action Icons:** The far right of the data row includes standard action icons: View (eye icon), Edit (pencil icon), and Delete (trash can icon).",
      "position": 4,
      "context": "g> button at the top-right of the Executive Reports overview page, as shown below."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_05.png",
      "alt": "The image displays a configuration form titled \"Create Executive Report,\" intended for scheduling a recurring report. A blue banner states: \"Fields with * are required.\"\n\nThe form elements are sequenced as follows:\n\n1.  **Name \\***: A text input field with the placeholder text \"Name of the report.\" An information icon (i) is present next to the field.\n2.  **Select Existing KCM User Email Addresses**: A selectable input field (likely a multi-select or dropdown) with the placeholder \"Click to Select...\"\n3.  **Enter Non-KCM User Email Addresses**: A section for adding external email addresses. It currently displays one numbered input field (\"1. Enter Email Address\") with an accompanying trash can icon for deletion. A primary button labeled \"+ Add Email Field\" allows for adding more inputs.\n4.  **Frequency of the Report \\***: A radio button group offering five options: Daily, Weekly, Monthly, Quarterly, and Annually. None appear definitively selected. An information icon (i) is present next to the label.\n5.  **Start Date \\***: A date input field pre-filled with the value \"06/21/2018.\"\n6.  **End Report Options \\***: A radio button selection group with two choices: \"Specify Date\" (currently selected) and \"No End Date.\" Since \"Specify Date\" is active, a subsequent date input field labeled **End Date** is displayed, pre-filled with the value \"07/21/2018.\"\n7.  **Scopes to Include in Report \\***: A selectable input field with the placeholder \"Click to Select...\"\n\nThe form concludes with a blue primary action button labeled **Create Report**.",
      "position": 5,
      "context": "img.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_04.png' alt=' '>"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM%20Executive%20Reports/KCMExecRep_06.png",
      "alt": "This image displays a User Interface (UI) page titled **\"Viewing Executive Report Settings For: Audit Remediation Report,\"** designed for managing report subscription details and metadata.\n\n**Header and Actions:**\nThe header row contains two blue action buttons on the right: **\"Update Executive Report\"** and **\"Back.\"**\n\n**Recipient Management Data Grid (Left Panel):**\n1.  **Search and Display Controls:** A search input field labeled \"Search Recipients...\" is present. Above the data table, a control allows the user to set the display size: \"Show **100** Rows.\"\n2.  **Table Structure:** The primary column header is **\"Email Address\"** (currently sorted ascending).\n3.  **Data:** The grid lists three entries, masked partially for privacy, sharing the domain \"@knowbe4.com.\"\n4.  **Row Actions:** Each recipient row includes a trashcan icon, indicating the function to remove the email address as a recipient. An orange directional arrow highlights the trashcan icon in the third row.\n5.  **Footer:** The grid footer displays **\"Showing 1 to 3 of 3 entries\"** and pagination controls (**Previous, 1, Next**).\n\n**Report Details Panel (Right Panel):**\nA separate panel with a blue header labeled **\"Report Details\"** displays fixed report metadata:\n*   **Scopes:** Audit Remediation Tracking (displayed in a black pill/tag format).\n*   **Start Date:** 06/14/2018 12:00 AM.\n*   **End Date:** No End Date.\n*   **Frequency of Report:** Daily.",
      "position": 6,
      "context": "trash can icon next to the disabled user's email address, as shown below."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "executive",
      "grc",
      "kcm",
      "reporting"
    ],
    "image_count": 6
  }
}