{
  "article": {
    "id": 360021083194,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360021083194.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360021083194.html",
    "author_id": 21027160967,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 2,
    "vote_count": 2,
    "section_id": 8746158474899,
    "created_at": "2019-04-05T20:13:38Z",
    "updated_at": "2025-03-11T17:19:54Z",
    "name": "Vendor Risk Management Module Guide",
    "title": "Vendor Risk Management Module Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:19:54Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "vendor module",
      "Vendor Risk Management",
      "KCM Vendor",
      "Vendor Management",
      "answerbot_kcmgrc"
    ],
    "body": "<p>The Vendor Risk Management module of your KCM GRC platform lets you centralize your third-party risk management processes. You can prequalify risk, assess your vendors, and conduct remediation efforts all in one platform. The Vendor Risk Management module is available to KCM GRC's Platinum subscriptions.</p>\n<p>This article provides an overview of the workflows and areas that you can use in the Vendor Risk Management module. See the sections below to learn how to create questionnaires, create vendor profiles, send questionnaires, and work with issues.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip: </strong>As a best practice for working in the Vendor Risk Management module, we recommend that you follow the sections in the order that they are listed in this article.</div>\n</div>\n<h2 id='h_01HVPP9PP71RVST6TPGX903PE4'>Before You Begin</h2>\n<p>Before you begin using your Vendor Risk Management module, below are a few things you might consider to better implement this platform into your third-party risk management program.</p>\n<ol role='list'>\n<li>\n<strong>What types of KCM GRC user roles will I create for users working in the Vendor Risk Management module?</strong>\n<ul role='list'>\n<li>Account Administrators can assign the Vendor Administrator user role to users so they can work in all areas of the Vendor Risk Management module. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148' target='_self'>User Role Guide</a>.</li>\n<li>Vendor Administrators and Account Administrators can create user accounts for the individuals completing questionnaires on behalf of the vendor or third-party organization. You will need to assign the Vendor User user role to these user accounts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148' target='_self'>User Role Guide</a>.</li>\n</ul>\n</li>\n<li>\n<strong>What kinds of questionnaires will I need for the different types of third-party affiliates working with my organization? </strong>\n<ul role='list'>\n<li>KCM GRC offers industry-standard templates to build questionnaires. You can also create custom questions for your vendor assessments. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021582594' target='_blank' rel='noopener'>How to Create and Configure Questionnaires</a> article. \n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong> In addition to using our questionnaire templates, you should check your organization's requirements and any frameworks that your organization must follow to determine what types of questions you need to ask your vendors.</div>\n</div>\n</li>\n</ul>\n</li>\n<li>\n<strong>What is the best workflow, or order of tasks for onboarding with my Vendor Risk Management module?</strong>\n<ul role='list'>\n<li>The jump links at the top of this article are listed in the order of the best practice workflow we recommend that you use to implement the Vendor Risk Management module into your risk management program.</li>\n</ul>\n</li>\n</ol>\n<h2 id='h_01HVPP9PP7PBB6SEV1D86ZM2W9'>Creating Questionnaires</h2>\n<p>Based on your organization's requirements and required frameworks, you can create your vendor questionnaires from the <strong>Questionnaires</strong> section of your console. You can use the questionnaire builder to create fully-custom questionnaires, add questions from the industry-standard templates provided, or create questionnaires with custom questions and questions from the templates.</p>\n<p>For details, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021582594' target='_blank' rel='noopener'>How to Create and Configure Questionnaires</a> article.</p>\n<h3 id='h_01HVPP9PP7CFY17EVX3Z8JPY1S'>Configuring and Finalizing Questionnaires</h3>\n<p>Once you've added questions to your questionnaire, you will configure points for each answer in order to \"score\" your vendor on their assessment responses. After you assign points to each question, you will mark the questionnaire as \"configured\", then it must be reviewed once more before it can be sent.</p>\n<p>For details, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021582594' target='_blank' rel='noopener'>How to Create and Configure Questionnaires</a> article.</p>\n<h2 id='h_01HVPP9PP7AZ8BNMQ9KWRGAZGM'>Adding Vendor Profiles to your Account</h2>\n<p>Before you begin sending questionnaires to your vendors, you will need to create vendor profiles under the <strong>Vendors</strong> area of the Vendor Risk Management module. Using v<span>endor profiles can help you keep track of the level of risk associated with the third party. From vendor profiles, you can send questionnaire assessments and work through any issues that you create from the vendors' questionnaire responses.</span><a name='VendorDetails'></a> <a name='VendorDetails'></a></p>\n<p>For details, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360021501394#NEWVENDORPROFILES' target='_blank' rel='noopener'>Adding New Vendor Profiles</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360021501394' target='_blank' rel='noopener'>How to Create and Manage Vendor Profiles</a> article.</p>\n<h3 id='h_01HVPP9PP7VPWFY2DFRFK9EP0E'>Adding Vendor User Accounts</h3>\n<p>Once you are ready to send a questionnaire to a vendor, you can create a user account for the user so they can complete the questionnaire. This user will log in to a separate vendor portal associated with your account. The vendor portal is for answering questionnaires and addressing issues resulting from the questionnaire responses.</p>\n<p>For details, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360021501394#AddVendorUser' target='_blank' rel='noopener'>Adding User Accounts for Vendor Contacts</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360021501394' target='_blank' rel='noopener'>How to Create and Manage Vendor Profiles</a> article.</p>\n<h2 id='h_01HVPP9PP739MYP1NB60540W41'>Sending Questionnaires</h2>\n<p>Once you have finalized your questionnaire and have added a user account for your vendor who will answer your questionnaire, you can send the questionnaire directly from the vendor's profile.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip: </strong>We recommend that you send questionnaires to your vendors at least once per year. Annual questionnaires can help you keep the level of risk that you associate with each vendor up to date.</div>\n</div>\n<p>For details, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360038671833' target='_self'>How to Send Questionnaires to Vendors</a> article.</p>\n<h2 id='h_01HVPP9PP7HXTJNFNJ24GMMMR1'>Vendor Experience</h2>\n<p>This section provides an overview of the vendor's experience when completing your questionnaire. If you'd like to share an instructional guide with your vendors, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021761873' target='_blank' rel='noopener'>How to Complete Questionnaires and Respond to Issues: A Guide for Vendor Users</a> article.</p>\n<p>Once you've sent the questionnaire, the questionnaire assessee will receive an email (<a href='#!' data-toggle='modal' data-target='#VendorEmailModal'>click to view example</a>) requesting them to complete the questionnaire. Once they've activated their Vendor User account, they'll log in and see the <strong>Vendor Portal Dashboard</strong>, as shown below.</p>\n<p><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorUserEmail_Generic.png' alt=' ' width='471' height='358'></p>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorPortalDashboard.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorPortalDashboard.png' alt=' ' width='1153' height='743'></a></p>\n<p>From the <strong>Questionnaires</strong> portion of the screen, the assessee will click the link under the <strong>Name</strong> or <strong>Template</strong> columns (shown above) to begin the questionnaire(s) you've assigned.</p>\n<p>The questionnaire assessee will answer the questions by selecting one or more checkboxes, selecting a multiple choice answer, or by typing a response in the <strong>Answer</strong> field–depending on which answer type(s), or template(s) you used for your questionnaire. Then, they must use the <strong>Save</strong> button to finalize each answer.<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_QuestionnaireCommentFile.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_QuestionnaireCommentFile.png' alt=' '></a></p>\n<p>The assessee is also able to add comments or upload supporting files for each question by using the <strong>Add Comment</strong> or <strong>Attach File</strong> buttons, shown above.</p>\n<p>The file attachment limitations for individual questions are as follows:</p>\n<ul role='list'>\n<li>File Size: Maximum of 5 MB (for each question)</li>\n<li>File Name: Maximum of 250 characters (including the file extension)</li>\n<li>File Types: See the <a href='https://support.knowbe4.com/hc/en-us/articles/4414553246483#FILE_TYPES' target='_blank' rel='noopener'>Do the files that vendors can upload to questionnaires need to meet any specific requirements?</a> question in our <a href='https://support.knowbe4.com/hc/en-us/articles/4414553246483' target='_blank' rel='noopener'>Vendor Risk Management Module Frequently Asked Questions (FAQ)</a> article for details</li>\n</ul>\n<p>Once the user has finished the questionnaire, they'll click the <strong>Finalize Questionnaire</strong> button at the bottom of the page. You'll receive an email notification and the questionnaire will be available for review in your account.</p>\n<h2 id='h_01HVPP9PP7GWMFZ1WZF393333D'>Reviewing Questionnaires and Creating Issues</h2>\n<p>Once your vendor contact has completed the questionnaire assessment, the KCM GRC <strong>Vendor Owner</strong> (<a href='#!' data-toggle='modal' data-target='#VendorModal'>click to view example</a>) will receive an email notification. You can review questionnaires from the applicable vendor profile, under the <strong>Vendors</strong> tab of your console.</p>\n<p>If the vendor provided an undesirable answer to one or more questions, you can create an \"issue\" to request additional information or to further discuss your concern with the vendor.</p>\n<p><img src='https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_Reviewing_Questionnaires/VendorOwnerExample.png' alt=' '></p>\n<p>For more information about reviewing questionnaires and creating or responding to issues, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360033813974' target='_blank' rel='noopener'>How to Review Questionnaires and Create Issues</a> article. Alternatively, you can watch the following videos: </p>\n<ul role='list'>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360039790534' target='_self'>Video: Reviewing Vendor Questionnaires</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360040615494' target='_self'>Video: Working with Questionnaire Issues</a></li>\n</ul>\n<h2 id='h_01HVPP9PP7YRAGBSSDVWHHPJPJ'>Responding to Issues (Vendor Users)</h2>\n<p>This section provides an overview of the vendor's experience when responding to the issues you've created as a result of their questionnaire responses. If you'd like to share an instructional guide with your vendors, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021761873' target='_blank' rel='noopener'>How to Complete Questionnaires and Respond to Issues: A Guide for Vendor Users</a> article.</p>\n<p>When you create an issue in response to the vendor's answer to a question, the vendor receives an email informing them of the issue. See the steps below for an explanation of how the vendor will address the issues you've created.</p>\n<ol role='list'>\n<li>The vendor logs in to their vendor portal to respond to the questionnaire issues. The vendor can see the open issues from both their <strong>Vendor Dashboard</strong> or by clicking <strong>Issues</strong> from the navigation panel on the left-hand side of their account, as shown below. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_IssuesNavpanel.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_IssuesNavpanel.png' alt=' '></a>\n</li>\n<li>The vendor clicks an <strong>Issue Description</strong> to open the issue, as shown below. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_OpentheIssue.png'><img src='https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_OpentheIssue.png' alt=' '></a>\n</li>\n<li>The vendor enters a response to your issue into the <strong>Response</strong> field and clicks the <strong>Save Response </strong>button to send the response to your account.</li>\n</ol>\n<h2 id='h_01HVPP9PP847WJKKDB1ZJECN6E'>Closing Issues</h2>\n<p>Once you're satisfied with the vendor's response, you can close the questionnaire issue. See our <a href='https://support.knowbe4.com/hc/en-us/articles/360033813974' target='_blank' rel='noopener'>How to Review Questionnaires and Create Issues</a> article for instructions.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360021083194-Vendor-Risk-Management-Module-Guide",
    "images": [
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorUserGuide/VendorUserEmail_Generic.png",
        "alt": "This image displays a notification email template for a vendor assessment process. The template is structured into three main sections: Header, Instructional Banner, and Body Text/Call-to-Action.\n\n**UI Elements and Layout:**\n1.  **Header:** A light gray bar featuring the dark gray and orange \"KCM\" logo on the left. The transmission date, \"Message sent on April 9, 2019,\" is right-aligned.\n2.  **Instructional Banner:** A prominent, solid orange block containing the primary instruction in large, white, bold text.\n3.  **Body:** A light gray/white area containing secondary instructions and the action link in standard dark gray text.\n\n**Text and Template Variables (Content Focus):**\n\n*   **Instructional Banner Text:** Defines the purpose and required action. It utilizes two dynamic template variables:\n    > \"As a part of **[[Organization Name]]**'s vendor assessment process, you are being asked to complete the following questionnaire: **[[Questionnaire Title]]**.\"\n\n*   **Body Text (Instructions):** Provides timing and support context:\n    1.  Instruction for timely submission: \"We ask that you submit the completed questionnaire as soon as possible.\"\n    2.  Contact information instruction: \"Should you have any questions pertaining to this questionnaire, please reach out to your point of contact, **[[Organization's Name]]**\"\n\n*   **Call-to-Action (CTA):** The final line presents the action prompt, where the word 'here' functions as a hyperlink:\n    > \"Click **here** to get started.\" (The word \"here\" is rendered in blue text.)",
        "position": 1,
        "context": "Once they've activated their Vendor User account, they'll log in and see the Vendor Portal Dashboard"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/VendorPortalDashboard.png",
        "alt": "The image displays the \"Vendor Portal Dashboard,\" a multi-module user interface organized into three primary data sections: Questionnaires, Issues, and Documents.\n\n**1. Questionnaires Module (Top Section)**\n\n*   **Search and Filters:** Contains a search bar with the placeholder text \"Search...\".\n*   **Data Grid:** Presents a list of records under sortable column headers: Name, Template, Status, and Due Date.\n*   **Records:** Two records are displayed, indicated by the footer \"2 records.\"\n    *   **Record 1:** Name: `CAIQ` (hyperlinked); Template: `CAIQ` (hyperlinked); Status: `Sent` (in a blue badge); Due Date: `October 14, 2019`.\n    *   **Record 2:** Name: `QuestionnaireAE03 CAIQ v3.0.1` (hyperlinked); Template: `QuestionnaireAE03 CAIQ v3.0.1 (10 questions)` (hyperlinked); Status: `Sent` (in a blue badge); Due Date: `October 16, 2019`.\n\n**2. Issues Module (Middle Section)**\n\n*   **Search and Filters:** Contains a search bar with the placeholder text \"Search Issues...\".\n*   **Data Grid:** Includes sortable column headers: Issue ID, Issue Description, Questionnaire, Priority, Status, and Date Created.\n*   **Content:** The table is empty, displaying the message \"No matching records.\"\n\n**3. Documents Module (Bottom Section)**\n\n*   **Search and Filters:** Contains a search bar with the placeholder text \"Search Documents...\".\n*   **Data Grid:** Includes sortable column headers: Name, Date Attached, and Actions.\n*   **Content:** The table is empty, displaying the message \"No matching records.\"",
        "position": 2,
        "context": "dor/VendorUserGuide/VendorUserEmail_Generic.png' alt=' ' width='471' height='358'>"
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_QuestionnaireCommentFile.png",
        "alt": "This image displays a section of a web-based interface for an **External Vendor Questionnaire**, featuring two distinct, bounded question modules.\n\n**General Structure:**\nThe page uses card-like modules for each question, separated by a horizontal blue rule. Each module includes the question title, the Answer input area, and action buttons.\n\n**Question #1 Module (Text Input):**\n*   **Title:** \"Question #1\"\n*   **Input Type:** A multi-line text input box (textarea) labeled \"Answer.\"\n*   **Content:** Contains the sample text: \"This is an answer.\"\n*   **Action Buttons (Top Right):** Two blue buttons are present: **\"Add Comment\"** (with a speech bubble icon) and **\"Attach File\"** (with a file icon).\n*   **Submission:** A green button labeled **\"Save Answer\"** is located at the bottom right of the module.\n\n**Question #2 Module (Multiple Choice Input):**\n*   **Title:** \"Question #2\"\n*   **Input Type:** Radio buttons labeled \"Answer.\"\n*   **Options:** \"Answer A,\" \"Answer B,\" and \"Answer C.\"\n*   **Current State:** \"Answer B\" is selected.\n*   **Action Buttons (Top Right):** Identical blue buttons: **\"Add Comment\"** and **\"Attach File.\"**\n*   **Submission:** A green button labeled **\"Save Answer\"** is located at the bottom right of the module.\n\n*Note: Orange highlight circles in the image emphasize the \"Add Comment\" and \"Attach File\" buttons, demonstrating the availability of these features for both question types.*",
        "position": 3,
        "context": "Then, they must use the Save button to finalize each answer."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/KCM/KCMVendor/Vendor_Reviewing_Questionnaires/VendorOwnerExample.png",
        "alt": "This document describes a user interface screen displaying detailed information for a vendor record.\n\n**Screen Context:** Vendor Details Management\n**Title:** Vendor Details - Supply Chain Distribution\n\n**UI Layout and Actions:**\nThe screen features a header bar with the primary entity title and a set of action buttons located in the upper right quadrant:\n1.  **Update** (Blue button)\n2.  **Archive** (Blue button)\n3.  **Delete** (Red button)\n\n**Data Display Section:** Organization Details\nThe main content is structured into two columns displaying key-value pairs, primarily static text data (likely read-only or pre-populated fields).\n\n**Left Column (Vendor Profile Data):**\n*   **Name:** Supply Chain Distribution\n*   **Contact Name:** Suzie Q\n*   **Vendor Type:** External\n*   **Vendor Status:** Active\n*   **Industry:** Manufacturing\n*   **Details of Services/Goods:** Supply chain logistics\n*   *Other fields listed (data redacted):* Contact Email, Telephone, Website, Vendor Score Offset Note.\n\n**Right Column (Address and Ownership Data):**\n*   **Country:** US\n*   *Other fields listed (data redacted):* Mailing Address, Mailing Address 2, City, State, Postal Code.\n*   **Vendor Owner:** example@yourdomain.com\n\n**Performance Metric Visualization:**\nIn the lower right section, a semi-circular progress chart (donut chart) displays a key performance metric:\n*   **Metric:** Vendor Score\n*   **Value:** 72.6% (Visually represented by the blue segment of the chart).\n\n**Annotation (Overlay):**\nAn illustrative orange/red ellipse and arrow are overlaid on the display, specifically highlighting the data field **Vendor Owner: example@yourdomain.com**. This annotation is external to the base application UI.",
        "position": 4,
        "context": "e.\nIf the vendor provided an undesirable answer to one or more questions, you can create an \"issue\" "
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_IssuesNavpanel.png",
        "alt": "The image displays a partial view of an application's user interface, focusing on the vertical navigation sidebar and application header.\n\n**UI Elements and Context:**\n\n*   **Header/Branding:** The top left corner features the stylized \"KCM\" application logo/branding.\n*   **Navigation Sidebar:** A dark gray vertical menu pane contains navigation links.\n*   **Menu Items:**\n    *   **Dashboard:** Listed with a speedometer/gauge icon.\n    *   **Issues:** Listed directly beneath \"Dashboard,\" paired with an icon depicting a list overlying servers or monitors.\n\n**Annotation:**\n\n*   A prominent, thick orange directional arrow overlays the screenshot, explicitly pointing toward and highlighting the **Issues** navigation link, indicating it as the target selection.",
        "position": 5,
        "context": "strong> from the navigation panel on the left-hand side of their account, as shown below."
      },
      {
        "url": "https://s3.amazonaws.com/helpimg/KCM/KCMVendor/Vendor_OpentheIssue.png",
        "alt": "This image displays the \"Issues\" tracking page, presenting a tabular list of records within a web application interface.\n\n**UI Elements:**\n*   **Page Title:** \"Issues\"\n*   **Search Function:** A search input field labeled with the placeholder text \"Search Issues...\" is positioned above the data table.\n*   **Record Count:** The footer indicates \"2 records.\"\n*   **Instructional Overlay:** A superimposed orange text element states, \"Click the description to open the issue.\" An accompanying segmented orange arrow points toward the \"Issue Description\" column, illustrating the clickable link functionality.\n\n**Data Table Structure:**\nThe table includes six columns: Issue ID, Issue Description, Questionnaire, Priority, Status, and Date Created.\n\n**Record Details (2 Records Displayed):**\n\n| Column | Issue 1 Details | Issue 2 Details |\n| :--- | :--- | :--- |\n| **Issue ID** | 1 (Clickable Link) | 2 |\n| **Issue Description** | \"Provide more information for question #4.\" (Clickable Link) | \"High Priority Issue. Please provide alternative.\" |\n| **Questionnaire** | \"External Vendor Questionnaire\" (Clickable Link) | \"External Vendor Questionnaire\" (Clickable Link) |\n| **Priority** | \"Moderate\" (Green badge) | \"High\" (Orange badge) |\n| **Status** | \"Open\" (Blue badge) | \"Open\" (Blue badge) |\n| **Date Created** | April 10, 2019 | April 10, 2019 |\n\nThe data confirms that both the Issue Description and the Questionnaire titles function as navigation links for detailed viewing.",
        "position": 6,
        "context": ">The vendor clicks an Issue Description to open the issue, as shown below."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "management",
        "module",
        "risk",
        "vendor"
      ],
      "image_count": 6
    }
  }
}