{
  "id": 360023818513,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360023818513.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360023818513.html",
  "author_id": 383255683393,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 4,
  "vote_count": 4,
  "section_id": 360004702454,
  "created_at": "2019-05-24T20:25:34Z",
  "updated_at": "2025-03-11T17:20:46Z",
  "name": "Free Social Media Phishing Test (SPT) Product Manual",
  "title": "Free Social Media Phishing Test (SPT) Product Manual",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T17:20:46Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "Lead Generator",
    "answerbot"
  ],
  "body": "<p>To learn about this product, read the below tutorial or watch this brief <a href='https://support.knowbe4.com/hc/en-us/articles/360034113253-Video-Social-Media-Phishing-Test-SPT-' target='_self'>Social Media Phishing Test</a> video.</p>\n<h2 id='h_01HSE93QPW0D0V9T5NER1NQKF3'>What is the Social Media Phishing Test?</h2>\n<p>KnowBe4's Social Media Phishing Test (SPT) is a web-based tool that helps you determine which of your users are most likely to fall for social media related phishing attacks. <span>These types of attacks work by tricking your user into clicking on a link in an email that directs them to a login page of a trusted social media platform so they feel safe enough to enter their credentials. With these credentials, hackers can log in to the user's social media account to access personal information. They can also use <a href='https://en.wikipedia.org/wiki/Social_login' target='_blank' rel='noopener'>social login</a> to log in to their accounts or even create fake accounts with the user's credentials and identity. SPT can help you see how likely your users would be to fall for this type of attack should a real attack ever occur.</span></p>\n<p><span>SPT allows you to send your users one of three social media based phishing templates. You can also select the landing page, where the user will be directed to should they click on the link in the phishing template. If you select the landing page for the social media platform and the user clicks on the link in the email, your user will be directed to a fake login page. If they enter credentials and try to log in, they will be redirected to an error page.</span></p>\n<p><span>The results will display how many of your users clicked on a link in the email and how many of your users entered data on a landing page. You will be able to download a report with all of your results. <strong>SPT will <em>never</em> save any of the data entered on the landing page. We only track whether the user entered data, not the data itself.</strong></span></p>\n<p>Follow these steps below to complete your free SPT. You will not be required to download or install any software. The default test is limited to 100 employees. Please contact us if you need to send to more.</p>\n<h2 id='h_01HSE93QPWHVXBSQM52MGKHB12'>Signing Up for a Free Account</h2>\n<p>If you already have a free account, skip to the <a href='#h_01HSE93QPWMBH0TAQJSHY3HEB5'>Setting Up a Social Media Phishing Test</a> section.</p>\n<ol role='list'>\n<li>Sign up for a free account here: <a href='https://www.knowbe4.com/social-media-phishing-test' target='_blank' rel='noopener'>KnowBe4 Free Social Media Phishing Test</a>.</li>\n<li>After entering your information, you can either click <strong>Get Started</strong> or click the link provided in the email we will send you.</li>\n<li>On the next page, you'll be prompted to enter your work email address. After you enter your email address, click <strong>Next</strong> to create a free account.</li>\n<li>You will receive an email asking you to activate your account. Click the link in the email to activate your free account.</li>\n<li>After you click the link, you will need to set up your free account. Enter your first and last name as well as a password for the account. Click <strong>Save &amp; Continue</strong>.</li>\n<li>You'll be redirected to the SPT wizard. As the first person to log in under your domain, you will be automatically set up as the Account Owner. Proceed to step 3 under <a href='#h_01HSE93QPWMBH0TAQJSHY3HEB5'>Setting Up a Social Media Phishing Test</a>.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong><span>Email addresses of publicly-available email services like Hotmail and Gmail cannot be used when signing up for or running the SPT.</span>\n</div>\n</div>\n<p>The Account Owner must use his or her corporate email address to sign up and this test will be limited to the domain of that corporate email address. For example, if you sign up with user@CompanyXYZ.com as your email address, you will only be able to test users with an “@CompanyXYZ.com” email address.</p>\n</li>\n</ol>\n<h2 id='h_01HSE93QPWMBH0TAQJSHY3HEB5'>Setting Up a Social Media Phishing Test</h2>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>It is <strong>vital</strong> that you whitelist us in your mail server and any spam filter you are using prior to setting up your phishing test to ensure the emails will reach your users. For whitelisting information, <a href='https://support.knowbe4.com/hc/en-us/articles/203645138-Whitelist-data-and-anti-spam-filtering-information' target='_blank' rel='noopener'>click here</a>. If you are using a firewall, <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener'>contact our support</a> team to ask for the domains that you will need to whitelist for this test. <span>Also, consider your mail server or mail filter may have rate limiting in place which could prevent a large number of emails from being delivered at once and settings might need to be adjusted.</span>\n</div>\n</div>\n<ol role='list'>\n<li>Log in to your free KnowBe4 account.</li>\n<li>Under the <strong>Free Social Media Phishing Test</strong>, click the <strong>Get Started</strong> button.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Dashboard.png'><img src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Dashboard.png' alt=' '></a>\n</li>\n<li>Choose which style of phishing template to use. We have three options: LinkedIn, Twitter, and Facebook. You can preview each by clicking the <strong>Preview</strong> button. When you are finished, click <strong>Next Step</strong> to advance to the next page.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Phishing.png'><img src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Phishing.png' alt=' '></a>\n</li>\n<li>Choose who you'd like to send this phishing test to. This page allows you to enter up to 100 email addresses from your organization. If you've already taken the Phishing Security Test (PST) or the Phishing Reply Test (PRT), you can import the user list you used for that test.<em>If manually adding emails</em>:Type out or paste the email addresses into the box, one per line, with no commas or spaces.<em>If importing emails from PST or PRT</em>:Click either the <strong>Import Recipient List from PST</strong> or <strong>Import Recipient List from PRT </strong>button. The email addresses will automatically populate in the text box. Any text you already have in the field will be replaced by the imported list.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Recipients.png'><img src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Recipients.png' alt=' '></a><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Import.png'><img src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Import.png' alt=' '></a>\n</li>\n<li>\n<p>Next, choose which landing page you'd like your users to see if they click on the link in the email. You can select either our standard landing page or the landing page for the social media platform you are spoofing. Our standard landing page lets the user know that they failed a phishing test and the red flags that indicated the email was a phishing email.</p>\n\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_LP.png'><img src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_LP.png' alt=' '></a>\n</li>\n<li>If you haven't already done so, make sure you whitelist our mail servers and test that you can successfully receive our phishing emails. On our <strong>Review &amp; Launch</strong> page, we provide links to our whitelisting documentation to guide you through this process.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Review.png'><img src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Review.png' alt=' '></a>\n</li>\n<li>After whitelisting, click the blue <strong>Preview and Send Test </strong><strong>Email</strong> button. This is a sample of what your email will look like when your users receive it. After previewing, you can send yourself a test email by clicking the <strong>Send me a test email</strong> link on the top right.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/FreeTools/SPT/SPT_Preview.png'><img src='https://s3.amazonaws.com/helpimg/FreeTools/SPT/SPT_Preview.png' alt=' '></a>\n</li>\n<li>After sending the test email, check your mail and make sure you've received it. This may take up to ten minutes to receive. You can make sure it has been delivered by checking the <strong>Test Email Delivery</strong> area towards the bottom of the page.If you receive this email, you are ready to continue to the last step. If you do NOT receive the email or it is filtered into your spam or junk folder by your email system, please review our whitelisting instructions which are linked to the instructions on the page, or you can <a href='https://support.knowbe4.com/hc/en-us/articles/203645138-Whitelist-data-and-anti-spam-filtering-information' target='_blank' rel='noopener'>click here for whitelisting information.</a> Be sure to consider any spam filter service or device you have in place where we may need to be whitelisted as well. You can also <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener'>contact our support team</a> for assistance.<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/FreeTools/SPT/SPT_Test.png'><img src='https://s3.amazonaws.com/helpimg/FreeTools/SPT/SPT_Test.png' alt=' '></a>\n</li>\n<li>Once you've successfully whitelisted and are ready to start your test, click the <strong>Start Your Free SPT Now!</strong> button to begin. The test will send out a phishing email to all of the users you entered on the <strong>Choose Recipients</strong> tab. It will track any clicks on these emails and any data entered on the social media landing pages (if selected) for three days.</li>\n</ol>\n<h2 id='h_01HSE93QPWPPYQYZWTN9M8QB72'>Analyzing Your Results</h2>\n<p>After you run the test, you can return to your account at any time to view the results on the <strong>Dashboard</strong> page. Under Free Social Media Phishing Test Results, you will be able to see the status of your Social Media Phishing Test, when the test was started, the total number of emails delivered, the total number of users who clicked the link, and the total number of users who entered data on the landing page. Please note that if you selected the SEI landing page, the percentage for data entered will be zero.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Results.png'><img src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Results.png' alt=' '></a></p>\n\n<p>A link to download a PDF report will also be emailed to you automatically after 24 hours. You can also view this PDF by clicking the <strong>Download PDF Report</strong> button under the Free Social Media Phishing Test Results section of your Dashboard. If you would like to know who replied, your rep or reseller can get you that information. If you do not know who your rep is, <a href='https://www.knowbe4.com/support' target='_blank' rel='noopener'>submit a support ticket</a> and we'll assist you right away.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_PDF.png'><img src='https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_PDF.png' alt=' '></a></p>\n\n<p>Armed with this knowledge, you can help protect your organization by teaching your users about the dangers of social media attacks. Enrolling in KnowBe4's new school security awareness training can help you achieve this goal. Through KnowBe4, you can train your users to spot the warning signs and keep their skills sharp by sending fake phishing attacks much like the ones in this free tool. For more information, request a demo <a href='https://info.knowbe4.com/kmsat-request-a-demo' target='_self'>here</a>.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360023818513-Free-Social-Media-Phishing-Test-SPT-Product-Manual",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Dashboard.png",
      "alt": "This image depicts a UI module advertising a security test, structured within a bordered panel.\n\n**Header Section:**\n*   **Title:** Bold, dark text reading \"**Free Social Media Phishing Test**\".\n*   **Icon:** An orange square icon featuring a three-line horizontal list precedes the title.\n*   A thin horizontal divider line separates the header from the body content.\n\n**Body Section (Context and CTA):**\n*   **Description Text:** Standard font text explaining the test's purpose: \"The Social Media Phishing Test helps you see how vulnerable your users are to social media phishing attacks that mimic platforms like Facebook, LinkedIn, and Twitter. This test will track what percentages of your users will click on a link as well as which users will expose their credentials to these popular social media sites.\"\n*   **Call-to-Action (CTA) Element:** A rectangular button, colored solid blue with rounded corners, is positioned in the bottom right corner of the content area. The button text is white and reads: \"**Get Started**\".",
      "position": 1,
      "context": "Free Social Media Phishing Test, click the Get Started button."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Phishing.png",
      "alt": "This image displays the first step of a four-step configuration wizard for a \"Free Social Media Phishing Test.\"\n\n**UI Structure and Context:**\nThe screen is titled \"Free Social Media Phishing Test\" and is currently at Step 1, \"Phishing Email,\" as indicated by the progress bar. Subsequent steps are \"Choose Recipients,\" \"Landing Page,\" and \"Review & Launch.\" The primary instruction is \"Let's Get Started\" with the subheading \"Selecting a Social Media Phishing Email Scenario.\"\n\n**Selection Elements:**\nThe user is presented with three horizontal options for social media platforms to spoof:\n1.  **LinkedIn:** Selected via a radio button (indicated by a blue dot).\n2.  **Twitter:** Unselected via a radio button.\n3.  **Facebook:** Unselected via a radio button.\n\nEach option includes a secondary action button below the logo, labeled \"Preview and Send Test Email\" (accompanied by an eye icon).\n\n**Navigation:**\nA primary action button, styled in blue, is located at the bottom center and labeled \"Next Step\" (with a right-facing arrow).",
      "position": 2,
      "context": "When you are finished, click Next Step to advance to the next page."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Recipients.png",
      "alt": "This image displays the second step in a multi-step configuration process for a \"Free Social Media Phishing Test.\"\n\n**Overall Context and Navigation:**\nThe screen is titled \"Free Social Media Phishing Test\" and shows a four-step linear progress indicator. The current active step is \"2 Choose Recipients,\" preceded by the completed step \"1 Phishing Email\" (indicated by a green checkmark). The subsequent steps, \"3 Landing Page\" and \"4 Review & Launch,\" are inactive.\n\nThe main heading for the current configuration page is \"Choosing Recipients of the Social Media Phishing Email,\" followed by the instruction: \"Enter up to 100 email addresses from your domain that you want to receive the Social Media Phishing Test.\"\n\n**Recipient Input Area:**\nA large text input field is provided with the prompt: \"Please enter email recipients below, one per line:\". The field currently contains three sample email addresses:\n*   `user1@technicalcontentteamkb4.com`\n*   `user2@technicalcontentteamkb4.com`\n*   `user3@technicalcontentteamkb4.com`\n\nBelow the text area, two buttons facilitate importing recipient lists:\n1.  **Import Recipient List from PST** (Dark grey, active button)\n2.  **Import Recipient List from PRT** (Grey, possibly inactive or secondary button)\n\n**Guidance and Support Panel (Right Column):**\nA blue informational panel provides constraints and help:\n*   Users are limited to \"up to 100 of your organization's email addresses.\"\n*   If testing more than 100 users, users are instructed to contact support.\n*   The required email format is displayed with the same sample addresses from the input field.\n\nA separate white panel displays an FAQ concerning data security:\n*   **Q:** \"Are the email addresses that I enter here safe?\"\n*   **A:** Confirms the list is used only for the SPT, not for marketing, and provides a privacy policy link: `http://www.knowbe4.com/privacy-policy/`.\n\n**Footer Navigation:**\nStandard step navigation buttons are located at the bottom of the screen:\n*   **← Previous Step** (Blue button)\n*   **Next Step →** (Blue button)",
      "position": 3,
      "context": "Any text you already have in the field will be replaced by the imported list."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Import.png",
      "alt": "This image displays two horizontally aligned UI controls functioning as buttons for importing data, differentiated by visual state and file format.\n\n**Element Breakdown:**\n\n1.  **Left Button (Active/Primary State):**\n    *   **Appearance:** Dark gray rectangular background with rounded corners.\n    *   **Text:** White/light gray text reading: \"Import Recipient List from PST\".\n    *   **Context:** Indicates an option to import a recipient list from a PST (Personal Storage Table) file format, visually highlighted as the current or primary choice.\n\n2.  **Right Button (Secondary/Inactive State):**\n    *   **Appearance:** Medium, lighter gray rectangular background with rounded corners, providing less contrast than the left button.\n    *   **Text:** White/light gray text reading: \"Import Recipient List from PRT\".\n    *   **Context:** Indicates an alternative option to import a recipient list from a PRT file format, visually distinguished as a secondary or currently unselected choice.",
      "position": 4,
      "context": "pients.png'>"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_LP.png",
      "alt": "This screen depicts Step 3 of the \"Free Social Media Phishing Test\" configuration wizard, focused on selecting the post-click destination page.\n\n**I. UI Context and Progress:**\n\n*   **Header:** \"Free Social Media Phishing Test\".\n*   **Progress Indicator:** A 4-step linear process is shown. Steps 1 (\"Phishing Email\") and 2 (\"Choose Recipients\") are marked complete with green checkmarks. Step 3 (\"Landing Page\") is the current step. Step 4 (\"Review & Launch\") is pending.\n*   **Main Title:** \"Choose a Landing Page Style\".\n\n**II. Descriptive Text and Policy:**\n\n*   **Explanation:** The text details two landing page functions: an informational warning page showing \"red flags,\" and a simulated social media login page to test for data entry.\n*   **Data Policy Note:** \"Note: No data is saved that is entered by your users. We only track that a user attempted to provide data on a landing page.\" (Text is aligned centrally above the selection options.)\n\n**III. Selection Options (Radio Buttons/Thumbnails):**\n\nThe user selects one of two options via radio buttons, presented with preview thumbnails (labeled KnowBe4 components):\n\n1.  **Standard Landing Page (Selected):**\n    *   **Status:** Active selection (blue radio button dot).\n    *   **Preview:** Displays an informational page with a prominent orange banner stating: \"Oops! You clicked on a phishing email!\" This page is designed to educate the user by showing social engineering indicators.\n2.  **LinkedIn Landing Page (Deselected):**\n    *   **Status:** Inactive selection (empty radio button circle).\n    *   **Preview:** Displays a simulated LinkedIn login page structure, including fields for \"Email or Phone\" and \"Password,\" and a \"Sign in\" button.\n\n**IV. Navigation Controls:**\n\nTwo standard blue navigation buttons are positioned at the bottom center:\n\n*   **Left Button:** \"← Previous Step\"\n*   **Right Button:** \"Next Step →\"",
      "position": 5,
      "context": "w that they failed a phishing test and the red flags that indicated the email was a phishing email."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Review.png",
      "alt": "This image displays the final step of the \"Free Social Media Phishing Test\" configuration workflow.\n\n**Context and Workflow:**\nThe page title is \"Review and Launch your Social Media Phishing Test.\" A horizontal progress bar indicates the user is on Step 4 of 4 (\"Review & Launch\"), following successful completion of \"Phishing Email,\" \"Choose Recipients,\" and \"Landing Page\" steps.\n\n**Instructional Content:**\nThe primary section is headed **\"IMPORTANT - Whitelisting & Spam Filtering,\"** detailing final prerequisites before launch. A numbered list (1 through 5) provides critical steps:\n1.  Whitelisting email servers in the spam filtering solution.\n2.  Reviewing documentation or contacting support for filter configuration.\n3.  Sending a test email to ensure delivery.\n4.  Confirmation message for proceeding (\"Start your Free SPT now\" button).\n5.  Support link (`https://support.knowbe4.com/`) for troubleshooting delivery issues.\n\n**Navigation and Actions:**\nThree distinct call-to-action buttons are present below the instructions:\n*   **\"Previous Step\"** (Blue button with a left arrow icon).\n*   **\"Preview and Send Test Email\"** (Neutral button with an eye icon).\n*   **\"Start Your Free SPT Now!\"** (Green primary button with a paper plane/send icon).\n\n**Test Email Tracking Interface:**\nA lower section titled **\"Test Email Delivery\"** tracks the outcome of test emails. It features an empty table placeholder labeled \"List of Test Emails Sent (this list will automatically update),\" with the following five column headers:\n1.  Subject\n2.  Sent At\n3.  Delivered at\n4.  Bounced\n5.  Reason",
      "position": 6,
      "context": "/strong> page, we provide links to our whitelisting documentation to guide you through this process."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/FreeTools/SPT/SPT_Preview.png",
      "alt": "This image displays an \"Email Preview\" interface for a LinkedIn notification email titled \"You appeared in new searches this week!\".\n\n**UI Header and Metadata:**\nThe preview interface header includes the title, \"Email Preview - You appeared in new searches this week!\", and a close ('X') icon. Debugging metadata on the right shows the \"Template ID: 224752-985841,\" along with two functional links: \"Send me a test email\" (with an envelope icon) and \"Toggle red flags\" (with a flag icon).\n\nEmail header fields are explicitly listed:\n*   **From:** `LinkedIn <noreply@linkedin.authentication.com>`\n*   **Reply-to:** `LinkedIn <noreply@linkedin.authentication.com>`\n*   **Subject:** `You appeared in new searches this week!`\n\n**Email Body Content:**\nThe body features the LinkedIn logo and a blurred header element. The core content highlights a recent activity metric:\n1.  A magnifying glass icon is displayed above the central statistic.\n2.  Headline text states: \"You appeared in 27 searches this week.\"\n3.  Subtext reads: \"You were found by people from these companies.\"\n4.  A multicolored, angular logo serves as a placeholder for company identification.\n5.  A primary blue Call-to-Action (CTA) button is labeled \"See all searches.\"\n\n**Email Footer and Context:**\nA promotional banner with a blue background encourages app download: \"Get the LinkedIn app. Stay updated wherever you are.\" A white button reads \"Download for free,\" accompanied by a graphic of a smartphone screen featuring the LinkedIn logo.\n\nThe legal/contextual footer includes:\n*   Action links: \"Unsubscribe | Help.\"\n*   Status text: \"You are receiving LinkedIn notification emails.\"\n*   Intended recipient disclosure: \"This email was intended for `admin@foxes-inc.com`\" followed by a link \"Learn why we included this.\"\n*   Final branding: A small LinkedIn logo.\n\nThe overall modal/preview screen concludes with a \"Close\" button in the lower right corner.",
      "position": 7,
      "context": "yourself a test email by clicking the Send me a test email link on the top right."
    },
    {
      "url": "https://s3.amazonaws.com/helpimg/FreeTools/SPT/SPT_Test.png",
      "alt": "This UI segment displays a tracking log for test emails sent.\n\n**Context and UI Elements:**\n\n*   **Header:** \"List of Test Emails Sent.\"\n*   **Action Link:** A blue hyperlink labeled \"(Refresh)\" is positioned next to the header.\n\n**Data Table Structure:**\n\nThe data is presented in a table format defined by the following six column headers (all in bold text):\n\n1.  Subject\n2.  Sent at\n3.  Delivered at\n4.  Bounced\n5.  Bounce\n6.  Reason\n\n**Displayed Data Entry (Row 1):**\n\nOne complete entry is visible, tracking a successfully delivered email:\n\n*   **Subject:** \"You appeared in new searches this week!\"\n*   **Sent at:** 06/26/2019 10:05:01\n*   **Delivered at:** 06/26/2019 10:06:09\n*   **Bounced, Bounce, Reason:** Fields are empty, indicating no bounce occurred.",
      "position": 8,
      "context": ".com/hc/en-us/requests/new' target='_blank' rel='noopener'>contact our support team for assistance."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_Results.png",
      "alt": "The image displays the results dashboard for a \"Free Social Media Phishing Test.\" The layout is organized into a primary header, two major statistical sections featuring donut charts, a detailed metrics table, and summarized percentage cards, concluding with an action button.\n\n**Header and Charts:**\nThe title is \"Free Social Media Phishing Test Results.\" Two donut charts dominate the upper section:\n\n1.  **Click Results Chart (Left):** Illustrates user interaction. The legend specifies Red for \"Clicked\" and Green for \"Not Clicked.\" The chart is overwhelmingly red, reflecting a high click rate.\n2.  **Data Entry Results Chart (Right):** Illustrates user credential submission. The legend specifies Red for \"Data Entered\" and Green for \"Not Data Entered.\" The red section comprises approximately two-thirds of the chart.\n\n**Detailed Metrics Table (Left Panel):**\nA tabular summary presents five key operational statistics:\n\n| Metric | Value |\n| :--- | :--- |\n| **Status:** | Active |\n| **Started:** | 2 hours and 58 minutes ago. |\n| **Total Delivered:** | 3 |\n| **Total Clicked:** | 3 |\n| **Total Data Entered:** | 2 |\n\n**Summary Percentage Cards (Right Panel):**\nTwo prominent summary cards highlight key vulnerability rates:\n\n1.  **Click Percentage:**\n    *   Description: \"The percentage of users that are vulnerable to social media phishing attacks.\"\n    *   Result: **100.00%**\n2.  **Data-Entered Percentage:**\n    *   Description: \"The percentage of users that attempt to enter data on a spoofed login page.\"\n    *   Result: **66.67%**\n\n**Action Element:**\nAt the bottom center, a button labeled **\"Download PDF Report\"** (accompanied by a document icon) allows for exporting the results.",
      "position": 9,
      "context": "Please note that if you selected the SEI landing page, the percentage for data entered will be zero."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/FreeTools/SPT/SPT_PDF.png",
      "alt": "This document is a technical results report from KnowBe4, titled \"Social Media Phishing Test Failure Rate.\"\n\n**Context and Metadata:**\nThe test commenced on Jun. 27, 2019, at 07:53 AM, initiated by `benz@knowbe4.com`. The overall report is divided into four primary sections detailing user failure rates and temporal analysis.\n\n**Section 1: Click Failure Rate**\n*   **Metric:** \"Social Media Phishing Test Failure Rate.\"\n*   **Result:** A large red pie chart indicates a dominant failure rate, labeled \"Clicked (3)\" versus \"Not Clicked (0).\"\n*   **Summary:** The corresponding key performance indicator (KPI) displays **100% Users Clicked**.\n\n**Section 2: Data Entry Failure Rate**\n*   **Metric:** \"Social Media Phishing Test Failure Rate.\"\n*   **Result:** A red and green pie chart shows the subsequent failure rate for data entry. The red segment is labeled \"Entered Data (2),\" and the green segment is labeled \"Not Entered Data (1).\"\n*   **Summary:** The corresponding KPI displays **66.7% Users Entered Data**.\n\n**Section 3: Temporal Failure Analysis**\nThis section presents two scatter plot graphs tracking failures over the first 8 hours (X-axis spanning 12:00 PM to 07:00 PM; Y-axis labeled \"Failures\").\n*   **Graph 1 (Clicked):** Titled \"Clicked failures in the first 8 hours.\" A single bubble, labeled '3', indicates three click failures occurred around 01:30 PM.\n*   **Graph 2 (Data Entry):** Titled \"Data entered failures in the first 8 hours.\" A single bubble, labeled '2', indicates two data entry failures occurred around 01:30 PM.\n\n**Section 4: Analysis and Footer**\n*   **Analysis:** A concluding text block explains that the graphs reflect the organization's vulnerability to impersonation attacks, recommending KnowBe4's security awareness training and simulated phishing platform.\n*   **Footer:** Includes corporate contact information: KnowBe4, Inc., 33 N Garden Ave, Suite 1200, Clearwater, FL 33755. Contact details are Tel: 855-KNOWBE4, URL: `www.KnowBe4.com`, and Email: `Sales@KnowBe4.com`. The copyright is listed as ©2019 KnowBe4, Inc.",
      "position": 10,
      "context": "com/support' target='_blank' rel='noopener'>submit a support ticket and we'll assist you right away."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "free",
      "manual",
      "media",
      "phishing",
      "product",
      "social",
      "spt",
      "test"
    ],
    "image_count": 10
  }
}