{
  "id": 360000727248,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360000727248.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360000727248.html",
  "author_id": 21027160967,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 2,
  "vote_count": 4,
  "section_id": 8750751995667,
  "created_at": "2018-03-14T22:28:30Z",
  "updated_at": "2025-03-11T17:04:36Z",
  "name": "Policy Management Module Guide",
  "title": "Policy Management Module Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T17:04:36Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "KCM",
    "knowbe4 compliance manager",
    "policy management",
    "compliance manager",
    "kcm grc",
    "KCM GRC",
    "GRC",
    "grc",
    "KCM Policy",
    "answerbot_kcmgrc"
  ],
  "body": "<p>In the <strong>Policy Management</strong> module of your KCM GRC platform, you can store, manage, and distribute the policies that your organization is required to acknowledge and agree to. You can access the <strong>Policy Management</strong> module from the <strong>Policy Management</strong> tab of your navigation panel. </p>\n<p>In this module, you can create policy management users and groups to assign policies to users in your organization. After you've created users and groups, you can create campaigns to send policies to your users. As your users acknowledge the policies, you can monitor the progress of each campaign. </p>\n<p>See the sections below to learn how to create policy management users and groups, create policy management users, create policy campaigns, and monitor policy campaigns from your platform. </p>\n<p><a name='USER_ROLES'></a></p>\n<h2 id='h_01J8J4BN03CWA1FJZNGYPEYJXJ'>Policy Management User Roles</h2>\n<p>The four user roles below can view, create, manage, or edit policy management campaigns. These user roles can also create policy management users and groups. To learn about each user role's permissions, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115015826148.html' target='_self'>User Roles Guide</a>.</p>\n<ul role='list'>\n<li>Account Administrator</li>\n<li>Policy Administrator</li>\n<li>Campaign Administrator</li>\n<li>Auditors (view only)</li>\n</ul>\n<p>If existing users in your account need access to manage your policy management campaigns, you can add the Policy Administrator or Campaign Administrator user roles to their accounts. Alternatively, you can create new KCM GRC accounts and assign the Policy Administrator or Campaign Administrator user roles to the users who will be managing policy campaigns.</p>\n<p>To learn how to edit user roles or add users to your account, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360019709833.html' target='_blank' rel='noopener'>Managing Users</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360019709833.html' target='_blank' rel='noopener'>Creating New Users</a> sections of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360019709833.html' target='_blank' rel='noopener'>How to Create and Manage KCM GRC User Accounts</a> article. </p>\n<p><a name='ONE'></a></p>\n<h2 id='h_01J8J4BN03G9723RYSDZC3NSCP'>Step One: Create Policy Management Groups and Users</h2>\n<p>In order to assign policy acknowledgments to your users, you must add your users to policy management groups. We recommend that you create policy management groups before you create policy management users. When you create policy management users, you can select a policy management group to add the users to.</p>\n<p>To learn how to create policy management groups and users, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4412346622099.html' target='_self'>Creating Policy Management Groups</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4412346622099.html' target='_self'>Creating Policy Management Users</a> sections of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4412346622099.html' target='_self'>How to Add Users and Groups to the Policy Management Module</a> article.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Before you add users to your <strong>Policy Management</strong> module, make sure all of your organization's email address domains are in the <strong>Domain Whitelist</strong> section of your Account Settings. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115016049347.html' target='_self'>How to Manage Your KCM GRC Account Settings</a> article. If you would like to add additional domains to your account, contact our <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener'>support team</a>.</div>\n</div>\n<p><a name='MANAGE'></a></p>\n<h3 id='h_01J8J4BN03BAJ6WDXGNP92RTC1'>Manage Users</h3>\n<p>From the <strong>Users</strong> tab of the <strong>Users &amp; Groups</strong> page, you can add users to groups, disable users, view user information and user policy acknowledgment history, and update user information.</p>\n<p>For more information, see the details below:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Policy+Mgmt+Users+and+Groups.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Policy+Mgmt+Users+and+Groups.png' alt='Policy Management Users and Groups List'></a></p>\n<ol role='list' type='a'>\n<li>Select the check box next to a user's name to select that user. You can also select the top check box to select all users on the page.</li>\n<li>\n<strong>Create New User</strong>: Click this button to create a new policy management user.</li>\n<li>\n<strong>Add Selected to Group</strong>: Click this button to add the selected users to the group that is selected in the <strong>Select a Group</strong> drop-down menu.</li>\n<li>\n<strong>Select a Group</strong>: Select a group from the drop-down menu that you want to add users to. </li>\n<li>\n<strong>Eye</strong>: Click this icon to view the user's information and their policy acknowledgment history.</li>\n<li>\n<strong>Pencil</strong>: Click this icon to edit the user's information.\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>If you remove the user from any groups that they are a member of, the user's policy acknowledgment activity will also be removed from that group. The user will no longer appear under active or completed campaigns that the group is included in, unless the user is a member of another group that is included in the same campaign.</div>\n</div>\n</li>\n<li>\n<strong>Check box</strong>: Click this icon to enable or disable the policy management user. If you disable the user, the user will stop receiving campaign notification emails. However, the user's campaign progress will still appear under any campaigns that the user is included in. If you enable the user, the user will start receiving campaign notification emails again.</li>\n<li>\n<strong>Trash can</strong>: Click this icon to permanently delete the policy management user and the user's campaign history.</li>\n</ol>\n<p><a name='TWO'></a></p>\n<h2 id='h_01J8J4BN03KJ85B57V6RYN1TQG'>Step Two: Add Policies</h2>\n<p>Before you can create a policy campaign, you will need to add one or more policies to your KCM GRC platform. To add a policy, you can either upload the policy file or provide a link to an external policy file that is stored on your organization's intranet or a file sharing service. </p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> If you need help creating new policies, you can download and customize the policy templates in your KCM GRC account. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500006135402.html' target='_self'>Policy Templates</a> article.</div>\n</div>\n<p>For more information about uploaded and linked policies, see the subsections below.</p>\n<p><a name='UPLOADED'></a></p>\n<h3 id='h_01J8J4BN03VGE8VMQWZS5QZDW2'>Uploaded Policies</h3>\n<p>If you would like to upload your policy as a file, you can upload files that meet the requirements below:</p>\n<ul role='list'>\n<li>The file type must be one of the file types listed below:\n<ul role='list'>\n<li>.png</li>\n<li>.jpg</li>\n<li>.jpeg</li>\n<li>.gif</li>\n<li>.bmp</li>\n<li>.tif</li>\n<li>.tiff</li>\n<li>.txt</li>\n<li>.pdf</li>\n<li>.rtf</li>\n<li>.eml</li>\n<li>.msg</li>\n<li>.csv</li>\n<li>.doc</li>\n<li>.docx</li>\n<li>.xls</li>\n<li>.xlsx</li>\n<li>.ppt</li>\n<li>.pptx</li>\n</ul>\n</li>\n<li>The maximum file size for all file types, except for .pdf is 10MB.</li>\n<li>The maximum file size for .pdf files is 50MB.</li>\n<li>The maximum character count for file names is 100.</li>\n</ul>\n<p>To upload a policy to your <strong>Policy Management</strong> module, follow the instructions below:</p>\n<ol role='list'>\n<li>From the navigation panel, navigate to <strong>Policy Management </strong>&gt; <strong>Policies</strong>.</li>\n<li>Click the <strong>Upload Policies </strong>button. When you click this button, the <strong>Upload Policies </strong>window will open.</li>\n<li>Drag and drop files into the upload box, or click the upload box and select files. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Policy%20Management/KCMPolicyMgmt_11.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Policy%20Management/KCMPolicyMgmt_11.png' alt=' '></a>\n</li>\n<li>(Optional) In the <strong>Edit Uploaded Policies</strong> section, enter a name and version number for your policy. The policy name will be visible to your users when they receive notifications about the policy.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> If you do not enter a name for your policy, the policy name will be the name of the file that you upload.</div>\n</div>\n</li>\n<li>Click the <strong>Save Policies</strong> button.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you're uploading multiple files, each file will process individually. Therefore, it may take some time for your policies to save.</div>\n</div>\n</li>\n</ol>\n<p>You can upload multiple policies at one time. Once you've uploaded policies to your account, you're ready to create a campaign.</p>\n<p><a name='LINKED'></a></p>\n<h3 id='h_01J8J4BN0310D5CTCPFABDF5Q7'>Linked Policies</h3>\n<p>If you would like to add a linked policy to your platform, you can add any link that meets the requirements below:</p>\n<ul role='list'>\n<li>The link must include one of the protocols below:\n<ul role='list'>\n<li>https://</li>\n<li>http://</li>\n<li>ftp://</li>\n<li>sftp://</li>\n<li>\\\\servername\\</li>\n<li>file:\\\\\\</li>\n<li>file://</li>\n</ul>\n</li>\n<li>The maximum character count for links is 2000 characters.</li>\n</ul>\n<p>To add a linked policy to your <strong>Policy Management</strong> module, follow the instructions below:</p>\n<ol role='list'>\n<li>From the navigation panel, navigate to <strong>Policy Management </strong>&gt; <strong>Policies</strong>.</li>\n<li>Click the <strong>Link Policies</strong> button. When you click this button, the <strong>Link Policies</strong> window will open. </li>\n<li>In the <strong>Display Name</strong> field, enter a display name for the policy. This name will be displayed in KCM GRC and in campaign notification emails.</li>\n<li>In the <strong>Link</strong> field, enter the link to the policy.</li>\n<li>(Optional) In the <strong>Version</strong> field, Enter the policy's version.</li>\n<li>(Optional) In the <strong>Description</strong> field, enter a description of the policy. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Policy%20Management/KCMPolicyMgmt_12.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM%20Policy%20Management/KCMPolicyMgmt_12.png' alt=' '></a>\n</li>\n<li>Click the <strong>Save Policies</strong> button. </li>\n</ol>\n<p>You can add up to five linked policies at one time. Once you've added policies to your account, you're ready to create a campaign. </p>\n<p><a name='THREE'></a></p>\n<h2 id='h_01J8J4BN03TXE3C9CTJNX8NT0G'>Step Three: Create Policy Campaigns</h2>\n<p>You can create policy campaigns to assign the policies you uploaded or linked to your users. To learn how to create a policy campaign, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4412197267603.html' target='_self'>Creating Campaigns</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4412197267603.html' target='_self'>How to Create and Manage Policy Campaigns</a> article.</p>\n<p><a name='MONITOR'></a></p>\n<h2 id='h_01J8J4BN033YFJKMSTZFZJ5T78'>Monitor and Manage Campaigns</h2>\n<p>After your policy campaign begins, you can monitor the campaign's policy acknowledgments.</p>\n<p>To learn how to monitor and manage a campaign, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4412197267603.html' target='_self'>Monitoring and Managing Campaigns</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4412197267603.html' target='_self'>How to Create and Manage Policy Campaigns</a> article.</p>\n<p><a name='EXPERIENCE'></a></p>\n<h2 id='h_01J8J4BN03T2E3YHJAD6X5RMNA'>User Experience</h2>\n<p>If you've added one or more notifications to a policy campaign, your users will receive an email with a link to review and acknowledge each policy. A unique link will be generated for each user and each policy that is included in the campaign. <span class='wysiwyg-color-red'></span></p>\n<p>Depending on the type of policy that you've included in your campaign, the user interface will look like one of the two examples below.</p>\n<p><a name='UPLOADED_2'></a></p>\n<h3 id='h_01J8J4BN03NWPHN2K6KA5N593X'>Uploaded Policy</h3>\n<p>If your campaign includes uploaded policies, your users will see the policy in a policy viewer. For an example of an uploaded policy that your users can see when they open a policy from a campaign notification email, see the picture below:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Uploaded+Policy+Example.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Uploaded+Policy+Example.png' alt='Uploaded Policy Example'></a></p>\n<p>In the policy viewer, your users can read the policy and select the <strong>I have read and understand the above policy</strong> check box. Then, to complete their policy acknowledgment, your users can click the <strong>Submit</strong> button.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>If you would like to add a custom logo to your KCM GRC account and your uploaded policies, you can upload your organization's logo in your Account Settings. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115016049347.html' target='_self'>How to Manage Your KCM GRC Account Settings</a> article.</div>\n</div>\n<p>Once the user clicks the <strong>Submit</strong> button, the user's status for this policy will change to <strong>Completed</strong>. You can review your users' statuses from the <strong>Users</strong> tab of the campaign <strong>View Campaign</strong> page. You can also view your users' statuses from the <strong>Reports</strong> tab of your navigation panel (<strong>Policy Management</strong> &gt; <strong>Reports</strong>). </p>\n<p><a name='LINKED_2'></a></p>\n<h3 id='h_01J8J4BN031C61BW14CJZJ04V4'>Linked Policy</h3>\n<p>For an example of a linked policy that your users can see when they open a policy from a campaign notification email, see the picture below:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Linked+Policy+Example.png'><img src='https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Linked+Policy+Example.png' alt='Linked Policy Example'></a></p>\n<p>When users receive the campaign notification email and click the policy link, the link will bring them to the screen above. This page instructs your users to click the link that you've included to the policy. Once your users have opened the link to the policy, they can select the <strong>I have read and understand the above policy</strong> check box. Then, to complete their policy acknowledgment, your users can click the <strong>Submit</strong> button.</p>\n<p>Once a user clicks the <strong>Submit</strong> button, the user's status for this policy will change to <strong>Completed</strong>. You can review your users' statuses from the <strong>Users</strong> tab of the <strong>View Campaign</strong> page. You can also view your users' statuses from the <strong>Reports</strong> tab of your navigation panel(<strong>Policy Management</strong> &gt; <strong>Reports</strong>). </p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360000727248-Policy-Management-Module-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Policy+Mgmt+Users+and+Groups.png",
      "alt": "",
      "position": 1,
      "context": "er information.\nFor more information, see the details below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM%20Policy%20Management/KCMPolicyMgmt_11.png",
      "alt": "This image displays a modal window titled **\"Upload Policies\"** designed for file submission and metadata assignment.\n\n**UI Elements and Interaction Areas:**\n\n1.  **File Input Area:** A large bordered box provides drag-and-drop functionality, with instructional text: \"Drop files here or click to upload.\"\n2.  **Accepted File Types:** Listed below the input area are the supported file extensions: `.png, .jpg, .jpeg, .gif, .bmp, .tif, .tiff, .txt, .pdf, .rtf, .eml, .msg, .csv, .doc, .docx, .xls, .xlsx, .ppt, .pptx`.\n3.  **Edit Uploaded Policies Section:** This section displays files that have been staged for upload. A single entry is present: `ExamplePolicy.pdf`.\n    *   Associated with the file are two text input fields:\n        *   Field 1 (Policy Description): Contains the text \"Annual Acceptable Use Policy\".\n        *   Field 2 (Version Identifier): Contains the text \"v1\".\n    *   An 'X' icon is available to the right of the input fields, allowing the user to remove the staged file.\n\n**Constraints and Limitations:**\n\n*   **Size Restriction (PDF):** \"Maximum size for PDF files is 50MB.\"\n*   **Size Restriction (Other):** \"Maximum size for all other files is 10MB.\"\n*   **File Name Length:** \"Maximum file name length is 250 characters.\"\n\n**Action Buttons (Footer):**\n\n*   **Clear Completed Uploads:** A red/orange button used to reset the staging area.\n*   **Save Policies:** A blue button used to finalize the upload and commit the policy data.",
      "position": 2,
      "context": "and drop files into the upload box, or click the upload box and select files."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM%20Policy%20Management/KCMPolicyMgmt_12.png",
      "alt": "This interface, labeled **\"Link Policies\"** at the top left, is a configuration grid presented within a modal dialog (indicated by a close icon 'X' in the top right corner).\n\nThe primary function of the screen is data entry, structured into a four-column input table. The column headers are:\n\n1.  **Display Name**\n2.  **Link**\n3.  **Version**\n4.  **Description**\n\nThe grid displays five visible rows of empty text input fields for the concurrent configuration of multiple policies.\n\nA primary action control, a blue rectangular button labeled **\"Save Policies\"**, is positioned in the bottom right corner of the interface.",
      "position": 3,
      "context": "In the Description field, enter a description of the policy."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Uploaded+Policy+Example.png",
      "alt": "",
      "position": 4,
      "context": "open a policy from a campaign notification email, see the picture below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KCM/KCM+Policy+Management/KCM_Linked+Policy+Example.png",
      "alt": "",
      "position": 5,
      "context": "y open a policy from a campaign notification email, see the picture below:"
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "management",
      "module"
    ],
    "image_count": 5
  }
}