{
  "id": 360019092633,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360019092633.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/360019092633.html",
  "author_id": 403968826754,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 23,
  "vote_sum": -2,
  "vote_count": 8,
  "section_id": 26429650317203,
  "created_at": "2019-02-28T19:40:02Z",
  "updated_at": "2025-06-02T19:18:26Z",
  "name": "Troubleshooting Uploaded Training Content",
  "title": "Troubleshooting Uploaded Training Content",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-06-02T19:18:26Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "SCORM Upload",
    "Uploaded Content",
    "Customer supplied content",
    "answerbot",
    "answerbot_kmsat"
  ],
  "body": "<p>KnowBe4's <a href='https://support.knowbe4.com/hc/en-us/articles/360019644394/'>Uploaded Content</a> feature allows you to upload custom training content (in SCORM or video format) so your users can take this training using KnowBe4's learner experience.</p>\n<p>If you are unable to fix the issue using the below information, we recommend you reach out to your e-learning authoring or publishing software's support team to identify what may be causing your particular issue.</p>\n<h2 id='h_01HS1SXGBWT4VY6R1MJ3JX4DY4'>Uploaded Content Requirements</h2>\n<p>Does your content meet the requirements listed on our <a href='https://support.knowbe4.com/hc/en-us/articles/360019644394/'>main instructional guide</a>? If you answer “No” to any of the questions below, please adjust your content to fit these requirements.</p>\n<h4 id='h_01HS1SXGBWFPH366SK75H9VGC7'>SCORM Packages</h4>\n<ul role='list'>\n<li>Is the file SCORM 2004 4th Edition?</li>\n<li>Is the file 1 GB or less? </li>\n<li>Does the content track completion with a Complete/Incomplete or Passed/Failed functionality?</li>\n<li>Content is included in the package and is not hosted on a third-party platform.</li>\n<li>The package only includes one language.</li>\n</ul>\n<h4 id='h_01HS1SXGBWAAEZZABY0PYT4Q0C'>Videos</h4>\n<ul role='list'>\n<li>Are you uploading a .mp4 file?</li>\n<li>Did you optimize your video for web streaming?</li>\n<li>Is the file 500 MB or less?</li>\n</ul>\n<h2 id='h_01HS1SXGBWS9HR1FJR7297Q3N1'>Problems During SCORM Validation Process<a name='AUTO'></a> </h2>\n<h3 id='h_01HS1SXGBW4F6X8GPGWZ70FE74'>Automated Verification Errors</h3>\n<p>After uploading SCORM content to your KnowBe4 console, that content is automatically verified to ensure it meets the initial compatibility requirements of KnowBe4's learner experience. If something causes the file to be rejected, an error message will display. See the table below for more information. </p>\n<p>If these troubleshooting steps don't resolve the issue, please contact support.</p>\n<table>\n<tbody>\n<tr>\n<td><strong>Error Message</strong></td>\n<td><strong>Troubleshooting</strong></td>\n</tr>\n<tr>\n<td>\"We were unable to convert your video to SCORM format. Please ensure your video meets our uploaded content requirements.\"</td>\n<td>\n<p>When uploading a video, it will be converted into a compatible SCORM file. This error occurs when a video file could not be converted.</p>\n<p>This error is typically caused by a corrupt video file. Please check that the video plays properly before uploading. If this video plays without issue before uploading it, try uploading the video again.</p>\n</td>\n</tr>\n<tr>\n<td>\"Video conversion was taking too long. Please try again or contact support.\"</td>\n<td>\n<p>When uploading a video, it will be converted into a compatible SCORM file which could take over an hour.</p>\n<p>This error indicates the conversion process was stopped. It could mean that the video was too long or that the video was incompatible with our conversion process. Try uploading the video again.</p>\n</td>\n</tr>\n<tr>\n<td>\"You are using an older version of SCORM that we do not support. Review our uploaded content requirements and try again.\"</td>\n<td>\n<p>Make sure that your file is SCORM 2004 4th Edition.</p>\n</td>\n</tr>\n<tr>\n<td>\"The imsmanifest.xml file was not found in the expected location. All associated files should be selected then zipped into an archive. Placing these files in an additional folder before zipping will change the file path.\"</td>\n<td>This error typically occurs if the SCORM package has been compressed incorrectly. Review the directory within the SCORM file and make sure it wasn’t saved in another folder before compressing.</td>\n</tr>\n<tr>\n<td>\"Your imsmanifest.xml file is invalid or could not be parsed.\"</td>\n<td>\"This error could be caused by a number of factors. Please contact support for troubleshooting assistance.</td>\n</tr>\n<tr>\n<td>\"Suspicious content was found in #{filename}. Please run a virus scan before attempting to upload content again.\"</td>\n<td>\n<p>During the automated verification, your file will be scanned for viruses. This error indicates a virus was found.</p>\n<p>Try running an anti-virus scan on your system, republish the file using your authoring tool, and upload it again.</p>\n</td>\n</tr>\n<tr>\n<td>\"The file type you attempted to upload is not supported. Please upload a SCORM file.\"</td>\n<td>Verify that the files you are uploading match the requirements <a href='#h_01HS1SXGBWT4VY6R1MJ3JX4DY4'>listed above</a>. If they do, please contact support for further assistance.</td>\n</tr>\n<tr>\n<td>\"The SCORM file you are uploading contains files with non-ASCII characters in their file names. Non-ASCII characters cannot be used in file names. Please rename your files and try again.\"</td>\n<td>Review the files within your SCORM package. Rename any files that use non-ASCII (American Standard Code for Information Interchange) characters.  </td>\n</tr>\n<tr>\n<td>\"Location Value Too Long: The provided value is longer than the maximum allowed size (255 characters)</td>\n<td>If your SCORM package tracks user progress by using the <strong>Location</strong> element, it may be recording too much data. In KSAT, the location value is limited to 255 characters. To track data that exceeds this limit, we recommend using the Suspend Data field.</td>\n</tr>\n</tbody>\n</table>\n<h3 id='h_01HS1SXGBWHB2S1GQRS81PSKCP'>Common Allowed Validation Errors</h3>\n<p>The following table provides a list of allowed error codes that you may see when adding a language file. We allow these error codes because they do not impact the SCORM package. They will not prevent you from approving your language file during the manual review and require no additional action.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>For information about other SCORM error codes, see the <a href='https://scorm.com/scorm-explained/technical-scorm/run-time/run-time-reference/#section-3' target='_self'>SCORM Run-Time Reference Chart for SCORM 1.2 and SCORM 2004</a>.</div>\n</div>\n<table>\n<tbody>\n<tr>\n<td>Error Message</td>\n<td>Description</td>\n</tr>\n<tr>\n<td>113 Termination After Termination</td>\n<td>Call to Terminate failed because Terminate was already called.</td>\n</tr>\n<tr>\n<td>133 Store Data After Termination</td>\n<td>Call to SetValue failed because it was made after the call to Terminate.</td>\n</tr>\n<tr>\n<td>403 Data Model Element Value Not Initialized</td>\n<td>Attempt to read a data model element that has not been initialized by the LMS or through a SetValue call. This error condition is often reached during normal execution of a SCO.</td>\n</tr>\n</tbody>\n</table>\n<h2 id='h_01HS1SXGBW7K5TZP723K8NZ563'>Manual Review Troubleshooting</h2>\n<p>If you're unable to complete the <strong>Manual Review</strong> steps, review your publishing and completion tracking settings, as well as the size of your file, and attempt to correct the issue.</p>\n<p>If you've republished or resized your file and your content is still not working, we recommend reaching out to your e-learning/authoring publishing software company for assistance.</p>\n<h4 id='h_01HS1SXGBWWTD092JA8PBGJ0GM'>My Video isn't Displaying as Expected</h4>\n<p>If your video is not working as expected, it could be because it wasn't optimized for web streaming.</p>\n<p>To optimize your video from within your Knowbe4 console, follow these steps:</p>\n<ol role='list'>\n<li>From the <strong>Manually Review File</strong> page, click the <strong>Optimize Video</strong> link on the bottom left. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/UploadedContent/ManuallyReviewFileVideo.png'><img src='https://helpimg.s3.amazonaws.com/UploadedContent/ManuallyReviewFileVideo.png' alt=' '></a>\n</li>\n<li>From the page that opens, click <strong>Start</strong> to begin the optimization process. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/UploadedContent/videooptimizing.png'><img src='https://helpimg.s3.amazonaws.com/UploadedContent/videooptimizing.png' alt=' '></a>\n</li>\n<li>This process could take an hour or more depending on the size of the video.</li>\n</ol>\n<h4 id='h_01HS1SXGBWV9CM512PMST0AGKS'>I Can Launch My File, but Can't Click the Manual Review Checkboxes</h4>\n<p>If you cannot click one or more of the checkboxes as part of your manual review process, this means your content did not pass our automated verification process. You'll need to review the publishing and completion settings, as well as the size of your file, and attempt to correct the issue. Delete your language file and try again with an updated file.</p>\n<h2 id='h_01HS1SXGBW7F3J9PQHY7TNYZKR'>User Issues With Uploaded Training</h2>\n<p>As a best practice, once your content is uploaded and published, you should enroll yourself in a training campaign to review the uploaded content within the KnowBe4 learner experience. When testing your content in this manner, you should also use a browser and operating system that the majority of your users will use. This allows you to mimic the conditions they will experience.</p>\n<p>If you experience issues when testing the training in the learner experience, the potential causes could include, but are not limited to:</p>\n<ul role='list'>\n<li>Browser extensions or applications\n<ul role='list'>\n<li>To test if this is the cause of your issue, we recommend attempting to test the training in a private window (Example: Incognito in Google Chrome, InPrivate Browsing in Internet Explorer) with all of your extensions turned off. You can then introduce them one by one until you determine which extension is causing the issue.</li>\n</ul>\n</li>\n<li>Browser compatibility and settings\n<ul role='list'>\n<li>We recommend using the latest version of a popular browser. Review our browser compatibility article <a href='https://support.knowbe4.com/hc/en-us/articles/204467478-What-Browser-Should-I-Use-'>here</a>.</li>\n</ul>\n</li>\n</ul>\n<h2 id='h_01HS1SXGBWRDMDAQ9DBNG1H4J8'>Additional Resources</h2>\n<p>Still need assistance? We recommend reaching out to your e-learning/authoring publishing software company for assistance. Below are links to various knowledge bases for some of these companies:</p>\n<ul role='list'>\n<li><a href='https://helpx.adobe.com/captivate/user-guide.html' target='_blank' rel='noopener'>Adobe Captivate</a></li>\n<li><a href='https://community.articulate.com/hubs/360' target='_blank' rel='noopener'>Articulate 360</a></li>\n<li><a href='https://community.articulate.com/hubs/storyline' target='_blank' rel='noopener'>Articulate Storyline</a></li>\n<li><a href='http://help.elucidat.com/' target='_blank' rel='noopener'>Elucidat</a></li>\n<li><a href='https://www.ispringsolutions.com/support/suite' target='_blank' rel='noopener'>iSpring Suite</a></li>\n<li><a href='https://h5p.org/documentation' target='_blank' rel='noopener'>H5P</a></li>\n<li><a href='https://www.shiftelearning.com/contact-us' target='_blank' rel='noopener'>Shift eLearning</a></li>\n<li><a href='https://www.smartbuilder.com/support/' target='_blank' rel='noopener'>SmartBuilder</a></li>\n<li><a href='https://www.techsmith.com/help.html' target='_blank' rel='noopener'>TechSmith Camtasia</a></li>\n<li><a href='https://www.trivantis.com/support-help/' target='_blank' rel='noopener'>Trivantis Lectora Inspira</a></li>\n</ul>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/360019092633-Troubleshooting-Uploaded-Training-Content",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/UploadedContent/ManuallyReviewFileVideo.png",
      "alt": "This image displays a User Interface (UI) element for the manual review and approval process of a language file, likely within the KnowBe4 training platform.\n\n**Header and Context:**\n*   **Title:** \"Manually Review File\" (accompanied by a magnifying glass icon).\n*   **Instructions:** \"Your language file must be reviewed to ensure it is compatible with the KnowBe4 learner experience. Click Launch File to review your file and check each of the following items:\"\n*   **Primary Action Button (Top Right):** A secondary button labeled \"Launch File\" is positioned above the checklist.\n\n**Review Checklist (Three Steps):**\nThe core section features three mandatory verification steps, each paired with a square, currently unchecked checkbox on the right side.\n1.  **Check 1:** \"Launch the file. Does the file start successfully?\"\n2.  **Check 2:** \"Continue reviewing the file. Is the time you've spent viewing the file indicated accurately?\"\n3.  **Check 3:** \"Finish reviewing the file and close the window. Does your status show as Complete?\" (This step includes the static text \"Incomplete\" adjacent to the checkbox, indicating the current status).\n\n**Footer and Final Actions:**\n*   **Help Links (Bottom Left):** A prompt reads, \"Video not displaying as expected?\" followed by two hyperlinked options: \"Optimize Video\" and \"Need help?\".\n*   **Final Submission Button (Bottom Right):** A solid blue, primary action button is labeled \"Approve File.\" This button is enabled, suggesting the file can be approved regardless of the checklist status shown in the image.",
      "position": 1,
      "context": "ile page, click the Optimize Video link on the bottom left."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/UploadedContent/videooptimizing.png",
      "alt": "The image displays a fragment of a web interface, likely a content management table, detailing localization and processing status.\n\n**Header Structure (Columns):**\n1.  Language\n2.  Status\n3.  Published At\n\n**Data Row 1:**\n*   **Language:** \"English - United States\" followed by a gray \"Default\" status badge.\n*   **Status:** A dark gray \"Draft\" status badge.\n*   **Published At:** Hyphen (-) indicating no publication date.\n*   **Action Links (Right):** \"Edit\" (active link) and \"Delete\" (inactive or secondary link).\n\n**Expanded Action Panel (Video Optimization):**\nBelow the data row is an expanded context panel for initiating a process.\n*   **Icon:** A blue settings/gear icon.\n*   **Title:** **Video Optimization** (Bold text).\n*   **Contextual Text:** \"Optimizing your video for web streaming could take an hour or more depending upon the size of the file.\"\n*   **Action Buttons (Right-aligned):**\n    *   **Cancel:** Secondary button (outlined in blue).\n    *   **Start:** Primary action button (solid blue fill, used to initiate the optimization process).",
      "position": 2,
      "context": "From the page that opens, click Start to begin the optimization process."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "content",
      "training",
      "troubleshooting",
      "uploaded"
    ],
    "image_count": 2
  }
}