{
  "article": {
    "id": 360013025854,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360013025854.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/360013025854.html",
    "author_id": 360322304667,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 26,
    "vote_count": 34,
    "section_id": 20416702417939,
    "created_at": "2018-12-03T20:50:05Z",
    "updated_at": "2025-11-11T18:29:20Z",
    "name": "Create and Manage PhishER Rules",
    "title": "Create and Manage PhishER Rules",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-10-24T19:39:20Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "certificate",
      "data entry",
      "course language",
      "clone",
      "company policy",
      "cyber hero",
      "earlybird",
      "cyberhero",
      "cyber heros",
      "cyber heroes",
      "How to Create an Action in PhishER",
      "How to Create a Rule in PhishER",
      "ADI",
      "contact support",
      "localized"
    ],
    "body": "<p>In your PhishER console, rules are logical expressions that allow you to automatically disposition and tag messages in your PhishER Inbox. The assigned tags trigger PhishER to run actions on the messages. You can create rules from the <strong>Rules</strong> tab. If you would like to create an action, see our <a href='https://support.knowbe4.com/hc/en-us/articles/13195730767635'>How to Create and Manage PhishER Actions</a> article.</p>\n<p>The <strong>Rules</strong> tab contains two types of rules: custom rules and system rules. Custom rules are rules that you can create by using the Yara Rule Editor. System rules are default rules provided by KnowBe4. The <strong>Rules</strong> tab also contains global variables, which are variables that you create to use in multiple rules with the same strings. By updating a global variable, you can update all of the rules that contain those strings.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>All PhishER rules must follow Yet Another Recursive/Ridiculous Acronym (YARA) rule logic to disposition messages. To learn more about writing YARA rules, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360013116053'>How to Write YARA Rules</a> article.</div>\n</div>\n<h2 id='h_01HJS7MXG7W45D60YF5G2N3W5T'>Creating Rules</h2>\n<p>You can create custom rules in your PhishER console to disposition messages that have been forwarded to your PhishER Inbox. To create your rules, you can use either the Basic Editor or the Advanced Editor. All custom rules must follow Yet Another Recursive/Ridiculous Acronym (<a href='https://yara.readthedocs.io/en/stable/' target='_blank' rel='noopener'>YARA</a>) logic. YARA is a tool used to identify and classify malware samples.</p>\n<p>To create a rule, follow the steps below:</p>\n<ol>\n<li>Log in to your PhishER console.</li>\n<li>From the sidebar on the left side of the page, select the <strong>Rules</strong> tab to open the <strong>Rules List</strong> page.</li>\n<li>Click the <strong>New Rule</strong> button at the top-right corner of the page to open the <strong>Rule Details</strong> page.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you want PhishER to automatically generate a rule based on a description of your needs, see the <a href='#h_01K7HEZY81WE0931JEXR54QBDJ'>Creating Rules Using the YARA Rule Generator</a> section.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_Name.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_Name.png' alt=' ' width='629' height='294'></a></p>\n</li>\n<li>In the <strong>Name</strong> field, enter a unique name for your rule. We recommend that you enter a name that briefly describes the function of the rule. The name cannot start with a numerical value, exceed 64 characters, or include any of the keywords listed in YARA's <a href='https://yara.readthedocs.io/en/v4.1.2/writingrules.html#id3' target='_blank' rel='noopener'>Writing YARA Rules</a> documentation.</li>\n<li>(Optional) In the <strong>Description</strong> field, enter a description of your rule. As a best practice, we recommend that you enter a description of the rule's intended function. The description cannot exceed 64 characters.</li>\n<li>In the <strong>Edit Tags:</strong> section, add a custom tag that you would like to see attached to a message if the message matches this specific rule. To add a tag, click Add new tag and enter a name for your tag. Then, click outside of the Add new tag field to create the tag.</li>\n<li>From the <strong>Choose target:</strong> drop-down menu, select the part of the message you would like the rule to be applied to or run on. The targets you can select are Raw, Headers, Body, or Attachments. By default, Raw will be selected.</li>\n<li>In the <strong>Yara Rule Editor</strong> section, write your rule using either the Basic Editor or the Advanced Editor. For more information, see the subsections below.</li>\n</ol>\n<h3 id='h_01HJS7MXG77M82295Q0T61VYBA'>Creating Rules Using the Basic Editor</h3>\n<p>The Basic Editor allows you to create a custom rule without writing all of the YARA rule logic. You can enter values for strings and select conditions for your rule, and the Basic Editor will process your input to create the rule logic for your rule. To learn how to create a rule using the <strong>Basic Editor</strong> tab, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/ruledetails_basiceditor.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/ruledetails_basiceditor.png' alt=' ' width='802' height='522'></a></p>\n<ol type='a'>\n<li>\n<strong> Basic Editor</strong>: Select this tab to display the options you can use to create a rule.</li>\n<li>\n<strong>Create Strings</strong>: Create and define strings to use when creating your conditions. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5635049737107'>How Do I Create Strings and Conditions in the Basic Editor?</a> article.</li>\n<li>\n<strong>New String</strong>: Click this button to add a string to the rule. You can create up to five strings per rule.</li>\n<li>\n<strong>Create Conditions</strong>: Create conditions by selecting how your defined strings should relate to each other. Conditions allow you to specify what messages you want your rule to affect. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5635049737107'>How Do I Create Strings and Conditions in the Basic Editor?</a> article. You can select from the following options:\n<ul>\n<li>\n<strong>Match any of the defined strings</strong>: Select this option to detect messages that match any of your defined strings.</li>\n<li>\n<strong>Match all of the defined strings</strong>: Select this option to detect messages that match all of your defined strings.</li>\n<li>\n<strong>Custom conditions</strong>: Select this option to detect messages that match your custom conditions.</li>\n</ul>\n</li>\n<li>\n<strong> New Condition Group</strong>: If <strong>Custom conditions</strong> is selected, you can click this button to create custom conditions that messages must meet to be affected by the rule.</li>\n<li>\n<strong>Save Rule</strong>: Click this button to save your rule. Your rule will display on the <strong>Rules List</strong> page under the <strong>Custom Rules</strong> subtab. After saving your rule, you can enable your rule by turning on the toggle under the rule's <strong>Status</strong> column. Then, click on the <strong>Apply Changes</strong> button in the top-right corner of the page.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/Rules_EnableApply.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/Rules_EnableApply.png' alt=' '></a></p>\n</li>\n<li>\n<strong>Apply Rule to Inbox</strong>: Click this button to run your rule against all of the messages in your Inbox. At least one message must match your rule and preview rule criteria for this option to become available.</li>\n</ol>\n<h3 id='h_01HJS7MXG7M51FQND3D927B9D5'>Creating Rules Using the Advanced Editor</h3>\n<p>The Advanced Editor allows you to write the logic of your YARA Rule without guidance. If you edit a rule in the Advanced Editor, the Basic Editor will be disabled for the rule. To learn about writing rules with YARA rule logic, see our How to Write YARA Rules article. To learn how to create a rule using the <strong>Advanced Editor</strong> tab, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/ruledetails_advancededitor.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/ruledetails_advancededitor.png' alt=' ' width='453' height='461'></a></p>\n<ol type='a'>\n<li>\n<strong> Advanced Editor:</strong> Select this tab to display the code block section where you can <a href='https://support.knowbe4.com/hc/en-us/articles/360013116053'>write a rule with YARA rule logic</a>.</li>\n<li>\n<strong>Save Rule</strong>: Click this button to save your rule. Your rule will appear on the <strong>Rules List</strong> page under the <strong>Custom Rules</strong> subtab. After saving your rule, you can enable your rule by turning on the toggle under the rule's <strong>Status </strong>column. Then, click on the <strong>Apply Changes</strong> button in the top-right corner of the page.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/Rules_EnableApply.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/Rules_EnableApply.png' alt=' '></a></p>\n</li>\n<li>\n<strong>Apply Rule to Inbox</strong>: Click this button to run your rule against all of the messages in the Inbox. At least one message must match your rule and preview rule criteria for this option to become available.</li>\n</ol>\n<h3 id='h_01K7HEZY81WE0931JEXR54QBDJ'>Creating Rules Using the YARA Rule Generator</h3>\n<p>The YARA Rule Generator allows you to create a custom rule by describing what you want the rule to do. You can enter the detection requirements for your rule, and the YARA Rule Generator will process your input to create the rule logic for your rule. To learn how to create a rule using the <strong>YARA Rule Generator</strong> tab, follow the steps below:</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>This feature is actively being enhanced and is only available for accounts with PhishER Plus. Rules that cause errors will be temporarily disabled.</div>\n</div>\n<p>To create a rule, follow the steps below:</p>\n<ol>\n<li>Log in to your PhishER console.</li>\n<li>From the sidebar on the left side of the page, select the <strong>Rules</strong> tab to open the <strong>Rules List</strong> page.</li>\n<li>Click the <strong>New AI Rule</strong> button at the top-right corner of the page to open the <strong>Rule Details</strong> page.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RulesList/EN/NewAIRuleButton.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RulesList/EN/NewAIRuleButton.png' alt=' ' width='363' height='149'></a></p>\n</li>\n<li>In the <strong>Describe your detection requirements</strong> field, enter a description of the rule you want to create.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RuleDetails/EN/RuleDetails_YaraRuleGenerator.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RuleDetails/EN/RuleDetails_YaraRuleGenerator.png' alt=' ' width='621' height='189'></a></p>\n</li>\n<li>Click <strong>Generate Rule</strong>. The YARA Rule Generator will convert your detection requirements into a PhishER rule with a name, description, tag, and complete YARA syntax.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RuleDetails/EN/GeneratedRuleExample_Ransomware.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RuleDetails/EN/GeneratedRuleExample_Ransomware.png' alt=' ' width='621' height='248'></a></p>\n</li>\n<li>You can edit the generated rule as needed. Then, click <strong>Save Rule</strong> to save your rule.</li>\n</ol>\n<h3 id='h_01HJS7MXG7CNW9ZKMB0SCCHTT4'>Previewing Rules</h3>\n<p>Before you save a new rule, we recommend previewing how the rule will affect your PhishER messages. To preview a rule, follow the steps below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_Preview.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_Preview.png' alt=' '></a></p>\n<ol>\n<li>Log in to your PhishER console.</li>\n<li>From the sidebar on the left side of the page, select the <strong>Rules</strong> tab to open the <strong>Rules List</strong> page.</li>\n<li>Click the <strong>New Rule</strong> button in the top-right corner of the page or select a rule on the <strong>Rules List </strong>page. When you click the <strong>New Rule</strong> button, the <strong>Rule Details</strong> page will open.</li>\n<li>Write or modify your YARA rule using the <strong>YARA Rule Editor</strong> section.</li>\n<li>Before saving your rule, click the <strong>Run Preview</strong> button. A list will display of all the messages in your Inbox that match your rule.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>PhishER will only check up to the last 1000 messages for a rule preview. If a message that matches the rule isn't within the last 1000 messages, it will not be included in the preview.</div>\n</div>\n</li>\n<li>You can update the preview list by modifying the following criteria options:\n<ul>\n<li>\n<strong>Saved Query </strong>(Optional): Choose a custom <a href='https://support.knowbe4.com/hc/en-us/articles/360013805414'>Saved Query</a> to see how the rule affects messages in that query.</li>\n<li>\n<strong>Last 7 days</strong>: Select a date range for the messages you would like to preview. The options are <strong>Last 24 hours</strong>, <strong>Last 7 days</strong>, and <strong>Last 30 days</strong>: By default, <strong>Last 7 days</strong> will be selected.</li>\n<li>\n<strong>Matched Messages</strong>: If you preview a rule, additional options will display to filter the messages in the preview list.</li>\n<li>\n<strong>Matched Messages</strong>(default): Select this option to only display messages in your PhishER <strong>Inbox</strong> that match the condition of the rule.</li>\n<li>\n<strong>Unmatched Messages</strong>: Select this option to only display messages in your PhishER <strong>Inbox</strong> that do not match the condition of the rule.</li>\n<li>\n<strong>All Messages</strong>: Select this option to display all messages in your PhishER <strong>Inbox</strong>. The <strong>Matched</strong> column will indicate if the message matched (true) or did not match (false) the rule.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/rulePreview-Matched.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/rulePreview-Matched.png' alt=' '></a></p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you would like to open a message displayed in the preview list, we recommend you open the message in a new tab to avoid losing your new rule.</div>\n</div>\n</li>\n<li>(Optional) If you would like to run this rule against all of the messages in the preview list, click the <strong>Apply Rule to Current Matches</strong> button.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_ApplyRuleToCurrentMatches.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_ApplyRuleToCurrentMatches.png' alt=' '></a></p>\n</li>\n</ul>\n</li>\n</ol>\n<h3 id='h_01HJS7MXG7H3J2712WTSS5A7H0'>Editing Rules</h3>\n<p>To edit a custom rule, click on the <strong>Name</strong> or <strong>Description</strong> of the rule from the <strong>Rules List</strong> page to open the <strong>Rule Details</strong> page. If you would like to edit a system rule, create a new custom rule. Then, copy and paste the logic of the system rule into the Yara Rule Editor of the custom rule. For more information about the system rules, read the <a href='#h_01HAQ11S5H50A17EQQ7E7Q9X9Y'>Using System Rules</a> section of this article.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>For all rule changes to be applied, you must click the <strong>Apply Changes</strong> button in the top-right corner of the <strong>Rules List</strong> page. Then, your rule will start to run against incoming messages. Messages that are already in your Inbox won't be affected by your rule.</div>\n</div>\n<h2 id='h_01HJS7MXG7WBV0DMQQWQ5K71MM'>Using Global Variables</h2>\n<p>From the <strong>Global Variables</strong> subtab of the <strong>Rules List</strong> page, you can create global variables or view the global variables you've created. If you use multiple rules with the same strings, you can use global variables to update all of these strings at once.</p>\n<p>You can include global variables in rules by using the Basic Editor or the Advanced Editor to create strings containing global variables. If you edit a global variable, the rule will be automatically updated in all the rules that include the global variable.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>You can create as many rules containing global variables as you would like. If you create and apply a rule containing global variables, that rule’s condition must be met before other rules can be run.</div>\n</div>\n<p>To create a global variable, follow the steps below:</p>\n<ol>\n<li>Log in to your PhishER console.</li>\n<li>From the sidebar on the left side of the page, select the <strong>Rules</strong> tab to open the <strong>Rules List</strong> page.</li>\n<li>Navigate to the <strong>Global Variables </strong>subtab.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/GlobalVariablesList.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/GlobalVariablesList.png' alt=' ' width='588' height='220'></a></p>\n</li>\n<li>Click the <strong>New Variable</strong> button at the top-right corner of the page. When you click this button, the <strong>Create Global Variable</strong> page will open.</li>\n<li>In the <strong>Name</strong> field, enter a name for the global variable.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/CreateGlobalVariable.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/CreateGlobalVariable.png' alt=' ' width='320' height='248'></a></p>\n</li>\n<li>In the <strong>Value</strong> field, enter a value for the global variable.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Global variables must meet the same requirements that apply to other variables and strings. The value cannot start with a numerical value, exceed 255 characters, or be one of the keywords listed in YARA's <a href='https://yara.readthedocs.io/en/v4.1.2/writingrules.html#id3' target='_blank' rel='noopener'>Writing YARA Rules</a> documentation.</div>\n</div>\n</li>\n<li>Click <strong>Save</strong> to save your global variable. The global variable will appear on the <strong>Rules List</strong> page under the <strong>Global Variables</strong> subtab.</li>\n</ol>\n<p>On the <strong>Rules List</strong> page, you can view information about the global variable, such as when the global variable was created and last updated. You can also edit a global variable’s value by clicking on the variable’s name to open the <strong>Edit Global Variable</strong> screen. The name of an existing global variable can’t be changed. If you would like to delete a global variable, click the trashcan icon.</p>\n<p>To learn how to create a rule using global variables, see our <a href='https://support.knowbe4.com/hc/en-us/articles/5635049737107'>How Do I Create Strings and Conditions in the YARA Rule Basic Editor?</a> article.</p>\n<h2 id='h_01HAQ11S5H50A17EQQ7E7Q9X9Y'>Using System Rules</h2>\n<p>Your PhishER console provides system rules to help you disposition and tag messages. From the <strong>System Rules</strong> subtab of the <strong>Rules List</strong> page, you can enable these rules for your PhishER console. By default, the system rules are disabled.</p>\n<p>For more information about system rules, view the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Rules/RulesList/EN/AllSystemRules.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Rules/RulesList/EN/AllSystemRules.png' alt=' '></a></p>\n<table>\n<thead>\n<tr>\n<th scope='col'>Rule Name</th>\n<th scope='col'>Rule Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<th scope='row'>KB4:COMMUNICATION</th>\n<td>This rule detects messages that contain common words for the Subject or From fields in phishing attempts that are about communication.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:NON_ENGLISH</th>\n<td>This rule detects messages that contain common words for the Subject or From fields in phishing attempts that are not in English.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:URGENCY</th>\n<td>This rule detects messages that contain common words for the Subject or From fields in phishing attempts that reflect urgency.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:SECURITY</th>\n<td>This rule detects messages that contain common words for the Subject or From fields in phishing attempts that are about security issues.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:SHIPPING</th>\n<td>This rule detects messages that contain common shipping words for the Subject or From fields in phishing attempts.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:FINANCIAL</th>\n<td>This rule detects messages that contain common financial words for the Subject or From fields in phishing attempts.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:BILLING</th>\n<td>This rule detects messages that contain common billing words for the Subject or From fields in phishing attempts.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:GENERAL</th>\n<td>This rule detects messages that contain common general words for the Subject or From fields in phishing attempts.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:BRANDS</th>\n<td>This rule detects messages that contain common brand words for the Subject or From fields in phishing attempts.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:419SCAM</th>\n<td>This rule detects messages that contain common words for the Subject or From fields in 419 scams (also known as Nigerian Prince scams).</td>\n</tr>\n<tr>\n<th scope='row'>KB4:KSAT_HEADERS_TRAINING</th>\n<td>This rule detects training notification messages that contain KnowBe4 headers.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:KSAT_HEADERS_PST</th>\n<td>This rule detects Phishing Security Test (PST) messages that contain KnowBe4 headers.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:SPF_PASS</th>\n<td>This rule detects messages that pass SPF checks.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:DKIM_PASS</th>\n<td>This rule detects messages that pass DKIM checks.</td>\n</tr>\n<tr>\n<th scope='row'>KB4:JAPANESE</th>\n<td>This rule detects messages that contain common words for the Subject or From fields in phishing attempts that are in Japanese.</td>\n</tr>\n</tbody>\n</table>\n<h2 id='h_01HTJKSHZSTK79321F9E6H410C'>QR Code Decoder Tags</h2>\n<p>The QR Code Decoder is a PhishER feature that operates in the background of your console to automatically scan for QR codes in reported emails. When the QR Code Decoder detects a QR code in the body of a message, it extracts the URL embedded in the QR code and assigns a tag to the message. The extracted URL will be displayed in the <strong>Domains and URLs</strong> tab on the <strong>Message Details</strong> page of your <a href='https://support.knowbe4.com/hc/en-us/articles/13169303385619'>PhishER Inbox</a>. For more information about the QR Code Decoder tags, view the list below:</p>\n<table>\n<thead>\n<tr>\n<th scope='col'>Tag Name</th>\n<th scope='col'>Tag Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<th scope='row'>QR_CODE_FOUND</th>\n<td>This tag is attached to a message when the QR Code Decoder detects a QR code in the body of the message.</td>\n</tr>\n<tr>\n<th scope='row'>QR_CODE_SCAN_FAILED</th>\n<td>This tag is attached to a message when the QR Code Decoder is unable to scan a message. For example, a scan will fail if a QR code does not contain an embedded URL.</td>\n</tr>\n</tbody>\n</table>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Currently, this feature can detect QR codes in the following file types: PDF, JPG, SVG, and GIF.</div>\n</div>\n<h2 id='h_01HJS7MXG7F13J5YK1RPD73M8Y'>Viewing the Rules List</h2>\n<p>The <strong>Rules List</strong> displays all of your rules and global variables. To learn more about the <strong>Rules List</strong> page, see the screenshot and list below.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/rulesList.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/rulesList.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Name</strong>: This column displays the name assigned to the rule.</li>\n<li>\n<strong>Description</strong>: This column displays a description of the rule.</li>\n<li>\n<strong>Rule Target</strong>: This column displays the part of a message the rule is run against. For example, the rule target could be the email header.</li>\n<li>\n<strong>Status</strong>: This column displays the current state of the rule. A rule can be enabled or disabled. To change the status of a rule, click the toggle.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>For a rule to run against messages in your PhishER Inbox, the rule must be enabled.</div>\n</div>\n</li>\n<li>\n<strong>Updated At</strong>: This column displays the date and time when the rule was last updated.</li>\n<li>\n<strong>Matched Count</strong>: This column displays the number of times the rule matched a message in your PhishER Inbox.</li>\n<li>\n<strong>Tags</strong>: This column displays all of the tags attached to a message. Tags will only be attached to a message if the message matches the rule.</li>\n<li>\n<strong>Filter by Status</strong>: Click this drop-down menu to select a filtered view of your enabled or disabled rules.</li>\n</ol>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360013025854-Create-and-Manage-PhishER-Rules",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_Name.png",
        "alt": "This technical manual describes a web UI dedicated to configuring detection rules, specifically YARA rules.\n\n**Screen Context:** Rule Details configuration page.\n\n**Header and Navigation:**\n*   **Title:** \"Rule Details\" (H1).\n*   **Navigation:** A square button containing a left arrow icon is located in the top right corner, serving as a back/exit control.\n*   **Metadata Display:** In the upper right section, the label \"Last Updated\" is displayed, followed by the current status: \"Never.\"\n\n**Rule Identification and Tagging Section:**\nThis section uses standard input fields:\n*   **Name:** Input field placeholder/label.\n*   **Description:** Input field placeholder/label.\n*   **Edit Tags:** Header for tag management. Below it, a clickable element displays a plus sign icon and the text \"Add new tag.\"\n\n**Rule Target Configuration:**\n*   **Label:** \"Choose target:\"\n*   **Target Selection:** A bordered dropdown element is selected, displaying the current target as a pill/tag labeled \"Raw.\"\n*   **Hint Text:** Contextual guidance is provided: \"Where should this rule be applied?\"\n\n**Rule Editor Section:**\n*   **Section Header:** \"Yara Rule Editor.\"\n*   **Editor Tabs:** Two distinct editor modes are presented as selectable tabs:\n    1.  **Basic Editor:** Currently selected and highlighted (orange text, orange underline).\n    2.  **Advanced Editor:** Unselected.",
        "position": 1,
        "context": "ating Rules Using the YARA Rule Generator section."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/ruledetails_basiceditor.png",
        "alt": "The image displays the \"Yara Rule Editor\" interface, set to the **Basic Editor** mode, divided into two primary configuration columns.\n\n**A. Editor Mode Selection:**\nThe header includes navigation tabs: **Basic Editor** (active) and **Advanced Editor**.\n\n**B. Left Column: Create Strings**\nThis section manages string definitions.\n*   **Context:** \"Create values for each string to use them when creating conditions.\"\n*   **Active String:** A field defines `$string_1 = \"spam\"`. An orange button featuring a globe icon is visible next to the string value input.\n*   **Action Button:** A solid orange button labeled **New String** is available for adding additional definitions.\n\n**C. Right Column: Create Conditions**\nThis section defines the logic for rule activation.\n*   **Context:** \"Create conditions by selecting how your defined strings should relate to each other...\"\n*   **Matching Options (Radio Buttons):** Three options are presented, with **Custom conditions** selected:\n    *   Match **any** of the defined strings\n    *   Match **all** of the defined strings\n    *   Custom conditions (Selected)\n*   **Custom Condition Input:** Displays \"Condition 1\" and a rule construction field: `( Choose string [dropdown] Add [button] )`.\n*   **Action Button:** A solid orange button labeled **New Condition Group** (with a dropdown indicator) allows for complex condition structuring.\n\n**D. Footer Actions:**\nTwo persistent action buttons are located at the bottom of the interface:\n*   Primary Action: **Save Rule** (Solid orange, active).\n*   Secondary Action: **Apply Rule to Inbox** (Light background, potentially disabled or secondary action state).",
        "position": 2,
        "context": "Editor tab, see the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/Rules_EnableApply.png",
        "alt": "This image depicts a Rule Management interface, showing a section of a data table and associated controls.\n\n**UI Elements and Controls:**\n\n*   **Action Buttons (Upper Right):**\n    *   **Apply Changes:** A primary, orange-filled button used to persist modifications. (Highlighted by an incoming orange arrow).\n    *   **New Rule:** A secondary, white-filled button with an orange outline, used for creating new rules.\n*   **Filtering Control:**\n    *   **Filter By Status:** A dropdown button with an orange outline, indicating the ability to filter the rule list.\n\n**Rule Data Table Structure:**\n\nThe table header defines six columns for rule configuration and performance metrics:\n\n1.  Rule Target\n2.  Status\n3.  Updated At\n4.  Matched Count\n5.  Tags\n6.  Actions\n\n**Data Rows (Example Content):**\n\nTwo example rows demonstrate rule states:\n\n*   **Row 1 (Active):**\n    *   Rule Target: Raw\n    *   Status: Active (Green toggle switch, ON position)\n    *   Updated At: Nov 16, 2022, 2:44 PM\n    *   Matched Count: 2403\n    *   Tags: NEWP (displayed in a light gray pill element)\n    *   Actions: Delete (Trash can icon)\n*   **Row 2 (Inactive):**\n    *   Rule Target: Raw\n    *   Status: Inactive (Gray toggle switch, OFF position)\n    *   Updated At: Jul 14, 2022, 10:16 AM\n    *   Matched Count: 0\n    *   Tags: TESTFOUND (displayed in a light gray pill element)\n    *   Actions: Delete (Trash can icon)",
        "position": 3,
        "context": "Apply Changes button in the top-right corner of the page."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/ruledetails_advancededitor.png",
        "alt": "This interface is the **Yara Rule Editor**, with the **Advanced Editor** tab currently selected.\n\n**UI Elements and Context:**\n\n1.  **Navigation (Top):** Two primary views, \"Basic Editor\" and the active \"Advanced Editor,\" are displayed. A circular UI element (labeled **a**) is positioned adjacent to the tabs.\n2.  **Code Editor:** The central element is a dark-themed code editor with visible line numbers (1 through 10). It contains a complete YARA rule named `default`.\n    *   **Strings Section:** Defines four strings: `$a = \"text1\"`, `$b = \"text2\"`, `$c = \"text3\"`, and `$d = \"text4\"`.\n    *   **Condition Section:** The rule condition is set as: `($a or $b) and (($c or $d) or #a > 4)`.\n3.  **Action Buttons (Bottom):**\n    *   **Save Rule** (Labeled **b**): Primary action button, highlighted in orange.\n    *   **Apply Rule to Inbox** (Labeled **c**): Secondary action button, presented with an outline.",
        "position": 4,
        "context": "itor tab, see the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/Rules_EnableApply.png",
        "alt": "This image depicts a Rule Management interface, showing a section of a data table and associated controls.\n\n**UI Elements and Controls:**\n\n*   **Action Buttons (Upper Right):**\n    *   **Apply Changes:** A primary, orange-filled button used to persist modifications. (Highlighted by an incoming orange arrow).\n    *   **New Rule:** A secondary, white-filled button with an orange outline, used for creating new rules.\n*   **Filtering Control:**\n    *   **Filter By Status:** A dropdown button with an orange outline, indicating the ability to filter the rule list.\n\n**Rule Data Table Structure:**\n\nThe table header defines six columns for rule configuration and performance metrics:\n\n1.  Rule Target\n2.  Status\n3.  Updated At\n4.  Matched Count\n5.  Tags\n6.  Actions\n\n**Data Rows (Example Content):**\n\nTwo example rows demonstrate rule states:\n\n*   **Row 1 (Active):**\n    *   Rule Target: Raw\n    *   Status: Active (Green toggle switch, ON position)\n    *   Updated At: Nov 16, 2022, 2:44 PM\n    *   Matched Count: 2403\n    *   Tags: NEWP (displayed in a light gray pill element)\n    *   Actions: Delete (Trash can icon)\n*   **Row 2 (Inactive):**\n    *   Rule Target: Raw\n    *   Status: Inactive (Gray toggle switch, OFF position)\n    *   Updated At: Jul 14, 2022, 10:16 AM\n    *   Matched Count: 0\n    *   Tags: TESTFOUND (displayed in a light gray pill element)\n    *   Actions: Delete (Trash can icon)",
        "position": 5,
        "context": "Apply Changes button in the top-right corner of the page."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RulesList/EN/NewAIRuleButton.png",
        "alt": "The image displays a segment of a user interface management screen, focusing on primary action buttons and a data filter control.\n\n**UI Elements and Text:**\n\n1.  **Action Buttons (Top Tier):** Three horizontal buttons are present for configuration actions:\n    *   **Apply Changes:** A primary action button with a solid orange background and white text, indicating a saving or confirmation function.\n    *   **New Rule:** A secondary action button with an outlined white background and orange text.\n    *   **New AI Rule:** A secondary action button, identically styled to \"New Rule\" but highlighted by a prominent red bounding box. This button is used to initiate the creation of a rule utilizing Artificial Intelligence.\n\n2.  **Filter Control (Lower Tier):**\n    *   **Filter By Status:** A dropdown menu control (outlined white with orange text) positioned below the main action buttons. It includes a downward-pointing chevron ($\\downarrow$), confirming its function as a filtering selector for rule status.",
        "position": 6,
        "context": "ht corner of the page to open the Rule Details page."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RuleDetails/EN/RuleDetails_YaraRuleGenerator.png",
        "alt": "This image displays a user interface (UI) for managing a detection rule, specifically leveraging a YARA Rule Generator.\n\n**Header and Actions:**\nThe page title is **\"Rule Details\"**. In the top right corner, there are two primary action buttons:\n1. An orange, squared button containing a left arrow icon, acting as a back or navigation control.\n2. A red button labeled **\"Delete Rule\"**, indicating a destructive action.\n\n**Contextual Information Panel (Alert Box):**\nBelow the title is a light-blue informational box, bordered on the left by a vertical blue line. The text content is:\n\"The YARA Rule Generator converts your detection requirements into PhishER rules with complete YARA syntax. You can manually refine any generated rule. This feature is actively being enhanced, and rules that cause errors will be temporarily disabled.\"\n\n**Rule Generation Input Section:**\nA white container box is dedicated to defining the rule generation request.\n*   **Header:** **\"Describe your detection requirements\"**\n*   **Input Field:** A single-line text input box containing the placeholder or pre-filled text: \"Create a yara rule that identifies ransomware behavior\"\n*   **Action Button:** To the right of the input field is an orange button labeled **\"Generate Rule\"**.\n\n**Context:** The interface facilitates the creation of YARA-based detection rules using natural language processing (NLP) or descriptive requirements, likely integrated into a PhishER platform.",
        "position": 7,
        "context": ", enter a description of the rule you want to create."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishER/Rules/RuleDetails/EN/GeneratedRuleExample_Ransomware.png",
        "alt": "This image displays the **Rule Details** configuration interface for a security detection system, specifically editing a YARA rule.\n\n**UI Structure and Metadata:**\n\n*   The interface is headed by **\"Rule Details\"** in the top-left, with a return arrow button located in the top-right corner.\n*   The status panel shows **\"Last Updated: Never\"**.\n*   Editable fields include:\n    *   **Name:** Contains the string `email_behavior_ransomware_indicators_ym1kf`.\n    *   **Description:** Contains the text `Detects common ransomware behavioral indicators in email communications`.\n    *   **Edit Tags:** A tagging input field containing one tag chip, `RANSOMWARE_BEHAVIOR`, alongside an `ADD NEW TAG` prompt.\n*   **Choose target:** A dropdown menu is present, currently set to **\"Raw\"**, with an accompanying prompt, `Where should this rule be applied?`.\n\n**Rule Editor:**\n\n*   The section is labeled **\"Yara Rule Editor\"**, confirming the format.\n*   Two navigation tabs are available: **Basic Editor** (highlighted in orange, indicating the active view) and **Advanced Editor**.\n*   A dark-themed code editor with line numbering (1 through 10+) displays the rule content. Key lines visible include:\n    *   Documentation stating the rule identifies potential ransomware behavioral indicators in email communications.\n    *   Comment sections identifying **\"Meta Section\"** and **\"Strings Section\"**.\n    *   A comment line in the Strings Section reads: `- Payment indicators: Detects cryptocurrency-related payment demands common in ransomware`.",
        "position": 8,
        "context": "a name, description, tag, and complete YARA syntax."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_Preview.png",
        "alt": "The image displays a \"Rule Preview\" configuration interface, centered within a bordered panel.\n\n**Heading and Controls:**\nThe section title is displayed as **Rule Preview**. Below the title is a control panel featuring three dropdown menus and one primary action button:\n\n1.  **Dropdown 1 (Saved Query):** Labeled **Saved Query (optional)**. This control allows selection of a predefined query filter.\n2.  **Dropdown 2 (Time Range):** Labeled **Last 7 Days**. This control defines the temporal range for the preview execution.\n3.  **Action Button (Run):** A rectangular orange button labeled **Run Preview**. This serves as the execution control for starting the rule preview.\n4.  **Dropdown 3 (Result Filter):** Located on the right margin, labeled **Matched Messages**. This control likely filters or selects the type of results to display post-execution.\n\n**Status and Instruction:**\nCentered below the controls, a placeholder instruction is displayed in light gray text: **Run a preview to see results**.",
        "position": 9,
        "context": "To preview a rule, follow the steps below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/rulePreview-Matched.png",
        "alt": "This image displays a column excerpt from a user interface table, likely a data grid or list view.\n\n**UI Elements and Structure:**\nThe structure is a single column, vertically separated by thin, light gray horizontal lines (dividers). All text is aligned centrally within the column.\n\n**Text Content and Context:**\n1. **Column Header:** The header text at the top is **\"Matched\"** (darker gray, bold/larger font indicating a column title).\n2. **Data Rows (Bools):** Below the header are three data rows presenting boolean values:\n    * Row 1: **\"False\"**\n    * Row 2: **\"True\"**\n    * Row 3: **\"True\"**\n\nThe excerpt indicates the status of three distinct items regarding whether they meet a specified \"Matched\" condition.",
        "position": 10,
        "context": "if the message matched (true) or did not match (false) the rule."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Documentation/RulesandActions/RuleDetails_ApplyRuleToCurrentMatches.png",
        "alt": "This image is a screenshot of a user interface section titled **\"Rule Preview,\"** displaying the results of a potential rule execution.\n\n**UI Elements and Controls:**\n\n*   **Filters (Top):** Two primary dropdown menus are visible: **\"Saved Query (optional)\"** and **\"Last 7 Days\"** (a time range selector).\n*   **Action Button (Top Right):** An orange button labeled **\"Run Preview\"** is used to execute the query based on the selected filters.\n*   **Results Summary:** The text **\"1-2 of 2\"** indicates that two records match the current rule criteria and are displayed below.\n\n**Data Table:**\n\n*   **Column Headers:** The table includes four columns: **Category, From** (sender/source), **Subject,** and **Reported At.** The **Reported At** column includes a downward arrow icon, indicating it is the currently active sort column.\n*   **Data Entries (2 Rows):** Both visible entries show a green label in the Category column labeled **\"Clean.\"** The Subject line for both is **\"TN Test Email 04.\"** Timestamps are **\"Feb 16, 2023, 4:02 PM\"** and **\"Feb 16, 2023, 4:00 PM.\"** (The 'From' field is intentionally blurred.)\n\n**Primary Action:**\n\n*   **Action Button (Bottom):** A prominent, large orange button at the bottom of the interface is labeled **\"Apply Rule to Current Matches.\"**\n*   **Annotation:** A thick orange arrow points directly toward the **\"Apply Rule to Current Matches\"** button, indicating it is the targeted element of the capture.",
        "position": 11,
        "context": "Apply Rule to Current Matches button."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/GlobalVariablesList.png",
        "alt": "This image displays the **Rules List** configuration interface, specifically detailing the **Global Variables** section.\n\n**UI Elements and Context:**\n\n1.  **Header:** The main title is **Rules List**.\n2.  **Action Button:** A button labeled **New Variable**, outlined in orange, is positioned in the top right corner, indicating the function to create a new entry.\n3.  **Tab Navigation:** A navigation component organizes the view into three primary categories:\n    *   Custom Rules (Inactive)\n    *   System Rules (Inactive)\n    *   Global Variables (Active/Selected, indicated by orange highlighting).\n\n**Data Table (Global Variables):**\n\nThe active view displays a list of global variables organized in a table with the following headers:\n\n*   **Name**\n*   **Value**\n*   **Created At**\n*   **Updated At**\n\n**Data Entry:**\n\nOne variable entry is visible:\n\n| Name | Value | Created At | Updated At | Actions |\n| :--- | :--- | :--- | :--- | :--- |\n| Tester | Testbgg | Jul 27, 2022 at 3:12 PM | Jul 27, 2022 at 3:39 PM | Trashcan icon (Delete) |\n\nThe rightmost column contains a **trashcan icon**, representing the action control for deleting the respective variable entry.",
        "position": 12,
        "context": "li>\nNavigate to the Global Variables subtab."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/CreateGlobalVariable.png",
        "alt": "This image displays a modal dialog or form titled **\"Create Global Variable.\"**\n\n**Header:**\n*   The title bar contains the text **\"Create Global Variable\"** preceded by an orange circle icon featuring a white plus sign (+).\n\n**Form Fields:**\nThe form requires input for two parameters:\n1.  **Name:** Labeled in bold text. The corresponding input box contains the placeholder text **\"Name of the Global Variable.\"**\n2.  **Value:** Labeled in bold text. The corresponding input box contains the placeholder text **\"Value of the Global Variable.\"**\n\n**Action Buttons:**\nAt the bottom right of the form, there are two action buttons:\n1.  **Cancel:** A white button with black text (secondary action).\n2.  **Save:** An orange button with white text (primary action).",
        "position": 13,
        "context": "trong>Name field, enter a name for the global variable."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Rules/RulesList/EN/AllSystemRules.png",
        "alt": "The image displays a \"Rules List\" management interface, specifically showing the \"System Rules\" tab.\n\n**Header and Controls:**\n*   The page title is \"Rules List.\"\n*   A primary action button, \"New Rule,\" is located in the upper right corner.\n*   The control area features a search input field labeled \"Search...\" on the left.\n*   A \"Filter By Status\" dropdown menu is available on the right.\n*   Below the search bar, three navigation tabs are visible: \"Custom Rules,\" **\"System Rules\" (currently active)**, and \"Global Variables.\"\n\n**Data Table Structure:**\nThe system rules are displayed in a detailed table format with the following seven columns:\n1.  **Name:** (e.g., KB4:COMMUNICATION, KB4:NON\\_ENGLISH)\n2.  **Description:** Provides context on the rule's purpose (e.g., \"Commonly used Subject/From names for Communication related phishing attempts\").\n3.  **Rule Target:** Specifies where the rule applies (e.g., Headers or Body).\n4.  **Status:** A toggle switch indicating if the rule is active (green/ON) or inactive (gray/OFF).\n5.  **Updated At:** Displays the last modification timestamp (e.g., Nov 8, 2023, 9:37 AM).\n6.  **Matched Count:** A numeric tally of times the rule has matched criteria (e.g., 23 or 0).\n7.  **Tags:** Pill-shaped labels providing quick categorization (e.g., KB4:COMMUNICATION).\n\n**Sample Data Details:**\n*   Most rules are currently inactive (Status OFF).\n*   The first entry, **KB4:COMMUNICATION**, is active (Status ON) and shows a **Matched Count of 23**.\n*   The \"Rule Target\" is predominantly \"Headers,\" but the last visible entry (**KB4:JAPANESE**) targets the \"Body.\"\n\n**Pagination:**\n*   The lower left footer displays a \"Page Size\" control, currently set to **25** items per page.\n*   The lower right corner shows pagination controls, indicating that page **1** is currently active.",
        "position": 14,
        "context": "For more information about system rules, view the screenshot and list below:"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/rulesList.png",
        "alt": "This interface displays the **Rules List** management view, with the **System Rules** tab currently selected.\n\n**UI Elements and Functionality:**\n\n*   **Header:** The page title is \"Rules List.\" A primary action button, \"New Rule,\" is located in the top right corner.\n*   **Navigation Tabs:** Three tabs allow switching between rule scopes: \"Custom Rules,\" the active \"System Rules,\" and \"Global Variables.\"\n*   **Filtering:** A **Search** text box is available on the left, and a **Filter By Status** dropdown (labeled 'h') is on the right.\n\n**System Rules Table Structure (Active View):**\n\nThe rules are presented in a table format with the following columns:\n1.  **Name (a)**\n2.  **Description (b)**\n3.  **Rule Target (c)**\n4.  **Status (d)** (Controlled by a toggle switch)\n5.  **Updated At (e)**\n6.  **Matched Count (f)**\n7.  **Tags (g)**\n\n**Displayed Data Rows:**\n\n1.  **Rule 1:** Name `KB4:COMMUNICATION`, Description relates to \"Subject/From names for Communication related phishing attempts,\" Target is `Headers`. The **Status** toggle is **ON** (active/green). Last updated `Dec 9, 2021, 3:22 PM`. Matched Count is `0`.\n2.  **Rule 2:** Name `KB4:URGENCY`, Description relates to \"Subject/From words to reflect urgency in related phishing attempts,\" Target is `Headers`. The **Status** toggle is **OFF** (inactive/gray). Last updated `Dec 9, 2021, 3:22 PM`. Matched Count is `0`.",
        "position": 15,
        "context": "he Rules List page, see the screenshot and list below."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "and",
        "manage",
        "phisher",
        "rules"
      ],
      "image_count": 15
    }
  }
}