{
  "article": {
    "id": 36630765844115,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/36630765844115.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/36630765844115.html",
    "author_id": 30877384316947,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 4,
    "vote_count": 4,
    "section_id": 26420669305107,
    "created_at": "2024-12-20T17:41:35Z",
    "updated_at": "2025-11-25T21:47:35Z",
    "name": "False-Positive Phishing Evasion Settings",
    "title": "False-Positive Phishing Evasion Settings",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-25T21:47:35Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot",
      "answerbot_ksat"
    ],
    "body": "<p>In this article, you will learn about the <strong>False-Positive Phishing Evasion</strong> settings in the <a href='https://support.knowbe4.com/hc/en-us/articles/12732930359699-KnowBe4-Console-Account-Settings-Phishing'><strong>Phishing</strong></a> section of your KSAT console’s <strong>Account Settings</strong>. If you are running a phishing campaign and see unusual results, you may be experiencing false clicks. When reviewing campaign results, if you see a 100 percent click rate or IP addresses that don't belong to your organization, this can indicate false positives. The <strong>False-Positive Phishing Evasion</strong> settings can minimize incidences of false positives, giving you more accurate phishing campaign results. For more information about bot clicks, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360059091413-Identify-and-Address-False-Positives#h_01HBVJBX3Q8HQQHBG2TN86YJPR'><strong>How to Identify Bot Clicks</strong></a> section of our <strong><a href='https://support.knowbe4.com/hc/en-us/articles/360059091413-Identify-and-Address-False-Positives'>Identify and Address False Positives</a></strong> article.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>False-Positive Phishing Evasion settings are not meant to replace proper whitelisting. These settings are meant to be used as a tool to help with false positives along with whitelisting. You still need to troubleshoot false positives to confirm proper whitelisting. For more information on setting up whitelisting in your KSAT console, please consult our <a href='https://support.knowbe4.com/hc/en-us/articles/203645138-Whitelisting-Guide'>Whitelisting Guide</a>.</div>\n</div>\n<p>False positives in phishing simulations often stem from improper whitelisting practices, link scanner interference, or incorrectly configured security policies. To minimize these issues, ensure your spam filters are properly set up to exclude KnowBe4 phishing emails from link scanning and probing activities.</p>\n<p>Verify that smart hosts and advanced delivery policies align with your campaign settings. When investigating false positives triggered by link scanners, review your whitelisting configurations and collaborate with IT admins to confirm that security settings meet organizational standards while reducing false-positive occurrences.</p>\n<h2 id='h_01JFJKWPQCJ2N3C6H3QTM3NK9A'>Enabling False-Positive Phishing Evasion Settings</h2>\n<p>We refer to phishing failures not caused by a user clicking a phishing link as false positives. If not resolved, false positives can cause phishing campaign results in your <strong>Phishing Security Test Reports</strong> to be inaccurate.</p>\n<p>False-positive phishing evasion works by tracking when a hidden link in a sent Phishing Security Test (PST) is accessed. Phishing failures that occur after this hidden link is accessed are flagged and ignored if they occur within the configured <strong>Duration for Ignored Bot Failures</strong>. In addition, IP addresses for bot-associated failures and actual phishing test failures are compared by configuring the <strong>IP Address Match for Ignored Bot Failures</strong> setting.</p>\n<p>You can enable and customize the <strong>False-Positive Phishing Evasion</strong> settings in the <strong>Phishing</strong> section of <strong>Account Settings</strong>. See the below screenshots and list for more information about the settings in this section:</p>\n<ol>\n<li>\n<strong>Ignore Bot-Associated Phishing Failures</strong>: Select this check box to ignore bot-associated phishing failures that occur soon after a hidden link is accessed. When this setting is enabled, the <strong>Duration for Ignored Bot Failures</strong> and <strong>IP Address Match for Ignored Bot Failures</strong> options will appear.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/False_Positives_AcctSettings1.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/False_Positives_AcctSettings1.png' alt=''> </a></p>\n</li>\n<li>\n<strong>Duration for Ignored Bot Failures</strong>: Here, you can select the amount of time after a hidden link is accessed that subsequent bot-associated phishing failures are to be ignored. The selections available are <strong>Conservative (5 sec)</strong>, <strong>Balanced (10 sec)</strong>, and <strong>Inclusive (30 sec)</strong>.</li>\n<li>\n<strong>IP Address Match for Ignored Bot Failures</strong>: You can select match criteria to ignore bot-associated phishing failures based on the IP address of the hidden link being accessed compared to the IP address of potential bot-associated phishing failures. The selections are <strong>No Match</strong>, <strong>First Two Octets</strong>, and<strong> Exact Match</strong>. The <strong>First Two Octets</strong> option will match IP addresses based on their Class B network identifier. For example, if the IP address is 54.70.53.60, it will look for IP addresses within the 54.70.0.0/16 subnet.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FalsePositives_AccountSettings2.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FalsePositives_AccountSettings2.png' alt=''> </a></p>\n</li>\n</ol>\n<h2 id='h_01JFJM5G98XDGM394C142H04D7'>How to View Details of Ignored Bot-Associated Phishing Failures</h2>\n<p>After you have enabled the <strong>Ignore Bot-Associated Phishing Failures</strong> setting, ignored failures on your phishing tests can be viewed in the <strong>Users </strong>&gt;<strong> Ignored Failures</strong> page on your phishing campaigns.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>The <strong>Ignored Failure</strong> tab will only show if there were failures ignored during the phishing campaign.</div>\n</div>\n<p>See the below screenshot and list for an explanation of the data located in this section:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Header_Annotated.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Header_Annotated.png' alt=''> </a></p>\n<ol>\n<li>\n<strong>Name and Email</strong>: This column displays the name and email address of the ignored bot-associated failure.</li>\n<li>\n<strong>Date and Time</strong>: This column displays the date and time of the ignored bot-associated failure.</li>\n<li>\n<strong>Bot Event Interval</strong>: This column displays the amount of time in seconds after a hidden link was accessed that subsequent bot-associated phishing failures were ignored.</li>\n<li>\n<strong>Ignored Failure Type</strong>: This column displays the type of ignored bot-associated failure, in this case, “Clicked.”</li>\n<li>\n<strong>IP Address</strong>: This column displays the IP address of the ignored bot-associated failure.</li>\n<li>\n<strong>Browser</strong>: This column displays the browser used by the bot-associated failure, such as Chrome.</li>\n<li>\n<strong>Browser Version</strong>: This column displays the browser version used by the bot-associated failure.</li>\n<li>\n<strong>OS</strong>: This column displays the operating system used for the bot-associated failure, such as Mac.</li>\n<li>\n<strong>Bot Events</strong>: This column displays the number of ignored failures for this user. Note that this counter stops at 5, and additional bot events won't update the rest of this row data. You'll see “5+” in the <strong>Bot Events</strong> column when this event occurs.</li>\n<li>\n<strong>Convert to Campaign Failure (trashcan icon)</strong>: When you select this icon, the console will convert ignored bot failures to phishing campaign failures. More information about how this feature works is explained below.</li>\n<li>\n<strong>Preview (envelope icon)</strong>: This icon, when selected, will show you a preview of the phishing campaign email.</li>\n</ol>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>There is an 18-month retention period for ignored failures data.</div>\n</div>\n<h2 id='h_01JFJMNGQZJP6KGTC4PHV0F9X0'>How to Convert Ignored Failures to Actual Failures</h2>\n<p>You can convert ignored bot failures to actual phishing campaign failures if you believe a false negative has occurred. If you believe a user has failed a phishing test and the console shows an ignored failure event and not a phishing failure, then you can convert the ignored bot failure to a phishing campaign failure.</p>\n<p>To complete this conversion process, follow the steps below:</p>\n<ol>\n<li>In your KSAT console, go to <strong>Phishing &gt; Campaigns,</strong> then select your phishing campaign.</li>\n<li>Navigate to <strong>Users</strong>.</li>\n<li>At the right side of the <strong>Users</strong> section, click <strong>Ignored Failure</strong>.</li>\n<li>When you see an ignored failure you would like to convert to an actual phishing failure, click the <strong>trashcan</strong> icon on the right side of the screen.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Arrow1.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Arrow1.png' alt=''> </a></p>\n</li>\n<li>You will be asked if you want to convert the bot event to a campaign failure, as you cannot undo this action.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Confirm.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Confirm.png' alt=''> </a></p>\n</li>\n<li>Click the <strong>Confirm</strong> button.</li>\n<li>An ignored failure can only be converted to a phishing failure once. The <strong>trashcan</strong> icon will be greyed out after the ignored failure is converted to a phishing failure.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Converted.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Converted.png' alt=''> </a></p>\n</li>\n<li>The <strong>Ignored Failure Type</strong> will be visible after it is converted to a phishing failure. For example, in the screenshot below, the <strong>Ignored Failure Type</strong> is a Clicked type failure.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_+Ignored_Failure_Type_Clicked.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_+Ignored_Failure_Type_Clicked.png' alt=''> </a></p>\n</li>\n</ol>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/36630765844115-False-Positive-Phishing-Evasion-Settings",
    "images": [
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/False_Positives_AcctSettings1.png",
        "alt": "This image displays a configuration panel section titled **\"Phishing Email Headers\"**. The panel contains six security configuration options presented as a list, each accompanied by a help icon (a gray question mark in a circle).\n\n**UI Elements and State:**\n\n1.  **Overwrite Fixed Return-path Address with Sender Address:** Checkbox (Unchecked).\n2.  **Disable X-PHISHTEST Header:** Checkbox (Unchecked).\n3.  **Enable PST Header Token:** Toggle Switch (Disabled/Off – indicated by light gray position).\n4.  **Add Custom Header:** Checkbox (Unchecked).\n5.  **Enable DKIM Signature:** Toggle Switch (Disabled/Off – indicated by light gray position).\n\n**Highlighted Section (Orange Box):**\n\nThe final configuration subsection is visually emphasized with an orange border and titled **\"False-Positive Phishing Evasion.\"**\n\nThis subsection contains one setting:\n\n6.  **Ignore Bot-Associated Phishing Failures:** Checkbox (Unchecked).",
        "position": 1,
        "context": ">IP Address Match for Ignored Bot Failures options will appear."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FalsePositives_AccountSettings2.png",
        "alt": "This image displays a User Interface (UI) configuration panel dedicated to **False-Positive Phishing Evasion** settings. The panel presents three distinct configuration areas, identified numerically:\n\n1.  **Bot Failure Ignore Toggle:** A configuration option controlled by a checked checkbox labeled **\"Ignore Bot-Associated Phishing Failures,\"** indicating that the feature is currently active. A help icon (?) is present next to the label.\n\n2.  **Duration Setting (Segmented Control):** A segmented control menu labeled **\"Duration for Ignored Bot Failures.\"** Three predefined time options are available:\n    *   Conservative (5 sec)\n    *   **Balanced (10 sec)** (Selected/Active)\n    *   Inclusive (30 sec)\n\n3.  **IP Address Match Setting (Segmented Control):** A segmented control menu labeled **\"IP Address Match for Ignored Bot Failures.\"** Three matching criteria are available:\n    *   No Match\n    *   **First Two Octets** (Selected/Active)\n    *   Exact Match\n\nBelow the main settings, a hyperlink for documentation is present, preceded by a book/guide icon, reading **\"View Our False-Positive Phishing Evasion Guide.\"**",
        "position": 2,
        "context": "0.53.60, it will look for IP addresses within the 54.70.0.0/16 subnet."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Header_Annotated.png",
        "alt": "This image displays a data tracking interface, likely for an email campaign or penetration test, structured into an **Overview/Users** tab system and a detailed performance dashboard.\n\n**I. Top Navigation and Summary Dashboard:**\n\n1.  **Tabs:** Two tabs are visible: \"Overview\" (selected via blue text underline) and \"Users\" (selected via light gray background).\n2.  **Performance Metrics (Horizontal Bar/Cards):** A set of twelve vertical data columns summarize campaign interaction, color-coded at the top to indicate status (e.g., green/blue for successful metrics, red for engagement, gray/dark blue for failures).\n    *   **Metrics Listed:** Recipients (10), Delivered (10, 100%), Opened (4, 40%), Clicked (1, 10%), QR Code Scanned (0, 0%), Replied (0, 0%), Attachment Opened (0, 0%), Macro Enabled (0, 0%), Data Entered (0, 0%), Reported (0, 0%), Bounced (0, 0%), and Ignored Failure (3, 30%).\n    *   The **Ignored Failure** column is highlighted in dark blue/gray and includes a downward-pointing arrow, suggesting it is a current focal point or contains expanded details below.\n\n**II. Detailed User Table (with Annotations):**\n\nBelow the summary, a table lists individual user interaction data, featuring eleven labeled columns, some with numerical annotations (1 through 11) for instructional purposes:\n\n| Column Header | Example Data (Row 1) | Annotation | Context |\n| :--- | :--- | :--- | :--- |\n| **Name and Email** | *[Blurred PII]* | 1 | User identification. |\n| (Unnamed Column) | (Empty) | 2 | Placeholder. |\n| **Date and Time** | 12/19/2024, 3:50 PM | 3 | Timestamp of the event. |\n| **Bot Event Interval** | 5.997 | 4 | Time (in seconds) between automated events. |\n| **Ignored Failure Type** | Clicked | 5 | Type of user interaction detected and ignored as failure. |\n| **IP Address** | *[Blurred IP]* | 6 | User's originating IP address. |\n| **Browser** | Chrome | 7 | Browser application used. |\n| **Browser Version** | 131 | 8 | Browser version number. |\n| **OS** | mac | 9 | Operating system used. |\n| **Bot Events** | 1 | 10 | Count of bot-related events detected. |\n| **Actions (Delete Icon)** | *[Trash Can Icon]* | 11 | Action icon to delete the entry. |\n| **Actions (Email Icon)** | *[Envelope Icon]* | 11 (Shared) | Action icon to view or interact with the corresponding email. |\n\n**III. Action Link:**\n\nLocated above the detailed table on the right side, there is a refresh icon followed by the text \"**Bulk Update**,\" indicating a feature to apply changes to multiple entries simultaneously.",
        "position": 3,
        "context": "d list for an explanation of the data located in this section:"
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Arrow1.png",
        "alt": "The image displays a User Interface (UI) dashboard for tracking event metrics and user-specific data logs.\n\n**UI Structure and Navigation:**\nThe top section features navigation tabs: \"Overview\" (inactive) and \"Users\" (active, highlighted).\n\n**Metrics Bar (KPIs):**\nA horizontal bar chart summarizes 11 metrics based on a total of **10 Recipients**. Key data points include:\n*   **Delivered:** 10 (100%)\n*   **Opened:** 4 (40%)\n*   **Clicked:** 1 (10%)\n*   **Ignored Failure:** 3 (30%). This metric is visually emphasized using a dark grey callout box.\nZero-count metrics listed include QR Code Scanned, Replied, Attachment Opened, Macro Enabled, Data Entered, Reported, and Bounced.\n\nBelow the metrics bar is a hyperlink labeled **Bulk Update** featuring a refresh icon.\n\n**Data Table:**\nA table displays detailed user activity. The columns are:\n1.  Name and Email (Data intentionally blurred)\n2.  Date and Time (e.g., 12/19/2024, 3:50 PM)\n3.  Bot Event Interval (e.g., 5.997)\n4.  Ignored Failure Type (e.g., Clicked)\n5.  IP Address (Data intentionally blurred)\n6.  Browser (e.g., Chrome)\n7.  Browser Version (e.g., 131)\n8.  OS (e.g., mac)\n9.  Bot Events (e.g., 1)\n\n**Action Icons:**\nThe rightmost column contains two interaction icons for the user listed in the row, emphasized by an orange arrow:\n*   A **Trash Can Icon** (Delete function).\n*   An **Envelope Icon** (Email or detailed view function).",
        "position": 4,
        "context": "e, click the trashcan icon on the right side of the screen."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Confirm.png",
        "alt": "This image depicts a reporting interface overlayed by a centered, critical confirmation modal dialog.\n\n**UI Context (Background):**\nThe background screen is a campaign or security event dashboard, indicated by active navigation tabs (\"Users\") and a detailed statistics bar. Key metrics include event types (e.g., \"Delivered,\" \"Opened,\" \"Clicked,\" \"Bounced,\" \"Ignored Failure\"). The \"Ignored Failure\" column registers 3 events (30%). A partial data table is visible, showing columns like \"Name and Email,\" \"Date/Time,\" and \"Bot Events.\"\n\n**Modal Dialog (Foreground):**\nA light-colored modal window is centered, requiring user interaction before proceeding.\n\n*   **Header:** The title is **\"Are you sure?\"** A standard close 'X' icon is present in the top-right corner.\n*   **Body Text:** The warning text defines the action and its consequence: \"Are you sure you want to convert this bot event to a campaign failure? This event cannot be undone.\"\n*   **Action Buttons:** Two buttons are provided for user choice:\n    1.  **Cancel:** A grey, inactive-color button (reverts the action).\n    2.  **Confirm:** A distinct green, primary-action button (executes the irreversible conversion).",
        "position": 5,
        "context": "onvert the bot event to a campaign failure, as you cannot undo this action."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_Ignored_Failure_Converted.png",
        "alt": "This document describes a user interface panel displaying campaign or message tracking data, segmented into an Overview Scorecard and a Detailed User List.\n\n**I. Top Navigation**\nThe interface features two primary navigation tabs: **Overview** (active/selected) and **Users** (inactive).\n\n**II. Performance Scorecard**\nA horizontal scorecard details 11 key metrics with counts and percentages, using color-coded bars (blue/teal for success/delivery, red for user interaction/failure, green for reported activity, dark gray for ignored failures).\n\n| Metric | Count | Percentage |\n| :--- | :--- | :--- |\n| Recipients | 10 | N/A |\n| Delivered | 10 | 100% |\n| Opened | 4 | 40% |\n| Clicked | 2 | 20% |\n| QR Code Scanned | 0 | 0% |\n| Replied | 0 | 0% |\n| Attachment Opened | 0 | 0% |\n| Macro Enabled | 0 | 0% |\n| Data Entered | 0 | 0% |\n| Reported | 0 | 0% |\n| Bounced | 0 | 0% |\n| **Ignored Failure** | **3** | **30%** |\n\nAn arrow points from the \"Ignored Failure\" metric block downward, visually linking the metric summary to the detailed table below.\n\n**III. Action Link**\nLocated below the scorecard and above the data table is a clickable action link: **Bulk Update** (accompanied by a refresh icon).\n\n**IV. Detailed User Data Table**\nA grid displays individual recipient tracking details under the following nine column headers:\n\n1.  Name and Email\n2.  Date and Time\n3.  Bot Event Interval\n4.  Ignored Failure Type\n5.  IP Address\n6.  Browser\n7.  Browser Version\n8.  OS\n9.  Bot Events\n\n**V. Data Row Example**\nOne visible row provides the following data points:\n*   **Date and Time:** 12/19/2024, 3:50 PM\n*   **Bot Event Interval:** 5.997\n*   **Ignored Failure Type:** Clicked\n*   **Browser:** Chrome\n*   **Browser Version:** 131\n*   **OS:** mac\n*   **Bot Events:** 1\n\nThe rightmost cell of the row contains two action icons: a **trash can icon** (for deletion/removal) and an **envelope icon** (for viewing/sending). An orange arrow overlaid on the image points toward these two action icons.",
        "position": 6,
        "context": "greyed out after the ignored failure is converted to a phishing failure."
      },
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/FP_+Ignored_Failure_Type_Clicked.png",
        "alt": "This image displays a dashboard for tracking the results of a user interaction event, likely a security assessment or email campaign.\n\n**UI Elements and Navigation:**\n*   The interface features two primary navigation tabs: \"Overview\" (selected) and \"Users.\"\n*   An action link labeled \"Bulk Update\" with a refresh icon is present below the metrics bar.\n*   An orange arrow highlights the \"IP Address\" column header and the \"Clicked\" entry in the row below it.\n\n**Metrics and Status Bar:**\nA segmented progress bar provides aggregated interaction metrics, showing both raw counts and percentages out of **10 Recipients**.\n\n| Metric | Percentage | Count | Color Coding |\n| :--- | :--- | :--- | :--- |\n| Recipients | N/A | 10 | Neutral |\n| Delivered | 100% | 10 | Blue/Teal |\n| Opened | 40% | 4 | Teal |\n| Clicked | 20% | 2 | Red (High Interaction) |\n| QR Code Scanned | 0% | 0 | Gray |\n| Replied | 0% | 0 | Gray |\n| Attachment Opened | 0% | 0 | Red |\n| Macro Enabled | 0% | 0 | Red |\n| Data Entered | 0% | 0 | Red |\n| Reported | 0% | 0 | Green |\n| Bounced | 0% | 0 | Blue |\n| Ignored Failure | 30% | 3 | Dark Gray/Blue (System Status) |\n\n**Detailed Log Table:**\nA detailed table provides user-specific event logging data, defined by the following columns:\n\n1.  **Name and Email** (Anonymized)\n2.  **Date and Time:** (e.g., 12/19/2024, 3:50 PM)\n3.  **Bot Event Interval:** (e.g., 5.997)\n4.  **Ignored Failure Type:** (e.g., Clicked)\n5.  **IP Address** (Anonymized)\n6.  **Browser:** (e.g., Chrome)\n7.  **Browser Version:** (e.g., 131)\n8.  **OS:** (e.g., mac)\n9.  **Bot Events:** (e.g., 1)\n\nThe bottom row displays action icons for the individual user log entry (trash/delete icon and mail/envelope icon).",
        "position": 7,
        "context": "the Ignored Failure Type is a Clicked type failure."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "evasion",
        "false",
        "phishing",
        "positive",
        "settings"
      ],
      "image_count": 7
    }
  }
}