{
  "id": 39515660382483,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/39515660382483.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/39515660382483.html",
  "author_id": 31899104510995,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 0,
  "vote_count": 0,
  "section_id": 42972312463891,
  "created_at": "2025-03-18T21:31:17Z",
  "updated_at": "2025-08-05T19:03:35Z",
  "name": "Prevent - Technical Overview",
  "title": "Prevent - Technical Overview",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-08-05T19:03:35Z",
  "user_segment_id": null,
  "permission_group_id": 195668,
  "content_tag_ids": [],
  "label_names": [],
  "body": "\n<p>Prevent helps users avoid errors and accidental mistakes when sharing data and Personally Identifiable Information (PII) by email. By combining historical email behavior trends, domain hygiene analysis, and Data Loss Prevention (DLP) rules, Prevent advises end users on the risk level of an email.</p>\n<p>This guide provides a comprehensive overview of the Prevent system and deployment.</p>\n<h2 id='h_01JQ71G20DGHERNTH9QF1XBT06'>Components</h2>\n<p>Prevent is formed of the following components:</p>\n<ul>\n<li>API\n<ul>\n<li>Learns user behavior to provide accurate opinions and prompts</li>\n<li>Responsible for metadata ingestion and storage</li>\n</ul>\n</li>\n<li>Policy Engine\n<ul>\n<li>Determines what to do with Prevent’s opinion of an email, such as when to prompt users in accordance with your policy</li>\n</ul>\n</li>\n<li>Client Add-In\n<ul>\n<li>Enforces the policy and prompts users when required</li>\n</ul>\n</li>\n<li>Prevent Gateway\n<ul>\n<li>For emails that are not processed by the COM or web add-in</li>\n</ul>\n</li>\n</ul>\n<h2 id='h_01JQ71G20D1XZVZPMC09QN62F1'>Architecture</h2>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004JPem.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004JPem.jpg' alt=''> </a></p>\n<ol>\n<li>Prevent Microsoft Outlook add-in triggers single sign-on (SSO) authentication when Microsoft Outlook starts up.</li>\n<li>Prevent Microsoft Outlook add-in makes a call to the Prevent policy server to retrieve security policies. These security policies control the behavior of the add-in, such as what scenario to show a prompt to the user.</li>\n<li>Analysis of email content and recipients occurs during composition and on sending the email. Prompts in line with Prevent security policies are delivered where necessary.</li>\n<li>Email sent to the recipient via the normal route, such as Microsoft Exchange and then SEG (optional).</li>\n<li>User actions are ingested to allow Prevent to learn and constantly provide accurate advice to users. This data is also ingested into the Prevent Analytics platform for reporting purposes.</li>\n</ol>\n<h2 id='h_01JQ71G20D2BB903X97S0YB57C'>Ingestion</h2>\n<p>For Prevent to provide the most value, it requires a baseline dataset and an understanding of email relationships. This data is acquired through ingestion. There are two ingestion methods that can be used:</p>\n<ul>\n<li>Graph API Ingestion\n<ul>\n<li>Ingests 12 months of metadata if available.</li>\n<li>Only available for organizations using Microsoft Exchange Online.</li>\n<li>Graph API ingestion is a mandatory requirement if using the web add-in.</li>\n<li>Graph API ingestion is a mandatory requirement for shared mailbox support. This feature ensures users receive real-time Prevent advice when sending from a shared mailbox or on behalf of another user.</li>\n</ul>\n</li>\n<li>Windows Outlook COM Add-In Ingestion\n<ul>\n<li>Ingests 12 months of metadata, if available, via the Microsoft Outlook add-in.</li>\n</ul>\n</li>\n</ul>\n<h2 id='h_01JQ71G20DGRT52NADP21VGA9T'>Data Storage</h2>\n<p>The data stored by Prevent includes:</p>\n<ul>\n<li>Sender</li>\n<li>From</li>\n<li>Sender Display Name</li>\n<li>From Display Name</li>\n<li>Recipients – display name and email</li>\n<li>SentBy Address</li>\n<li>Mailbox Address</li>\n<li>Sent Date</li>\n<li>Parent Thread Index</li>\n<li>Message References</li>\n<li>Thread Index</li>\n<li>Exchange Message Class</li>\n<li>Message ID</li>\n<li>InReplyTo Message ID</li>\n<li>Hashed identifiers *</li>\n<li>Subject line*</li>\n<li>Attachment names*</li>\n</ul>\n<p>*This data is optional and ingested to display additional information in the Prevent Security Center.</p>\n<p>All data is stored for 18 months. All activity between the application and its underlying data sources occurs over a secure connection using TLS 1.2.</p>\n<h3 id='h_01JQ71G20DRYFTVXHZXKTNKQ0A'>Data Segregation</h3>\n<p>Customer data is isolated by assigning each organization an ID. Authentication and database queries to Prevent are made at an organizational level, ensuring that data cannot be accessed between organizations.</p>\n<h3 id='h_01JQ71G20D0NJ0JAC3ABMGBHHN'>Data Retention</h3>\n<p>The retention period for Prevent Analytics is 18 months rolling and for up to 30 calendar days thereafter. This data is required to improve the accuracy of the Prevent services and provide trend and risk analysis for reporting. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500008107581.html'>Data Retention Policy Schedule</a>.</p>\n<h2 id='h_01JQ71G20DFBT6E45YDW8AEE9Q'>Network Configuration</h2>\n<p>Communication to the Prevent cloud is via HTTPS. If SSL inspection or decryption is being used, a customer may be required to add proxy exceptions to bypass this for URLs given below to avoid interference.</p>\n<p><strong>United Kingdom</strong></p>\n<ul>\n<li>switch.egress.com</li>\n<li>uk.intelligence.egress.com</li>\n<li>uk.office.egress.com</li>\n<li>uk.kes.knowbe4.com</li>\n</ul>\n<p><strong>Europe</strong></p>\n<ul>\n<li>eu1.esi.egress.com</li>\n<li>eu.intelligence.egress.com</li>\n<li>eu.office.egress.com</li>\n<li>eu.kes.knowbe4.com</li>\n</ul>\n<p><strong>North America </strong></p>\n<ul>\n<li>us1.esi.egress.com</li>\n<li>us.intelligence.egress.com</li>\n<li>us.office.egress.com</li>\n<li>us.kes.knowbe4.com</li>\n</ul>\n<p><strong>Asia-Pacific </strong></p>\n<ul>\n<li>au.esi.egress.com</li>\n<li>au.intelligence.egress.com</li>\n<li>au.office.egress.com</li>\n<li>au.kes.knowbe4.com</li>\n</ul>\n<h2 id='h_01JQ71G20DP5N24HTAYB3GRS18'>Graph API Ingestion Configuration</h2>\n<p>Graph API ingestion requires an app registration within your Entra ID tenant. This configuration can be done manually within the Entra ID admin platform or using Powershell. Global Administrator credentials are required.</p>\n<p>To set this up, follow the steps below:</p>\n<ol>\n<li>Log in to your Entra ID portal.</li>\n<li>Navigate to <strong>App registrations New registration</strong>.</li>\n<li>Populate the settings as shown below:\n<table style='margin-block-start: 1.5rem;'>\n<thead>\n<tr>\n<th scope='col'>Name</th>\n<th scope='col'>Prevent</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Who can use this application or access this API?</td>\n<td>Accounts in this organizational directory only (Single Tenant)</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>Click <strong>Register</strong>.</li>\n<li>Navigate to <strong> Authentication Add a platform Mobile and desktop applications</strong>.</li>\n<li>\n<p>Select the URL ending with \"/nativeclient\" and click <strong>Configure</strong>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000002bK8R.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000002bK8R.jpg' alt=''> </a></p>\n</li>\n<li>Add a new redirect URL with the value of urn:ietf:wg:oauth:2.0:oob</li>\n<li>\n<p>Under <strong>Advanced Settings</strong>, enable <strong>Allow public client flows</strong> by selecting <strong>Yes</strong>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000002bJ4B.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000002bJ4B.jpg' alt=''> </a></p>\n</li>\n<li>Click <strong>Save</strong>.</li>\n<li>Navigate to <strong>API Permissions Add a permission</strong>.</li>\n<li>Add the permissions below:\n<ol>\n<li>Microsoft Graph Application Permissions User User.Read.All</li>\n<li>Microsoft Graph Application Permissions Group Group.Read.All</li>\n<li>Microsoft Graph Application Permissions Mail Mail.Read</li>\n</ol>\n</li>\n<li>Click <strong>Add Permissions</strong>.</li>\n<li>\n<p>Click <strong>Grant admin consent for your organization</strong>. Click <strong>Yes</strong> to any prompts asking you to override any existing permissions.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004JR2E.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004JR2E.jpg' alt=''> </a></p>\n</li>\n<li>\n<p>Navigate to <strong>Certificates and Secrets</strong>. Add a new client secret with an expiry of 24 months. Copy the value of the secret immediately after creation. Your Prevent engineer will need this value.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000002bVen.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000002bVen.jpg' alt=''> </a></p>\n</li>\n<li>Navigate to the <strong>Overview</strong> page and note the <strong>Application (client)</strong> ID and <strong>Directory (tenant) ID</strong>. Your Prevent engineer will need these values.</li>\n<li>Pass the following information to your Prevent engineer:\n<ol>\n<li>Application (client) ID.</li>\n<li>Directory (tenant) ID.</li>\n<li>Client secret value and date of expiry.</li>\n</ol>\n</li>\n</ol>\n<h2 id='h_01JQ71G20DV2J90SPSRTGMMEJ9'>Gateway</h2>\n<p>Prevent has developed the Prevent Gateway to ensure that Prevent caters to non-outlook mail flow from sources, such as mobile devices or back-end systems.</p>\n<h3 id='h_01JQ71G20DDG1KW22HY2F1TXZ4'>Prevent Deployment Manager</h3>\n<p>The implementation of Prevent for mobile is achieved via a Deployment Manager, which will be run from the Prevent engineer’s machine. Full details on this Deployment Manager can be found within the following subsections, but it will require a Global Administrator from your tenant to authorize the implementation via Device Code authentication.</p>\n<h3 id='h_01JQ71G20EF09S0MACC9NSVDYS'>Authentication Requirements</h3>\n<p>Deployment Manager is a Windows application that is run by a KnowBe4 Engineer to enable remote and easy installation of Prevent for mobile. Using Microsoft OAuth Device authentication, the Deployment Manager authenticates with a client’s Microsoft 365 environment remotely. The Deployment Manager must be run on a KnowBe4 employee’s computer, connected to a KnowBe4 VPN, without the client needing to physically enter their username and password onto the KnowBe4 engineer’s device. It will require authorization from a Global Administrator within your tenant. A “token” is received from Microsoft Graph after login, which lasts between 60 and 90 minutes, and is discarded as soon as the page containing the auth flow is closed.</p>\n<h3 id='h_01JQ71G20ENSD4VD7PTMRZNA08'>Conditional Access</h3>\n<p>The Prevent Deployment Manager will be run from the KnowBe4 engineer’s machine connected to a VPN from the UK or America. If you have Conditional Access policies applied to the Global Administrator who authorizes the scripts, you may need to make an exception to the Conditional Access Policy during the installation. The exception can be removed afterward.</p>\n<h3 id='h_01JQ71G20E4E7F60H1YJQHC2WY'>General Flow</h3>\n<p>Emails sent from outside of the Prevent Microsoft Outlook Add-in are sent to a moderation mailbox in the Prevent Gateway and are scanned for any risks and processed accordingly. If a risk is detected, such as a misdirected email, the sender will receive a bounce-back verification email with the option to either approve and send or reject and discard the email. The flow of this feature is shown in the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004JaDZ.jpg'> <img src='https://helpimg.s3.amazonaws.com/egress/0EMSr000004JaDZ.jpg' alt=''> </a></p>\n<ol>\n<li>A mobile user sends an email.</li>\n<li>The email is redirected to the Prevent Gateway via SMTP for analysis.</li>\n<li>Prevent Gateway analyses the email for any risks. If no risks are detected, the email is automatically approved and released.</li>\n<li>If a risk is detected, the Prevent Gateway will send a verification email to the sender on behalf of the shared mailbox. The sender can review the verification email and either approve or reject the send of the email. Approved messages are returned to the Prevent Gateway queue for additional SMTP processing, with encryption or decryption if required, and then returned to Microsoft 365 for final delivery. Rejected messages are deleted with a notification message to the sender or released with a MIME header that Microsoft 365 rules can act upon if needed).</li>\n<li>Approved messages are returned to Microsoft 365 for delivery to the recipient.</li>\n<li>If a user takes no action, by default, emails are auto-approved after two hours.</li>\n</ol>\n<h2 id='h_01JQ71G20E4P3J0SS3QR1YM78D'>Gateway Configuration</h2>\n<p>The Prevent Deployment Manager is used to configure the components required for the Prevent Gateway, reducing the risk of human error and the time required for the implementation. Below are the components implemented by the Deployment Manager:</p>\n<ul>\n<li>Accepted Domain\n<ul>\n<li>Configuring an accepted domain allows us to route emails to the Prevent Gateway for processing. We do not configure an MX record, but we do use the MX record value.</li>\n</ul>\n</li>\n<li>Connectors\n<ul>\n<li>Allows emails to be transmitted between Microsoft 365 and Prevent over TLS 1.2, using the MS recommendation of CA-issued certificate-based authentication.</li>\n</ul>\n</li>\n<li>Microsoft 365 Group\n<ul>\n<li>The transport rules created, as shown below, are scoped to apply to a Microsoft 365 group. Prevent users will need to be manually added to the group.</li>\n</ul>\n</li>\n<li>Shared Mailbox\n<ul>\n<li>When a risk is detected, the Prevent Gateway will send a verification email to the sender to approve or reject whether or not the mail will be sent. This verification email is sent on behalf of the shared mailbox.</li>\n</ul>\n</li>\n<li>Transport Rules\n<ul>\n<li>There are two rules required. The first rule will determine what emails will be redirected to the Prevent Gateway. The second rule will determine if any emails are being sent to the shared mailbox, typically approve or reject responses, and redirect them to the Prevent Gateway.</li>\n</ul>\n</li>\n</ul>\n<p>If deployment using the deployment manager is not possible, the manual steps detailed in this section should be followed.</p>\n<h3 id='h_01JQ71G20EB6DV9C2QVMDRV1QJ'>Prerequisites</h3>\n<p>The prerequisites needed for configuring the gateway are listed below:</p>\n<ul>\n<li>Graph API ingestion configured</li>\n<li>Microsoft 365</li>\n<li>Microsoft 365 Global Administrator access</li>\n</ul>\n<h3 id='h_01JQ71G20ERN758KYKM6MCBE44'>Accepted Domain</h3>\n<p>To configure an accepted domain, follow the steps below:</p>\n<ol>\n<li>In the Microsoft 365 admin portal, navigate to <strong>Setup</strong>.</li>\n<li>Under <strong>Get your custom domain set up</strong>, select <strong>View Manage Add domain</strong>.</li>\n<li>Configure the new domain using your Prevent Gateway domain address, which will be provided by your KnowBe4 Engineer.</li>\n</ol>\n<h3 id='h_01JQ71G20EXQJECGZ9M6FXWZWQ'>Connectors</h3>\n<h4 id='h_01JQ71G20EC5E96V4ESVK2G5QW'>Send Connector</h4>\n<p>To configure a send connector, follow the steps below:</p>\n<ol>\n<li>In the M365 admin portal, navigate to <strong>Mail Flow Connectors</strong>.</li>\n<li>Click <strong>+ Add a Connector</strong>.</li>\n<li>Set the mail flow scenario to be from<strong> Microsoft 365</strong> to <strong>Partner Organization</strong>.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Enter a name for the connector.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Select the option to only use the connector where there is a transport rule associated with it.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Select <strong>Route email through these smart hosts</strong>.</li>\n<li>Add the Prevent hostname, which will be provided by your KnowBe4 Engineer.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Select <strong>Always use Transport Layer Security (TLS) to secure the connection</strong>.</li>\n<li>Tick <strong>Add the subject name</strong> and enter your Prevent hostname.</li>\n<li>Click <strong>Next</strong>.</li>\n</ol>\n<h4 id='h_01JQ71G20EN00JD4ZS7NXGFXYS'>Receive Connector</h4>\n<p>To configure a receive connector, follow the steps below:</p>\n<ol>\n<li>In the Microsoft 365 admin portal, navigate to <strong>Mail Flow Connectors</strong>.</li>\n<li>Click <strong>+ Add a connector</strong>.</li>\n<li>Set the mail flow scenario to be from <strong>Your Organization</strong> to <strong>Microsoft 365</strong>.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Enter a name for the connector.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Enter the Prevent Gateway hostname to allow Microsoft 365 to identify the source of incoming mail.</li>\n</ol>\n<h3 id='h_01JQ71G20E6QP00DG6E6XNR0A5'>Microsoft 365 Group</h3>\n<p>To configure a Microsoft 365 group, follow the steps below:</p>\n<ol>\n<li>In the Microsoft 365 admin portal, navigate to <strong>Active Teams and Groups</strong>.</li>\n<li>Select Add a <strong>Microsoft 365 group</strong>.</li>\n<li>Enter a name for the group, such as \"Prevent Moderation\".</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Assign an owner of the group.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Add relevant members to the group.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Enter a group email address, such as \"Prevent_Users@customer.com\".</li>\n<li>Use the <strong>Privacy</strong> drop-down menu to select <strong>Private</strong>.</li>\n<li>Untick <strong>Create a team for this group</strong>.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>Review and create the group.</li>\n</ol>\n<p>Once created, add the desired Prevent users to the group.</p>\n<h3 id='h_01JQ71G20EYKNV6BQ1ZPP1WP5H'>Shared Mailbox</h3>\n<p>Create the shared mailbox in the Microsoft 365 admin portal by following the steps below:</p>\n<ol>\n<li>Navigate to <strong>Teams &amp; Groups Shared mailboxes</strong>.</li>\n<li>Click <strong>+ Add a shared mailbox</strong>.</li>\n<li>The address of the mailbox should be <strong>Egress_Moderator@customer.com</strong>\n</li>\n<li>Click <strong>Save Changes</strong>.</li>\n</ol>\n<p>Prevent will send verification emails on behalf of this shared mailbox. These emails will originate from an internal address but from an external Prevent IP address and will therefore, be rejected due to SPF misalignment. To prevent these rejections, the Gateway hostname should be allowed to spoof the mailbox address within your Microsoft Security Portal:</p>\n<ol>\n<li>Navigate to <strong> Policies and Rules Threat Policies Tenant Allow/Block Lists Spoofed senders</strong>.</li>\n<li>Add a new domain pair including the moderator mailbox address and your Prevent Gateway regional address, which can be provided by your KnowBe4 Engineer.</li>\n</ol>\n<h3 id='h_01JQ71G20EYFYTEZVF6TRX9695'>Transport Rules</h3>\n<h4 id='h_01JQ71G20EHE5ZTAFS5KTSASP5'>Prevent Moderation</h4>\n<p>To configure Prevent moderation, follow the steps below:</p>\n<ol>\n<li>In the Microsoft 365 admin portal, navigate to <strong> Mail Flow Rules + Create a new rule</strong>.</li>\n<li>\n<p>Configure the rule with the following settings:</p>\n<p><strong>Apply this rule if the Header</strong></p>\n<p>X-MS-Exchange-Organization-AuthMechanism</p>\n<p><strong>Matches</strong></p>\n<p>^0?4</p>\n<p><strong>And is received from</strong></p>\n<p>Member of group <strong>Egress_Prevent_Users@customer.com</strong>.</p>\n<p><strong>Do the following </strong></p>\n<p>Route the message using the following Connector:</p>\n<p>Exchange Online to Egress</p>\n<p><strong>And Set the message header</strong></p>\n<p>X-Egress-Moderation with the value Required</p>\n<p><strong>Except if</strong></p>\n<p>Message type is Calendaring</p>\n<p><strong>Or</strong></p>\n<p>Message Header X-Switch-Processed contains:</p>\n<p>[GATEWAY ID] <em>this will be provided by you Prevent Engineer</em></p>\n<p><strong>Or</strong></p>\n<p>Message Header X-$Switch matches the following patterns:</p>\n<p>^((?!TPSECONDARY).){1,1000}$</p>\n</li>\n</ol>\n<h4 id='h_01JQ71G20EY34518E2BFM7FH1F'>Forward Replies to Prevent SMTP Moderation</h4>\n<p>To forward replies to Prevent SMTP moderation, follow the steps below:</p>\n<ol>\n<li>In the Microsoft 365 admin portal, navigate to <strong>Mail Flow Rules + Create a new rule</strong>.</li>\n<li>\n<p>Configure the rule with the following settings:</p>\n<p><strong>Apply this rule if Received from</strong></p>\n<p>Inside the Organization</p>\n<p>And is sent to recipient <strong>Egress_Prevent_Users@customer.com</strong>.</p>\n<p><strong>Do the following</strong></p>\n<p>Route the message using the connector</p>\n<p>Exchange Online to Egress</p>\n<p><strong>And set the Message Header</strong></p>\n<p>X-Egress-Moderation with the value required</p>\n<p><strong>Except if the header</strong></p>\n<p>[GATEWAY ID] <em>this will be provided by your Prevent Engineer</em></p>\n</li>\n</ol>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/39515660382483-Prevent-Technical-Overview",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004JPem.jpg",
      "alt": "This technical diagram illustrates the data flow for an email transaction involving the Egress Cloud, policy retrieval, and final delivery.\n\n### 1. Key Components and Containers\n\n*   **Egress Cloud:** A container housing three primary services:\n    *   **ANALYTICS (ADMIN.EGRESS.COM)**\n    *   **PREVENT (INTELLIGENCE.EGRESS.COM)**\n    *   **POLICY (SWITCH.EGRESS.COM)**\n*   **Identity Provider:** Represents external authentication services (AZURE AD/OKTA/PING ETC).\n*   **Customer Intranet:** Contains the source user, labeled **OUTLOOK USER**.\n*   **M365/Exchange:** The internal messaging platform.\n*   **Email Gateway/SEG:** The Security Email Gateway responsible for outbound routing.\n*   **RECIPIENT:** The final destination entity.\n\n### 2. Transaction Flow (Policy and Intelligence Retrieval)\n\nThe flow is initiated by the OUTLOOK USER during email composition and send, detailed in numbered steps:\n\n1.  **SSO Request:** The OUTLOOK USER requests Single Sign-On (SSO) authentication from the Identity Provider.\n2.  **Policy Retrieval:** The user authenticates with the Egress Cloud **POLICY (SWITCH.EGRESS.COM)** service for policy retrieval.\n3.  **API Call:** A \"Rest API call during email composition and on send\" is directed from the OUTLOOK USER to the Egress Cloud **PREVENT (INTEEDS.EGRESS.COM)** service.\n4.  **Email Delivery Path:** Post-policy validation, the email proceeds from the OUTLOOK USER to **M365/Exchange**, then through the **Email Gateway/SEG**, and finally to the **RECIPIENT**.\n5.  **Data Ingestion:** Following the delivery process, **PREVENT (INTELLIGENCE.EGRESS.COM)** submits ingested email data to the **ANALYTICS (ADMIN.EGRESS.COM)** service within the Egress Cloud.",
      "position": 1,
      "context": "e COM or web add-in\n\n\n\nArchitecture"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000002bK8R.jpg",
      "alt": "This image displays a configuration section titled **\"Mobile and desktop applications\"** focused on **\"Redirect URIs\"** within a development portal, likely related to OAuth 2.0 or OpenID Connect settings (e.g., Azure App Registration).\n\n**Header and Context:**\n*   The section title is \"Mobile and desktop applications\" followed by a subheading \"Redirect URIs\".\n*   In the upper right corner, navigation links include \"Quickstart\", \"Docs\" (with an external link icon), and a garbage can icon (Delete/Remove).\n*   A descriptive paragraph explains the purpose: \"The URIs we will accept as destinations when returning authentication responses (tokens) after successfully authenticating users. The redirect URI you send in the request to the login server should match one listed here. Also referred to as reply URLs. Learn more about Redirect URIs and their restrictions [external link icon]\".\n\n**Redirect URI List:**\nThe section lists four predefined redirect URIs, structured as a list with checkboxes for selection/activation and associated actions:\n\n1.  **URI 1 (Checked):** `https://login.microsoftonline.com/common/oauth2/nativeclient`\n    *   This entry is marked with a checked blue box, indicating it is active or pre-selected.\n    *   An icon resembling stacked documents (Copy icon) is present next to the URI.\n2.  **URI 2 (Unchecked):** `https://login.live.com/oauth20_desktop.srf (LiveSDK)`\n    *   This entry includes a parenthetical note \"(LiveSDK)\".\n    *   A checkbox is present but unchecked.\n    *   A Copy icon is present.\n3.  **URI 3 (Unchecked):** `msal6f8ea25c-c9df-4197-bd62-68f896ff49cc://auth (MSAL only)`\n    *   This entry includes a parenthetical note \"(MSAL only)\".\n    *   A checkbox is present but unchecked.\n    *   A Copy icon is present.\n4.  **URI 4 (Unselectable/Static):** `urn:ietf:wg:oauth:2.0:oob`\n    *   This entry is listed without a preceding checkbox or copy icon.\n    *   A garbage can icon (Delete icon) is present to the far right of this entry.\n\n**Footer Action:**\n*   Below the list, there is a blue link labeled \"Add URI\".",
      "position": 2,
      "context": "Select the URL ending with \"/nativeclient\" and click Configure."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000002bJ4B.jpg",
      "alt": "This image displays a section of an application configuration UI titled **Advanced settings**. The setting shown controls the enablement of public client authentication flows.\n\n**UI Elements and Text:**\n\n1.  **Header:** Advanced settings.\n2.  **Primary Setting Label:** Allow public client flows (accompanied by an informational icon).\n3.  **Control Element:** A binary toggle switch labeled **Yes** and **No**. The control is currently active, with the **Yes** option highlighted blue.\n4.  **Context Text:** Enable the following mobile and desktop flows:\n5.  **Associated Flows (Bulleted List):**\n    *   App collects plaintext password (Resource Owner Password Credential Flow)\n    *   No keyboard (Device Code Flow)\n    *   SSO for domain-joined Windows (Windows Integrated Auth Flow)\n\nEach listed flow description is immediately followed by a blue, hyperlink-formatted **Learn more** text with an external link icon.",
      "position": 3,
      "context": "/strong>, enable Allow public client flows by selecting Yes."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004JR2E.jpg",
      "alt": "This image displays the **Configured permissions** UI section, typically found in application registration settings (e.g., Azure Active Directory/Entra ID).\n\nThe interface includes introductory text explaining the consent process, followed by two primary actions: \"+ Add a permission\" and a highlighted button labeled **\"Grant admin consent for Contoso\"**. This button confirms that administrative consent has been applied to the listed permissions.\n\nA data table details the currently configured permissions, grouped under **Microsoft Graph (3)**, with five columns:\n\n1.  **API / Permissions name:** Lists the specific scope.\n2.  **Type:** Indicates the permission type (all listed are **Application** type).\n3.  **Description:** Provides a brief explanation.\n4.  **Admin consent requ... (Required):** Shows **Yes** for all scopes.\n5.  **Status:** Shows the current authorization status, which is **Granted for Contoso** (indicated by a green checkmark) for all configured permissions.\n\nThe three configured permissions are: `Group.Read.All`, `Mail.Read`, and `User.Read.All`.",
      "position": 4,
      "context": "Click Yes to any prompts asking you to override any existing permissions."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000002bVen.jpg",
      "alt": "The image displays a sectional view of a user interface managing security credentials, specifically client secrets, presented in a tabular format.\n\n**UI Elements and Context:**\n\n1.  **Action Link:** A prominent link is visible at the top: `+ New client secret`.\n2.  **Data Grid:** A single entry (row) is displayed under the following column headers:\n    *   **Description:** Displays the value `Egress Secret`.\n    *   **Expires:** Displays the expiration date `9/21/2025`.\n    *   **Value:** Indicates sensitive data. The cell content is masked/obscured (greyed out) and is accompanied by an informational icon (`ⓘ`).\n\n**Interactive Elements (Right-Hand Side):**\n\n1.  **Copy Functionality:** A **Copy to clipboard** action is displayed via a tooltip (highlighted in red), hovering over an associated clipboard icon. The full context suggested by the truncated text is likely `Copy to clipboard Secret ID`.\n2.  **Delete Functionality:** A trash can icon (delete icon) is visible on the far right, indicating the function to remove or revoke the specific `Egress Secret`.",
      "position": 5,
      "context": "Your Prevent engineer will need this value."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/egress/0EMSr000004JaDZ.jpg",
      "alt": "This diagram illustrates a five-step messaging workflow centered around Microsoft 365 and an Egress Gateway.\n\n**Components:**\n1.  **EGRESS GATEWAY:** Located at the top (pink box). Contains an icon representing stacked servers overlaid with a circular arrow/toggle icon. The internal flow is designated as **SMTP Approval** $\\rightarrow$ **3** $\\rightarrow$ **SMTP Processing**.\n2.  **MICROSOFT 365:** Located centrally (cloud and envelope icon). Serves as the intermediary message handler.\n3.  **MOBILE USER:** Located bottom right (user silhouette icon). The message originator.\n4.  **RECIPIENT:** Located bottom left (user silhouette icon). The message destination.\n\n**Workflow Sequence (Steps 1-5):**\n1.  **Step 1:** The flow begins with the **MOBILE USER** sending a message to **MICROSOFT 365**.\n2.  **Step 2:** **MICROSOFT 365** forwards the message (solid red up-arrow) to the **EGRESS GATEWAY** for evaluation/approval.\n3.  **Step 3:** The **EGRESS GATEWAY** performs internal processing (SMTP Approval and SMTP Processing), indicated by the dashed red down-arrow labeled '3' back towards M365. This step likely represents a status or interim response.\n4.  **Step 4:** The **EGRESS GATEWAY** returns the processed or approved message (solid red down-arrow labeled '4') to **MICROSOFT 365**.\n5.  **Step 5:** **MICROSOFT 365** delivers the final message to the **RECIPIENT**.",
      "position": 6,
      "context": "The flow of this feature is shown in the screenshot and list below:"
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "overview",
      "prevent",
      "technical"
    ],
    "image_count": 6
  }
}