{
  "id": 4401872595731,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/4401872595731.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/4401872595731.html",
  "author_id": 403968826754,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 8,
  "vote_sum": 4,
  "vote_count": 4,
  "section_id": 26430388867347,
  "created_at": "2021-06-04T18:42:08Z",
  "updated_at": "2025-03-11T17:38:33Z",
  "name": "Compliance Plus Guide",
  "title": "Compliance Plus Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-03-11T17:38:33Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "compliance",
    "training content",
    "localized",
    "answerbot",
    "compliance plus",
    "add on",
    "find content",
    "answerbot_kmsat"
  ],
  "body": "<p>One of the most critical factors in meeting compliance requirements is your users’ understanding of those requirements. Just as security awareness training creates a strong human firewall, Compliance Plus content gives your users the tools they need to help mitigate risk.</p>\n<p>This article has been written for users who may be unfamiliar with the KSAT console. If you are a compliance expert with little experience in the console, please reach out to your admin with any questions that you may have. For best results, we recommend running a compliance training campaign once every quarter.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>If you are an admin granting your compliance experts access to the KSAT console, see our  <a href='https://support.knowbe4.com/hc/en-us/articles/4401808867731'>Who Can Manage Compliance Plus Training?</a> article.</div>\n</div>\n<h2 id='h_01HBGNJNFHMXSJS1736AXVYYRM'>Finding Compliance Plus Training Content</h2>\n<p>Before you can create a training campaign, you must first select the content to include in that campaign. First, find Compliance Plus content in the ModStore. Then, add the desired content to your account’s library. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/Browse_CompliancePlus_Badges.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/Browse_CompliancePlus_Badges.png' alt=' '></a></p>\n<p>If you are browsing the ModStore, look for items with the orange compliance badge next to the title. If you would like to specifically search for Compliance Plus content, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KSAT console. </li>\n<li>Navigate to the <strong>ModStore</strong> tab.</li>\n<li>On the <strong>Browse</strong> subtab, click on <strong>Additional Filters</strong>.</li>\n<li>From the <strong>Subscription Level </strong>drop-down menu, select <strong>Compliance Plus </strong>to browse all content specific to the Compliance Plus add-on.</li>\n<li>If you find the content you are interested in using, you can hover your cursor over the image and click <strong>View Details</strong> for more information. On the item details page, you can read the full content description and view the content.</li>\n<li>To add the content to your library, click the <strong>+ Add to Library</strong> button. Once added, the content will be listed in the <strong>Library</strong> subtab, beneath the <strong>ModStore</strong> tab.\n<ul role='list'>\n<li>If an item shows the <strong>Already Added</strong> tag, the item is already available in your library and does not have to be added.  <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/ItemDetails_AddToLibrary.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/ItemDetails_AddToLibrary.png' alt=' '></a>\n</li>\n</ul>\n</li>\n</ol>\n<p>Once you have added all of the Compliance Plus training you would like to your library, you can move on to <a href='#h_01HBGNJNFH2H742XCWH6X60AGJ'>Creating a Compliance Training Campaign</a>.</p>\n<h2 id='h_01HBGNJNFH2H742XCWH6X60AGJ'>Creating a Compliance Training Campaign</h2>\n<p>Once you have added content to your library, you can create a compliance training campaign. While logged in to your KSAT console, navigate to the <strong>Training</strong> tab. Then, click the <strong>+Create Training Campaign</strong> button in the top-right corner of the page.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_NewCampaignButton.gif'><img src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_NewCampaignButton.gif' alt=' ' width='678' height='523'></a></p>\n<p>On the campaign creation screen that opens, use the list below to create a compliance campaign with our recommended settings. </p>\n<ol role='list'>\n<li>\n<strong>Campaign Name</strong>: Name your campaign something descriptive, such as \"Compliance Training\". \n<ul role='list'>\n<li>This name will be seen by both admins and users completing the training. </li>\n</ul>\n</li>\n<li>\n<strong>Start Date</strong>: Select when you would like this campaign to run. </li>\n<li>\n<strong>End Date</strong>: Select <strong>Relative Duration</strong> and use the default duration of three weeks. </li>\n<li>\n<strong>Allow assignments to be completed after due date</strong>: Select this check box.</li>\n<li>\n<strong>Content</strong>: From the drop-down menu, select each of the training assignments you would like to include in this campaign.\n<ul role='list'>\n<li>In this menu, you can scroll vertically and horizontally as well as sort the list by each header. You can also type a keyword into the field to filter content. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/training+course+mgmt/ContentDrop-DownMenu.gif'><img src='https://helpimg.s3.amazonaws.com/training+course+mgmt/ContentDrop-DownMenu.gif' alt=' '></a>\n</li>\n<li>Once you have selected the desired content, click out of the menu to view your content list. To reorder this list, you can click and drag the titles you would like to move. </li>\n</ul>\n</li>\n<li>\n<strong>Enable Content Survey</strong>: We recommend selecting this check box so that users will be prompted to take a survey after each assignment they complete. This setting is optional, but enabling surveys will help you keep in touch with users and see the effectiveness of your training strategy.</li>\n<li>\n<strong>Track Scores</strong>: Select this check box. This option saves the scores of each user for later review.</li>\n<li>\n<strong>Enroll Groups</strong>: Select <strong>Specific User</strong>. Then, from the drop-down menu, select the user group to enroll in this campaign. If this training is for everyone in your organization, select <strong>All Users</strong>.\n<ul role='list'>\n<li>If you do not know which group to include in this campaign, reach out to your admin for help.</li>\n</ul>\n</li>\n<li>\n<strong>Enable automatic enrollment for new users</strong>: Select this check box. This option ensures that any users who are added to the selected groups at a later date will be enrolled in this training. </li>\n<li>\n<strong>Enable progress reset for remedial training</strong>: This option is only recommended for remedial training campaigns. So, be sure that this check box is not selected.</li>\n<li>\n<strong>Notifications</strong>: We recommend creating notifications to welcome enrolled users and to remind them of the upcoming due date.\n<p>To create a welcome notification, follow the steps below: <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_WelcomeNotif.png'><img src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_WelcomeNotif.png' alt=' ' width='501' height='313'></a></p>\n<ol role='list'>\n<li>Click the <strong>+Add Notification</strong> button. </li>\n<li>From the <strong>Notification Type</strong> drop-down menu, select <strong>Welcome</strong>. </li>\n<li>Select each check box next to <strong>User</strong>, <strong>Manager</strong>, and <strong>Admin</strong>. </li>\n<li>In the drop-down menus next to each recipient type, keep the default templates selected.</li>\n<li>Click the <strong>Save</strong> button.</li>\n</ol>\n<p>To create a due date reminder, follow the steps below:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_DueDateNotif.png'><img src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_DueDateNotif.png' alt=' ' width='501' height='421'></a></p>\n<ol role='list'>\n<li>Click the <strong>+Add Notification</strong> button. </li>\n<li>From the <strong>Notification Type</strong> drop-down menu, select <strong>Remind Before Due Date</strong>. </li>\n<li>Keep the default number of days before the due date.</li>\n<li>Check each check box next to <strong>User</strong>, <strong>Manager</strong>, and <strong>Admin</strong>. </li>\n<li>In the drop-down menus next to each recipient type, keep the default templates selected.</li>\n<li>Click the <strong>Save</strong> button.</li>\n</ol>\n</li>\n<li>Review your selected settings. When you are satisfied with the settings, click the <strong>Create Campaign</strong> button. </li>\n</ol>\n<p>After creating the campaign, users will be enrolled in this training on the start date. Once the campaign has started, you can move on to <a href='#h_01HBGNJNFHSSDTJ53J8SHEAKJC'>Monitoring a Compliance Training Campaign</a>.</p>\n<h2 id='h_01HBGNJNFHSSDTJ53J8SHEAKJC'>Monitoring a Compliance Training Campaign</h2>\n<p>To check on the progress of your users’ training, their scores, and other campaign metrics, follow the steps below.</p>\n<ol role='list'>\n<li>Log in to your KSAT console. </li>\n<li>Navigate to the <strong>Training</strong> tab.</li>\n<li>On the <strong>Campaign</strong> subtab, find the compliance training campaign that you created. Click on the campaign name.</li>\n<li>The campaign’s<strong> Overview</strong> tab will display. On this tab, you will see a summary of the campaign, including a graph of users who have completed all of the content, the status, start date, relative duration, number of users, and more. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_CampaignOverview.png'><img src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_CampaignOverview.png' alt=' ' width='601' height='349'></a>\n</li>\n<li>To view user progress for the entire campaign, click on the <strong>Users</strong> subtab. \n<ul role='list'>\n<li>This page is organized by subtabs, starting with <strong>All Users</strong>, then sorted by completion status.</li>\n<li>The table is sorted alphabetically by user name. Under each user is a list of their enrolled content. To the right of the content name, you can see if the training was started, if and when it was completed, the user’s score for that module, and their current training status.</li>\n<li>To find a specific user, enter their name or email address in the <strong>Search</strong> field. </li>\n</ul>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_UserProgress.png'><img src='https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_UserProgress.png' alt=' ' width='600' height='347'></a>\n</li>\n</ol>\n<p>At any point during the campaign, you can download a spreadsheet of the user's progress. On the <strong>Users</strong> subtab of the campaign, click the <strong>Generate CSV</strong> button.</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/4401872595731-Compliance-Plus-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/Browse_CompliancePlus_Badges.png",
      "alt": "This image displays a content catalog interface presenting five vertical cards, likely representing educational assets or training modules. Each card adheres to a standard metadata structure: a graphical thumbnail, a bold title, a compliance status tag, the asset type, and an indication of available languages.\n\n**Common UI Elements:**\n*   **Compliance Status:** All five cards feature an identical orange tag labeled \"**Compliance Plus**\" with a preceding checkmark icon.\n*   **Language Count:** All five cards include a globe icon followed by the numeral \"**2**\", indicating dual language availability.\n*   **Asset Type/Iconography:** The card footer displays a specific icon corresponding to the asset type (e.g., picture frame icon for \"Posters & Artwork,\" graduation cap icon for \"Training Module,\" and smartphone icon for \"Mobile-First Module\").\n\n**Content Breakdown (Left to Right):**\n\n1.  **Card 1:**\n    *   **Title:** Poster: The Truth About Gender Diversity?\n    *   **Asset Type:** Posters & Artwork\n    *   **Thumbnail:** Abstract illustration of four diverse faces.\n\n2.  **Card 2:**\n    *   **Title:** Protecting Privacy Under FERPA\n    *   **Asset Type:** Training Module\n    *   **Thumbnail:** Illustration of students working on laptops around a large tablet display showing data and icons.\n\n3.  **Card 3:**\n    *   **Title:** New York SHIELD Act\n    *   **Asset Type:** Training Module\n    *   **Thumbnail:** A geometric white shield featuring simplified illustrations of key New York City skyscrapers, overlaid on a dark, high-angle city background.\n\n4.  **Card 4:**\n    *   **Title:** TISAX: Information Security for the Automotive Industry\n    *   **Asset Type:** Training Module\n    *   **Thumbnail:** Blue field with technical and security-related line-art icons (circuitry, delivery truck, security shield, checklist, EU flag in the top right).\n\n5.  **Card 5:**\n    *   **Title:** Getting To Know CASL\n    *   **Asset Type:** Mobile-First Module\n    *   **Thumbnail:** Illustration of a hand signing a document featuring a Canadian maple leaf icon.",
      "position": 1,
      "context": "Then, add the desired content to your account’s library."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/KMSAT/ModStore/Browse/ItemDetails_AddToLibrary.png",
      "alt": "The image displays the product detail page for a training module titled **\"Anti-Bribery and Corruption.\"**\n\n**Contextual and Text Elements:**\n\n*   **Module Identification:** Listed under the heading \"Training Module\" (orange text).\n*   **Metadata:** Key specifications are provided: \"10 minutes\" (duration icon), \"Training Module\" (type icon), and \"December 2023\" (date icon).\n*   **Feature Tags (Badges):** Three capability badges are displayed in orange/yellow hues: \"Brandable Content,\" \"Compliance Plus,\" and \"1 Language.\"\n*   **Description:** A truncated description begins, followed by the provider credit: \"By Popcorn Training.\"\n\n**Visual and UI Interaction Elements:**\n\n*   **Thumbnail:** A large graphic on the left depicts a blue whistle, serving as the module's cover image. A blue footer bar contains two small icons, symbolizing academic content and video content.\n*   **Action Buttons (User Interface):** A stack of three action buttons is presented below the thumbnail:\n    1.  Primary blue button: **\"View\"** (with a dropdown indicator).\n    2.  Secondary green button: **\"+ Add to Library\"** (This button is highlighted by a prominent orange arrow, indicating a suggested action).\n    3.  Tertiary white button: **\"Download.\"**\n*   **Links:** A link below the buttons provides access to **\"Open in Content Manager\"** (includes an external link icon).\n*   **Content Preview:** The lower right section shows a cropped preview of the module content, featuring a stylized cartoon business character and two navigation arrows (`<`, `>`) for browsing preview frames.",
      "position": 2,
      "context": "the item is already available in your library and does not have to be added."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_NewCampaignButton.gif",
      "alt": "The image displays the user interface for a digital content catalog labeled **ModStore**, emphasizing a featured content banner and filtering options.\n\n**1. Global Navigation (Top Bar):**\n*   The primary navigation displays \"TRAINING\" and the currently selected tab, **MODSTORE** (highlighted in blue).\n*   A horizontal orange rule separates the global navigation from the main page content.\n\n**2. Application Header and Sub-Navigation:**\n*   The application title, **ModStore** (accompanied by an orange logo), is visible.\n*   The sub-navigation tabs are **Browse** (active/selected) and **Library**.\n\n**3. Featured Content Banner (Carousel):**\n*   A promotional dark banner features multiple characters and is tagged **Featured Content**.\n*   The main title is **THE INSIDE MAN** with the subtitle **SEASON 3 OUT NOW**.\n*   Metadata below the title specifies the content format: **Video Module | 2 minutes | January 2021**.\n*   Interaction elements include left and right chevron arrows for navigation and a row of pagination dots at the bottom of the banner.\n*   Two main call-to-action buttons are present: **View Details** and **Add to Library**.\n\n**4. Filtering and Search Interface (Below Banner):**\n*   Three filter/search controls are provided horizontally:\n    *   **Content Types:** Dropdown menu currently set to **All**.\n    *   **Topics:** Dropdown menu currently set to **All**.\n    *   **Search:** Text input field displaying the placeholder text **Search** and accompanied by a magnifying glass icon for execution.",
      "position": 3,
      "context": "trong>+Create Training Campaign button in the top-right corner of the page."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/training+course+mgmt/ContentDrop-DownMenu.gif",
      "alt": "This image displays a segment of a web application configuration interface, presenting various options for managing content access, surveys, tracking, and user enrollment groups.\n\n**UI Elements and Configuration Settings:**\n\n1.  **Content Selection:**\n    *   Label: \"Content\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more items from the list...\"\n\n2.  **Content Survey Options:**\n    *   Checkbox (Checked): \"Enable Content Survey\" (Followed by an information/help icon: \"?\")\n    *   Nested Checkbox (Unchecked, within a shaded/highlighted background box): \"Allow users to leave comments\"\n\n3.  **Tracking Option:**\n    *   Checkbox (Unchecked): \"Track Scores\" (Followed by an information/help icon: \"?\")\n\n4.  **Enrollment Group Selection:**\n    *   Label (Partially Visible): \"...roll Groups\"\n    *   Input Type: Segmented button control with two options:\n        *   \"All Users\" (Active/Unselected style)\n        *   \"Specific Groups\" (Selected/Dark Gray style)\n    *   Information/help icon (\"?\") follows the segmented control.\n    *   Below the segmented control is a Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\" (This input field is relevant only when \"Specific Groups\" is selected).\n\n5.  **Automatic Enrollment Options:**\n    *   Checkbox (Checked): \"Enable automatic enrollment for new users\" (Followed by an information/help icon: \"?\")\n    *   Nested Checkbox (Unchecked, within a shaded/highlighted background box): \"Enable progress reset for remedial training\" (Followed by an information/help icon: \"?\")\n\n6.  **Additional Group Assignments (Partially Visible):**\n    *   Label (Partially Visible): \"...d Users To\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\"\n\n7.  **Completion Assignments (Partially Visible):**\n    *   Label (Partially Visible): \"...Completed\"\n    *   Input Type: Dropdown menu/Select list.\n    *   Placeholder Text: \"Select one or more groups from the list...\"\n\n**Contextual Details:**\n*   The interface utilizes checkboxes, segmented controls, and dropdowns for configuration.\n*   The use of shaded background boxes indicates dependent or secondary options that are enabled by the primary checkbox above them (e.g., \"Allow users to leave comments\" is dependent on \"Enable Content Survey\").\n*   A mouse cursor is visible in the upper right quadrant, pointing towards the area above the \"Allow users to leave comments\" box.\n*   Question mark icons (\"?\") are used extensively to indicate the availability of tooltips or supplementary help information for specific settings.",
      "position": 4,
      "context": "You can also type a keyword into the field to filter content."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_WelcomeNotif.png",
      "alt": "The screen displays a configuration form titled \"Add Automatic Training Notifications.\"\n\n**Configuration Fields:**\n\n1.  **Notification Type:** A required field utilizing a dropdown selector, currently displaying the default value \"Welcome.\"\n\n**Recipient and Template Selection:**\n\nA section titled \"Select Recipients and Templates\" presents three recipient groups, each enabled via a checked box and associated with a template dropdown selector and a help icon (question mark):\n\n| Recipient | Checkbox Status | Template Selection (Dropdown) | Action Icon |\n| :-------- | :-------------- | :---------------------------- | :---------- |\n| **User**  | Checked         | You've been enrolled in a training campaign (Fro...) | View (Eye Icon) |\n| **Manager** | Checked         | Employees Enrolled (Manager) (From KnowBe4) | View (Eye Icon) |\n| **Admin**   | Checked         | Users Enrolled (Admin) (From KnowBe4) | View (Eye Icon) |\n\n**Additional Actions:**\n\nA blue hyperlink is present beneath the recipient list: \"Manage Training Notification Templates.\"\n\n**Save Actions:**\n\nThe interface concludes with two action buttons located at the bottom left:\n*   **Save** (Primary, Blue)\n*   **Cancel** (Secondary, Gray)",
      "position": 5,
      "context": "m of the upcoming due date.\nTo create a welcome notification, follow the steps below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_DueDateNotif.png",
      "alt": "This image displays a configuration screen titled \"Add Automatic Training Notifications.\"\n\n**Notification Settings:**\n\n1.  **Notification Type:** A dropdown menu is present, currently set to **\"Remind Before Due Date.\"**\n2.  **Informational Note:** A blue-tinted box contains the text: **\"Note: Reminder notifications are sent at the beginning of business hours as specified under Account Settings.\"**\n3.  **Timing Configuration:** A field labeled **\"Send Reminder\"** precedes an input box containing the value **\"5\"**, followed by the text **\"days before due date\"** and a help icon (question mark inside a circle).\n\n**Recipient and Template Selection:**\n\n1.  The section is headed **\"Select Recipients and Templates.\"**\n2.  Three recipient types are listed, each with a checked checkbox and a help icon:\n    *   **User:** Assigned the template **\"Please complete your assigned training (From Kn...\"**\n    *   **Manager:** Assigned the template **\"Employees Incomplete (Manager) (From KnowBe4)\"**\n    *   **Admin:** Assigned the template **\"Users Incomplete (Admin) (From KnowBe4)\"**\n3.  Each template assignment uses a dropdown menu.\n4.  To the right of each dropdown is a blue eye icon, indicating a preview option.\n5.  A hyperlinked option, **\"Manage Training Notification Templates,\"** appears below the templates.\n\n**Action Buttons:**\n\nAt the bottom left, two action buttons are visible: a primary **\"Save\"** button (blue) and a secondary **\"Cancel\"** button (gray).",
      "position": 6,
      "context": "ave button.\n\nTo create a due date reminder, follow the steps below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_CampaignOverview.png",
      "alt": "This image displays the \"Overview\" section of an administrative user interface for a training campaign titled **\"Compliance Training\"** targeting **\"Groups: All Users\"**.\n\n**Header and Navigation:**\n*   A link labeled **\"← Back to Training\"** is present in the top right.\n*   The primary navigation tabs are **\"Overview\"** (active) and **\"Users\"**.\n*   A green button labeled **\"Notify Users\"** (with an envelope icon) is visible on the right.\n\n**Right Panel: Campaign Summary**\n*   **Completion Status:** A large donut chart shows **\"29%\"** completed for \"All Content\".\n*   **Status:** The current status is **\"In Progress\"** (highlighted in green).\n*   **Start Date:** **\"05/06/2021, 9:00 AM\"**.\n*   **Relative Duration:** **\"3 weeks\"**.\n*   **Users:** **\"242\"**.\n\n**Left Panel: Campaign Content**\nThis section lists individual training modules and their completion percentages:\n1.  **Insider Trading:** Shows **\"39% Completed\"** with a corresponding blue progress bar segment.\n2.  **Ethics and Code of Conduct: Handling Company Resources:** Shows **\"49% Completed\"** with a corresponding blue progress bar segment.\n*   Both modules have a button labeled **\"User Progress\"** (with a line chart icon) beneath their title.\n\n**Center Panel: User Completion Activity**\n*   This section includes a line graph titled \"Number of Users who have not completed their assignments\".\n*   The Y-axis is marked with increments (e.g., 100, 150, 200).\n*   The current data points indicate that the number of uncompleted assignments remains relatively constant, around **170 users**, across the displayed timeframe.",
      "position": 7,
      "context": "f the content, the status, start date, relative duration, number of users, and more."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/modstore/CompliancePlus_UserProgress.png",
      "alt": "This image depicts a User Management and Enrollment Status Report screen, likely from an LMS or compliance tracking platform.\n\n**I. Header and Navigation:**\n*   **Navigation:** Two primary tabs are visible: \"Overview\" (inactive) and \"Users\" (active).\n\n**II. Summary Metrics (Statistics Bar):**\n*   A row of six data tiles provides aggregate enrollment statistics.\n*   The first tile (\"All Users\") is highlighted in dark grey, indicating the current filtering context:\n    *   **All Users:** 242\n*   Subsequent tiles detail completion statuses with associated percentages and counts:\n    *   **Incomplete:** 70.2% (170)\n    *   **Not Started:** 11.6% (28)\n    *   **In Progress:** 70.2% (172)\n    *   **Completed:** 29.8% (72) (Displayed with a green progress bar)\n    *   **Past Due:** 0.4% (1) (Displayed with a small red progress bar)\n\n**III. Search and Action Bar:**\n*   **Search Input:** A text field labeled \"Search for users by name or email,\" accompanied by a magnifying glass icon for execution.\n*   **Action Buttons (Right):**\n    *   \"Bulk Update\" (Link/Button with a circular refresh arrow icon).\n    *   \"Download CSV\" (Primary green button with a download icon).\n    *   \"Actions\" (Dropdown menu button with a gear icon).\n\n**IV. Detailed Data Table:**\n*   The table lists content enrollment records, grouped by user email address. A checkbox is present next to each row for multi-selection.\n\n*   **Table Columns (Left to Right):**\n    *   *Checkbox*\n    *   **Content Name:** Includes the user email header (e.g., `BarryGoode@YourDomain.com`) followed by specific content titles (e.g., \"Ethics and Code of Conduct,\" \"Insider Trading\"). Content titles are prefixed with a small graduation cap icon.\n    *   **Enrollment Date:** (e.g., `05/06/2021`)\n    *   **Content Started:** Indicates if the content was accessed (represented by a green checkmark icon).\n    *   **Time Spent:** Recorded completion time (e.g., `00:00`).\n    *   **Time Remaining:** Displayed as a dash (`-`).\n    *   **Score:** Displayed as a dash (`-`).\n    *   **Status:** A status label, currently showing \"Completed\" in a green pill format, accompanied by a small trophy icon.",
      "position": 8,
      "context": "ser, enter their name or email address in the Search field."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "compliance",
      "plus"
    ],
    "image_count": 8
  }
}