{
  "id": 4404150738067,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/4404150738067.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/4404150738067.html",
  "author_id": 383255683393,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 1,
  "vote_sum": 17,
  "vote_count": 27,
  "section_id": 4410339705875,
  "created_at": "2021-07-23T21:34:03Z",
  "updated_at": "2025-11-12T14:41:33Z",
  "name": "Gmail Add-on Phish Alert Button (PAB) Guide",
  "title": "Gmail Add-on Phish Alert Button (PAB) Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-11-12T14:41:33Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "localized",
    "answerbot",
    "answerbot_enduser"
  ],
  "body": "<p>Your organization may have recently installed the Gmail Add-on Phish Alert Button (PAB). In this article, you will learn how this tool works and how you can use it to help keep your organization safe from malicious phishing emails.</p>\n<h2 id='h_01HPF7PT5W1A63TP5HEYRGZQ3T'>When to Use the PAB</h2>\n<p>You should select the PAB anytime you suspect that you have received a phishing email or any potentially dangerous email. The emails you report may also be forwarded to a designated contact within your organization for analysis.</p>\n<h2 id='h_01HPF7PT5WN8CSH6WESYZM3B9X'>How to Use the PAB</h2>\n<p>You can use the <strong>PAB</strong> icon to report any email as a phishing email, but you cannot use the PAB to report multiple emails at once. You should report each potential phishing email individually. However, if you report an email that has multiple emails associated with it, all of the associated emails will be reported as well.</p>\n<h3 id='h_01HPF7PT5WZPXAW7X7AQ3W6XT3'>Gmail Inbox</h3>\n<p>To use the PAB add-on in your Gmail inbox, follow the steps below:</p>\n<ol>\n<li>Log in to your Gmail account on your web browser.</li>\n<li>Open the email that you would like to report.</li>\n<li>Open the add-on menu on the right side of your Google inbox and select the <strong>phish hook</strong> icon to open the PAB add-on.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnPAB.gif'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnPAB.gif' alt=' ' width='567' height='290'></a></p>\n</li>\n<li>(Optional) You can also add comments and select a disposition to provide more information about the email.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABComments.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABComments.png' alt=' ' width='526' height='328'></a></p>\n</li>\n<li>Select the blue <strong>Phish Alert</strong> button to report the email.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABReporting.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABReporting.png' alt=' ' width='526' height='328'></a></p>\n</li>\n<li>Once the confirmation message appears, select the back arrow to go back to your inbox. The reported email will be moved to the Trash folder.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>If you're viewing an email in split pane mode, the back arrow is not available. You can change your Gmail inbox settings to make the back arrow visible. You can also select <strong>Inbox</strong> or your browser's back arrow to go back to your inbox.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABReportingBack.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABReportingBack.png' alt=' ' width='526' height='328'></a></p>\n</li>\n</ol>\n<h3 id='h_01HPF7PT5WYZWWH5WBCHTDM6SG'>Gmail Mobile</h3>\n<p>To use the PAB add-on from the Gmail app on your mobile device, follow the instructions below.</p>\n<ol>\n<li>Log in to the Gmail app on your mobile device.</li>\n<li>Open the email that you would like to report.</li>\n<li>Scroll to the bottom of the screen and locate the available add-ons section.</li>\n<li>From the add-ons section, select the <strong>phish hook</strong> icon and scroll down to the bottom of the screen to access the PAB.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile.png' alt=' ' width='244' height='531'></a></p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile2.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile2.png' alt=' ' width='244' height='531'></a></p>\n</li>\n<li>Select the blue <strong>Report</strong> button to report the email.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile3.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile3.png' alt=' ' width='244' height='528'></a></p>\n</li>\n<li>If enabled, you will see a confirmation message, and the email will be moved to your Trash folder.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobileSuccess.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobileSuccess.png' alt=' ' width='256' height='552'></a></p>\n</li>\n<li>Select the back arrow to return to your inbox.</li>\n</ol>\n<h2 id='h_01HPF7PT5WPBCDSV7C033T3JEB'>Reason to Use the PAB</h2>\n<p>Reporting emails will help your organization stay safe. Because the potential phishing emails you report are sent to your organization for analysis, your organization will be aware of which phishing attacks are able to reach their users' inboxes. Once everyone is aware of possible vulnerabilities, they can better defend against cyber attacks. You are an important part of the process of keeping your organization safe from cybercriminals. Stop, look, and think!</p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/4404150738067-Gmail-Add-on-Phish-Alert-Button-PAB-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnPAB.gif",
      "alt": "This image displays the full-screen desktop view of a received email within the Google Gmail web interface.\n\n**UI Environment:**\nThe interface utilizes a dark grey desktop background visible through the application window. The user is logged in under the \"knowbe4 D\" profile and is marked as \"Active.\" The standard Gmail layout includes a left navigation rail (Mail, Chat, Meet) and a right-hand sidebar containing application shortcuts (Calendar, Keep, Tasks, and a non-standard orange hook icon).\n\n**Email Metadata and Controls:**\nThe email is titled **\"Email Server Migration Failure\"** and is marked with the label **\"Inbox.\"** A prominent suggestion button, **\"Summarize this email,\"** is visible beneath the subject line. The email header shows the sender as **\"IT <IT@knowbe4.com>\"** addressed \"to User.\" The message was received on **\"Mon, Nov 3, 2:29 PM (3 days ago).\"** Standard action icons (Star, Reply, More Options) are present in the top right of the message pane.\n\n**Email Content (Body Text):**\nThe message text addresses a technical failure:\n1.  **Context:** \"The IT Department was running an email server migration last night and encountered an error with several email accounts. Your account happened to be one of them.\"\n2.  **Resolution Request:** \"We attempted to resolve this problem and believe we have fixed it. If your email has been working just fine, please let us know by going to this secure **website** and validate your email address is working.\" (The word \"website\" is rendered as a blue, underlined hyperlink, but the destination URL is obscured.)\n3.  **Sign-off:** The email concludes with \"Thanks for your quick cooperation, IT.\"\n\n**User Interaction Elements:**\nThree standard response buttons are displayed at the bottom of the email body: **Reply**, **Reply all**, and **Forward**.",
      "position": 1,
      "context": "Google inbox and select the phish hook icon to open the PAB add-on."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABComments.png",
      "alt": "This image displays the Google Mail (Gmail) interface featuring an open email being processed by a security extension.\n\n**Primary Email Content (Left Panel):**\n*   **Subject:** \"Email Server Migration Failure\"\n*   **Sender:** \"IT <IT@knowbe4.com>\"\n*   **Body Context:** The text claims a server migration error has been fixed and directs the recipient to a \"secure **website**\" to \"validate your email address is working,\" consistent with a phishing attempt attempting credential harvesting.\n*   **UI Elements:** Standard email controls are visible, including \"Summarize this email,\" \"Reply,\" \"Reply all,\" and \"Forward.\"\n\n**Security Extension (Right Panel - Phish Alert):**\n*   A vertical sidebar, titled \"Phish Alert,\" is active, associated with \"KnowBe4 Inc. / Report Email.\"\n*   **Confirmation Text:** \"Are you sure you want to report this as a phishing email?\"\n*   **Subject Confirmation:** Confirms the subject is \"Email Server Migration Failure.\" A link to \"Show Sender's Details\" is present.\n*   **Email Classification:** This section provides three radio button options:\n    1.  **(Selected):** \"Phishing or Suspicious - I think this email is suspicious.\"\n    2.  **(Unselected):** \"Spam or Junk - I think this email is spam.\"\n    3.  **(Unselected):** \"Unknown - I'm not sure how to categorize this email.\"\n*   **Comment Input:** A text input field beneath the classification options contains the user-entered text: \"This looks like a phish.\"\n*   **Action Button:** The process concludes with a prominent blue submission button labeled \"Phish Alert.\"",
      "position": 2,
      "context": "add comments and select a disposition to provide more information about the email."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABReporting.png",
      "alt": "This image is a screenshot of the Google Mail (Gmail) interface displaying an email being reported as a potential phishing attempt via a third-party security plugin (KnowBe4's Phish Alert Button).\n\n**Left Pane (Email Context):**\nThe central content displays an email with the subject line \"Email Server Migration Failure.\" The sender is identified as \"IT <IT@knowbe4.com>.\" The body text details a simulated server migration failure and prompts the recipient to navigate to a \"secure website\" to \"validate your email address,\" a common phishing technique.\n\n**Right Pane (Phish Alert Tool):**\nA vertical sidebar, titled \"Phish Alert,\" overlays the right side of the screen, indicating the active use of a security reporting tool provided by \"KnowBe4 Inc.\" Key UI elements within the alert window include:\n\n1.  **Confirmation Prompt:** \"Are you sure you want to report this as a phishing email?\"\n2.  **Subject Confirmation:** Displays the email's subject: \"Email Server Migration Failure.\" A clickable link, \"Show Sender's Details,\" is present below the subject.\n3.  **Email Classification:** A section containing three radio button options:\n    *   **Selected:** \"Phishing or Suspicious - I think this email is suspicious.\"\n    *   **Deselected:** \"Spam or Junk - I think this email is spam.\"\n    *   **Deselected:** \"Unknown - I'm not sure how to categorize this email.\"\n4.  **Comment Box:** A text input field pre-filled with the user comment: \"This looks like a phish.\"\n5.  **Action Button:** The final submission control is a prominent blue button labeled \"**Phish Alert**.\" A large, red instructional arrow points directly to this button, indicating the intended user action.",
      "position": 3,
      "context": "/li>\nSelect the blue Phish Alert button to report the email."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailPABReportingBack.png",
      "alt": "This image displays the Gmail interface showing an open email and an active third-party security plugin sidebar, specifically the \"Phish Alert\" tool from KnowBe4.\n\n**Main Email Content Area (Left):**\n\n*   **Email Subject:** \"Email Server Migration Failure\" (labeled with an \"Inbox\" tag).\n*   **Sender:** \"IT\" `<IT@knowbe4.com>`.\n*   **Recipient:** \"to User\".\n*   **Timestamp:** \"Mon, Nov 3, 2:29 PM (3 days ago)\".\n*   **Email Body Excerpt:** A notification claiming that \"The IT Department was running an email server migration last night and encountered an error,\" and asking the user to visit a secure \"website\" (linked text) to \"validate your email address is working.\"\n*   **UI Elements:** Standard Gmail toolbar icons (Back arrow, Archive, Report Spam, Delete, etc.) are visible above the email content. A red arrow points specifically to the **Back arrow** icon. Reply, Reply all, and Forward buttons are present at the bottom.\n\n**Phish Alert Sidebar (Right):**\n\n*   **Title:** \"Phish Alert\".\n*   **Header:** Displays \"KnowBe4 Inc.\" and \"Report Email\" beneath an envelope icon with a hook.\n*   **Prompt:** \"Are you sure you want to report this as a phishing email?\"\n*   **Subject Confirmation:** Shows the subject as \"Email Server Migration Failure\" with a clickable button \"Show Sender's Details.\"\n*   **Email Classification Section:** Offers three radio button options, with the first option selected:\n    1.  **[Selected]** \"Phishing or Suspicious - I think this email is suspicious.\"\n    2.  \"Spam or Junk - I think this email is spam.\"\n    3.  \"Unknown - I'm not sure how to categorize this email.\"\n*   **Comment Field:** A text box contains the partially visible input: \"This looks like a phish\" followed by a link to \"Add a comment...\"\n*   **Action Button:** A large blue button labeled \"Phish Alert.\"",
      "position": 4,
      "context": "or your browser's back arrow to go back to your inbox."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile.png",
      "alt": "The image displays a screenshot of an email thread on a mobile device, likely within a Gmail application interface.\n\n**Header and Subject:** The email is titled, \"Scheduled Tests on Your Computer.\" It is labeled with a yellow \"External\" tag and a grey \"Inbox\" tag. The top navigation bar includes icons for Archive, Delete, and More Options.\n\n**Sender Information:** The email is from \"Ron W.\" sent at \"19:58.\"\n\n**Email Body:**\nThe text claims the sender, identifying as \"Ron,\" is a Senior Technician with \"ISP Services\" who was contacted by the recipient's IT department to run diagnostic tests.\nThe core instruction is: \"In order to complete my tests I need you to please visit **this site** [hyperlink], download the test files, and run them on your computer. Just click Run when prompted. The program will send some information back to me and then delete itself.\"\nThe signature reads: \"R. Weasley, Senior Technician, ISP Services.\"\n\n**UI Elements (Bottom):**\nBelow the email body are Smart Reply buttons: \"Will do.\", \"Thank you, I will do that.\", and \"Done.\"\nStandard email interaction buttons include: \"Reply,\" \"Reply all,\" and \"Forward.\"\n\n**Footer and Action Icon:**\nThe footer area includes the text \"Available add-ons:\". A red arrow explicitly points to a circular action button located on the bottom right, which contains a stylized fish hook icon. This icon typically represents the \"Report Phishing\" function in the application.",
      "position": 5,
      "context": "hook icon and scroll down to the bottom of the screen to access the PAB."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile2.png",
      "alt": "The image displays a mobile phone screen showing an email opened in an application, likely Gmail, and integrated with a security add-on.\n\n**Header and Status Bar:**\n*   **Time:** 20:00.\n*   **System Icons:** Icons for Wi-Fi, battery, and notifications are visible, along with a front-facing camera cutout (punch hole design).\n*   **App Navigation:** Icons for back arrow, archive, delete, mark unread, and a three-dot menu (top right) are present.\n\n**Email Details:**\n*   **Subject:** \"Scheduled Tests on Your Computer\".\n*   **Labels:** Two adjacent labels are displayed: \"External\" (yellow background) and \"Inbox\" (white/light background).\n*   **Sender:** \"Ron W.\"\n*   **Timestamp:** 19:58.\n*   **Recipient:** \"to me\".\n\n**Email Body Content (Key Phishing Elements):**\n*   The email claims to be from a \"local Internet Service Provider\" assisting the recipient's \"IT department.\"\n*   It instructs the user to \"visit this site, download the test files, and run them on your computer.\"\n*   It further states, \"The program will send some information back to me and then delete itself.\" The word \"site\" is hyperlinked (blue text).\n\n**Security Add-on/Detection Interface:**\n*   Below the main email content, a section titled \"Available add-ons:\" appears.\n*   **Highlighted Area (Phishing Indicator):** An orange arrow points from the text body to a stylized, orange fishing hook icon enclosed in a circle, indicating a detected phishing link or threat (likely as part of a training exercise).\n*   **Add-on Banner:** A prominent blue banner is labeled \"Phish Alert.\"\n*   **Reporting Interface:** Below the banner, the identity \"KnowBe4 Inc.\" is shown, accompanied by an icon of an envelope with a fishing hook. The adjacent text is \"Report Email.\"\n*   **Confirmation Prompt:** A prompt asks, \"Are you sure you want to report this as a phishing email?\"\n*   **Footer Details:** The subject is repeated under a \"SUBJECT:\" label. A button labeled \"SHOW SENDER'S DETAILS\" is displayed at the bottom of the visible screen.",
      "position": 6,
      "context": ".com/PAB-FAQ/GPAB/GmailAddOnMobile.png' alt=' ' width='244' height='531'>"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobile3.png",
      "alt": "The image displays a smartphone screen showing an email opened within a mobile application (likely Gmail). The email is titled **\"Scheduled Tests on Your Computer\"** and is labeled as **\"External\"** and **\"Inbox.\"**\n\n**Email Content Summary:**\n*   **Sender:** Ron W., sent at 19:58.\n*   **Body:** The sender claims to be with a local Internet Service Provider, contacted by the recipient's IT department to run diagnostic tests. The email instructs the user to click a hyperlinked word (**\"this site\"**), download test files, run them, and notes that \"The program will send some information back to me and then delete itself.\"\n\n**UI Elements and Context:**\n\n1.  **Header/Navigation Bar (Top):** Displays time (**20:00**), status icons (Wi-Fi, battery, etc.), and standard email actions: Back arrow, Archive icon, Delete (Trash) icon, Mark as Unread icon, and a three-dot More options menu.\n2.  **Email Actions (Mid-Right):** Includes a Star icon (to mark as favorite) and a curved Reply arrow with a three-dot menu for additional message actions.\n3.  **Security/Add-on Interface (Below Email Body):** A section labeled **\"Available add-ons:\"** precedes a prominent blue banner titled **\"Phish Alert.\"** A fishing hook icon is present in the upper right of this section.\n4.  **Reporting Interface (Phish Alert):** This custom interface features an **\"EMAIL CLASSIFICATION:\"** section with radio buttons:\n    *   **Selected:** \"Phishing or Suspicious - This email is a threat.\"\n    *   **Unselected:** \"Spam or Junk - This email is spam.\"\n    *   **Unselected:** \"Unknown - I'm not sure how to describe this email.\"\n    *   A multiline text input field is provided below, prompting the user to **\"Add a comment...\"**\n5.  **Action Button:** A large, prominent blue button at the bottom reads **\"REPORT.\"** A red arrow is overlaid on the image, pointing specifically to this \"REPORT\" button, indicating the intended user action.",
      "position": 7,
      "context": "/p>\n\nSelect the blue Report button to report the email."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PAB-FAQ/GPAB/GmailAddOnMobileSuccess.png",
      "alt": "The image displays a mobile device screen running an email application, specifically viewing a single message that has been reported as a simulated phishing attempt.\n\n**UI and Context:**\n\n1.  **Status Bar:** Displays the time (20:01) and standard connectivity/battery indicators, with a charging cable visible at the base of the phone.\n2.  **Email Header:** The subject is \"Scheduled Tests on Your Computer,\" tagged with an \"External\" yellow pill-box and \"Inbox.\" The sender is listed as \"Ron W.\" at 19:58.\n3.  **Email Body (Phishing Content):** The text identifies the sender as \"Ron\" from a \"local Internet Service Provider\" claiming cooperation with the IT department for \"diagnostic tests.\" It instructs the recipient to \"please visit this site\" (a blue, underlined hyperlink), download, and run \"test files\" that will gather information and \"then delete itself.\"\n4.  **Security Integration:** An intermediate section, labeled \"Available add-ons,\" shows a blue banner for the security tool: \"Phish Alert,\" affiliated with \"KnowBe4 Inc.,\" and displaying the status \"Success.\" This banner includes a fishing hook icon, symbolizing the action taken against the phish.\n5.  **Confirmation Screen:** The final section confirms the action with the bold header, \"Email Reported Successfully.\" The body text provides immediate feedback: \"Congratulations! The email you reported was a simulated phishing attack initiated by your company. Good job!\" The final instruction is to \"Refresh this page and return to your inbox.\"",
      "position": 8,
      "context": "e a confirmation message, and the email will be moved to your Trash folder."
    }
  ],
  "metadata": {
    "category": "",
    "section": "",
    "topics": [
      "alert",
      "gmail",
      "pab",
      "phish"
    ],
    "image_count": 8
  }
}