{
  "id": 4410161863955,
  "url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/4410161863955.json",
  "html_url": "https://Criscras13.github.io/KB_Transformer/site_src/static/api/v2/help_center/en-us/experimental/articles/4410161863955.html",
  "author_id": 403968826754,
  "comments_disabled": true,
  "draft": false,
  "promoted": false,
  "position": 0,
  "vote_sum": 9,
  "vote_count": 17,
  "section_id": 26428384978451,
  "created_at": "2021-11-09T18:15:53Z",
  "updated_at": "2025-10-08T21:32:05Z",
  "name": "Phishing Templates Advanced Features Guide",
  "title": "Phishing Templates Advanced Features Guide",
  "source_locale": "en-us",
  "locale": "en-us",
  "outdated": false,
  "outdated_locales": [],
  "edited_at": "2025-10-01T13:30:53Z",
  "user_segment_id": null,
  "permission_group_id": 195648,
  "content_tag_ids": [],
  "label_names": [
    "MAPS",
    "PHISHING TEST",
    "account settings",
    "acknowledge a policy",
    "Template",
    "PhishER",
    "How to Create an Action in PhishER",
    "SCORM files",
    "PhishML",
    "Learner Dashboard",
    "access account",
    "Security Coach",
    "#localize"
  ],
  "body": "<p>In your KSAT console, you can find the <strong>Phishing Templates </strong>subtab under the <strong>Phishing </strong>tab. This subtab allows you to search through our selection of system templates to meet your organization’s needs. To learn more about this subtab, see the sections below. You can also exclude system templates from your phishing campaigns, manage templates, create new templates, and manage template topics.</p>\n<h2 id='h_01J44MREKYW5KA96B7E3TJEV4G'>How to Opt in to Advanced Features</h2>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>All accounts will be migrated to phishing templates advanced features in 2025. New accounts created after January 2025 will be automatically migrated. For more information and answers to questions that may not be covered in this article, please see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/45009014447251.html'>FAQ: Phishing Templates Advanced Features</a> article.</div>\n</div>\n<p>By default, advanced features for the <strong>Phishing Templates</strong> subtab are disabled. To use the advanced features, click the <strong>Opt In</strong> button.</p>\n<p>When you opt in to the advanced features, the <strong>Legacy Email Templates</strong> subtab of the <strong>Phishing</strong> tab will no longer display in your console. You'll be able to use the<strong> Phishing Templates</strong> subtab to search for your templates instead.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplatesTab.png'> <img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplatesTab.png'></a></p>\n<p>For a list of more changes that occur when you opt in, see the list below.</p>\n<ul>\n<li>Phishing campaign <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115011714968.html'>categories</a> will be migrated to topics. This migration may take up to one hour.</li>\n<li>Custom phishing templates will transfer over when you opt in to advanced features.</li>\n<li>Our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115010414108.html'>Security Hints and Tips</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/226314167.html'>Scam of the Week</a> newsletters will be located in the <strong>Users</strong> &gt; <strong>Messages</strong> section.</li>\n<li>Existing phishing campaigns, Scam of the Week campaigns, and Security Hints and Tips campaigns will continue to run and can be edited.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Phishing Campaigns using Scam of the Week and Security Hints and Tips from the legacy email templates subtab will need to be added in the <strong>Users </strong>&gt; <strong>Messages</strong> section.</div>\n</div>\n</li>\n<li>Phishing campaigns using system templates will automatically be localized. If you have users with multiple languages on your account, <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360060622513.html'>user phishing languages must be set</a>.\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Because not all system templates are available in all user phishing languages, you must set the default phishing language for the account in Account Settings. Be advised that a phishing campaign will not be created if no templates are available in a user’s language.</div>\n</div>\n</li>\n<li>If you have a partner account and opt in at the partner level, all your managed accounts will be opted in to the new user experience.\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>For managed accounts to receive managed phishing campaigns, both the managed and the partner accounts must be opted in to advanced features.</div>\n</div>\n</li>\n<li>\n<a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/228001628.html'>Hidden system templates or categories</a> will become <a href='#h_01J44NY0RCNT9DX147DBB84X2C'>excluded system templates or topics.</a>\n</li>\n</ul>\n<h2 id='h_01HS1N5KB4BHY2TY86YVVMF9PK'>System Templates</h2>\n<p>In the <strong>System Templates </strong>section of the <strong>Phishing Templates </strong>subtab, you can search through system templates by using filters and clone templates to use in your phishing campaigns.</p>\n<h3 id='h_01JRDNK9CYRD36M196HAS4YQ6Q'>System Template Origins</h3>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/AdvancedPhishingFeatures_SystemTemplateOrigin.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/AdvancedPhishingFeatures_SystemTemplateOrigin.png' alt=''> </a></p>\n<ul>\n<li>\n<strong>Community</strong>: These phishing templates have been submitted to our System Templates by other KnowBe4 admins.</li>\n<li>\n<strong>KnowBe4</strong>: These templates include original and innovative phishing methods created by the KnowBe4 team.</li>\n<li>\n<strong>Reported Phish</strong>: Our users reported these phishing templates using our Phish Alert Button (PAB). Admins can use these trending phishing emails to phish their users by using the Reported Phishes of the Week topic, which is updated weekly. We remove any malicious links and identifying information from the original phishing emails before adding them to our template library.</li>\n<li>\n<strong>Real Scam</strong>: These phishing emails are based on actual scams that the KnowBe4 templates team has researched in security news and blogs. We have recreated them for admins to use when phishing their users.</li>\n</ul>\n<h3 id='h_01HS1N5KB4DAWN62E46XFG5PEA'>Searching for System Templates</h3>\n<p>To learn how you can search for templates on the <strong>Phishing Templates </strong> subtab, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingTemplates_Settings.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingTemplates_Settings.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>System Topics:</strong> Use this sidebar menu to view and select from system topics.</li>\n<li>\n<strong>Show Excluded Topics:</strong> Use this toggle to only show topics you have excluded from use.</li>\n<li>\n<strong>Languages:</strong> Use this filter to find localized templates for the selected languages.</li>\n<li>\n<strong>Difficulty:</strong> Use this filter to find templates with the selected difficulty ratings. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/218333717.html'>Template Difficulty Ratings Overview</a> article.</li>\n<li>\n<strong>Search:</strong> Use this filter to find templates with a specific keyword in the title.</li>\n<li>\n<strong>Additional Filters:</strong> Select this drop-down menu to view additional filter options.</li>\n<li>\n<strong>Attack Vectors:</strong> Use this filter to find templates with specific attack vectors, such as attachments with links.</li>\n<li>\n<strong>Template Features:</strong> Use this filter to find templates with specific features, such as data entry templates.</li>\n<li>\n<strong>Placeholders:</strong> Use this filter to find templates that contain specific placeholders, such as the Company Name placeholder.</li>\n<li>\n<strong>Red Flags:</strong> Use this filter to find templates that contain specific red flags, such as the Aggressive Content red flag.</li>\n</ol>\n<h3 id='h_01HS1N5KB4P3SZGB7DNRQ3C75M'>Viewing Your Search Results</h3>\n<p>After you finish selecting your filters, you will see a list of templates that meet your criteria in the results table. Here, you can view information about the template, including the template’s name, category, language, difficulty rating, when it was last updated, and origin. You can also clone templates, preview templates, and clear your filters.</p>\n<p>For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/SearchResults.png'><img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/SearchResults.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Clear Filters</strong>: You can click this link to remove all of your selected filters and reset the template list.</li>\n<li>\n<strong>Preview</strong>: You can click this icon to preview the template.</li>\n<li>\n<strong>Exclude:</strong> Use this toggle to exclude individual templates. For more information, see the <a href='#h_01J44NY0RCNT9DX147DBB84X2C'>Excluding Templates from Campaigns</a> section below.</li>\n</ol>\n<h3 id='h_01HS1N5KB4TMNN2EJYQ2RN40DR'>Cloning Templates for Use</h3>\n<p>On the <strong>Phishing Templates </strong> subtab, you can clone a template to use in your phishing campaigns. When you clone a template, it will automatically be saved to the <strong>My Templates</strong> section of the <strong>Phishing Templates </strong>subtab.</p>\n<p>To clone a template for use, follow the steps below:</p>\n<ol type='a'>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to <strong>Phishing </strong>&gt;<strong> Phishing Templates </strong>.</li>\n<li>Select the check box next to the template or templates you want to clone. Then, click <strong>Clone Selected Templates</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneTemplateWindow.png'><img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneTemplateWindow.png' alt=' '></a></p>\n</li>\n<li>The <strong>Clone Selected Templates</strong> pop-up will open. Select a language and topic for the templates.</li>\n<li>Once you've made your selections, click <strong>Clone</strong> at the bottom of the pop-up window.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneSelectedTemplates.png'><img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneSelectedTemplates.png' alt=' '></a></p>\n</li>\n<li>These templates will now appear in the <strong>My Templates</strong> section.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplates-MyTemplates.png'> <img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplates-MyTemplates.png'></a></p>\n</li>\n</ol>\n<div class='callout callout-note'>\n<div>\n<strong>Note:</strong> If you would like to copy a custom template, you'll need to copy the source code and paste it in a new template using the <strong>Source</strong> button.</div>\n</div>\n<h3 id='h_01J44NY0RCNT9DX147DBB84X2C'>Excluding Templates from Campaigns</h3>\n<p>In the <strong>System Templates</strong> section, you can exclude templates from being used in phishing campaigns. For example, if you would like to create a phishing campaign that uses <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500003848062.html'>automated template selection</a> to select templates from the <strong>Social Networking</strong> topic, you could use this feature to exclude a template that is in that topic.</p>\n<p>There are two methods for excluding templates. To exclude an individual template, click the <strong>Exclude Template</strong> toggle in the <strong>Actions</strong> column.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishingTemplates/ExcludeTemplateToggle.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishingTemplates/ExcludeTemplateToggle.png' alt=''> </a></p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> Hiding topics does not remove them from the list but highlights them in gray.</div>\n</div>\n<p>To exclude multiple templates, click the <strong>Templates Exclusions</strong> link in the top-right corner of the page, which will take you to the <strong>Template Exclusions</strong> page. On this page, you can use the filters to exclude templates that meet your selected criteria. For more information, see the screenshot and list below:</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> Translated versions of these templates will also be excluded from phishing campaigns.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/TemplateExclusions.png'> <img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/TemplateExclusions.png'></a></p>\n<ol type='a'>\n<li>\n<strong>Topics:</strong> You can use this filter to exclude templates that cover specific topics. You can also use the <strong>Show Excluded Topics</strong> toggle to show<strong> Excluded Topics</strong> in the list. For a full list of topics, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/115011714968.html'>Phishing Template Category Glossary</a>.</li>\n<li>\n<strong>Attack Vectors:</strong> You can use this filter to exclude templates that include specific attack vectors.</li>\n<li>\n<strong>Template Features:</strong> You can use this filter to exclude templates with specific features.</li>\n<li>\n<strong>Placeholders:</strong> You can use this filter to exclude templates that contain specific placeholders.</li>\n<li>\n<strong>Only Show Individual Exclusions:</strong> You can use this toggle to only show individual template exclusions.</li>\n<li>\n<strong>Exclusion Type:</strong> This column shows the exclusion type for each template. The <strong>hidden eye</strong> <strong>icon</strong> represents individual exclusions and the <strong>filter</strong> <strong>icon</strong> represents criteria exclusions.</li>\n</ol>\n<h2 id='h_01J44P508PM8NHFDB4SYAJ4QYN'>My Templates</h2>\n<p>In the <strong>My Templates</strong> section of the <strong>Phishing Templates</strong> subtab, you can search through your templates and manage your template topics.</p>\n<div class='callout-note'>\n<div>\n<strong>Important: </strong>We also offer the option to generate AI phishing templates based on your specifications. For more information, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/30990080170771.html'>AIDA Template Generation Guide</a>.</div>\n</div>\n<h3 id='h_01J44PC6PDBTHQ2CYZF9J4EBGE'>Searching for Your Templates</h3>\n<p>In the <strong>My Templates</strong> section, you can use filters to navigate and search for your templates. For more information about these filters, see the screenshot and list below.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTemplates.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTemplates.png' alt=''> </a></p>\n<ol>\n<li>\n<p><strong>My Topics:</strong> Use this sidebar menu to view and select from custom topics.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>You can select multiple topics at the same time. Click a topic row to select and highlight it. To deselect a topic, click the topic row again, and the highlight will be removed.</div>\n</div>\n</li>\n<li>\n<p><strong>+ Add:</strong> Use this button to create and add new topics to the <strong>My Topics</strong> sidebar menu.</p>\n</li>\n<li>\n<p><strong>Languages:</strong> Use this filter to find localized templates for the selected languages.</p>\n</li>\n<li>\n<p><strong>Difficulty:</strong> Use this filter to find templates that have the selected difficulty ratings. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/218333717.html'>Template Difficulty Ratings Overview</a> article.</p>\n</li>\n<li>\n<p><strong>Search:</strong> Use this filter to find templates with a specific keyword in the title.</p>\n</li>\n</ol>\n<h3 id='h_01J44PEQSTD3RGTACYXE007HYZ'>Viewing Your Search Results</h3>\n<p>Once your filters are selected, the results table will display templates that match your selected filter criteria. For more information about the results table, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/ResultsTable.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/ResultsTable.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>Template Name:</strong> This column displays the name of the template.</li>\n<li>\n<strong>Updated:</strong> This column displays when the template was last updated.</li>\n<li>\n<strong>Language:</strong> This column displays the localized language used in the template.</li>\n<li>\n<strong>Difficulty:</strong> This column displays the assigned difficulty rating of the template.</li>\n<li>\n<strong>Topics:</strong> This column displays the assigned template topics.</li>\n<li>\n<strong>Preview:</strong> Click the eye icon to preview the template.</li>\n<li>\n<strong>Import:</strong> Click this button to open the <strong>Import Templates</strong> pop-up window and import custom templates.</li>\n<li>\n<strong>Clear Filters:</strong> Click this button to remove all the selected filters and reset the template list.</li>\n</ol>\n<h3 id='h_01J44T4CJEBB9FJNPRK2P13XGW'>Managing Your Template Topics</h3>\n<p>The <strong>My Templates</strong> section can also be used to add, edit, and remove template topics. Add a topic to your templates to easily find and select the types of templates you want to add to your phishing campaigns.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Before adding a template to a topic, you'll need to create at least one topic.</div>\n</div>\n<h4 id='h_01JPQFV19267J1RJEW8YTW80VN'>Adding a Topic</h4>\n<p>To add a topic, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to <strong>Phishing</strong> &gt; <strong>Phishing Templates</strong>.</li>\n<li>Click <strong>+ Add</strong> next to <strong>My Topics</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/Add.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/Add.png' alt=''> </a></p>\n</li>\n<li>In the text field, enter a name for the topic.</li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<p>Once you add topics, you can edit or remove any topic by hovering over the chosen topic in the sidebar menu and clicking the <strong>pencil</strong> or <strong>trash can</strong> icon.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopicsSidebar.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopicsSidebar.png' alt=''> </a></p>\n<h4 id='h_01JPQG7SP678TVS26JM0SCWDR7'>Adding a Template to a Topic</h4>\n<p>To add templates to topics, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to <strong>Phishing</strong> &gt; <strong>Phishing Templates</strong>.</li>\n<li>Select <strong>My Templates</strong>.</li>\n<li>Navigate to your desired template in the results table.</li>\n<li>Select the check box next to the template you would like to add to a topic.</li>\n<li>From the <strong>Select Topic</strong> drop-down menu, select the topic that you would like to add the template to.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/SelectTopicDropDownMenu.png'> <img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/SelectTopicDropDownMenu.png' alt=''> </a></p>\n</li>\n<li>Click <strong>Add</strong>.</li>\n</ol>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>You can add templates to more than one topic.</div>\n</div>\n<h4 id='h_01JPQN8H35V2HWPRM4KG65MRT9'>Removing a Template from a Topic</h4>\n<p>To remove templates from topics, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to <strong>Phishing</strong> &gt; <strong>Phishing Templates</strong>.</li>\n<li>Select <strong>My Templates</strong>.</li>\n<li>Navigate to your desired template in the results table.</li>\n<li>Select the check box next to the template.</li>\n<li>From the <strong>Select Topic</strong> drop-down menu, select the topic that you would like to remove the template from.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopics_SelectTopics.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopics_SelectTopics.png' alt=''> </a></p>\n</li>\n<li>Click <strong>Remove</strong> to remove the template from the topic.</li>\n</ol>\n<h2 id='h_01J44TCSQA7BNVWMAK4DR28CEC'>Creating Phishing Campaigns with Template Topics</h2>\n<p>When you create phishing campaigns, you'll have access to the <strong>New Phishing Campaign</strong> page with a <strong>Template Topics</strong> drop-down menu. This drop-down menu allows you to select topics for your phishing templates.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_TempTopics.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_TempTopics.png' alt=''> </a></p>\n<p>In the <strong>Template Selection</strong> drop-down menu, you can select how your users will receive their emails. You can select a specific template or use one of our Automated Template Selections: <strong>AIDA Selected</strong>, <strong>Full Random</strong>, or <strong>Random</strong>. If you select a specific template, the <strong>Specific Template</strong> drop-down menu will appear. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/1500003848062.html'>Automated Template Selection Overview</a> article.</p>\n<p>In the <strong>Available Templates</strong> drop-down menu, you can view the list of phishing templates that will be sent to your users. From this list, you can view the <strong>Template Name</strong>, <strong>Topics</strong>, and <strong>Languages</strong>. You can also preview the template.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_AvailableTemplates2.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_AvailableTemplates2.png' alt=''> </a></p>",
  "user_segment_ids": [],
  "source_url": "https://support.knowbe4.com/hc/en-us/articles/4410161863955-Phishing-Templates-Advanced-Features-Guide",
  "images": [
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplatesTab.png",
      "alt": "The image displays the header and primary horizontal navigation for a web application interface focused on security assessment tools.\n\n**Header Section:**\nThe page title is displayed in large, bold font as **Phishing Templates**, preceded by a magnifying glass icon (Search icon). A thin horizontal divider separates the header from the navigation bar.\n\n**Navigation Bar (Tabs):**\nA row of navigation tabs follows, listing available sub-sections: Overview, Campaigns, Phishing Templates, Landing Pages, Domains, Ignored IPs, and Reports.\n\n**Current State:**\nThe **Phishing Templates** tab is highlighted with a light gray background, indicating it is the currently active section. This active tab also features a persistent blue pill-shaped badge labeled **New** positioned in the upper right corner, indicating recent updates or additions to the module. Inactive tabs are rendered in blue text.",
      "position": 1,
      "context": "rong> Phishing Templates subtab to search for your templates instead."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/AdvancedPhishingFeatures_SystemTemplateOrigin.png",
      "alt": "This image displays a segment of a web application's data table, specifically a list of templates.\n\n**Header/Context:**\nThe title is \"**All Templates - 7782 Results**\" indicating the current view and the total record count. In the top right, a blue text link labeled \"**Clear Filters**\" is present, preceded by a grey circular arrow/refresh icon.\n\n**Table Structure (Column Headers):**\nThe table headers, which are clickable sorting elements (indicated by the up/down arrows), are:\n1. (Checkbox)\n2. **Template Name** (with a sorting arrow icon)\n3. **Topics**\n4. **Languages** (with a sorting arrow icon)\n5. **Difficulty**\n6. **Updated On** (with a sorting arrow icon)\n7. **Origin** (with a sorting arrow icon)\n8. **Actions**\n\n**Data Row 1:**\nThe first visible data row contains details for a single template:\n* **Checkbox:** Unchecked.\n* **Template Name:** \"**PUBLISHING NOTICE (Link)**\" (Blue hyperlink text).\n* **Topics:** \"**2 Topics**\" (Blue hyperlink text).\n* **Languages:** \"**English (United States)**\".\n* **Difficulty:** A 5-star rating graphic showing 2 solid orange stars and 3 hollow stars (indicating a rating of 2/5).\n* **Updated On:** \"**04/07/2025**\".\n* **Origin:** A grey fish hook icon.\n* **Actions:** A blue horizontal toggle switch and a blue eye icon (view/preview).\n\n**Visual Annotation:**\nA large, thick orange arrow is pointing toward the \"Updated On\" and \"Origin\" column headers, specifically indicating the sortable nature of these columns.",
      "position": 2,
      "context": "RD36M196HAS4YQ6Q'>System Template Origins"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingTemplates_Settings.png",
      "alt": "The image displays the **Phishing Templates** section of a security application interface, specifically focused on viewing and filtering system-provided templates.\n\n**1. Navigation and Context:**\n\n*   **Main Navigation:** The active tab is \"Phishing Templates.\" The navigation bar includes Overview, Campaigns, Phishing Templates, Landing Pages (marked 'New'), Domains, Ignored IPs, and Reports.\n*   **Sub-Navigation:** The active view selection is \"**System Templates**,\" situated alongside \"My Templates\" and \"Managed Templates.\"\n\n**2. Filtering and Search Controls:**\n\nThe filtering system is divided into a vertical topics list and horizontal dropdown filters.\n\n*   **System Topics (a, b):** A left sidebar listing template categories. The \"**All Templates**\" category is active, showing 162 results. A toggle allows users to \"**Show Excluded Topics**.\" Other visible topics include Banking (18), Brand Knock-Offs (10), and IT (12).\n*   **Primary Filters (c, d, e):**\n    *   **Languages (c):** Dropdown set to \"All.\"\n    *   **Difficulty (d):** Dropdown set to \"All.\"\n    *   **Search (e):** Text input field for keyword searching.\n    *   **Action Link (e):** \"Template Exclusions (0).\"\n*   **Additional Filters (f, g, h, i, j):** This section is expanded (f).\n    *   **Attack Vectors (g):** Dropdown set to \"All.\"\n    *   **Template Features (h):** Dropdown set to \"All.\"\n    *   **Placeholders (i):** Dropdown set to \"All.\"\n    *   **Red Flags (j):** Dropdown set to \"All.\"\n\n**3. Results Table:**\n\n*   **Header:** \"All Templates - 162 Results.\" A \"Clear Filters\" link is present.\n*   **Columns:** The table displays sortable columns: Template Name, Topics, Languages, Difficulty, Updated On, Origin, and Action (partially visible).\n*   **Data Example:**\n    *   The first listed template is \"Amazon: Approval required for your Amazon order (Link) (Credentials Landing Page).\"\n    *   It is categorized under \"Data Entry Landing Page,\" uses \"English (United States),\" has a **Difficulty** rating of 3 out of 5 stars, and was **Updated On** 01/27/2025.\n    *   The second listed template, \"Google Apps: Please Initiate a Password Reset/Suspected Hacking Attempt...\", has a Difficulty rating of 2 out of 5 stars.",
      "position": 3,
      "context": "emplates  subtab, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishingTemplates/SearchResults.png",
      "alt": "This image displays a section of a web application interface presenting filtered data in a tabular format, likely representing templates or assets.\n\n## I. General Context and Header\n\nThe display indicates **\"135 Results\"** in the upper left corner, confirming the data shown is the result of a search or filtering operation.\n\nIn the upper right, the following control elements are visible:\n1.  An orange circular badge labeled **(a)**, positioned adjacent to a refresh icon and the clickable link **\"Clear Filters.\"**\n\n## II. Data Table Structure\n\nThe content is organized in a table with eight columns. Most headers include sorting indicators (two superimposed gray triangles):\n\n| Column Header | Sorting Indicator | Description |\n| :--- | :--- | :--- |\n| **\\[Checkbox]** | None | Used for multi-selection. |\n| **Template Name** | Present | The identifying title of the item. |\n| **Topics** | Present | Categorization of the item. |\n| **Languages** | Present | Target language and locale. |\n| **Difficulty** | Present | Skill rating, presented visually via stars. |\n| **Updated On** | Present | Date of the last modification (MM/DD/YYYY format). |\n| **Origin** | Present | Icon-based field, showing a gray circular refresh/history icon. |\n| **Actions** | None | Contains functional icons for interacting with the template. |\n\n## III. Data Rows\n\nTwo rows of data are displayed:\n\n### A. Row 1 Details\n*   **Template Name:** \"Google Apps: Please Initiate a Password Reset/Suspected Hacking Attempt (Link) (Credentials Landing Page)\"\n*   **Topics:** \"Data Entry Landing Page\"\n*   **Languages:** \"English (United States)\"\n*   **Difficulty:** 1 out of 5 stars (one star filled orange).\n*   **Updated On:** 09/06/2024\n*   **Actions (b):** Located in the action column, an orange circular badge **(b)** points to a cluster of control icons: a gray eye icon (View), a blue horizontal toggle switch (in the ON position), and another blue eye icon (View/Preview).\n\n### B. Row 2 Details\n*   **Template Name:** \"Traffic Citation (Link)\"\n*   **Topics:** \"Government\"\n*   **Languages:** \"English (United States)\"\n*   **Difficulty:** 2 out of 5 stars (two stars filled orange).\n*   **Updated On:** 09/06/2024\n*   **Actions (c):** Located in the action column, an orange circular badge **(c)** overlaps a control icon, which is part of a cluster including: a gray circular refresh icon (Undo/History), the icon hidden by the badge (likely a configuration or settings icon), a blue horizontal toggle switch (in the ON position), and a blue eye icon (View/Preview).",
      "position": 4,
      "context": "nd clear your filters.\nFor more information, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneTemplateWindow.png",
      "alt": "This image displays a tabular list interface titled \"**5555 Results**.\"\n\n**UI Elements and Context:**\n\n1.  **Header and Actions:** Located above the table, two clickable actions are present:\n    *   A primary action indicated by an orange arrow: \"**Clone Selected Templates**\" (accompanied by a document icon).\n    *   A secondary action: \"**Clear Filters**\" (accompanied by a refresh/undo icon).\n2.  **Table Structure:** The table displays multiple rows of data, likely related to phishing or training templates. Columns include:\n    *   **Selection Checkbox:** The first column allows selection via checkboxes. An empty checkbox is in the header row for select-all, and three rows are currently selected (indicated by blue checkmarks in the highlighted orange box).\n    *   **Template Name:** Displays the name of the content. Examples shown are \"Amazon Prime: Unable to complete your membership renewal (Link),\" \"New Connection to your Wallet from a New Device (Link),\" and \"Meta: You have 2 messages from Meta Pay Support (Link).\"\n    *   **Topics:** Lists related categories (e.g., \"2 Topics,\" \"Banking,\" \"3 Topics\").\n    *   **Languages:** Specifies the language (e.g., \"English (United States)\").\n    *   **Difficulty:** Uses a 5-star rating system; the displayed rows show 3-star difficulty ratings (three orange stars filled, two gray stars empty).\n    *   **Updated On:** Displays the last modification date (\"07/29/2024\"). This column features a sort icon.\n    *   **Origin:** Displays an icon resembling a fishing hook, suggesting the source or type of template.\n    *   **Actions:** Contains a clickable \"view\" icon (an eyeball symbol) for each template.\n\n**Focus Area (Highlighted by Orange Box):**\n\nThe orange box emphasizes the selection column, confirming that three rows are checked, enabling the \"**Clone Selected Templates**\" function.",
      "position": 5,
      "context": "Then, click Clone Selected Templates."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneSelectedTemplates.png",
      "alt": "This image displays the **\"Clone Selected Templates\"** modal dialog window.\n\n**Interface Elements and Context:**\n\n1.  **Modal Title and Instructions:** The dialog is titled \"Clone Selected Templates.\" Below the title, the instruction text reads: \"Choose one topic and at least one language for the selected templates below.\"\n2.  **Input Fields:**\n    *   **Languages (Dropdown):** Displays the current selection \"English (United States).\"\n    *   **Topic (Dropdown):** Displays the placeholder prompt \"Select a topic...\"\n3.  **Template Selection Table:** A table lists the templates chosen for cloning, with two column headers: \"Template Name\" and \"Languages\" (which features a sort icon).\n    *   **Templates Listed:**\n        *   \"Amazon Prime: Unable to complete your membership renewal (Link)\"\n        *   \"Meta: You have 2 messages from Meta Pay Support (Link)\"\n        *   \"New Connection to your Wallet from a New Device (Link)\"\n    *   **Language Status:** Each listed template displays a checkmark (✓) next to \"English (United States)\" under the Languages column, indicating the available language for cloning.\n4.  **Footnote:** A note appears above the action buttons: \"Only available languages for each template will be cloned.\"\n5.  **Action Buttons:** The bottom right of the modal contains two action buttons:\n    *   **Cancel** (Secondary action button, gray).\n    *   **Clone** (Primary action button, blue, indicating execution of the cloning process).",
      "position": 6,
      "context": "your selections, click Clone at the bottom of the pop-up window."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplates-MyTemplates.png",
      "alt": "This image displays the **My Templates** view within a phishing simulation management platform.\n\n**Header and Navigation:**\n*   The page title is \"My Templates.\"\n*   A primary action button is visible in the top right: **+ Create Phishing Template**.\n*   The main navigation bar shows **Phishing Templates** selected, with **Landing Pages** noted as **New**.\n\n**Template Selection and Filtering:**\n*   A segmented selector highlights **My Templates** as active, distinguishing it from **System Templates**.\n*   A filter panel provides four selection criteria (all defaulted to 'All'): **Topics**, **Languages**, and **Difficulty**, alongside a text **Search** bar.\n*   The link **Manage Topics** is displayed above the Search field.\n\n**Results and Actions:**\n*   The total number of entries is indicated by **163 Results**.\n*   Action links below the filters are **Import** and **Clear Filters**.\n\n**Data Table:**\nThe content is presented in a sortable data table format with the following columns:\n1.  **Template Name** (Checkbox selection available)\n2.  **Updated** (Date format MM/DD/YYYY)\n3.  **Languages**\n4.  **Difficulty** (Represented by a star rating)\n5.  **Topics**\n6.  **Actions** (Displayed as a blue eye/view icon).\n\n**Sample Data Rows:**\nAll visible rows show an updated date of **07/23/2024**, language **English (United States)**, a difficulty rating of **3 out of 5 stars**, and the topic **Creative**.\n*   The first entry is \"Sharepoint: IT Support shared “To be completed” with you (Link).\"\n*   The second entry is \"Disney: You have been selected by Disney for a FREE NFT! (Link).\"\n*   The third entry is \"Wells Fargo: Customize withdrawal notifications (QR Code).\"",
      "position": 7,
      "context": "e templates will now appear in the My Templates section."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/PhishingTemplates/ExcludeTemplateToggle.png",
      "alt": "The image displays a segment of a user interface data table, detailing a single configuration record.\n\n**Table Structure (Headers, left to right):**\n1.  **[Selection Checkbox]**\n2.  **Template Name**\n3.  **Topics**\n4.  **Languages**\n5.  **Difficulty** (Sortable via vertical chevron icon)\n6.  **Updated On** (Sortable via vertical chevron icon)\n7.  **Origin** (Sortable via vertical chevron icon)\n8.  **Actions**\n\n**Data Record Details (Row 2):**\n*   **Selection:** Unchecked checkbox control.\n*   **Template Name:** Google Apps: Please Initiate a Password Reset/Suspected Hacking Attempt (Link) (Credentials Landing Page)\n*   **Topics:** Data Entry Landing Page\n*   **Languages:** English (United States)\n*   **Difficulty:** Two out of five stars filled (orange color, indicating a 2-star rating).\n*   **Updated On:** 09/06/2024\n*   **Origin:** A light gray circular refresh/sync icon.\n*   **Actions:** Two interactive controls: a solid blue horizontal toggle switch (in the 'on' or active state) and a blue eye icon (typically representing a view or preview function).\n\n**Annotation:** A large, orange, semi-transparent instructional arrow points toward the **Origin** and **Actions** columns, specifically highlighting the date, refresh icon, and action controls.",
      "position": 8,
      "context": "de Template toggle in the Actions column."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishingTemplates/TemplateExclusions.png",
      "alt": "This technical description covers a template exclusion configuration interface, structured into two main sections: Criteria Definition and Exclusion Results.\n\n**1. Criteria Definition Panel (Top)**\n\nThe panel is titled \"Exclude Templates by Criteria.\" An instructional banner states that templates matching the criteria, including translated versions, will be excluded from campaigns.\n\nFour selection criteria dropdown menus are displayed, all showing the default placeholder text \"Select one or more items from...\":\n*   (a) Topics\n*   (b) Attack Vectors\n*   (c) Template Features\n*   (d) Placeholders\n\nTwo action buttons are positioned in the bottom right of this section:\n*   \"Save Changes\" (Primary, blue button).\n*   \"Undo Changes\" (Secondary, gray button).\n\n**2. Exclusion List and Data Table (Bottom)**\n\nA heading indicates the current filtered result count: \"1 Result Excluded.\"\n\nTo the right of the heading is a toggle switch (e) labeled \"Only Show Individual Exclusions,\" which is currently active (teal color).\n\nA data table follows with five sortable columns and one action column:\n*   Template Name\n*   Topics\n*   Languages\n*   Updated On\n*   Exclusion Type (f)\n*   Actions\n\nThe single displayed row shows the following data:\n*   **Template Name:** \"Google Apps: Please Initiate a Password Reset/Suspected Hacking Attempt (Link) (Credentials Landing Page)\"\n*   **Topics:** \"Data Entry Landing Page\"\n*   **Languages:** \"English (United States)\"\n*   **Updated On:** 10/17/2024\n*   **Exclusion Type (f):** An icon indicating a criteria-based exclusion (a slashed circle).\n*   **Actions:** Two icons, likely representing options to manage or view the excluded template.\n\nThe table footer confirms the display status: \"Displaying all 1 rows.\"",
      "position": 9,
      "context": "sions of these templates will also be excluded from phishing campaigns."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTemplates.png",
      "alt": "The image displays a user interface (UI) for managing email or simulation templates, organized into two main sections: Template Navigation (left) and Content Display/Filtering (right).\n\n**Context and Global Navigation:**\nThe current view is set to **\"My Templates\"** (selected tab), distinct from \"System Templates.\"\n\n**Template Navigation Pane (Left Column):**\nThis pane, labeled **\"My Topics\" (a)**, lists template categories (Topics) and their associated counts. **\"All Templates\"** is currently selected, displaying **50** results. Other listed topics include \"Drafts (2),\" \"PhishFlip (8),\" \"Callback (0),\" and several others with counts indicating the number of contained templates.\n\n**Content Filtering and Actions (Top Right):**\n*   **Action Button (b):** A blue button labeled **\"+ Add\"** is present, indicating functionality for template creation.\n*   **Filters:** Three primary filter controls are available:\n    *   **Languages (c):** A dropdown selector defaulted to \"All.\"\n    *   **Difficulty (d):** A dropdown selector defaulted to \"All.\"\n    *   **Search (e):** A free-text input field labeled \"Search.\"\n*   **Utility Actions:** Below the filters, two action links are visible: **\"Import\"** (with a download icon) and **\"Clear Filters\"** (with a refresh icon).\n\n**Data Display Table:**\nThe main content area is headed **\"All Templates - 50 Results.\"** The content is presented in a sortable table format with the following columns:\n\n| Column Header | Type / Content |\n| :--- | :--- |\n| Checkbox | Selection control for batch actions. |\n| **Template Name** (Sortable) | Hyperlinked text identifying the template (e.g., \"Invoice 14098 for [[company\\_name]]...\"). |\n| **Updated** (Sortable) | Date of last modification (e.g., \"03/26/2025\"). |\n| **Languages** | Language specification (e.g., \"English (United States)\"). |\n| **Difficulty** (Sortable) | Visual rating using five star icons (filled/outlined) indicating difficulty level (e.g., three stars filled). |\n| **Topics** (Sortable) | The template category (e.g., \"PhishFlip\"). |\n| **Actions** | An icon (eye) indicating a \"View\" or \"Preview\" function for the specific template row. |",
      "position": 10,
      "context": "information about these filters, see the screenshot and list below."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/ResultsTable.png",
      "alt": "This document describes a user interface component displaying searchable and sortable results, typically associated with a template library or content repository.\n\n**Overall Context:** The view displays **39 Results** found based on current criteria. Action buttons for filtering management are located in the top right.\n\n**I. Actions Bar (Top Right):**\n\n*   A clickable link labeled **Import** (g), preceded by a blue downward-pointing arrow icon (indicating data retrieval or upload functionality).\n*   A clickable link labeled **Clear Filters** (h), preceded by a blue circular arrow icon (indicating reset functionality).\n\n**II. Results Table Structure:**\n\nThe data is presented in a table format with the following header columns, designed for sorting and content identification:\n\n| Column Header | Sortable | Example Data Type | Context/Marker |\n| :--- | :--- | :--- | :--- |\n| Checkbox | No | Selection Control | Global selection/bulk action. |\n| Template Name | Yes | Hyperlink (Blue text) | Main identifier (a). |\n| Updated | Yes | Date (MM/DD/YYYY) | Last modification date (b). |\n| Language | No | Text string (e.g., \"English (United States)\") | Target language (c). |\n| Difficulty | Yes | Star Rating (5-point scale) | Complexity level (d). |\n| Topics | Yes | Text string/Category label | Content grouping (e). |\n| Actions | No | Icon button | Row-specific operations. |\n\n**III. Example Data Rows (First Three Results):**\n\nEach row begins with an unchecked selection checkbox. Key data points include:\n\n1.  **Row 1:** Template Name: `CEO Fraud: Invoice to Pay (Word Attachment with Macro) (Spoofs Domain)`. Updated: `07/22/2022`. Language: `English (United States)`. Difficulty: 4/5 stars (Four orange stars). Topics: Blank. Action (f): Blue eye icon (denoting 'View' or 'Preview').\n2.  **Row 2:** Template Name: `Secure File transfer: Er staat een bestand voor je klaar (Link)`. Language: `Dutch`. Difficulty: 3/5 stars. Topics: `Smoke Test Category`.\n3.  **Row 3:** Template Name: `Usted tiene una transferencia segura de archivos y espera (Enlace) (Colombia)`. Language: `Spanish (Colombia)`. Difficulty: 3/5 stars.\n\n*Note: All visible action icons (f) across the rows are identical blue eye icons, providing immediate viewing access to the corresponding template.*",
      "position": 11,
      "context": "rmation about the results table, see the screenshot and list below:"
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/Add.png",
      "alt": "This image is a partial screenshot of a user interface for managing templates, likely within a security or training platform.\n\n**Header and Navigation:**\n*   **Main Title:** \"My Templates\" (preceded by a search icon).\n*   **Primary Action Button (Top Right):** A large blue button labeled \"+ Create Template\".\n*   **Horizontal Navigation Bar (Level 1 Tabs):** Contains links including \"Overview,\" \"Campaigns,\" \"Legacy Email Templates,\" \"Phishing Templates,\" \"Landing Pages,\" \"Domains,\" \"Ignored IPs,\" and \"Reports.\"\n    *   The \"Phishing Templates\" tab is currently selected/active.\n    *   The \"Landing Pages\" tab is highlighted with a small blue \"New\" badge.\n\n**Content Area Filters (Template Management):**\n*   **Sub-Tabs (Template Type):** A toggle or set of sub-tabs below the main navigation. \"My Templates\" is active (dark gray); \"System Templates\" is inactive (white).\n*   **My Topics Section:**\n    *   **Filter/Topic List:** The filter labeled \"All Templates\" is active (blue background) and shows a count of (3).\n    *   **Action Button:** A blue button labeled \"+ Add\" is present next to the \"My Topics\" heading. An orange arrow graphic points directly at this \"+ Add\" button.\n    *   **Filter Dropdowns:** Three visible filter fields are arranged horizontally:\n        1.  **Languages:** Dropdown with \"All\" selected.\n        2.  **Difficulty:** Dropdown with \"All\" selected.\n        3.  **Search:** Text input field labeled \"Search.\"",
      "position": 12,
      "context": "rong>.\nClick + Add next to My Topics."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopicsSidebar.png",
      "alt": "The image displays a user interface segment focused on category management, titled \"**My Topics**.\"\n\n**UI Elements and Context:**\n\n1.  **Header and Action:** The title \"My Topics\" is prominently displayed. In the upper right corner, a blue rectangular action button is present, labeled **\"+ Add.\"**\n2.  **Navigation List:** The main content is a vertical list of templates and topics, functioning as navigation. Each entry includes a label and a numerical count displayed in a circular badge on the right.\n3.  **Active Selection:** The first list item, \"**All Templates**,\" is highlighted in blue (indicating the active selection state) and displays a count of **50**.\n4.  **List Contents:**\n    *   **Drafts** is listed below the active entry with a count of **2**.\n    *   Subsequent entries represent individual topics (e.g., **PhishFlip**, **Callback**, **Banking**, **Shipments & Deliveries**, **My Passwords & Authentication**). These custom topics are preceded by a **hamburger menu icon** (three horizontal lines), suggesting drag-and-drop or configuration functionality.\n    *   Counts for these individual topics range from **0** (e.g., Callback) to **8** (PhishFlip).",
      "position": 13,
      "context": "the pencil or trash can icon."
    },
    {
      "url": "https://helpimg.s3.amazonaws.com/PhishingTemplates/SelectTopicDropDownMenu.png",
      "alt": "The image displays a software interface for managing security awareness training templates, specifically focused on **Phishing Templates**.\n\n**Navigation and Context:**\nThe primary navigation shows the active tab as \"Phishing Templates\" (with \"Landing Pages\" marked \"New\"). Sub-navigation is set to \"System Templates\" (active), with \"My Templates\" as an alternative view. A \"Manage Topics\" link with a gear icon is visible on the upper right.\n\n**Filters and Results:**\nThe interface features four filter controls: \"Topics,\" \"Languages,\" \"Difficulty,\" and a \"Search\" text field; all are currently set to \"All\" or empty. The total results count is displayed as **166 Results**. Action links include \"Import\" and \"Clear Filters.\"\n\n**Batch Action Bar:**\nA dedicated row manages actions for selected templates. An indicator shows **\"Selected Templates (1)\"**. Available batch actions include icons for Revert/Duplicate, Export/Upload, and Delete (red trash can). The focus area (indicated by an orange arrow) is the bulk modification control: A dropdown labeled **\"Select Topic,\"** followed by two buttons, **\"Add\"** (blue) and **\"Remove\"** (gray).\n\n**Results Table:**\nThe template list includes sortable columns: Template Name, Updated, Languages, Difficulty, Topics, and Actions.\n\n**Example Data Row:**\nOne row is selected (purple checkbox), showing the template name **\"Amazon Prime: Unable to complete your membership renewal (Link)\"**. Details include Update Date: **07/30/2024**, Language: **English (United States)**, Difficulty: **3 out of 5 stars**, and Topic: **Creative**.",
      "position": 14,
      "context": "g> drop-down menu, select the topic that you would like to add the template to."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopics_SelectTopics.png",
      "alt": "This image displays a User Interface (UI) section for managing a list of templates.\n\n**Header and Filters:**\nThe top section contains global filters:\n1.  A dropdown labeled **Languages**, currently set to \"All\".\n2.  A dropdown labeled **Difficulty**, currently set to \"All\".\n3.  A search input box labeled **Search**.\n\n**Results Summary and Global Actions:**\nA bold text heading reads **All Templates - 50 Results**. To the right, utility links are present: **Import** (with a download icon) and **Clear Filters** (with a refresh icon).\n\n**Batch Action Bar (Primary Focus):**\nImmediately below the heading, a selection and action bar is visible:\n1.  A box labeled **Selected Templates** displays a badge with the number '1', indicating one template is selected.\n2.  An **Export** button with an upload icon.\n3.  A red **Delete/Trash** button (prominently marked by a large orange arrow), indicating an active or highlighted destructive action.\n4.  A dropdown input box labeled **Select Topics**.\n5.  Two contextual action buttons: **Add** (blue) and **Remove** (light blue). This group suggests batch modification of \"Topics\" for selected templates.\n\n**Template List (Data Table):**\nThe primary content is a sortable data table with the following column headers:\n*   **Template Name** (with a sort/filter icon and a master checkbox).\n*   **Updated** (with a sort/filter icon).\n*   **Languages**.\n*   **Difficulty** (with a sort/filter icon).\n*   **Topics** (with a sort/filter icon).\n*   **Actions**.\n\n**Template Rows (Data):**\nTwo rows of data are visible:\n*   **Row 1:** Checked checkbox. **Template Name:** Invoice 14098 for [[company\\_name]] is days past due. **Updated:** 03/26/2025. **Languages:** English (United States). **Difficulty:** Two out of five stars (rated 2/5). **Topics:** PhishFlip. **Actions:** View icon (eye symbol).\n*   **Row 2:** Unchecked checkbox. **Template Name:** Ricky Blickger: New Invoice (Attachment). **Updated:** 03/26/2025. **Languages:** English (United States). **Difficulty:** Two out of five stars (rated 2/5). **Topics:** PhishFlip. **Actions:** View icon (eye symbol).",
      "position": 15,
      "context": "ect the topic that you would like to remove the template from."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_TempTopics.png",
      "alt": "This image displays the configuration interface for \"Phishing Templates\" within a campaign setup tool.\n\n**Context and Header:**\nThe page title is **Phishing Templates**. A subtitle reads: \"Template options may vary based on the groups targeted for the campaign.\"\n\n**UI Elements (Configuration Fields):**\n\n1.  **Template Topics:** A dropdown menu currently showing the placeholder text \"Please select\". (An orange arrow highlights this selection field.)\n2.  **Set Template Language:** An unchecked checkbox followed by a label and a help icon (question mark).\n3.  **Difficulty Rating:** A dropdown menu currently set to \"All Ratings\". A help icon is adjacent to this input field.\n4.  **Template Selection:** A dropdown menu currently set to \"Full Random (Random email to each user)\".\n5.  **Available Templates:** A footer/readout field indicating the current template count: \"Available Templates (0 Total)\". This field includes a chevron, suggesting it is a collapsible or expandable section.",
      "position": 16,
      "context": "allows you to select topics for your phishing templates."
    },
    {
      "url": "https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_AvailableTemplates2.png",
      "alt": "This image displays the configuration interface for selecting **Phishing Templates** for a simulated campaign.\n\n## Phishing Template Selection UI\n\nThe screen is organized into two primary sections: filtering controls and the resulting template list.\n\n### Configuration Controls\n\nThe upper section provides filtering and selection settings:\n\n| Setting Label | UI Element Type | Current Value/State | Details |\n| :--- | :--- | :--- | :--- |\n| **Template Topics** | Dropdown/Tag Selector | Phishing For Sensitive Information | Allows selection of campaign themes. |\n| **Set Template Language** | Checkbox | Checked | Controls language selection override. |\n| **Language Override** | Dropdown Selector | English (United States) | Sets the specific language for the templates. |\n| **Difficulty Rating** | Dropdown Selector | All Ratings | Filters templates by perceived difficulty (includes tooltip icon). |\n| **Template Selection** | Dropdown Selector | Full Random (Random email to each user) | Defines the distribution logic of selected templates. |\n\n### Available Templates List\n\nA collapsible section titled **Available Templates (33 Total)** displays the templates matching the current filter settings.\n\nThe list is presented as a table with the following columns:\n\n1.  **Template Name:** Displays the descriptive name of the phishing simulation.\n2.  **Topics:** Indicates the number of relevant topics associated with the template.\n3.  **Languages:** Indicates the number of languages available for the template.\n4.  **Preview:** Contains an eye icon, serving as a link/button to view the template content.\n\n**Visible Template Examples:**\n\n*   *Platinum [[company_name]] Proposal (Word Attachment) (Credentials Landing Page)* (3 Topics, 35 Languages)\n*   *Office 365 Renewal (Link) (Spoofs Domain) (Credentials Landing Page)* (3 Topics, 35 Languages)\n*   *LinkedIn: Suspicious activity on your account (Link) (Credentials Landing Page)* (3 Topics, 35 Languages)",
      "position": 17,
      "context": "You can also preview the template."
    }
  ],
  "metadata": {
    "category": "Security Awareness Training",
    "section": "Phishing Templates",
    "topics": [
      "advanced",
      "awareness",
      "features",
      "phishing",
      "security",
      "templates",
      "training"
    ],
    "image_count": 17
  }
}