{
  "article": {
    "id": 4414652114451,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/4414652114451.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/4414652114451.html",
    "author_id": 1507801285842,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 360002404954,
    "created_at": "2022-01-07T16:59:05Z",
    "updated_at": "2024-09-24T13:46:28Z",
    "name": "Risk Management Module Frequently Asked Questions (FAQ)",
    "title": "Risk Management Module Frequently Asked Questions (FAQ)",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-09-24T13:45:13Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot_kcmgrc"
    ],
    "body": "<p>In this article, you can find frequently asked questions about the KCM GRC <strong>Risk Management</strong> module. If this article doesn't include the question you're looking for, please submit a ticket to our <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener'>support team</a>. </p>\n<p>For general information about the Risk Management module, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360010819154' target='_self'>Risk Management Module Guide</a>. </p>\n<p><a name='GENERAL'></a></p>\n<h2 id='h_01J8J4EJN8D53G5RA8C1A99NK4'>General Information</h2>\n<p><a href='#ASSESSMENT' target='_self'>1. How can I use KCM GRC to perform a risk management assessment?</a></p>\n<p><a href='#RISK_WIZARD' target='_self'>2. How does KnowBe4 select the risks that are in the Risk Wizard?</a></p>\n<p><a href='#TEMPLATES' target='_self'>3. What are risk templates, and how can I use them?</a></p>\n<p><a href='#MAPPING_CONTROLS' target='_self'>4. What is the benefit of mapping controls to my risks?</a> <a name='ASSESSMENT'></a></p>\n<p><strong>1. Question:</strong> How can I use KCM GRC to perform a risk management assessment?</p>\n<p><strong>Answer:</strong> You can use the KCM GRC Risk Management module to get started with your risk management program or to maintain your existing risk management program.</p>\n<p>To learn how you can perform a risk management assessment in KCM GRC, see the list below:</p>\n<ul role='list'>\n<li>You can use the <strong>Risk Wizard</strong> tool to perform a baseline risk management assessment. To learn about the <strong>Risk Wizard</strong>, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360010931634' target='_self'>How to Use the Risk Wizard</a> article.</li>\n<li>When you create or update risks, you can document the consequences and affected assets of each risk. This information can help you determine the areas of your organization that would be affected by the risk. To learn how to create or update risks, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733' target='_self'>How to Use Your Risk Register</a> article.</li>\n<li>You can assign Likelihood and Impact scores to your risks. KCM GRC will use these scores to calculate the Inherent Risk Score to each risk. You can use the inherent risk score to prioritize the risks in your <strong>Risk Register</strong>. To learn about the Likelihood and Impact scores, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360010819154#Likelihood_and_Impact' target='_self'>Risk Likelihood and Impact</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360010819154' target='_self'>Risk Management Module Guide</a>.</li>\n<li>To document the preventative measures your organization uses to mitigate risks, you can map controls to your risks. To learn how to map controls to risks, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060605553' target='_self'>How to Create and Map Risk Controls</a> article. </li>\n<li>As your organization implements new processes or encounters new issues, you can use your <strong>Risk Register</strong> to perform issue-based risk management assessments. To perform an issue-based risk assessment, you can reevaluate your existing risks to update the Likelihood and Impact scores, consequences, and affected assets. As you update existing risks, you can document the new process or issue and the updates you make by using the risk <strong>Notes</strong> widget. Then, you can create new risks for any threats that the new process or issue poses for your organization. To learn how to create or update risks, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733' target='_self'>How to Use Your Risk Register</a> article.</li>\n<li>You can maintain your risk management program by performing a continuous risk management assessment. To perform a continuous risk management assessment, you can regularly reevaluate the risks in your <strong>Risk Register</strong>. Then, you can document the updates you make to risks by using the risk <strong>Notes</strong> widget. You can also use your <strong>Risk Dashboard</strong> to monitor your top risks. To learn how to update risks, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733' target='_self'>How to Use Your Risk Register</a> article. To learn about your <strong>Risk Dashboard</strong>, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360011382934' target='_self'>How to Use the Risk Dashboard</a> article. </li>\n</ul>\n<p><a name='RISK_WIZARD'></a></p>\n<p><strong>2. Question:</strong> How does KnowBe4 select the risks that are in the <strong>Risk Wizard</strong>?</p>\n<p><strong>Answer:</strong> The risks in the<strong> Risk Wizard</strong> are from the <a href='https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-30r1.pdf' target='_self'>National Institute of Standards and Technology (NIST) Special Publication 800-30, Guide for Conducting Risk Assessments</a>.</p>\n<p>To learn more about the <strong>Risk Wizard</strong>, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360010931634' target='_self'>How to Use the Risk Wizard</a> article. </p>\n<p><a name='TEMPLATES'></a></p>\n<p><strong>3. Question:</strong> What are risk templates, and how can I use them?</p>\n<p><strong>Answer:</strong> Risk templates are risks that KnowBe4 provides from our master risk repository, which are the same risks that appear in the <strong>Risk Wizard</strong>. You can use risk templates to add risks to your <strong>Risk Register</strong>. You can also import risk templates into your account, which may be useful if you would like to reuse a risk name or description for multiple risks. </p>\n<p>For more information about risk templates, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360010296394' target='_self'>How to Use the Risk Templates Tab</a> article.</p>\n<p><a name='MAPPING_CONTROLS'></a></p>\n<p><strong>4. Question:</strong> What is the benefit of mapping controls to my risks?</p>\n<p><strong>Answer:</strong> You can use controls to document the preventative measures your organization uses to mitigate risks. After you map a control to a risk, you can create task schedules or one-time tasks for the control so that your organization can submit evidence that demonstrates how you are meeting the control. This process can help your organization prepare for risks that you may encounter.</p>\n<p>To learn how to map controls to your risks, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360060605553' target='_self'>How to Create and Map Risk Controls</a> article.</p>\n<p><a name='RISK_REGISTER'></a></p>\n<h2 id='h_01J8J4EJN8F4T5JWKKW6THBKW4'>Risk Register</h2>\n<p><a href='#CUSTOM' target='_self'>1. Can I add custom categories to my Risk Register?</a></p>\n<p><a href='#DELETE' target='_self'>2. Can I delete the risks in my Risk Register?</a></p>\n<p><a href='#TREATMENT_SCORE' target='_self'>3. Can I assign different risk Treatment Scores to a control that is mapped to multiple risks?</a></p>\n<p><a href='#INHERENT_SCORE' target='_self'>4. How does KCM GRC calculate the Inherent Risk Score based on risk Likelihood and Impact scores?</a></p>\n<p><a href='#AUDITORS' target='_self'>5. How do I send information from my Risk Register to auditors?</a></p>\n<p><a name='CUSTOM'></a></p>\n<p><strong>1. Question:</strong> Can I add custom categories to my <strong>Risk Register</strong>?</p>\n<p><strong>Answer:</strong> Yes. You can add custom categories to your <strong>Risk Register</strong> from your <strong>Account Settings</strong>. To learn how to add custom categories to your <strong>Risk Register</strong>, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733#CUSTOM' target='_self'>Creating Custom Categories</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733' target='_self'>How to Use Your Risk Register</a> article. </p>\n<p><a name='DELETE'></a></p>\n<p><strong>2. Question:</strong> Can I delete risks from my<strong> Risk Register</strong>?</p>\n<p><strong>Answer:</strong> At this time, you cannot permanently delete risks from your <strong>Risk Register</strong>. However, you can archive risks to remove them from your <strong>Risk Register</strong>. When you archive a risk, it will be moved to the <strong>Archived Items </strong>section of your account (<strong>Settings</strong> &gt; <strong>Archived Items</strong>). You can unarchive the risk to add it back to your <strong>Risk Register</strong>. </p>\n<p>To learn how to archive a risk in your <strong>Risk Register</strong>, see the <a href='https://support.knowbe4.com/hc/en-us/articles/4405773349395#RISKS' target='_self'>Archiving Risks</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/4405773349395' target='_self'>Archiving Items Guide</a>.</p>\n<p><a name='TREATMENT_SCORE'></a></p>\n<p><strong>3. Question:</strong> Can I assign different Treatment Scores to a control that is mapped to multiple risks?</p>\n<p><strong>Answer:</strong> No. When you assign a Treatment Score to a control, it will affect the control for all risks that the control is mapped to. However, if you would like to assign different Treatment Scores to a control, you can clone the control for each risk you would like to map the control to. Then, when you map the cloned controls to the risks, you can assign a different Treatment Score to each cloned control. </p>\n<p>To learn how to clone a control, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360045177593#VIEWING2' target='_self'>Viewing Individual Controls from the View Control Page</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360045177593' target='_self'>How to Use Controls in Your KCM GRC Platform</a> article. To learn more about the Treatment Score, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360042334914#TREATMENT' target='_self'>Treatment Score</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360042334914' target='_self'>Risk Scoring Guide</a> article.</p>\n<p><a name='INHERENT_SCORE'></a></p>\n<p><strong>4. Question:</strong> How does KCM GRC calculate the Inherent Risk Score based on risk Likelihood and Impact scores?</p>\n<p><strong>Answer:</strong> The KCM GRC risk Likelihood and Impact scales are based on the qualitative method. After you assign Likelihood and Impact scores to a risk, KCM GRC uses the <a href='https://www.techopedia.com/definition/15823/fibonacci-sequence' target='_self'>Fibonacci sequence</a> to calculate the risk's Likelihood and Impact scores. Then, KCM GRC multiplies the Likelihood score by the Impact score to calculate the Inherent Risk Score, which you can use to prioritize your risks. </p>\n<p>To learn more about the Likelihood and Impact scores, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360010819154#Likelihood_and_Impact' target='_self'>Risk Likelihood and Impact</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360010819154' target='_self'>Risk Management Module Guide</a> article. To learn more about the Inherent Risk Score, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360042334914#INHERENT' target='_self'>Inherent Risk Score</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360042334914' target='_self'>Risk Scoring Guide</a> article. </p>\n<p><a name='AUDITORS'></a></p>\n<p><strong>5. Question:</strong> How do I send information from my <strong>Risk Register</strong> to auditors?</p>\n<p><strong>Answer:</strong> You can export a list of the risks that are in your <strong>Risk Register</strong>. Then, you can download the list as a data export and send it to auditors. </p>\n<p>To learn more about exporting the risks in your <strong>Risk Register</strong>, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733#EXPORTING' target='_self'>Exporting Risks</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360011109733' target='_self'>How to Use Your Risk Register</a> article. </p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/4414652114451-Risk-Management-Module-Frequently-Asked-Questions-FAQ",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "asked",
        "faq",
        "frequently",
        "management",
        "module",
        "questions",
        "risk"
      ],
      "image_count": 0
    }
  }
}