{
  "article": {
    "id": 4649885043475,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/4649885043475.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/experimental/articles/4649885043475.html",
    "author_id": 1501549449361,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 2,
    "vote_count": 4,
    "section_id": 4406698342547,
    "created_at": "2022-03-09T15:27:33Z",
    "updated_at": "2025-09-29T17:49:06Z",
    "name": "Use Automatic Activation for the Gmail Add-on Phish Alert Button (PAB)",
    "title": "Use Automatic Activation for the Gmail Add-on Phish Alert Button (PAB)",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-29T17:49:05Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot"
    ],
    "body": "<p>The automatic activation feature for the Gmail add-on Phish Alert Button (PAB) allows admins to create a PAB instance for all Google Workspace users in their organization. With this feature, users will no longer have to manually activate their PAB with a license key, and magic mail will not be required for new users.</p>\n<p>For more information about the Gmail add-on PAB, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4404150738067'>Gmail Add-on Phish Alert Button (PAB) Guide</a>.</p>\n<h2 id='h_01H2TM544MPQ5N430XTPPC323N'>How to Enable Automatic Activation</h2>\n<p>To enable automatic activation for the Gmail add-on PAB, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 account.</li>\n<li>Click your email address in the top-right corner of the page and select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Integrations</strong> &gt; <strong>Phish Alert</strong>.</li>\n<li>From the <strong>Phish Alert</strong> menu, click the name of the desired PAB instance.</li>\n<li>In the <strong>Gmail Add-on Settings</strong> section, select the <strong>Enable Automatic PAB Activation</strong> check box.</li>\n</ol>\n<h2 id='h_01H2TM0H92QA3KTPNFKECAC56V'>Configure Automatic Activation</h2>\n<p>After you enable automatic activation, you will need to configure the feature for your users. The configuration process will vary depending on whether your users have used the Gmail add-on PAB previously.</p>\n<p>To configure automatic activation for users who have not used the Gmail add-on PAB before, see the <a href='#h_01H2TM2HK5ACMW09XH5AFD2GYA'>New Users</a> subsection below. To configure automatic activation for users who have used the Gmail add-on PAB previously, see the <a href='#h_01H2TM3CP5PF2CQTCA3MZ4CCK1'>Existing Users</a> subsection below.</p>\n<h2 id='h_01H2TM2HK5ACMW09XH5AFD2GYA'>New Users</h2>\n<p>For new admins who have just enabled the Gmail add-on PAB for the first time, automatic activation will be the default for all your users. In this scenario, you and your users will not need to take any further action to configure automatic activation.</p>\n<p><a href='#h_01H2TM544MPQ5N430XTPPC323N' target='_self'>Back to top</a></p>\n<h2 id='h_01H2TM3CP5PF2CQTCA3MZ4CCK1'>Existing Users</h2>\n<p>The Gmail add-on PAB will continue to work for existing users who were manually activated. However, existing users who want to switch from manual activation to automatic activation will need to reset their PAB license. To reset your PAB license, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your Gmail account.</li>\n<li>In your Gmail account, click the <strong>phish hook</strong> icon.</li>\n<li>Click the <strong>three dots</strong> icon in the <strong>Phish Alert</strong> modal.</li>\n<li>Click <strong>Reset License</strong>.</li>\n<li>Once your license is reset, refresh your web browser.</li>\n</ol>\n<p>After refreshing the browser, your users’ Gmail add-on PAB should switch from manual activation to automatic activation.</p>\n<h2 id='h_01HSE58C9BV1E7T5ADFS4BR8XQ'>Disable Automatic Activation</h2>\n<p>To disable automatic activation for your Gmail add-on PAB, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 account.</li>\n<li>Click your email address in the top-right corner of the page and select <strong>Account Settings</strong>.</li>\n<li>Navigate to <strong>Account Integrations</strong> &gt; <strong>Phish Alert</strong>.</li>\n<li>Click the name of your Phish Alert Button instance.</li>\n<li>In the <strong>Gmail Add-on Settings</strong> section, deselect the <strong>Enable Automatic PAB Activation</strong> check box.</li>\n</ol>\n<h2 id='h_01K6B7DX4M02BJZEJ88VM5WCTY'>Advanced Configuration Scenarios</h2>\n<p>The following scenarios address specific deployment configurations and organizational structures that may affect how you implement automatic activation.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Automatic activation is unique per domain across all PAB instances and KSAT regions.</div>\n</div>\n<h3 id='h_01K6B7EBWF9RDA1ZX9S798FV6W'>Multiple KSAT Regions</h3>\n<p>If your organization operates KSAT instances across different regions, such as the US, UK, CA, DE, and EU, you can only enable automatic activation for one PAB instance across all regions that share the same domain.</p>\n<p>Example scenario:</p>\n<p>Your organization has US and UK KSAT accounts that both use the @company.com domain. You must choose to enable automatic activation in either one PAB instance in your US account or one PAB instance in your UK account, but not both.</p>\n<h3 id='h_01K6B7EX4096NRTYMWSTPQ8KC6'>Multiple PAB Instances per KSAT Account</h3>\n<p>When using multiple PAB instances in a single KSAT account to customize messaging for different departments, only one instance can have automatic activation enabled for your domain.</p>\n<p>We recommend you choose the PAB instance that serves your primary user base or most critical use case for automatic activation.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/4649885043475-Use-Automatic-Activation-for-the-Gmail-Add-on-Phish-Alert-Button-PAB",
    "images": [],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "activation",
        "alert",
        "automatic",
        "for",
        "gmail",
        "pab",
        "phish",
        "the",
        "use"
      ],
      "image_count": 0
    }
  }
}