{
  "article": {
    "id": 115010178267,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115010178267.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115010178267.html",
    "author_id": 8157437908,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 12,
    "vote_sum": 23,
    "vote_count": 29,
    "section_id": 360000156648,
    "created_at": "2017-07-11T15:38:16Z",
    "updated_at": "2025-10-27T20:01:37Z",
    "name": "Failures and Phish-prone Percentages",
    "title": "Failures and Phish-prone Percentages",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-05-27T17:41:55Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "phishing",
      "phish prone",
      "phish prone percentage",
      "more than 100%",
      "over 100%",
      "ppp",
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>During a phishing campaign, your users will receive Phishing Security Tests (PST). Based on if they fail or pass the phishing security test, they will receive a Phish-prone Percentage. Users with a low Phish-prone Percentage are less likely to fall for real phishing attacks than those with a higher Phish-prone Percentage. If you’re interested in learning more about PST, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/236271227.html'>What is a Phishing Security Test (PST) and How Does it Work? </a>article.</p>\n<h2 id='iv_01H8F8Z5PHZMY2HFW0ACGAGWQM'>What Is a Failure?</h2>\n<p>If a user interacts with the email in an unsafe way, that action is a failure and the user fails that test. Users can have multiple failures from a PST during a phishing campaign. In order from most to least severe, the different types of failures are listed below:</p>\n<ul role='list'>\n<li>Entering data on a landing page</li>\n<li>Entering personal information in a callback phishing call</li>\n<li>Enabling a macro on an attachment</li>\n<li>Replying to the simulated phishing email</li>\n<li>Opening an attachment</li>\n<li>Scanning a QR Code</li>\n<li>Calling the number and entering the callback code in a callback phishing email</li>\n<li>Clicking the embedded link</li>\n</ul>\n<h2 id='iv_01H8F8Z5PHKKJ5AR5FXXNTY914'>How Phish-prone Percentage Is Calculated</h2>\n<p>A Phish-prone Percentage is the percentage of employees that are prone to click on a phishing link. It differs from a <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360018819194.html'>Phish-failure Percentage</a> since it tracks the exact way a user fails. It is possible for a user to have many failures on one email and receive a Phish-prone Percentage that goes over 100 percent. For example, if a user opens an email, clicks on the link, and opens the attachment, they have two failures and one failed phishing test. As a result, this user will have a 200 percent personal Phish-prone Percentage, because the user failed two times in one test.</p>\n<p>A higher personal Phish-prone Percentage indicates that the individual user may be more vulnerable to an email-borne social engineering attack. If a user opens a simulated phishing email and has many failures, then they are failing to spot red flags. Knowing the number and types of failures can help determine what training the user needs.</p>\n<h2 id='iv_01H8F8Z5PHDC77ABGRFQAFA4ZE'>Campaign Phish-prone Percentage</h2>\n<p>A phishing campaign creates a Phish-prone Percentage from the number of total failures divided by the total number of emails delivered in that campaign.</p>\n<p>If 100 people received emails, and 52 of them clicked a link in the email that would mean 52 percent of them failed. If eight of those 52 people also entered data into the landing page, that would increase the Phish-prone Percentage for that campaign to 60 percent.</p>",
    "user_segment_ids": []
  }
}