{
  "article": {
    "id": 115009156087,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115009156087.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115009156087.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 20,
    "vote_sum": 12,
    "vote_count": 16,
    "section_id": 26410859974291,
    "created_at": "2017-06-20T14:13:21Z",
    "updated_at": "2025-10-11T04:03:10Z",
    "name": "Enable and Use Password-Less Logins",
    "title": "Enable and Use Password-Less Logins",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-06-19T17:58:44Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "passwordless",
      "password-less",
      "password less",
      "logins",
      "localized",
      "Login",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>In your KSAT console, you can enable the password-less logins feature in your <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/226457887.html'>Account Settings</a> to allow users to log in to their assigned training directly without requiring them to use a password. You can also use our specially designed training notifications to let your users access training through this password-less method.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> Password-less logins are convenient and easy to use, but this feature isn't the most secure. If a login link is shared or leaked to the internet, it could be indexed by Google or other search engines. This indexing means that attackers could view the URL and related information, such as a user’s email address, well after the link has expired. To learn how to use password-less logins safely, see the <a href='#h_01GSDCFRSQ81HJ47A2FY7QP7HX' target='_self'>Best Practices for Password-Less Logins</a> section of this article.</div>\n</div>\n<p>If you need further assistance with password-less logins, contact our <a href='https://support.knowbe4.com/hc/en-us/requests/new'>support team</a>.</p>\n<h2 id='h_01HQNMRJEYPTP4M7YH673X25FH'>What Are Password-Less Logins?</h2>\n<p>By default, your users will be prompted to set a password for their training account once they confirm their account and log in for the first time. Alternatively, you can set a password for your users once they are imported into the console.</p>\n<p>If password-less logins are enabled instead, users will receive an email with a customized link. Users can click this link to access their Learner Experience (LX) or take their training directly. They can use this link to log in without creating or entering a password at any time.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Clicking the link will take users directly to their <strong>My Training</strong> page, even if they’ve used a password for their LX in the past.</div>\n</div>\n<p>This link provides users the convenience of not having to remember a password for their training account.</p>\n<p>For board members or other employees who need to take training but cannot receive the password-less login links, you can send them to <a href='https://training.knowbe4.com/users/login/' target='_self'>https://training.knowbe4.com/users/login/</a> to log in with their assigned email address and password that you set for them. Alternatively, you can manually generate a link for them by following the steps in the <a href='#h_01GSDDFE080Q0TNF5XHVYV9CD9' target='_self'>Generating New Password-Less Login Links</a> section of this article. For more information about training users outside your organization's domain, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/235675668.html'>Train External Users</a> article.</p>\n<h2 id='h_01HQNMRJEY5Z37DY57Z3ZH0A7S'>Set Up Password-Less Logins </h2>\n<p>To set up password-less logins, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KSAT console and click your email address in the top-right corner. Then, click <strong>Account Settings</strong>. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/passwordless/pwl01.png'><img src='https://s3.amazonaws.com/helpimg/passwordless/pwl01.png' alt=' '></a>\n</li>\n<li>Navigate to <strong>User Management</strong> &gt; <strong>Users Settings</strong> section.</li>\n<li>Select the <strong>Use Password-less Login </strong>check box. For more information about this setting, see the screenshot and list below. <a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/User-Managment/User-Provisioning/EN/Password-lessLoginSettings.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/Account_Settings/User-Managment/User-Provisioning/EN/Password-lessLoginSettings.png'></a>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> We recommend that you don't select the <strong>Require users to reset initial password set by admins</strong> check box.</div>\n</div>\n<ol role='list' type='a'>\n<li>\n<strong>Disable Password-less Login for Admins</strong>: When selected, the password-less login option will be disabled for admins.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>You cannot set password-less logins for specific users or groups, with the exception of admin users. When password-less login is enabled, all users will be required to log in with a password-less login link.</div>\n</div>\n</li>\n<li>\n<strong>Disable Automatic Email Generation for Password-less Logins:</strong> When selected, users must click the Next button on the login page to receive a new password-less login link.</li>\n<li>\n<strong>Expire Password-less Link After:</strong> Select how long you would like password-less links to remain active. The default is 3 days, and the maximum entry is 999 days. <br>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If your users need a new password-less login link, they can request a new link or you can send them a new link manually. For more information, see the <a href='#h_01GSDDFE080Q0TNF5XHVYV9CD9' target='_self'>Generating New Password-less Login Links</a> subsection below.</div>\n</div>\n</li>\n</ol>\n</li>\n<li>Scroll down and click <strong>Save Changes</strong> at the bottom of the page.</li>\n</ol>\n<h3 id='h_01GSDDFE080Q0TNF5XHVYV9CD9'>Generate New Password-Less Login Links</h3>\n<p>If your users' links expire, they can request new links at any time from <a href='https://training.knowbe4.com'>https://training.knowbe4.com </a> or <a href='https://eu.knowbe4.com'>https://eu.knowbe4.com</a>, depending on your KSAT instance. You can also manually generate a link for a user manually from their individual <strong>User Information</strong> subtab. To generate a link for a user, follow the steps below:</p>\n<ol role='list'>\n<li aria-level='1'>In your KSAT console, navigate to the <strong>Users</strong> tab.</li>\n<li aria-level='1'>Click on the desired user. </li>\n<li aria-level='1'>Navigate to the <strong>User Information</strong> subtab.</li>\n<li aria-level='1'>In the <strong>Users Account Details</strong> section, click the <strong>refresh</strong> icon to the right of the expiration date. Generating a new link will automatically invalidate the previous link provided to the user.</li>\n<li aria-level='1'><strong><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/passwordless/newpwll01.png'><img src='https://s3.amazonaws.com/helpimg/passwordless/newpwll01.png' alt=' '></a></strong></li>\n<li aria-level='1'>Click <strong>OK</strong>.<strong><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/passwordless/newpwll02.png'><img src='https://s3.amazonaws.com/helpimg/passwordless/newpwll02.png' alt=' '></a></strong>\n</li>\n<li aria-level='1'>Copy the link from the text box that displays.</li>\n<li aria-level='1'>Send the link to the user so they can log in for training. Remember, the link won't be emailed to the user when you generate it for them. You'll need to provide it to them manually.<strong><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/passwordless/newpwll03.png'><img src='https://s3.amazonaws.com/helpimg/passwordless/newpwll03.png' alt=' '></a></strong>\n</li>\n</ol>\n<h2 id='h_01GSDCFRSQ81HJ47A2FY7QP7HX'>Best Practices for Password-Less Logins</h2>\n<p>For the safest login experience, we recommend using <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/225681448.html'>multi-factor authentication (MFA)</a> as an extra layer of protection for your organization when using password-less logins. </p>\n<p>In certain scenarios, you can also use <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360041935913.html'>SAML single sign-on (SSO)</a> with password-less logins. If both SSO and password-less logins are enabled, users with access to KnowBe4 through SSO will log in through their SSO portal and authenticate with their identity provider. Users who don't have SSO accounts will have to wait for their password-less login notification to log in.</p>\n<p>As a final best practice after enabling password-less logins, you should be especially aware of what training notifications you're using. We offer built-in templates with the <strong>password-less</strong> tag containing the password-less login placeholder, which will automatically populate your training notification. Alternatively, you can create your own templates that include our password-less placeholders. For more information about placeholders read the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/204949707.html' target='_blank' rel='noopener noreferrer'>Placeholders Guide</a>.</p>",
    "user_segment_ids": []
  }
}