{
  "article": {
    "id": 12769050560403,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/12769050560403.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/12769050560403.html",
    "author_id": 6101752692627,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 6,
    "vote_sum": 6,
    "vote_count": 8,
    "section_id": 4406922364307,
    "created_at": "2023-01-05T18:47:12Z",
    "updated_at": "2025-09-19T14:39:13Z",
    "name": "KnowBe4 Console Account Settings: Account Integrations",
    "title": "KnowBe4 Console Account Settings: Account Integrations",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-12T20:25:49Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>In this article, you'll learn about the Account Integrations section of your KSAT <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/226457887.html'>account settings</a>. In the <strong>Account Integrations</strong> section, you can manage your account integrations for SAML, the Phish Alert Button (PAB), API reporting, PhishER, and if you have a Diamond-level subscription, Second Chance and PasswordIQ.</p>\n<h2 id='h_01HBR30D0QG3TRJN781XH5CT34'>SAML</h2>\n<p>In the <strong>SAML</strong> section, you can enable or disable SAML on your account. You will need the information provided in this section to set up SAML with your single sign-on (SSO) provider. If you need to enable SAML to allow your users to log in for training using your SSO provider, please follow the instructions in our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360041935913.html'>Set Up SAML Single Sign-on for the Security Awareness Training Console</a> article.</p>\n<p>See below for more information about the settings in this section:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_saml.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_saml.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Enable SAML SSO:</strong> Select this setting to enable SAML Single Sign-on (SSO) on your account. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360041935913.html'>Set Up SAML Single Sign-on for the Security Awareness Training Console</a> article.</li>\n<li>\n<strong>Disable non-SAML Logins for All Users:</strong> Select this check box to disable password logins for all users. Once selected, users will be required to log in with their SAML application and all bypass URLs will be disabled. This check box is only visible when the <strong>Enable SAML SSO</strong> check box is selected.</li>\n<li>\n<strong>Allow Admins with MFA to Bypass SAML Login:</strong> Select this check box to allow admins with multi-factor authentication to log in with their password and token. This check box is only visible when the <strong>Disable non-SAML Logins for All Users</strong> check box is selected. Admins can use this login method with a bypass URL as an alternative to their SAML application. To bypass SAML single sign-on integration, navigate to the <strong>Bypass-SSO Login URL</strong>. The bypass SSO URL is public.</li>\n<li>\n<strong>Allow Account Creation from SAML Login:</strong> This check box will display after you enable SAML. This setting allows users who do not already have an account to create a new account by entering their email address from the login window. If the SAML authentication was successful, the new user's account will be created. If you don’t enable this setting, users who do not already have an account will get an error message if they try to create an account.</li>\n<li>\n<strong>IdP SSO Target URL:</strong> Enter your identity provider URL or SSO URL into the field.</li>\n<li>\n<strong>IdP Cert Fingerprint:</strong> Enter the fingerprint of your identity provider's SAML certificate. The SHA-1 option is selected by default.</li>\n<li>\n<strong>Sign SP AuthnRequest:</strong> Select this check box to digitally sign the SAML AuthnRequest sent from the KnowBe4 service provider to your identity provider. Once you select this check box, you’ll be able to copy your current and upcoming AuthnRequest values and see how long the certificates are valid.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>To update an expired certificate or see a certificate, you need to activate the new certificate in the console by selecting the check box for<strong>Sign SP AuthnRequest</strong>.</div>\n</div>\n</li>\n<li>\n<strong>Enable SP AuthnRequest Expiration Notification:</strong> Select this check box to receive email notifications when your AuthnRequest is about to expire and has expired. If you select this check box, you’ll be able to enter notification recipients.</li>\n<li>\n<strong>Current AuthnRequest Certificate:</strong> This field shows your current AuthRequest Certificate with the ability to download your certificate and view how long the certificate is valid for.</li>\n<li>\n<strong>Entity ID:</strong> When configuring the SAML connection to your identity provider, enter the ID found in this section. Depending on your IdP provider, the Entity ID field may also be named the SAML Audience or Identifier.</li>\n<li>\n<strong>Generate Unique Entity ID:</strong> You can click this button to generate a unique entity ID to use for this account. However, be aware that if you do change the entity ID, SSO will not work for your users until you update the entity ID in your Identity Provider account.\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong> If you manage multiple accounts, your Identity Provider may not allow the same entity ID to be entered multiple times in the same Identity Provider account. If your Identity Provider does not allow the same ID to be entered multiple times, your users may be unable to log in to their account with SSO.If you click the <strong>Generate Unique Entity ID</strong> button, you'll see the <strong>Restore Default Entity ID</strong> button. You can click this button to restore your entity ID back to \"KnowBe4\". If you click this button, any existing SAML connection using your entity ID will stop functioning until you update it in your identity provider.</div>\n</div>\n</li>\n<li>\n<strong>SSO Sign-in URL:</strong> This field provides the Login URL or SAML Endpoint URL. This URL will redirect your users to the identity provider SSO URL.</li>\n<li>\n<strong>SSO Sign-out URL:</strong> This field provides the Logout URL.</li>\n<li>\n<strong>SSO Callback (ACS) URL:</strong> This field provides the Assertion Customer Service (ACS) URL. This URL receives the authentication response from your identity provider.</li>\n<li>\n<strong>SAML ID:</strong> This field provides your SAML ID. Your SAML ID is a unique code that links your users back to your KnowBe4 account. You can’t change your SAML ID.</li>\n<li>\n<strong>Metadata URL:</strong> This field provides your Metadata URL. Your Metadata URL contains your service provider’s metadata file and can be used to automatically configure the SAML connection on your identity provider. You can only use the metadata URL where applicable.</li>\n<li>\n<strong>Bypass-SSO Login URL:</strong> This field provides your Bypass-SSO Login URL. If you'd like to bypass SSO, this URL will bypass the SSO redirect and allow you to log in to the KSAT console using your email and password.</li>\n</ol>\n<h2 id='h_01HBR30D0Q9SVQD5KVFV65VE1A'>Phish Alert Button (PAB)</h2>\n<p>In the <strong>Phish Alert</strong> section, you can configure and customize aspects of the Phish Alert Button (PAB) for your account. For information about the settings in this section, see the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/208969608.html'>Enable and Configure PAB</a> section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/208969608.html'>Phish Alert Button (PAB) Product Manual</a>.</p>\n<h2 id='h_01HBR30D0Q78HCP31ZBWCTWB1F'>API</h2>\n<p>In the <strong>API</strong> section, you can enable and access KnowBe4’s APIs.</p>\n<p>See below for more information about the settings in this section:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_api.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_api.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Reporting API:</strong> If your organization would like to use an API to pull data from the console for reporting purposes, select the <strong>Enable Reporting API Access</strong> setting and then click <strong>Reporting API</strong>. To use this feature, you must have a Platinum or Diamond subscription. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115016090908.html'>Reporting API Overview</a> article.</li>\n<li>\n<strong>User Event API:</strong> If your organization uses the User Event API, you can click <strong>User Event API</strong> to access the User Event API Management Console. To access the console, you must have a Platinum or Diamond subscription. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360024863474.html'>User Event API Overview</a> article.</li>\n<li>\n<strong>Product API:</strong> If your organization would like to use an API for PhishER, KSAT, or to integrate with KCM GRC, click <strong>Product API</strong>. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4404258222099.html'>KnowBe4 Graph API Overview</a> and <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7728644706579.html'>How to Integrate KnowBe4's KSAT Console with KCM GRC</a> articles.</li>\n</ol>\n<h2 id='h_01HBR30D0Q04Q745W2VG4PS4TB'>PhishER</h2>\n<p>If you have enabled PhishER in your organization, you can click the <strong>Go to PhishER</strong> button to access the PhishER interface.</p>\n<p>For more information about PhishER, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>PhishER Product Manual</a>.</p>\n<h2 id='h_01HBR30D0QBX80PK3ADEV80TYG'>Webhooks</h2>\n<p>In the <strong>Webhooks</strong> section, you can create webhooks for your KnowBe4 account by clicking the <strong>+Create</strong> button. With this feature, you can use webhooks to send real-time phishing and training data to other applications that you use.</p>\n<p>For more information, see <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/10103021848723.html'>Webhooks in Your KSAT Console</a> article.</p>\n<h2 id='h_01HBR30D0Q0ZGCYWK3MRSDTRYN'>Second Chance</h2>\n<p>In the <strong>Second Chance</strong> section, you can enable our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115011813867.html'>Second Chance</a> tool for your KnowBe4 account. You must have a Diamond-level subscription to enable Second Chance.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_secondchance.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_secondchance.png' alt=' '></a></p>\n<p>To enable Second Chance, select the <strong>Enable Second Chance Management</strong> setting. If you enable Second Chance, you can have access to a new <strong>Second Chance</strong> tab in your KSAT console.</p>\n<p>If you have a Partner account, you can use the <strong>Days Shown on Overview Page</strong> field to select the number of days you’d like to include when displaying the User Actions data on the Second Chance Overview page. The default setting is 30 days.</p>\n<p>For more information about Second Chance, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115011813867.html'>Second Chance Product Manual</a>.</p>\n<h2 id='h_01JHG5QEHJH7845PMMRKTNRV07'>PasswordIQ</h2>\n<p>In the PasswordIQ section, you can use our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4406004172435.html'>PasswordIQ</a> tool for your KnowBe4 account. You must have a Diamond-level subscription to use PasswordIQ.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_passwordiq.png'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Account+Settings/accountsettings_passwordiq.png' alt=' '></a></p>\n<p>To use PasswordIQ, select the <strong>Enable PasswordIQ</strong> setting. Once enabled, you can access a new <strong>PasswordIQ</strong> tab in your KSAT console.</p>\n<p>For more information about PasswordIQ, see our<a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4406004172435.html'>PasswordIQ Product Manual</a>.</p>",
    "user_segment_ids": []
  }
}