{
  "article": {
    "id": 13195275591955,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/13195275591955.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/13195275591955.html",
    "author_id": 1534339111301,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 26946827254035,
    "created_at": "2023-01-19T17:42:59Z",
    "updated_at": "2024-07-24T19:10:36Z",
    "name": "PhishER Reports Guide",
    "title": "PhishER Reports Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-05-09T16:34:46Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot",
      "answerbot_phisher"
    ],
    "body": "<p>On the <strong>Reports</strong> tab of your PhishER platform, you can view reports about the most common information found in your users' reported emails. For example, you can view reports about the most common sender domains and URL domains found in reported emails.</p>\n<h2 id='h_01HSBNHC3E9R2YB38TKQESVAJB'>Viewing Reports</h2>\n<p>To learn how to customize and view reports, see the screenshot and list below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/ReportsList.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/ReportsList.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>Most Common</strong>: Click a report type to view the report's dashboard.</li>\n<li>\n<strong>Search</strong>: Use the search bar to find specific information in a report.</li>\n<li>\n<strong>Download CSV</strong>: Click this button to download a CSV file of each report. This CSV file will include all data from the report. If a report contains a row for messages grouped as <strong>Other</strong>, those messages will be listed individually in the CSV file.</li>\n<li>\n<strong>Top 10</strong>: Click this drop-down menu to change the number of results displayed in the report. By default, each report displays the top 10 results.</li>\n<li>\n<strong>Last 30 Days</strong>: Click this button to view the report for a different date range. By default, each report displays data and activity over the last 30 days.</li>\n<li>\n<strong>Edit</strong>: Click the gear icon to show and hide columns on the different report pages. You can select whether to include messages that are in the <strong>Unknown</strong>, <strong>Clean</strong>, <strong>Spam</strong>, or <strong>Threat</strong> category.</li>\n</ol>\n<h2 id='h_01HSBNHC3EW33D4ACRJVQQNTQ6'>Attachments</h2>\n<p>You can use the <strong>Attachments</strong> report to determine the types of attachments found in the emails your users are reporting. The <strong>Most Common Attachment Types</strong> bar graph represents the data found in the table below it. For more information about the <strong>Attachments</strong> report, see the screenshot and list below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_Attachments.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_Attachments.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>File Extension</strong>: This column displays the attachment file extension type.\n<div class='callout-info'>\n<div class='callout__content'>\n<strong>Note:</strong>Only the top 10 attachment file extension types will display in this column. The <strong>Other</strong> row indicates the number of additional attachment file extension types that were found in reported emails.</div>\n</div>\n</li>\n<li>\n<strong>Message Count</strong>: This column displays the number of messages in your PhishER <strong>Inbox</strong> that have this file extension.</li>\n<li>\n<strong>Unknown</strong>: This column displays the number of messages in your <strong>Inbox</strong> that have this file extension and were determined to be Unknown.</li>\n<li>\n<strong>Clean</strong>: This column displays the number of messages in your <strong>Inbox</strong> that have this file extension and were determined to be Clean.</li>\n<li>\n<strong>Spam</strong>: This column displays the number of messages in your <strong>Inbox </strong>that have this file extension and were determined to be Spam.</li>\n<li>\n<strong>Threat</strong>: This column displays the number of messages in your <strong>Inbox </strong>that have this file extension and were determined to be a Threat.</li>\n</ol>\n<h2 id='h_01HSBNHC3EE1PS4ZXWYVBYBW36'>Reporters</h2>\n<p>You can use the <strong>Reporters</strong> report to determine which of your users report emails frequently. The <strong>Most Common Reporters</strong> bar graph represents the data found in the table below. For more information about the <strong>Reporters</strong> report, see the screenshot and list below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_Reporters.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_Reporters.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>Reporter</strong>: This column displays the email address of the user who reported messages to the <strong>Inbox</strong>.\n<div class='callout-info'>\n<div class='callout__content'>\n<strong>Note:</strong>Only the top 10 reporters will display in this column. The <strong>Other</strong> row in the CSV file indicates the number of additional reporters that reported messages frequently.</div>\n</div>\n</li>\n<li>\n<strong>Message Count</strong>: This column displays the number of messages the reporter has forwarded to the <strong>Inbox</strong>.</li>\n<li>\n<strong>Unknown</strong>: This column displays the number of messages in your <strong>Inbox</strong> that were forwarded by the reporter and determined to be Unknown.</li>\n<li>\n<strong>Clean</strong>: This column displays the number of messages in your <strong>Inbox</strong> that were forwarded by the reporter and determined to be Clean.</li>\n<li>\n<strong>Spam</strong>: This column displays the number of messages in your <strong>Inbox</strong> that were forwarded by the reporter and determined to be Spam.</li>\n<li>\n<strong>Threat</strong>: This column displays the number of messages in your <strong>Inbox</strong> that were forwarded by the reporter and determined to be a Threat.</li>\n</ol>\n<h2 id='h_01HSBNHC3EQBT3SSWV2YG2JW1E'>Senders</h2>\n<p>You can use the <strong>Senders</strong> report to determine the types of sender domains associated with the emails your users are reporting. The <strong>Most Common Senders</strong> bar graph represents the data found in the table below it. For more information about the <strong>Senders</strong> report, see the screenshot and list below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_Senders.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_Senders.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>Sender Domain</strong>: This column displays the sender domain tied to the original reported message.\n<div class='callout-info'>\n<div class='callout__content'>\n<strong>Note:</strong>Only the top 10 sender domains will display in this column. The <strong>Other</strong> row in the CSV file indicates the number of additional sender domains that were reported.</div>\n</div>\n</li>\n<li>\n<strong>Message Count</strong>: This column displays the number of messages forwarded to your <strong>Inbox</strong> with this sender domain.</li>\n<li>\n<strong>Unknown</strong>: This column displays the number of messages that were forwarded to your <strong>Inbox</strong> with this sender domain and were determined to be Unknown.</li>\n<li>\n<strong>Clean</strong>: This column displays the number of messages that were forwarded to your <strong>Inbox</strong> with this sender domain and were determined to be Clean.</li>\n<li>\n<strong>Spam</strong>: This column displays the number of messages that were forwarded to your <strong>Inbox</strong> with this sender domain and were determined to be Spam.</li>\n<li>\n<strong>Threat</strong>: This column displays the number of messages that were forwarded to your <strong>Inbox</strong> with this sender domain and were determined to be a Threat.</li>\n</ol>\n<h2 id='h_01HSBNHC3E35RYDHGWM39MMRZA'>Domains and URLs</h2>\n<p>You can use the <strong>Domains and URLs</strong> report to determine the types of domains and URLs found in the emails your users are reporting. The <strong>Most Common Domains and URLs</strong> bar graph represents the data found in the table below it. You can find a list of all of the supported URL rewriters and shorteners that are compatible with PhishER in our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360014171474.html' target='_self'>PhishER FAQ</a> article. For more information about the <strong>Domains and URLs</strong> report, see the screenshot and list below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_DomainsURLs.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_DomainsURLs.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>Domain</strong>: This column displays the URL domain associated with a message in your <strong>Inbox</strong>.\n<div class='callout-info'>\n<div class='callout__content'>\n<strong>Note:</strong>Only the top 10 URL domains will display in this column. The <strong>Other</strong> row in the CSV file indicates the number of additional domains and URLs that were reported.</div>\n</div>\n</li>\n<li>b. <strong>Message Count</strong>: This column displays the number of messages forwarded to your <strong>Inbox</strong> with this URL domain.</li>\n<li>\n<strong>Unknown</strong>: This column displays the number of messages that were forwarded to your <strong>Inbox</strong> with this URL domain and were determined to be Unknown.</li>\n<li>\n<strong>Clean</strong>: This column displays the number of messages that were forwarded to your <strong>Inbox </strong>with this URL domain and were determined to be Clean.</li>\n<li>\n<strong>Spam</strong>: This column displays the number of messages that were forwarded to your <strong>Inbox</strong> with this URL domain and were determined to be Spam.</li>\n<li>\n<strong>Threat</strong>: This column displays the number of messages that were forwarded to your <strong>Inbox</strong> with this URL domain and were determined to be a Threat.</li>\n</ol>\n<h2 id='h_01HSBNHC3ERTGED0T7NQYXFBQS'>Tags</h2>\n<p>You can use the <strong>Tags</strong> report to determine the tags most often applied to the emails your users are reporting. The <strong>Most Common Tags</strong> bar graph represents the data found in the table below it. For more information about the <strong>Tags</strong> report, see the screenshot and list below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_Tags.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/GettingStarted/ProductManual/Reports_Tags.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>Tag</strong>: This column displays the tag applied to at least one message in your <strong>Inbox</strong>.\n<div class='callout-info'>\n<div class='callout__content'>\n<strong>Note:</strong>Only the top 10 tags will display in this column. The <strong>Other</strong> row in the CSV file indicates the number of additional tags that were applied.</div>\n</div>\n</li>\n<li>\n<strong>Message Count</strong>: This column displays the number of messages in your <strong>Inbox</strong> that include this tag.</li>\n<li>\n<strong>Unknown</strong>: This column displays the number of messages in your <strong>Inbox</strong> that include this tag and were determined to be Unknown.</li>\n<li>\n<strong>Clean</strong>: This column displays the number of messages in your <strong>Inbox</strong> that include this tag and were determined to be Clean.</li>\n<li>\n<strong>Spam</strong>: This column displays the number of messages forwarded to your <strong>Inbox</strong> that include this tag and were determined to be Spam.</li>\n<li>\n<strong>Threat</strong>: This column displays the number of messages in your <strong>Inbox</strong> that include this tag and were determined to be a Threat.</li>\n</ol>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/13195275591955-PhishER-Reports-Guide"
  }
}