{
  "article": {
    "id": 15664129041811,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/15664129041811.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/15664129041811.html",
    "author_id": 10253571462675,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 1,
    "vote_count": 3,
    "section_id": 16786935365139,
    "created_at": "2023-04-11T14:02:20Z",
    "updated_at": "2025-06-03T14:34:23Z",
    "name": "Free QR Phishing Security Test (PST) Product Manual",
    "title": "Free QR Phishing Security Test (PST) Product Manual",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-06-03T14:34:23Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "Free QR Phishing",
      "QR Phishing",
      "Free Tools",
      "QR Code",
      "Free QR Code"
    ],
    "body": "<p>You can use our free QR Code Phishing Security Test to see how vulnerable your users may be to QR code phishing attacks.</p>\n<p>QR codes are scannable barcodes that contain data, such as links or digital business cards, in a compact format. If your users scan a malicious QR code, they could be prompted to visit a dangerous website.</p>\n<p>To teach your users about QR code phishing attacks and other threats, we recommend enrolling them in security awareness training. If you’re interested in KnowBe4’s training and phishing features, you can request a demo <a href='https://info.knowbe4.com/training-request-a-demo' target='_blank' rel='noopener'>here</a>.</p>\n<p>See the sections below to complete your free QR Code Phishing Security Test. If you have any questions about this tool, please reach out to our <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener noreferrer'>support team</a> for further assistance.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>This test does not require any additional software and is limited to 100 employees.</div>\n</div>\n<h2 id='h_01HSE8H1Q789G67RGK4NYEGX0K'>Signing Up for a Free Account</h2>\n<p>To sign up for a free account, follow the below steps. If you already have a free account, skip to the <a href='#h_01HSE8H1Q73XMF0NE8M9R3NH1S'>Setting Up a QR Code Phishing Security Test</a> section of this article.</p>\n<ol role='list'>\n<li>Sign up for a free account here: KnowBe4 Free QR Code Phishing Security Test.</li>\n<li>After entering your information on the right side of the page, click <strong>Get Started</strong> or click the link provided in the email we will send you.</li>\n<li>On the next page, enter your work email address. After you enter your email addresses, click <strong>Next</strong> to create a free account.\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Email addresses of publicly-available email services like Hotmail and Gmail cannot be used when signing up for the free QR Code Phishing Security Test. Any email addresses that are not from the same domain as the corporate email address used for registration will not be valid.</div>\n</div>\n</li>\n<li>You will receive an email asking you to activate your account. Click the link in the email to activate your free account.</li>\n<li>After you click the link, you will need to set up your free account. Enter your first and last name as well as a password for the account. Then, click <strong>Save &amp; Continue</strong>.</li>\n<li>As the first person to log in under your domain, you will be automatically set up as the Account Owner. Proceed to step three under the <a href='#h_01HSE8H1Q73XMF0NE8M9R3NH1S'>Setting Up a QR Code Phishing Security Test</a> section of this article.</li>\n</ol>\n<h2 id='h_01HSE8H1Q73XMF0NE8M9R3NH1S'>Setting Up a QR Code Phishing Security Test</h2>\n<p>To set up a QR Code Phishing Security Test, follow the below steps.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Before setting up this test, you must whitelist KnowBe4 in your mail server and any spam filters that you’re using. Your mail server or mail filter may use rate limiting, which could prevent many emails from being delivered at once. Your settings may need to be adjusted. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/203645138'>Whitelisting Data and Anti-Spam Filtering Information</a> article.</div>\n</div>\n<ol role='list'>\n<li>Log in to your free KnowBe4 account.</li>\n<li>Under the <strong>Free QR Code Phishing Security Test </strong>section, click the <strong>Get Started</strong> button. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/PhishingTest.png'><img src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/PhishingTest.png' alt=' '></a>\n</li>\n<li>Choose which style of template you would like to use. We have three template options: <strong>Review Document</strong>, <strong>Voice Message</strong>, and <strong>HR Survey</strong>. <strong>Review Document</strong> will be selected by default. You can also choose the language for the template by clicking the language drop-down menu. <strong>English (United States)</strong> will be selected by default. </li>\n<li>Click <strong>Next Step.</strong> <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/LanguageSelect.png'><img src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/LanguageSelect.png' alt=' '></a>\n</li>\n<li>On the <strong>Choose Email Recipients </strong>page, choose who you’d like to send this phishing test to. You can enter up to 100 email addresses from your organization. Enter the email addresses in the space provided with one email address on each line. Do not use commas or spaces between email addresses.\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> You can import your users if you have already used the free Phishing Security Test (PST) or the free Phishing Reply Test (PRT). To import your users, navigate to the<strong> Import from: </strong>drop-down menu and select either <strong>Free PST</strong> or <strong>Free PRT</strong>.</div>\n</div>\n</li>\n<li>Click <strong>Next Step</strong>. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/EmailRecipients.png'><img src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/EmailRecipients.png' alt=' '></a>\n</li>\n<li>On the <strong>Landing Page</strong> page, choose which landing page you would like your users to see upon failing the test. You can select a 404 error page so that the user may assume they clicked on a broken link. Or, you can select our Social Engineering Indicators (SEI) landing page, which lets the user know they failed a phishing test and teaches them about the red flags that they should have looked out for.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>The SEI landing page is selected by default.</div>\n</div>\n</li>\n<li>Click <strong>Next Step</strong>. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/LandingPages.png'><img src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/LandingPages.png' alt=' '></a>\n</li>\n<li>On the <strong>Review &amp; Launch</strong> page, review your information before launching your free QR Code Phishing Security Test. If you haven’t already done so, make sure that you whitelist KnowBe4’s mail servers and ensure that you can receive our phishing test emails. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/LaunchTest.png'><img src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/LaunchTest.png' alt=' '></a>\n</li>\n<li>After whitelisting, click the <strong>Preview and Send Test Email</strong> button. A pop-up window will open that will display what the email will look like when your users receive it. After previewing the email, you can send yourself a test email by clicking the <strong>Send Me a Test Email</strong> button in the top-right corner of the pop-up window. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/EmailPreview.png'><img src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/EmailPreview.png' alt=' ' width='533' height='581'></a>\n</li>\n<li>After sending the test email, check your inbox and make sure you’ve received it. This email may take up to 10 minutes to send. You can also check the <strong>Test Email Delivery</strong> section towards the bottom of the <strong>Review &amp; Launch</strong> page.\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> If you don’t receive the email or it’s filtered by your mail server, please see our <a href='https://support.knowbe4.com/hc/en-us/articles/203645138'>Whitelisting Data and Anti-Spam Filtering Information</a> article.</div>\n</div>\n</li>\n<li>Once you are ready to start your test, click the <strong>Start Your Free QR Code PST Now! </strong>button. The test will send emails to your selected recipients and track QR code scans for three days.</li>\n</ol>\n<h2 id='h_01HSE8H1Q7EQB5A76VZ9NPHJBQ'>Analyzing Your Results</h2>\n<p>After you run the test, you can view your results on the <strong>Dashboard</strong> page of your free KnowBe4 account. You will be able to view your QR Code Scanned Percentage, which will show your organization’s vulnerability to QR phishing attacks. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/AnalyzeResults.png'><img src='https://helpimg.s3.amazonaws.com/Free_QR_Phishing/AnalyzeResults.png' alt=' '></a></p>\n<p>You can download a PDF report from the results page or from an email automatically sent to you after 24 hours. If you want to know who replied to the tests, your representative or reseller can get that information for you. If you do not know who your representative or reseller is, submit a ticket to our <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener noreferrer'>support team</a>.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/15664129041811-Free-QR-Phishing-Security-Test-PST-Product-Manual"
  }
}