{
  "article": {
    "id": 18853966211219,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/18853966211219.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/18853966211219.html",
    "author_id": 1534339111301,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 5,
    "vote_sum": -1,
    "vote_count": 1,
    "section_id": 7759989017491,
    "created_at": "2023-07-24T21:52:47Z",
    "updated_at": "2025-06-13T13:33:50Z",
    "name": "Integrate CrowdStrike with Your PhishER Platform",
    "title": "Integrate CrowdStrike with Your PhishER Platform",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-06-13T13:33:50Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot",
      "answerbot_phisher"
    ],
    "body": "<p>From the <strong>CrowdStrike</strong> subtab of your <a href='https://support.knowbe4.com/hc/en-us/articles/16569063307411'>PhishER Settings</a>, you can configure the CrowdStrike Falcon Sandbox integration for your PhishER platform. CrowdStrike Falcon Intelligence is a threat intelligence service that combines with the Falcon Sandbox to analyze files and URLs for malicious content in a protected, sandbox environment. This integration uses the Falcon Sandbox API to allow PhishER to submit files and URLs for analysis, pull report data, and perform advanced search queries.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>To integrate the CrowdStrike Falcon Sandbox with PhishER, you must have a PhishER Plus subscription and an active CrowdStrike Falcon Intelligence subscription. If you do not have a CrowdStrike subscription, you can purchase one on CrowdStrike's <a href='https://www.crowdstrike.com/products/threat-intelligence/falcon-sandbox-malware-analysis/' target='_blank' rel='noopener noreferrer'>website</a>.</div>\n</div>\n<p>After CrowdStrike scans an attachment or URL, a malware analysis report will be available under the <strong>Attachments</strong> or <strong>Domains &amp; URLs</strong> subtab on the <strong>Message Details</strong> page of your PhishER platform. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/13169303385619#VIEWMSGDETAILS'>How to Use Your PhishER Inbox</a> article.</p>\n<h2 id='iv_01H7V4D8B9KXTCPGQJA157S6AB'>Creating an OAuth Client</h2>\n<p>Before you can set up this integration in your PhishER platform, you will need to create an OAuth client and assign it the appropriate credentials. PhishER will use these credentials to send files to the CrowdStrike system to be scanned.</p>\n<p>To create an OAuth client, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your CrowdStrike Falcon console and navigate to <strong>Support and resources</strong> &gt; <strong>Resources and tools</strong> &gt; <strong>API clients and keys</strong>..<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_APIClientsandKeys.png'><img src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_APIClientsandKeys.png' alt='CrowdStrike API Clients and Keys' width='209' height='245'></a>\n</li>\n<li>In the <strong>API client and Secrets</strong> window under the <strong>OAuth2API clients</strong> tab, click <strong>Create API client</strong>. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_OAuth2APIClients.png'><img src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_OAuth2APIClients.png' alt='CrowdStrike Add New API Client'></a>\n</li>\n<li>In the <strong>Create API client</strong> pop-up window, enter a name for your new client in the <strong>Client name</strong> field. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_CreateAPIclient.png'><img src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_CreateAPIclient.png' alt='CrowdStrike API Client ID and Secret' width='551' height='280'></a>\n</li>\n<li>Configure your new client by selecting the <strong>Read</strong> and <strong>Write</strong> check boxes, where available, next to the following <strong>API Scopes</strong>:\n<ul role='list'>\n<li><strong>Actors</strong></li>\n<li><strong>Indicators </strong></li>\n<li><strong>Reports</strong></li>\n<li><strong>Sandbox</strong></li>\n<li><strong>Quick Scan</strong></li>\n<li>\n<strong>Sample uploads</strong> <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_API_Scopes.png'><img src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_API_Scopes.png' alt='CrowdStrike API Scopes' width='444' height='561'></a>\n</li>\n</ul>\n</li>\n<li>Click <strong>Create</strong> to create your new client.</li>\n<li>Locate the <strong>Client ID</strong> and<strong> Secret</strong>. Make sure to copy both of these items and save them somewhere that you can easily access later. You will need both of these items to set up the integration in your PhishER platform. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_APIClientCreated.png'><img src='https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_APIClientCreated.png' alt='CrowdStrike API Client ID and Secret' width='551' height='280'></a>\n</li>\n</ol>\n<h2 id='iv_01H7V4D8B9TP96GY79C6NQV2SE'>Setting Up CrowdStrike in Your PhishER Platform</h2>\n<p>Once you have created your CrowdStrike OAuth client, you can set up the integration in your PhishER platform. To configure the integration, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your PhishER platform and navigate to <strong>Settings</strong> &gt; <strong>CrowdStrike</strong>.</li>\n<li>Click <strong>Update Authorization Settings</strong> to open the <strong>CrowdStrike Authentication Keys</strong> pop-up window.</li>\n<li>In the pop-up window fields, enter the Client ID and Secret that you copied in the <a href='#01H7V4D8B9KXTCPGQJA157S6AB'>Creating an OAuth Client</a> section of this article.</li>\n<li>Click <strong>Update CrowdStrike Keys</strong> to save the authorization settings.</li>\n<li>Click the <strong>CrowdStrike Disabled</strong> toggle to enable the integration.</li>\n<li>Fill out the remaining fields in the <strong>CrowdStrike Settings</strong> section. Then, click <strong>Update CrowdStrike Settings</strong> to update the integration settings.</li>\n<li>(Optional) The <strong>Shared Integrations Settings</strong> section displays the settings that affect all integrations that use the Timeout value and Ignored Domains list. If you would like to update these settings, click <strong>Update Shared Settings</strong>.</li>\n</ol>\n<p>For more information about your CrowdStrike integration settings, view the screenshot and list below:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/Settings/CrowdStrike/EN/CrowdStrikeSettings.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/Settings/CrowdStrike/EN/CrowdStrikeSettings.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>CrowdStrike Disabled or CrowdStrike Enabled</strong>: Use this toggle to disable or enable the integration.</li>\n<li>(Optional) <strong>CrowdStrike Automatic Scanning</strong>: In this section, you can configure settings that allow CrowdStrike to automatically scan parts of a message. To learn about these options, view the list below:\n<ul role='list'>\n<li>\n<strong>Automatically Scan All Attachments (Hashes Only)</strong>: If you select this check box, CrowdStrike will automatically be sent a hash of all attachments in your PhishER <strong>Inbox</strong>.</li>\n<li>\n<strong>Automatically Scan All URLs</strong>: If you select this check box, CrowdStrike will automatically be sent all URLs in your PhishER <strong>Inbox</strong>.</li>\n</ul>\n</li>\n<li>\n<strong>Default Operating System</strong>: From this drop-down menu, select the operating system that you would like to use as the default operating system for scans. For more information, view the list below:\n<ul role='list'>\n<li>macOS</li>\n<li>Linux Ubuntu</li>\n<li>Android</li>\n<li>Windows 10, 64-bit\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> This is the default setting.</div>\n</div>\n</li>\n<li>Windows 7, 64-bit</li>\n<li>Windows 7, 32-bit</li>\n</ul>\n</li>\n<li>\n<strong> Default Network Configuration</strong> From this drop-down menu, select the network configuration that you would like to use as the default network configuration for scans. For more information, view the list below:\n<ul role='list'>\n<li>Fully Operating Network \n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> This is the default setting.</div>\n</div>\n</li>\n<li>Network Traffic Routed Through TOR</li>\n<li>Simulated Network Traffic</li>\n<li>No Network Traffic</li>\n</ul>\n</li>\n<li>\n<strong>Update CrowdStrike Settings</strong>: Click this button if you would like to save changes made to the integration settings in this section. </li>\n<li>\n<strong>Your API Client ID</strong>: In this field, enter the <strong>Client ID</strong> that you created in the <a href='#01H7V4D8B9KXTCPGQJA157S6AB'>Creating an OAuth Client</a> section of this article.</li>\n<li>\n<strong>Your API Client Secret</strong>: In this field, enter the<strong> Secret</strong> that you created in the <a href='#01H7V4D8B9KXTCPGQJA157S6AB'>Creating an OAuth Client</a> section of this article.</li>\n<li>\n<strong> Update Authorization Settings</strong>: Click this button open the <strong>CrowdStrike Authentication Keys</strong> pop-up window. In the pop-up window, you can update your API Client ID and API Client Secret. </li>\n<li>(Optional) <strong>Automatic Scanning Timeout</strong>: The <strong>Timeout if no response (seconds) field</strong> displays the custom timeout period for your CrowdStrike scan results. If CrowdStrike does not return scan results in this timeout period, a <strong>CS_BYPASSED</strong> tag will be applied to the corresponding message. By default, the timeout period is 120 seconds. To learn more about the tags that can be applied to the message, read the <a href='#h_01HCB1YJCAHYHXSR1F5VAGS9A6'>CrowdStrike Tags</a> section of this article. </li>\n<li>(Optional) <strong>Ignored Domains</strong>: This section displays the domains that you would like CrowdStrike to ignore when running a scan.</li>\n<li>\n<strong>Update Shared Settings</strong>: If you would like to update the custom timeout period or ignored domains for your integrations, click this button to open the <strong>Shared Integrations Settings</strong> pop-up window. In the pop-up window, you can enter a number of seconds in the <strong>Timeout if no response (seconds)</strong> field to set a custom timeout period for your CrowdStrike scan results. In the <strong>Ignored Domains</strong> field, you can enter the domains that you would like CrowdStrike to ignore when running a scan. Enter each domain as a new line in the text box. If you add a domain to this list, any subdomains of that domain will be excluded as well. However, if you add a subdomain to the list, the domain will not be excluded. Wildcards (*) and Uniform Resource Identifiers (URIs) are not supported. \n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> For more information about KnowBe4 domains that should not be sent as links or attachments to CrowdStrike, read the <a href='#01H7V4D8B94QM2NZAVJFSR0AW5'>Excluding KnowBe4 Domains from Scans</a> section of this article.</div>\n</div>\n</li>\n</ol>\n<h2 id='iv_01H7V4D8B90PKXVMZFP27Y3005'>Scanning with CrowdStrike</h2>\n<p>Once you integrate your CrowdStrike account with your PhishER platform, you can run a CrowdStrike scan on message attachments and URLs. To run a CrowdStrike scan on a specific attachment or URL, click <strong>Detonate</strong> on the <strong>Message Details</strong> page.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you enable the settings in the <strong>CrowdStrike Automatic Scanning</strong> section of your settings, CrowdStrike will automatically receive a hash of all attachments or URLs in your PhishER <strong>Inbox</strong>.</div>\n</div>\n<p>When you run a CrowdStrike scan on an attachment or URL, CrowdStrike detonates and analyzes the submitted file sample in a sandbox environment. The scan may take up to fifteen minutes to complete. When the scan is complete, the malware analysis report will be shared in a private sandbox environment on your CrowdStrike Falcon platform and on the <strong>Message Details</strong> page of your PhishER platform. For more information, read the <a href='https://support.knowbe4.com/hc/en-us/articles/13169303385619#VIEWMSGDETAILS'>Viewing Message Details</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/13169303385619'>How to Use Your PhishER Inbox</a> article.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> The CrowdStrike Falcon Sandbox does not support all file types. If you detonate a file sample with an unsupported file type, the detonation will fail. For more information about the file types that CrowdStrike can analyze, read the <a href='https://www.crowdstrike.com/products/threat-intelligence/falcon-sandbox-malware-analysis/faq/' target='_blank' rel='noopener noreferrer'>CrowdStrike Falcon Sandbox FAQ</a>.</div>\n</div>\n<h2 id='iv_01H7V4D8B94QM2NZAVJFSR0AW5'>Excluding KnowBe4 Domains from Scans</h2>\n<p>KnowBe4 uses multiple domains that should not be sent as links or attachments to CrowdStrike. You can enter these ignored domains in the <strong>Shared Integrations Settings</strong> section on the <strong>CrowdStrike</strong> subtab of your PhishER settings. To find and exclude the domains, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to the <strong>Phishing</strong> tab, then select the <strong>Domains</strong> subtab. This subtab displays a list of our root phish link domains. For more information, read our <a href='https://support.knowbe4.com/hc/en-us/articles/360061705153'>How to Manage Phish Link Domains</a> article.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If you don't have access to this subtab, you can contact our <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_self'>support team</a> for a list of phish link domains.</div>\n</div>\n</li>\n<li>In a separate browser or tab, log in to your PhishER platform.</li>\n<li>Navigate to <strong>Settings</strong> &gt; <strong>CrowdStrike</strong>.</li>\n<li>In the <strong>Shared Integrations Settings</strong> section, click <strong>Update Shared Settings</strong>.</li>\n<li>In the <strong>Ignored Domains</strong> field, enter the root domains from your KSAT console.</li>\n<li>Click <strong>Update Shared Settings</strong>.</li>\n<li>If you use more than one instance of the KSAT console, repeat steps 1-7 to exclude the root domains from all of your instances. For more information about KSAT instances, read our <a href='https://support.knowbe4.com/hc/en-us/articles/360043196354'>KnowBe4's Training Instances</a> article.</li>\n</ol>\n<h2 id='iv_h_01HCB1YJCAHYHXSR1F5VAGS9A6'>CrowdStrike Tags</h2>\n<p>Based on the scan results, CrowdStrike will apply one or more tags to your messages. To learn about the CrowdStrike tags, view the list below:</p>\n<ol role='list'>\n<li>\n<strong>CS_BYPASSED</strong>: This tag is attached to your message when a CrowdStrike scan times out. This tag is commonly attached with additional CrowdStrike tags. You can set a custom timeout period under your CrowdStrike<strong> Shared Integrations Settings</strong>.\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>If a CrowdStrike timeout occurs, PhishER will still wait for your CrowdStrike results to return. However, automated actions will not run against the item while CrowdStrike scans it.</div>\n</div>\n</li>\n<li>\n<strong>CS_ERROR</strong>: This tag is attached to your message when a CrowdStrike scan results in processing errors or when CrowdStrike is unable to detonate a file sample.</li>\n<li>\n<strong>CS_IGNORED</strong>: This tag is attached to your message when URLs or domains found on your <strong>Ignored Domains</strong> list are detected on a message.</li>\n<li>\n<strong>CS_MALICIOUS</strong>: This tag is attached to your message when a CrowdStrike scan determines that a threat was detected from the attachments or URLs.</li>\n<li>\n<strong>CS_NO_SPECIFIC_THREAT</strong>: This tag is attached to your message when a CrowdStrike scan determines that no threat was detected from the attachment or URL.</li>\n<li>\n<strong>CS_NOT_FOUND</strong>: This tag is attached to your message when a CrowdStrike scan doesn’t return a match for the hashed attachments or the URLs.</li>\n<li>\n<strong>CS_PENDING</strong>: This tag is attached to your message when a CrowdStrike scan is queued. This tag will be removed when the scan is completed.</li>\n<li>\n<strong>CS_SCANNED</strong>: This tag is attached to your message when a CrowdStrike detonation is completed and has not found results for threats.</li>\n<li>\n<strong>CS_SUSPICIOUS</strong>: This tag is attached to your message when a CrowdStrike scan determines that the attachments or URLs are suspicious but are not confirmed to be malicious.</li>\n</ol>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>A message with multiple attachments can have multiple CS tags since some scans may finish at different times or have different results.</div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/18853966211219-Integrate-CrowdStrike-with-Your-PhishER-Platform",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_APIClientsandKeys.png",
        "alt": "",
        "position": 1,
        "context": "keys.."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_OAuth2APIClients.png",
        "alt": "",
        "position": 2,
        "context": "lient."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_CreateAPIclient.png",
        "alt": "",
        "position": 3,
        "context": "field."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_API_Scopes.png",
        "alt": "",
        "position": 4,
        "context": "mple uploads"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/integrations/CrowdStrike/Support_and_resources/Resources_and_tools/API_Client_and_keys/EN/CS_APIClientCreated.png",
        "alt": "",
        "position": 5,
        "context": "ishER platform."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/PhishER/Settings/CrowdStrike/EN/CrowdStrikeSettings.png",
        "alt": "This technical description details the configuration page for the **CrowdStrike Falcon** integration within a platform settings interface.\n\n**Interface Context:**\nThe user is viewing the **SETTINGS** page. In the left navigation pane, under the **INTEGRATIONS** section, the **CrowdStrike** submenu item is actively selected (highlighted in dark blue).\n\n**Main Content Area: CrowdStrike Falcon Configuration**\n\nAn informational blue banner at the top confirms the purpose of the page: integrating CrowdStrike Falcon Intelligence for file and URL scanning, providing a hyperlink to a setup guide titled, \"How to Integrate CrowdStrike with Your PhishER Platform.\"\n\nThe configuration is organized into three distinct sections:\n\n**1. CrowdStrike Settings**\nThis section controls the general scanning behavior:\n*   **CrowdStrike Enabled:** A toggle switch is active (green, 'Enabled').\n*   **CrowdStrike Automatic Scanning:** Two checkboxes are enabled:\n    *   `Automatically Scan All Attachments (Hashes Only)`\n    *   `Automatically Scan All URLs`\n*   **Default Operating System:** A dropdown menu is set to `Windows 10, 64-bit`.\n*   **Default Network Configuration:** A dropdown menu is set to `Fully Operating Network`.\n*   **Action Button:** `Update CrowdStrike Settings` (orange).\n\n**2. Authorization Settings**\nThis section handles credential input, with sensitive data masked:\n*   **Your API Client ID:** Input field showing masked data ending in `d463`.\n*   **Your API Client Secret:** Input field showing masked data ending in `gzdf`.\n*   **Action Button:** `Update Authorization Settings` (orange).\n\n**3. Shared Integrations Settings**\nThis section applies parameters common across multiple integrations:\n*   **Context:** Descriptive text states these settings affect all integrations using the Timeout and Ignored Domains list.\n*   **Automatic Scanning Timeout:** An input field specifies the timeout in seconds, currently set to `6`.\n*   **Ignored Domains:** A multi-line text area containing the entry `some1234.com`.\n*   **Action Button:** `Update Shared Settings` (orange).",
        "position": 6,
        "context": "your CrowdStrike integration settings, view the screenshot and list below:"
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "crowdstrike",
        "integrate",
        "phisher",
        "platform",
        "your"
      ],
      "image_count": 6
    }
  }
}