{
  "article": {
    "id": 218912147,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/218912147.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/218912147.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 3,
    "vote_sum": 14,
    "vote_count": 20,
    "section_id": 20033755383827,
    "created_at": "2016-04-21T21:57:58Z",
    "updated_at": "2025-03-11T16:45:05Z",
    "name": "Prepare for Your Walkthrough or Webinar",
    "title": "Prepare for Your Walkthrough or Webinar",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T16:45:05Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "walkthrough",
      "onboarding",
      "walk through",
      "webinar",
      "onboard",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>As a new member of the KnowBe4 family, your Customer Success Manager will be contacting you to schedule you for a webinar or walkthrough of the KSAT console. To prepare for your webinar or walkthrough, we recommend that you complete the following steps:</p>\n<ol role='list'>\n<li>Whitelist our mail servers.</li>\n<li>Prepare your list of users for import, or integrate with your Active Directory.</li>\n<li>Read our Quickstart Implementation Guide.</li>\n</ol>\n<p>For more information about each of these steps, read the sections below.</p>\n<h2 id='h_01HH2JGA9GWB8VYRYE0VZ9211A'>Whitelist Our Mail Servers</h2>\n<p>It is very important that you whitelist our mail servers before you send out any simulated phishing emails. If you don't whitelist our mail servers, emails may get blocked entirely or end up in your users' Junk or Spam folders.</p>\n<p>To see the IP addresses and hostnames of our servers that will need to be used in your system to whitelist us, see our<a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/203645138.html' target='_self'> Whitelisting Data and Anti-Spam Filtering Information</a> article. As a general rule, we recommend whitelisting by IP address only, which is usually the most effective method. However, this method may not be compatible with your system setup. So, feel free to whitelist as needed based on the mail server and spam filter you have in place.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>We recommend that you set up a test campaign prior to the webinar or walkthrough to ensure that your whitelisting was done properly. Limit the test to a small test group of only one or two admins who can confirm receipt and tracking of clicks on phishing links. This campaign can be deleted once the test successfully reaches your inbox.</div>\n</div>\n<h2 id='h_01HH2JGA9GS6XF3VE7E818WKAY'>Prepare Your List of Users for Import, or Integrate with Your Active Directory</h2>\n<p>Importing your users will allow you to include them in your phishing or other social engineering campaigns, allow them to take their security awareness training, and more. There are a few methods you can use to import your users.</p>\n<p>The simplest and most efficient method for maintaining your list of users is to sync your KSAT console with your Active Directory. To learn how to do so, check out our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/228373888.html' target='_self'>Active Directory Integration (ADI) Configuration Guide</a> or our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/229045167.html' target='_self'>Configuring Active Directory Integration (ADI)</a> video.</p>\n<p>If you'd rather do a one-time import of users, you will need to prepare your list of current users. Typically, an admin will pull their list of active users from their Active Directory. For more information on how to do this, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/200281719.html' target='_self'>How Can I Import Users from Active Directory Using Disquery?</a> article.</p>\n<p>You can also download one of our sample CSV files from the KSAT console to get started. The sample CSV files contain various fields for additional user information that can be helpful to add. To download a sample CSV file, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KSAT console, then navigate to <strong>Users</strong> &gt; <strong>Import Users</strong> &gt;<strong> CSV Import</strong>.</li>\n<li>Click one of the links with a CSV file example on the right side of the page.\n<a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/before_your_walkthrough/CSV1.png'><img src='https://s3.amazonaws.com/helpimg/before_your_walkthrough/CSV1.png' alt=' '></a>\n</li>\n<li>After you click an example CSV file, click the <strong>Download Example CSV </strong>button if the example file meets your organization’s needs.</li>\n</ol>\n<p><a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/before_your_walkthrough/CSV2.png'><img src='https://s3.amazonaws.com/helpimg/before_your_walkthrough/CSV2.png' alt=' '></a></p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note: </strong>Not all of the fields that you see in the sample CSV file are necessary. The only required field is the <strong>Email</strong> field. However, we recommended that you add a <strong>First Name</strong> field and <strong>Last Name</strong> field, as well as a <strong>Group</strong> field for that user. Once groups are set up, you can use those groups to target subsets of users with phishing or training campaigns.</div>\n</div>\n<p>For more tips to prepare your CSV file, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/204873347.html' target='_self'>How to Import Users with a CSV File</a> article.</p>\n<h2 id='h_01HH2JGA9GM9CJ1KT619W4J8H0'>Read Our Quickstart Implementation Guide</h2>\n<p>As an optional third step, we recommend that you read our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/206523288.html' target='_self'>Quickstart Implementation Guide</a>. The steps in this guide will be the steps that we'll recommend taking on the webinar or walkthrough.</p>\n<p>If you have any questions regarding these steps or anything else, contact us by <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener noreferrer'>submitting a support ticket</a> and we will be able to assist you.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/218912147-Prepare-for-Your-Walkthrough-or-Webinar"
  }
}