{
  "article": {
    "id": 29586165576339,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/29586165576339.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/29586165576339.html",
    "author_id": 397832506533,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 2,
    "vote_count": 2,
    "section_id": 30042379444499,
    "created_at": "2024-05-21T17:37:31Z",
    "updated_at": "2025-10-27T20:03:26Z",
    "name": "Google User Provisioning (GUP) Guide",
    "title": "Google User Provisioning (GUP) Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-30T17:14:24Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [
      "01HASWC0TM4R1K4WRNG1YFNN8S"
    ],
    "label_names": [
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>Google User Provisioning (GUP) is an automated method for importing users from your Google Workspace tenant directly into your KnowBe4 console. This integration allows you to use data from Google Workspace to provision users in your KnowBe4 console. Changes that you make to your users’ information and statuses in Google Workspace will sync automatically to your KnowBe4 console. Once you have configured the integration, you’ll be able to manage all your users from one place.</p>\n<p>This integration requires you to have access to a Google super-admin account. The admin account must have the permissions to configure the six Google scopes that are required by this integration. For the full list of required scopes, see the <a href='#h_01HZHK4XWS273NA90MS3P8BVY2'>What You Will Need</a> section of this article. If you are not a Google customer, KnowBe4 also offers other methods of automated user provisioning. For further information about alternative user provisioning methods, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360052380374.html'>SCIM Configuration Guide</a> or our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/228373888.html'>Active Directory Integration (ADI) Configuration Guide</a>.</p>\n<h2 id='h_01HZHK0BFY6VVBX05GSMTJ7ZP4'>How GUP Works</h2>\n<p>Using your Google <strong>Customer ID</strong> and your KnowBe4 <strong>Client ID</strong>, you can configure a direct connection between your Google Workspace environment and your KnowBe4 console. Once this connection has been established, you can configure which of your Google Workspace users and groups you would like to sync into your KnowBe4 console. Changes that you make to your users in Google Workspace will be reflected automatically in your KnowBe4 console.</p>\n<p>This sync is an automated process that occurs repeatedly throughout the day. Syncs will occur every six hours at minimum. The sync is a one-way process, and any changes made to users in your KnowBe4 console will not sync to your Google Workspace environment. Changes made to users directly in your KnowBe4 console will be overwritten by the data in Google Workspace. Any users in your KnowBe4 console who are not present in Google Workspace will be archived during the next GUP sync.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> You have the option to prevent any specific users from being managed by GUP. To prevent specific users from being managed by GUP, create a CSV file with a list of users that you don’t want to be managed by GUP. Enter “false” under the <strong>Provisioning Managed</strong> heading for those users.</div>\n</div>\n<h2 id='h_01HZHK1SW9Z685B81GY3M1R0H0'>Prerequisites</h2>\n<ul>\n<li>You must have admin access to your organization's KnowBe4 console.</li>\n<li>You must have super-admin access to Google Workspace.</li>\n</ul>\n<h2 id='h_01HZHK45DHHA6N5PA6GTGZ3D9H'>Configuring Your Google Workspace Connection</h2>\n<p>In order to configure GUP, you’ll need to connect your KnowBe4 console to your Google Workspace tenant.</p>\n<h3 id='h_01HZHK4XWS273NA90MS3P8BVY2'>What You Will Need</h3>\n<p>You will need to gather the KnowBe4 <strong>Client ID</strong> and list of six scopes from your KnowBe4 <strong>Account Settings</strong> in order to complete the connection to Google Workspace. This information can be found by navigating to your <strong>Account Settings</strong>, clicking <strong>User Management</strong> &gt; <strong>User Provisioning</strong>, and then toggling the <strong>Google</strong> button, as shown in the screenshot below:</p>\n<p><img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/WorkspaceConnectionScopes.png'></p>\n<p>Additionally, you will also need your Google Customer ID and Google super-admin email address when configuring the connection in your KnowBe4 <strong>Account Settings</strong>. This information is located in your Google Admin console. You can find it by logging in at <a href='https://admin.google.com'>admin.google.com</a>, and then clicking <strong>Account</strong> &gt; <strong>Account Settings</strong>. Your customer ID is shown at the top of the list.</p>\n<p><img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsCustomerIDAnnotated.png'></p>\n<p>Once you have the information listed above, you can begin configuring the Google Workspace connection.</p>\n<h3 id='h_01HZHYFVJKFQKQXGG6JZY9BZ2C'>Google Workspace Configuration</h3>\n<p>To connect Google Workspace and your KnowBe4 console, follow the steps below:</p>\n<ol>\n<li>Log in at <a href='https://admin.google.com'>admin.google.com</a>.</li>\n<li>From the home page of your Google Admin console, click <strong>Security</strong> &gt; <strong>Access and data control</strong> &gt; <strong>API controls</strong>.</li>\n<li>Click <strong>Manage Domain Wide Delegation</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageDomainWideDelegationAnnotated.png'>\n</li>\n<li>On the next screen, click <strong>Add New</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddNewAnnotated.png'>\n</li>\n<li>You will need to enter the KnowBe4 <strong>Client ID</strong> from your <strong>Account Settings</strong>, along with the list of six scopes.\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> Each scope will need to be separated by a comma.</div>\n</div>\n<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddNewClientID.png'> Once you have entered this information, click <strong>Authorize</strong>. You should now see KnowBe4's GUP listed in the <strong>API clients</strong> list.</li>\n</ol>\n<h3 id='h_01HZHZ96Z2A269REWT9WRKC59H'>KnowBe4 Account Settings Configuration</h3>\n<p>Once you have completed the above steps, you can configure the connection from your KnowBe4 console to Google Workspace.</p>\n<ol>\n<li>Log in to your KnowBe4 console.</li>\n<li>Navigate to your <strong>Account Settings</strong> by clicking your username, then clicking <strong>Account Settings</strong> in the drop-down menu.</li>\n<li>Click <strong>User Management</strong> &gt; <strong>User Provisioning</strong>, and then toggle the <strong>Google</strong> button.</li>\n<li>Enter your information into the <strong>Google Workspace Customer ID</strong> and <strong>Google Workspace Admin Email Address</strong> fields. Instructions for locating your <strong>Google Workspace Customer ID</strong> can be found in the <a href='#h_01HZHK45DHHA6N5PA6GTGZ3D9H'>Configuring Your Google Workspace Connection</a> section above. <img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsGoogleWorkspaceConnection.png'>Once you have entered the information, click <strong>Save</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AccountSettingsConnectionSaved.png'>If your connection was successful, you will see a “Connection saved” message, as shown in the screenshot above. You can then click <strong>Configure Google Provisioning User Scoping</strong> to begin configuring the users that you would like to import into your KnowBe4 console. For further instructions, see step 1 in the next section.</li>\n</ol>\n<h2 id='h_01HZHZZWHMY11VV5549DXYP53X'>Configure Google Provisioning</h2>\n<p>Now that you have successfully connected your KnowBe4 console to Google Workspace, you can begin provisioning your users. If you have not yet established the Google Workspace connection, see the <a href='#h_01HZHK45DHHA6N5PA6GTGZ3D9H'>Configuring Your Google Workspace Connection</a> section above.</p>\n<p>Prior to running your first sync, we strongly recommend keeping your KnowBe4 console in <strong>Test Mode</strong> in order to verify that you are happy with the results of your sync. <strong>Test Mode</strong> enables you to see the users who would be included in your sync before they are added to your KnowBe4 console. This will allow you to make any necessary adjustments to your configuration prior to any users actually being provisioned. For further information about placing your console into <strong>Test Mode</strong>, see the <strong>User Provisioning</strong> section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/12731036715411.html'>KnowBe4 Console Account Settings: User Management</a> article.</p>\n<h3 id='h_01HZJ02EHKNNRH30CDYHCYAF4D'>User Scoping</h3>\n<p>To begin configuring your <strong>User Scoping</strong>, follow the steps below:</p>\n<ol>\n<li>After logging in to your KnowBe4 console, navigate to <strong>Users</strong> &gt; <strong>Provisioning</strong>.</li>\n<li>In the top-right corner, click the <strong>Configure Google Provisioning</strong> button.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ClickConfigureGoogleProvisioningAnnotated.png'>\n</li>\n</ol>\n<p>Before continuing, you’ll need to determine how you would like to sync your users into your KnowBe4 console. You’ll have the option to sync by domain and group membership, OU scoping, or a combination of both methods. We generally recommend that customers start by adding a domain and then configuring users and groups for syncing. This method is the only method that allows you to sync group membership information into your KnowBe4 console.</p>\n<p>If you would like to sync users by adding a domain and configuring groups for syncing, proceed to the <a href='#h_01J5BH8XZJB67NTA9SAWEA66F8'>Syncing By Domain and Group Membership</a> section below. If you would like to use OU scoping to sync your users, navigate to the <a href='#h_01J5BQJ99NWT8H8T4RERBGNA9K'>Syncing By OU Scoping</a> section.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> Both methods can be used simultaneously to sync users.</div>\n</div>\n<h3 id='h_01J5BH8XZJB67NTA9SAWEA66F8'>Syncing By Domain and Group Membership</h3>\n<p>You can use this method if you would like to sync groups of users or individual users. You can choose to include or exclude groups or users, as well as sync group membership information about your users into your KnowBe4 console.</p>\n<ol>\n<li>Click the <strong>+Add Domain</strong> button.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/EmptyStateText_OUScopingToggle_Annotated.png'>This will allow you to select a domain from which to import your users. In order to import a user into your KnowBe4 console, you will need to select the Google domain in which they currently reside. The list of currently available domains will appear in the drop-down menu. Once you have selected a domain, click <strong>Save</strong>.<br>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note</strong>: The domain must be an Allowed Domain on your account. For further information regarding adding an Allowed Domain, see our Add and Verify Domains article.</div>\n</div>\n<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/AddDomain.png'>\n</li>\n<li>You will now see the domain included in the <strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>User Scoping</strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'> section. Click the arrow next to the domain name to expand the drop-down menu.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/UserScoping_OUScopingToggle.png'></span><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Here, you’ll see options for configuring the users and groups you want to include in the sync. You also have the option to exclude groups and users from syncing. Excluding a group or user will take precedence over including them. For example, if you include a group for syncing but exclude a specific user who resides in that group, all users in the group will be provisioned except for that specific user.</span>\n<ol>\n<li>\n<strong>Manage Groups</strong>: This button allows you to select groups from your Google Workspace environment. You can specify which groups you would like to include for syncing, and you can also choose to exclude specific groups from the sync. This option may be useful if there are nested groups that you would like to exclude from a larger group. A nested group is a Google group that is a member of another group, and it will be included by default during the sync unless it is manually excluded.\n<p>Group names must be unique in order to sync into your KnowBe4 console, even if they are located in different domains.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> You will need to type the name of the group that you would like to include or exclude in order to select them from the drop-down menus. You must type at least two characters of the group name in order for it to appear in the menu.</div>\n</div>\n<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageGroups.png'>When you have finished configuring your included and excluded groups, click <strong>Save</strong>. </li>\n<li>\n<strong>Manage Users</strong>: This button allows you to select users from your Google Workspace environment. You can specify which users you would like to include for syncing, and you can also choose to exclude specific users from the sync. The <strong>Sync All Users in this Domain</strong> check box will allow you to provision all users who are associated with the domain. Users that have been excluded from syncing will not be provisioned when this check box is selected.\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong> You will need to type the email address of the user that you would like to include or exclude in order to select them from the drop-down menus. You must type at least five characters of the user’s email in order for it to appear in the menu.</div>\n</div>\n<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/ManageUsers.png'>When you have finished configuring your included and excluded users, click <strong>Save</strong>.</li>\n</ol>\n</li>\n<li> Once you have configured your groups and users, click <strong>Save Configuration</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/SaveConfiguration.png'>\n</li>\n<li>The button will change to <strong>Sync Now</strong>. If you will not need to configure OU scoping or <strong>Field Mapping</strong> in addition to your user and group settings, you can click this button to begin syncing your users from Google Workspace. If you would like to also configure OU scoping or <strong>Field Mapping</strong> in addition to your group membership configuration, continue to the sections below.</li>\n</ol>\n<h3 id='h_01J5BQJ99NWT8H8T4RERBGNA9K'>Syncing By OU Scoping</h3>\n<p>If you would like to configure GUP to sync users using OUs, click the <strong>Enable OU Scoping</strong> toggle switch. This will give you the ability to specify OUs from your Google Workspace environment for inclusion in your sync. You can use this method in addition to configuring users and groups for syncing, or you can use the OU scoping method on its own.</p>\n<p>OU scoping supports nesting when searching for users. For example, if you are including an OU for syncing, GUP will include all users who are part of that OU, as well as any users contained within OUs that are nested under it. If you sync users using only OU scoping, group membership information will not be synced to your KnowBe4 console. If you would like to sync group membership information from Google Workspace, you will need to specify user and group information as outlined in the <a href='#h_01J5BH8XZJB67NTA9SAWEA66F8'>Syncing By Domain and Group Membership</a> section above.</p>\n<p>To configure OU scoping for your users, follow the steps below:</p>\n<ol>\n<li>Click the <strong>Enable OU Scoping</strong> toggle switch.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/Enable_OU_Scoping_Toggle.png'>\n</li>\n<li>This will enable menus for <strong>Including</strong> or <strong>Excluding</strong> OUs. You can select the OUs that you would like to include or exclude in your sync.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/Including_Excluding_OUs.png'>\n</li>\n<li>Once you have configured the OUs for syncing, click <strong>Save Configuration</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/OU_Scoping_Save_Configuration.png'>\n</li>\n<li>When you are satisfied with your configuration choices, click <strong>Sync Now</strong> to run your sync.</li>\n</ol>\n<p>Alternatively, if you would like to configure field mapping for your users prior to running your first sync, see the <strong>Field Mapping</strong> section below before continuing with syncing.</p>\n<h3 id='h_01HZJ2PE28YARFT1YWNAR5S8W9'>Field Mapping</h3>\n<p>The GUP sync supports syncing standard Google user attributes into your KSAT console. Configuring the <strong>Field Mapping</strong> section for your users is optional. By default, the GUP sync will include and map the following Google attributes to their corresponding KSAT attributes:</p>\n<table style='width: 455px;'>\n<caption>Google User Provisioning Default Attributes</caption>\n<thead>\n<tr>\n<th style='width: 247.453px;' scope='col'>Google Directory Attribute</th>\n<th style='width: 200.547px;' scope='col'>KSAT Attribute</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style='width: 239.453px;'>givenName</td>\n<td style='width: 192.547px;'>First Name</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>familyName</td>\n<td style='width: 192.547px;'>Last Name</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>workPhone</td>\n<td style='width: 192.547px;'>Phone Number</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>externalID</td>\n<td style='width: 192.547px;'>Employee Number</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>orgTitle</td>\n<td style='width: 192.547px;'>Job Title</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>orgName</td>\n<td style='width: 192.547px;'>Organization</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>orgDepartment</td>\n<td style='width: 192.547px;'>Department</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Mobile Phone Number</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Location</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Division</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Custom Field 1</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Custom Field 2</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Custom Field 3</td>\n</tr>\n<tr>\n<td style='width: 239.453px;'>None</td>\n<td style='width: 192.547px;'>Custom Field 4</td>\n</tr>\n</tbody>\n</table>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>Certain values such as the <strong>Manager Email</strong> and <strong>Manager Name</strong> field will sync by default if populated in your Google Workspace tenant.</div>\n</div>\n<p>If you would like to make adjustments to the default attributes that are included in the sync, follow the steps below:</p>\n<ol>\n<li>Navigate to the <strong>Configure Google Provisioning</strong> page, as shown in steps 1 and 2 in the <a href='#h_01HZJ02EHKNNRH30CDYHCYAF4D'>User Scoping</a> section above.</li>\n<li>In the <strong>Field Mapping</strong> section, click the drop-down arrow next to <strong>Mapping Rules</strong>.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingDropdown.png'>\n</li>\n<li>This action will expand the <strong>Field Mapping</strong> section.<img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExpanded.png'>\n<ol>\n<li>\n<strong>Google Directory Attribute</strong>: This column includes your users’ data and attributes as they appear in your Google Workspace environment. You can click the drop-down arrow next to the name of a <strong>Google Directory Attribute</strong> to open the drop-down menu that contains additional attributes for selection. The attribute that you select on the left side of the screen will be mapped to the adjacent <strong>KSAT Attribute</strong> on the right side. At this time, primary attribute types are the only attributes that are supported for syncing.</li>\n<li>\n<strong>KSAT Attribute</strong>: This column includes your users’ attributes as they will appear in their User Information subtab in your KnowBe4 console. Selections that are made in the <strong>Google Directory Attribute</strong> column will be mapped to these attributes.\n<p>For example, in the screenshot below, the “workPhone” attribute from Google Workspace will be mapped to the <strong>Phone Number</strong> attribute in your KnowBe4 console.<img style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;' src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExample1.png'></p>\n<p><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>You can choose to map any available </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Google Directory Attribute</strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'> to the </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>KSAT Attribute</strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'> of your choice by changing the </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Google Directory Attribute</strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'> in the drop-down menu, as shown in the example below.</span><img style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;' src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/FieldMappingExample2.png'></p>\n</li>\n</ol>\n</li>\n<li>\n<span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Once you have made your </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Field Mapping </strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>selections, click the </span><strong style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>Save Configuration </strong><span style='font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Helvetica, Arial, sans-serif;'>button at the top-right corner of the page.<br></span><img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/SaveConfiguration.png'>\n</li>\n<li>The button will change to <strong>Sync Now</strong>. You can click this button to run your sync, as shown in step 6 of the <a href='#h_01HZJ02EHKNNRH30CDYHCYAF4D'>User Scoping</a> section above.\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note: </strong>Once you are satisfied with the results of your GUP test mode syncs you will need to disable <strong>Test Mode</strong> in your <strong>Account Settings</strong> in order for your Google users to begin syncing to your KnowBe4 console.</div>\n</div>\n</li>\n</ol>\n<h2 id='h_01HZJCK5HWSKN524ZXRMM9NQY7'>Troubleshooting</h2>\n<p>In this section, you will find error messages related to GUP, along with potential causes.</p>\n<table style='height: 755px;' width='700'>\n<caption>GUP Error Messages</caption>\n<thead>\n<tr>\n<th style='width: 162.617px;' scope='col'>Error Message</th>\n<th style='width: 530.383px;' scope='col'>Cause</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style='width: 154.617px;'>Google Admin email connection is no longer valid.</td>\n<td style='width: 522.383px;'>\n<p>This error message can have several causes:</p>\n<ul>\n<li>The Google super-admin email address that was used to configure the Google Workspace connection has been archived in your Google Workspace tenant.</li>\n<li>The Google super-admin email address that was used to configure the Google Workspace connection no longer has super-admin permissions.</li>\n<li>One or more of the scopes that were used to configure the Google Workspace connection have been removed.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style='width: 154.617px;'>Google domain connection is no longer valid.</td>\n<td style='width: 522.383px;'>This error message occurs when the domain used in the provisioning configuration no longer exists in your Google Workspace tenant.</td>\n</tr>\n<tr>\n<td style='width: 154.617px;'>Invalid admin email.</td>\n<td style='width: 522.383px;'>This error message occurs when entering your Google super-admin email address in your KnowBe4 <strong>Account Settings</strong>. This message means that the email address formatting is incorrect.</td>\n</tr>\n<tr>\n<td style='width: 154.617px;'>Sync error.</td>\n<td style='width: 522.383px;'>\n<p>The <strong>Credentials</strong> tab will show if there’s an error in your sync. If no errors are present, the <strong>Domains</strong>, <strong>Credentials</strong>, and <strong>OU</strong> sync subtabs will be hidden.</p>\n<p><img src='https://helpimg.s3.amazonaws.com/Google_User_Provisioning/UserProvisioningSyncReports.png'></p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>If you have any questions or experience any issues with your configuration, submit a ticket at <a href='https://support.knowbe4.com/hc/en-us/requests/new'>https://support.knowbe4.com/hc/en-us/requests/new</a>.</p>",
    "user_segment_ids": []
  }
}