{
  "article": {
    "id": 29871208001683,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/29871208001683.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/29871208001683.html",
    "author_id": 397832506533,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 2,
    "vote_count": 6,
    "section_id": 29871158269715,
    "created_at": "2024-05-30T19:11:33Z",
    "updated_at": "2025-03-11T18:09:21Z",
    "name": "BreachSim Guide",
    "title": "BreachSim Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T18:09:21Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "Lead Generator",
      "answerbot"
    ],
    "body": "<p>BreachSim is a data exfiltration simulator. Once installed, it attempts to send test files to KnowBe4’s remote servers using techniques similar to an actual malware attack. If the tool exfiltrates the files, it indicates that a similar malware attack on your computer could also be successful.</p>\n<p>By default, BreachSim will attempt to exfiltrate the test files across the following protocols and ports:</p>\n<ul>\n<li>HTTP:80</li>\n<li>HTTPS:443</li>\n<li>ICMP</li>\n<li>DNS:53</li>\n</ul>\n<p>Once the exfiltration test has been completed, you’ll be able to see the files that were successfully exfiltrated along with any files that were blocked by your security software. Your BreachSim results can help identify potential vulnerabilities in your existing security setup.</p>\n<p>Read the sections below to learn how to install and launch BreachSim and view your results.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong> For accurate results, we recommend installing BreachSim on a computer that uses the same programs and security software as your users’ computers.</div>\n</div>\n<h2 id='h_01J2HGVJG2M31HTM8EG193CW1F'>Prerequisites</h2>\n<p>To install and launch BreachSim, you will need to meet the requirements listed below:</p>\n<ul>\n<li>64-bit Microsoft Windows 10 or later</li>\n<li>Windows Server 2016 or later</li>\n</ul>\n<h2 id='h_01J2HGDX6W756RPBHPB270P003'>Installing BreachSim</h2>\n<p>Once you’ve verified that your computer meets the requirements in the <a href='#h_01J2HGVJG2M31HTM8EG193CW1F'>Prerequisites</a> section above, you are ready to install BreachSim.</p>\n<p>To install BreachSim, follow the steps below:</p>\n<ol>\n<li>Navigate to our <a href='https://www.knowbe4.com/free-tools/breach-simulator'>BreachSim page</a>. Complete the sign-up form and click <strong>Sign Up</strong>.</li>\n<li>On the following page, click <strong>Get Started</strong> to download the BreachSim installation file.</li>\n<li>You’ll be sent an email containing your BreachSim license key. Check your email to retrieve the license key, which you’ll need to use during the setup process.</li>\n</ol>\n<h2 id='h_01J2HH80E1WJV8MGZ8FA3RC6P4'>Launching BreachSim</h2>\n<p>To launch BreachSim, follow the steps below:</p>\n<ol>\n<li>Open the <strong>BreachSimSetup.exe</strong> installation file.</li>\n<li>When asked if you would like to allow the app to make changes to your device, click <strong>Yes</strong>.<img src='https://helpimg.s3.amazonaws.com/BreachSim/AllowBreachSim.png'>\n</li>\n<li>Next, you’ll need to acknowledge the license agreement by selecting the check box and clicking <strong>Install</strong>.<img src='https://helpimg.s3.amazonaws.com/BreachSim/BreachSimAcceptTOS.png'>\n</li>\n<li>BreachSim will begin installing. Once the installation is complete, you’ll be prompted to enter the license key that you received by email in Step 2 of the <a href='#h_01J2HGDX6W756RPBHPB270P003'>Installing BreachSim</a> section above.<img src='https://helpimg.s3.amazonaws.com/BreachSim/BreachSimLicense.png'>\n</li>\n<li>In the <strong>Welcome to KnowBe4 BreachSim</strong> window, click the <strong>Start Test</strong> button. When you click this button, BreachSim will attempt to exfiltrate data from your machine using various ports, protocols, and file types.<img src='https://helpimg.s3.amazonaws.com/BreachSim/BreachSimHomescreen.png'>\n</li>\n<li>You can view the test’s exfiltration progress in the <strong>KnowBe4 BreachSim</strong> window.<img src='https://helpimg.s3.amazonaws.com/BreachSim/BreachSimExfiltrationInProgress.png'>\n</li>\n<li>Once the exfiltration test is completed, your results will be displayed in the <strong>KnowBe4 BreachSim</strong> window. <img src='https://helpimg.s3.amazonaws.com/BreachSim/BreachSimResults.png'>To learn more about your results, see the list below.</li>\n<ul>\n<li style='list-style-type: none;'>\n<ul>\n<li>\n<strong>File name</strong>: This column shows the name and file type of the test file.</li>\n<li>\n<strong>Exfiltration Status</strong>: This column shows the status of the exfiltration process. This column will display either the In Progress, Exfiltrated, or Not Exfiltrated status.</li>\n<li>\n<strong>Protocol</strong>: This column shows the protocol that was used during the exfiltration test.</li>\n<li>\n<strong>Duration (sec)</strong>: This column shows the amount of time spent (in seconds) during the exfiltration testing of this file.</li>\n<li>\n<strong>MD5 File Hash</strong>: This column displays the encrypted hash of the test file as it is calculated on KnowBe4’s servers after the file was successfully exfiltrated.</li>\n<li>\n<strong>File Size (bytes)</strong>: This column shows the size of the test file that was exfiltrated. If the file was successfully received, the file size is recalculated on KnowBe4’s servers so that you can verify that the file sizes are equivalent.</li>\n<li>\n<strong>Remote URL</strong>: This column displays the URL where the test files are temporarily saved on our servers. This column will only appear if you have selected the check box to temporarily save a copy of your test files on KnowBe4’s servers. For more information on this setting, see the Customization section below.</li>\n</ul>\n</li>\n</ul>\n<li>You have the option to export your results to an Excel file or a PDF file by clicking <strong>Export to Excel</strong> or <strong>Export to PDF</strong>. Additionally, you can click <strong>Open Source Folder</strong> to display the folder where the test files are stored. You can optionally add more files into this folder for testing, as shown in our Customization section below.</li>\n</ol>\n<h2 id='h_01J2HJY7QA3VK2RKXNY652EYT5'>Customization</h2>\n<p>If you would like to customize the protocols used during the exfiltration test, click the <strong>gear</strong> icon in the top-right corner of the BreachSim home screen.<img src='https://helpimg.s3.amazonaws.com/BreachSim/BreachSimGearIcon.png'>On the <strong>Settings</strong> screen, you can select the check boxes next to the protocols you would like to test. Additionally, you can select the check box to <strong>Temporarily store test files and provide download links</strong> if you would like to save a temporary version of the file on our test servers so that you can download them later. Click <strong>Apply Changes</strong> to save your selections.</p>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong> If you have selected the option to temporarily save test files on KnowBe4’s servers, any custom test files you provide will be saved for up to one hour.</div>\n</div>\n<p><img src='https://helpimg.s3.amazonaws.com/BreachSim/BreachSimSettings.png'></p>\n<p>During installation, BreachSim creates a folder with eight default test files. If you would like to add more test files for exfiltration, you can click <strong>Open Source Folder</strong> on the BreachSim home screen. This action will open the folder where you can add additional test files. You can also manually add files to the test folder by using the following file path:</p>\n<p>C:\\Program Files\\KnowBe4\\BreachSim\\TestFiles</p>\n<div class='callout_content'>You can add up to 10 test files totaling up to 10 MB in size. BreachSim is compatible with most file formats except for scripts, executable files, binary files, or other file types that can be used to run programs.</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/29871208001683-BreachSim-Guide",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/BreachSim/AllowBreachSim.png",
        "alt": "This image displays a standard Microsoft Windows **User Account Control (UAC)** prompt dialog box.\n\n**Title Bar:** \"User Account Control\"\n\n**Primary Instruction (Header):** \"Do you want to allow this app to make changes to your device?\"\n\n**Application Details:**\n*   **Icon:** A small icon depicting an installation folder or CD/DVD case.\n*   **Application Name:** KnowBe4 BreachSim\n*   **Verified Publisher:** Temasoft SRL\n*   **File Origin:** Hard drive on this computer\n\n**Interactive Elements:**\n*   A blue hyperlink labeled \"Show more details.\"\n*   Two action buttons located at the bottom of the dialog:\n    *   **Yes** (Standard gray button)\n    *   **No** (Highlighted gray button with a dark border, indicating it is the default or currently selected action).\n\n**Context:** The prompt is seeking user confirmation to grant administrative privileges to the application \"KnowBe4 BreachSim\" (published by Temasoft SRL) before it executes.",
        "position": 1,
        "context": "s below:\n\nOpen the BreachSimSetup.exe installation file.\nWhen asked if you would like to allow the a"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/BreachSim/BreachSimAcceptTOS.png",
        "alt": "This image displays the **KnowBe4 BreachSim Setup** wizard at the License Agreement stage.\n\n**UI Elements and Layout:**\n\n*   **Window Title:** \"KnowBe4 BreachSim Setup\".\n*   **Left Panel (Dark Gray):** Features the \"BreachSim\" product logo—an orange shield centered within a target reticle—and the text \"BreachSim\" in white.\n*   **Main Content Area:**\n    *   **Header Text:** \"Please read the KnowBe4 BreachSim License Agreement\".\n    *   **License Text Box (Scrollable):** Contains abbreviated text referencing external policies:\n        *   \"For our full Terms of Service and Privacy Policy, see:\"\n        *   `https://www.knowbe4.com/Terms`\n        *   `https://www.knowbe4.com/Product-Privacy-Notice`\n        *   \"© 2016-2024 KnowBe4, Inc.\"\n    *   **Acceptance Checkbox:** A checkbox labeled \"**I accept the terms in the License Agreement**\" is checked (enabled).\n*   **Navigation Buttons (Bottom):**\n    *   **Print:** Active button (prints the license text).\n    *   **Back:** Disabled/grayed-out button (suggests this is the first or mandatory screen).\n    *   **Install:** Active button (proceeds with installation, enabled by the checked acceptance box).\n    *   **Cancel:** Active button (exits setup).\n\n**Context:**\n\nThe screen prompts the user to review and accept the software's license agreement, necessary before proceeding to the installation step. The acceptance checkbox is checked, making the \"Install\" button actionable.",
        "position": 2,
        "context": "src='https://helpimg.s3.amazonaws.com/BreachSim/AllowBreachSim.png'>\n\nNext, you’ll need to acknowled"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/BreachSim/BreachSimLicense.png",
        "alt": "This image displays a **KnowBe4 BreachSim Setup Wizard** window, running on a Windows OS environment, interrupted by a modal license key request dialog.\n\n**Main Setup Window Context:**\n*   **Title Bar:** \"KnowBe4 BreachSim Setup\"\n*   **Main Header:** \"Installing KnowBe4 BreachSim\"\n*   **Instruction Text:** \"Please wait while the Setup Wizard installs KnowBe4 BreachSim.\"\n*   **Status Indicator:** The text \"Status:\" is visible next to a horizontal progress bar, which is partially rendered in green, suggesting an installation is underway but paused.\n*   **Navigation Buttons (Bottom):** Three buttons are present: \"Back\" (disabled/grayed out), \"Next\" (disabled/grayed out), and \"Cancel\" (active).\n\n**Modal Dialog Overlay (License Key Request):**\n*   **Title Bar:** \"KnowBe4 BreachSim\"\n*   **Prompt Text:** \"Please enter your license key.\"\n*   **Input Field:** A large, empty text field is provided directly below the prompt for license key entry, indicated by a blinking cursor.\n*   **Action Buttons:** Two primary buttons are present for user interaction: \"OK\" (default style) and \"Cancel\" (default style). This dialog must be addressed before the installation proceeds.",
        "position": 3,
        "context": "Step 2 of the Installing BreachSim section above"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/BreachSim/BreachSimHomescreen.png",
        "alt": "This image displays the main interface of the **KnowBe4 BreachSim** application, a data exfiltration simulator.\n\n**Header Section:**\n\n*   The application title bar shows \"KnowBe4 BreachSim\".\n*   Top-right controls include standard window management icons (Minimize, Maximize/Restore, Close) alongside application-specific icons for **Settings (gear)** and **Help (question mark)**.\n*   The center of the screen features the **KnowBe4 logo** and tagline: \"Human error. Conquered.\"\n*   A welcoming headline reads: \"Welcome to KnowBe4 BreachSim\".\n\n**Introductory Text and Instructions:**\n\n*   A detailed description explains the tool's purpose: \"BreachSim is a data exfiltration simulator. It is designed to test the effectiveness of your organization's security against data leakage. The KnowBe4 BreachSim tool tests multiple data exfiltration techniques to show if your organization is protected from data theft.\"\n*   Further information guidance is provided: \"For more information, see our **BreachSim Product Manual**.\" (The manual name is presented as a clickable hyperlink).\n*   The primary instruction for use is: \"Click the button below to begin the data exfiltration test. The MD5 hash and file size will be computed on our servers and displayed for each file if the data is successfully exfiltrated.\"\n\n**Action and Output Area:**\n\n*   A prominent orange button labeled **\"Start Test\"** initiates the simulation.\n*   Below the button, a data grid displays results. Above the grid, there is a **\"Search\"** text field.\n*   The grid columns, defining the test output, include: **File Name**, **Exfiltration Status**, **Protocol**, **Duration (sec)**, **MD5 File Hash**, **File Size (bytes)**, and **Remote URL**. The grid is currently empty.\n*   Above the grid's headers, utility links are provided for data management: **Open Source Folder**, **Export to Excel**, and **Export to PDF**.\n\n**Footer Section:**\n\n*   The bottom-left corner displays the copyright notice: \"Copyright © KnowBe4, Inc. 2024\".\n*   The bottom-right corner shows the application version number: \"v. 1.0.0.187\".",
        "position": 4,
        "context": "When you click this button, BreachSim will attempt to exfiltrate data from your machine using variou"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/BreachSim/BreachSimExfiltrationInProgress.png",
        "alt": "This screen capture displays the main interface of the **KnowBe4 BreachSim** desktop application, a data exfiltration simulator. The application is shown in an active testing state, overlaid by a progress modal.\n\n**General UI and Context:**\n\n*   **Branding:** The central heading features the KnowBe4 logo and the tagline, \"Human error. Conquered.\" The main heading is \"Welcome to KnowBe4 BreachSim.\"\n*   **Introductory Text:** Explains the tool's purpose: \"BreachSim is a data exfiltration simulator. It is designed to test the effectiveness of your organization's security against data leakage...\"\n*   **Documentation:** A clickable hyperlink directs the user to the \"**BreachSim Product Manual**.\"\n*   **Window Controls:** The title bar includes standard window controls (Minimize, Maximize, Close) along with application-specific icons for **Settings** (gear) and **Help** (question mark).\n*   **Footer:** Displays copyright information: \"Copyright © KnowBe4, Inc. 2024\" and the application version number: \"v. 1.0.0.187.\"\n\n**Test Initiation Section:**\n\n*   **Instruction:** \"Click the button below to begin the data exfiltration test...\"\n*   **Primary Action Button:** A prominent orange button labeled \"**Start Test**.\"\n\n**Results and Data Grid Section:**\n\n*   **Utility Elements:** Above the primary data grid, a **Search** input box is present.\n*   **Export Links:** Three hyperlinked options are available for data manipulation: \"**Open Source Folder**,\" \"**Export to Excel**,\" and \"**Export to PDF**.\"\n*   **Data Grid Columns:** The results table is empty but defines the following columns: **File Name** (with a sort arrow), **Exfiltration Status**, **File Size (bytes)**, and **Remote URL**.\n\n**Active Modal Overlay (Exfiltration in Progress):**\n\n*   A centered modal dialog interrupts the workflow, indicating the active test status.\n*   **Modal Title:** **BreachSim**\n*   **Status Indicator:** A pulsing or spinning icon indicates activity.\n*   **Status Text:** \"Exfiltration in progress...\"",
        "position": 5,
        "context": "and file types.\n\nYou can view the test’s exfiltration progress in the KnowBe4 BreachSim window."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/BreachSim/BreachSimResults.png",
        "alt": "This image displays the main interface of the **KnowBe4 BreachSim** application, a data exfiltration simulator designed for security testing. The interface features a clean, professional layout organized into introductory, action, and results sections.\n\n**Application and Header Details:**\n*   The title bar shows the application name: \"KnowBe4 BreachSim.\"\n*   The top right corner includes standard window controls, plus dedicated icons for Settings (gear) and Help (question mark).\n*   A large welcome banner reads, \"Welcome to KnowBe4 BreachSim,\" accompanied by the KnowBe4 logo and tagline (\"Human error. Conquered.\").\n\n**Context and Action Area:**\n*   **Context:** Text explains the tool's purpose: testing organizational security against data leakage using multiple data exfiltration techniques. A hyperlink directs users to the \"BreachSim Product Manual.\"\n*   **Instruction:** Users are prompted to \"Click the button below to begin the data exfiltration test.\" The text confirms that MD5 hashes and file sizes will be computed remotely and displayed upon successful exfiltration.\n*   **CTA:** A prominent orange button is labeled \"**Start Test**.\"\n\n**Results and Data Grid:**\nThe lower portion of the screen displays the results of a completed simulation in a detailed, sortable table:\n*   **Search/Export Controls:** A \"Search\" input field is provided above the table. To the right, utility links allow users to \"**Open Source Folder**,\" \"**Export to Excel**,\" and \"**Export to PDF**.\"\n*   **Data Columns:** The grid includes seven primary columns:\n    1.  File Name\n    2.  Exfiltration Status (All visible entries show \"Exfiltrated\")\n    3.  Protocol (Examples shown include HTTP, HTTPS, ICMP, and DNS)\n    4.  Duration (sec)\n    5.  MD5 File Hash\n    6.  File Size (bytes)\n    7.  Remote URL (URLs point to `https://breachsim.knowbe4.com/api/...`)\n*   **Sample Data:** Results show three sample files (a .jpg, a .docx, and a .png) were tested using four distinct exfiltration protocols, demonstrating successful exfiltration across all tested methods.\n\n**Footer Information:**\nThe bottom of the window displays the copyright information: \"Copyright © KnowBe4, Inc. 2024,\" and the software version number: \"v. 1.0.0.187.\"",
        "position": 6,
        "context": "mg.s3.amazonaws.com/BreachSim/BreachSimExfiltrationInProgress.png'>\n\nOnce the exfiltration test is c"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/BreachSim/BreachSimGearIcon.png",
        "alt": "This image displays the primary graphical user interface (GUI) for the **KnowBe4 BreachSim** application, a data exfiltration simulator.\n\n**Header and Navigation:**\n*   The application title bar identifies the program as \"KnowBe4 BreachSim.\"\n*   The upper right corner contains service icons: a **Gear icon** (for Configuration/Settings) and a **Question Mark icon** (for Help/Documentation).\n\n**Context and Instruction:**\n*   The central area features the KnowBe4 logo and the headline, \"Welcome to KnowBe4 BreachSim.\"\n*   Introductory text defines the tool's function: \"BreachSim is a data exfiltration simulator. It is designed to test the effectiveness of your organization’s security against data leakage...\"\n*   A hyperlink is provided to the \"BreachSim Product Manual.\"\n*   Users are instructed to click the primary control to start the test, noting that \"MD5 hash and file size will be computed on our servers\" upon successful exfiltration.\n\n**Primary Control and Data Entry/Search:**\n*   The main action is initiated via a large, orange **\"Start Test\"** button.\n*   Below the action button is a search field labeled \"Search.\"\n\n**Data Grid and Reporting:**\n*   An empty data grid is present for displaying test results. Column headers define the output fields: **File Name**, **Exfiltration Status**, **Protocol**, **Duration (sec)**, **MD5 File Hash**, **File Size (bytes)**, and **Remote URL**.\n*   Three export and management links are positioned above the grid: **Open Source Folder**, **Export to Excel**, and **Export to PDF**.\n\n**Footer:**\n*   The footer displays the copyright notice: \"Copyright © KnowBe4, Inc. 2024\" and the application version number: \"v. 1.0.0.187.\"",
        "position": 7,
        "context": "52EYT5'>Customization\nIf you would like to customize the protocols used during the exfiltration test"
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/BreachSim/BreachSimSettings.png",
        "alt": "This is a screenshot of the **KnowBe4 BreachSim** application's settings dialog, specifically displaying the **General** configuration tab.\n\n## UI Elements and Configuration Details:\n\n**Header and Navigation:**\n*   The window title is **KnowBe4 BreachSim**.\n*   A single active tab, labeled **General**, is displayed.\n\n**Settings Context:**\n*   The primary heading is **Settings**.\n*   Descriptive text explains the purpose: \"You can select the protocols you'd like to test, as well as allow your test files to be temporarily stored and downloaded from our servers. This will allow you to verify that the exfiltrated files match the test files that you provided.\"\n*   A major configuration option, **Temporarily store test files and provide download links**, is enabled (checked).\n\n**Protocol Configuration List:**\nA table structure is used with columns for **Protocol** and **Ports**. All listed protocols are currently enabled (checked). The corresponding port fields are text inputs:\n\n| Protocol | Status | Ports (Value) |\n| :--- | :--- | :--- |\n| **HTTP** | Enabled (Checked) | 80 |\n| **HTTPS** | Enabled (Checked) | 443 |\n| **ICMP** | Enabled (Checked) | (Empty text field) |\n| **DNS** | Enabled (Checked) | 53 |\n\n**Action Button:**\n*   The configuration window includes a single action button at the bottom right: **Apply Changes**.",
        "position": 8,
        "context": "ntent'>\nNote: If you have selected the option to temporarily save test files on KnowBe4’s servers, a"
      }
    ],
    "metadata": {
      "category": "Free Tools",
      "section": "BreachSim",
      "topics": [
        "breachsim",
        "free",
        "tools"
      ],
      "image_count": 8
    }
  }
}