{
  "article": {
    "id": 35666044386323,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/35666044386323.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/35666044386323.html",
    "author_id": 31899104510995,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 2,
    "vote_count": 2,
    "section_id": 35656808418195,
    "created_at": "2024-11-21T23:17:01Z",
    "updated_at": "2025-09-09T09:12:42Z",
    "name": "Defend - Banner Overview",
    "title": "Defend - Banner Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-09T09:12:42Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot_defend"
    ],
    "body": "<p>Incoming emails from outside your organization will have colored banners inserted using Defend. These banners inform you of how the email has been classified after Defend analyzes the content and detects potential threats. The color of the banner corresponds to the associated level of threat.</p>\n<p>The banners are interactive tools designed to enhance your security awareness in real time. Each banner interaction serves as a mini-training session, providing specific information about why an email might pose a threat and helping you understand potential risks over time. An email can receive multiple banners simultaneously, either from the same category or different categories, depending on the threats detected.</p>\n<p>There are four banner categories displayed below:</p>\n<ul class='js-toggles'>\n<li title='Productivity Banners'>Productivity banners are gray and are applied to emails that Defend classifies as graymail or spam. These emails are usually non-malicious bulk emails such as newsletters, announcements, or advertisements. The purpose of these banners is to act as a visual cue for easy categorization and improved productivity.\n<p><br>An example of a productivity banner is displayed in the screenshot below: <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Gray+banner.png' width='256' height='61'></p>\n</li>\n<li title='Benign Banners'>Benign banners are blue and are informative alerts that are not associated with detected threats. These banners are designed to provide additional context about an email and typically do not require any specific action. Benign banners may notify you about various email characteristics, including:\n<ul>\n<li>New sender: The email is from someone who has never emailed you before.</li>\n<li>Financial content: The email contains financial information or references.</li>\n<li>External source: The email originates from outside your organization.</li>\n<li>Sensitive information: The email includes content that may be considered sensitive.</li>\n</ul>\n<p><br>These banners increase awareness and help you make informed decisions about handling an email. While no immediate action is usually necessary, the information provided can be valuable for assessing the email's relevance and importance.</p>\nAn example of a benign banner is displayed in the screenshot below:<img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/External+Sender.png' width='346' height='61'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Blue+banner.png' width='390' height='61'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Sensitive+Information.png' width='630' height='61'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Financial+Banner.png' width='695' height='61'>\n</li>\n<li title='Suspicious Banners'>Suspicious banners are amber and are applied to emails that contain suspicious elements, potentially indicating phishing or impersonation attempts. These banners serve as a cautionary alert, prompting you to exercise increased vigilance. When you encounter an amber banner, follow the tips below:\n<ol>\n<li>Exercise caution before taking any action on the email.</li>\n<li>Carefully inspect the sender's email address to verify its authenticity.</li>\n<li>Be wary of clicking on any links within the email.</li>\n<li>Avoid downloading or opening attachments unless you are certain of their safety.</li>\n<li>If you need to reply, double-check that you're sending to the legitimate sender, not a similar-looking fraudulent address.</li>\n<li>When in doubt, verify the email's legitimacy through an alternative communication channel, such as a phone call or in-person confirmation.</li>\n<li>Report suspicious emails to your IT or security team for further investigation.</li>\n</ol>\n<br>An example of a suspicious banner is displayed in the screenshot below:<img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Amber+banner.png' width='672' height='61'><img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Impersonation+Banner.png' width='775' height='61'>\n</li>\n<li title='Dangerous Banners'>\n<p>Dangerous banners are red and are applied to emails exhibiting strong indicators of phishing or other malicious intent. These banners represent the highest level of threat warning. When you encounter a dangerous banner, follow the tips below:</p>\n<ol>\n<li>Do not click on any links or download any attachments within the email.</li>\n<li>Refrain from replying to the email or engaging with the sender.</li>\n<li>Do not forward the email to others, as this may spread the potential threat.</li>\n<li>Report the email immediately to your IT security team.</li>\n<li>Delete the email from your inbox after reporting it unless instructed otherwise by your IT team.</li>\n</ol>\nRemember, dangerous banners indicate a severe risk, and it is important to treat these emails as genuine threats. Your organization's security protocols should always be followed when dealing with dangerous-bannered emails.<br>\n<p><br>An example of a dangerous banner is displayed in the screenshot below:<img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Banners/Red+banner.png' width='791' height='61'></p>\n</li>\n</ul>\n<h2 id='h_01K4PVE1QM6T8JP04F75X5Z2WF'>Email Summary Page</h2>\n<p>All banners applied by Defend can be clicked on. This feature allows you to learn more about what was detected in the email. If you think an email has been categorized incorrectly, you can report it by selecting a reporting button at the bottom of the email summary page. For more information about what the email summary page displays, see the list below:</p>\n<p><img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Email+Summary+Page.png'></p>\n<ol type='a'>\n<li>\n<strong>What we found</strong>: This section provides an overview of what Defend found and the recommended action you should take. In this example, Defend identifies strong signs of phishing and recommends following your organization's policy for reporting phishing emails.</li>\n<li>\n<strong>Primary Reason</strong>: This area describes the primary reason the email raised concerns and triggered the banners.</li>\n<li>\n<strong>Threat dial</strong>: The colored threat dial displays the risk rating that Defend has assigned to this email. In this example, Defend has assigned the highest risk classification.</li>\n<li>\n<strong>Email information</strong>: This section displays advanced email information, including details such as the sender address, sender location, email security protocols, and your previous interaction history with the sender.</li>\n<li>\n<strong>Report this email</strong>: The reporting section allows you to report the email if you believe it has been classified incorrectly by Defend.</li>\n</ol>\n<h2 id='h_01K4PVV15VFNMMBT230QZMB1NM'>Link Protection</h2>\n<p>Defend includes link protection that helps safeguard you from malicious links in emails, even when they appear legitimate. This protection works by checking links in your emails in two ways:</p>\n<ol>\n<li>When the email arrives</li>\n<li>When you click on links</li>\n</ol>\n<p>This dual approach helps protect you against links that may seem safe at first but later direct you to harmful websites. Attackers sometimes change where a link goes after an email is delivered, and Defend helps catch this trick by verifying links in real-time when you click them.</p>\n<p>When Defend detects a potentially harmful link that you've clicked, you'll see a warning screen instead of being taken directly to the website. This protective screen shows you the actual destination web address, indicates the specific signs of phishing that were detected, and highlights when the sender is being impersonated. This information helps you make an informed decision about whether it's safe to proceed to the website, protecting you from phishing attempts and other malicious sites that could compromise your security.</p>\n<p><img src='https://helpimg.s3.us-east-1.amazonaws.com/Defend/Admin+Console/Defend+Link+Scanning.png'></p>",
    "user_segment_ids": []
  }
}