{
  "article": {
    "id": 35666055286931,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/35666055286931.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/35666055286931.html",
    "author_id": 31899104510995,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 11,
    "vote_sum": 0,
    "vote_count": 2,
    "section_id": 35656844330899,
    "created_at": "2024-11-21T23:16:56Z",
    "updated_at": "2025-11-11T14:57:26Z",
    "name": "Defend - Link Scanning Overview",
    "title": "Defend - Link Scanning Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-11T14:57:25Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot_defend"
    ],
    "body": "<p>By default, Defend rewrites all URLs and scan links at the time of receipt and click. URL rewriting allows Defend to perform the checks again at the time of click to protect against time-based attacks. Where Threat Actors will not activate a site for a period of time to make it seem to the security tools as \"clean\".</p>\n<h2 id='h_01JEPGAC5FC0K2KKK953F7JA1Z'>Scanning a URL</h2>\n<p>Defend scans a URL when an email is first received and every time the link is clicked.</p>\n<p>Defend initially looks at five key things to determine if a particular link is safe:</p>\n<ol>\n<li>Linguistical analysis of the link, such as character obfuscation, mismatched TLD, and Punycode).</li>\n<li>Existing block list entries indicating known bad domains.</li>\n<li>Age of the domain or address and \"Whois\" lookups.</li>\n<li>The number of hops and locality of each hop taken to reach the end destination.</li>\n<li>Check the context of the URL for signs of organization impersonation, such as the use of protected language and entities like DHL, Amazon, and PayPal.</li>\n</ol>\n<p>When a user clicks on a URL, Defend's link scanning will recheck it against blocklists and any redirects to protect against real-time attacks.</p>\n<h2 id='h_01JEPGAC5FFR5HMAANH3JGJN2M'>Link Rewriting versus Link Scanning​</h2>\n<p>URL Rewriting and Link Scanning are two distinct features in Defend that work together to enhance email security. The subsections below explain how they function.</p>\n<h3 id='h_01JYPBPFPRGGV4BF7AC6938CC4'>Link Rewriting </h3>\n<p>Link rewriting functions as follows:</p>\n<ul>\n<li>When enabled, this feature modifies links in emails by redirecting them through the Defend portal.</li>\n<li>For example, a link to google.com would be rewritten to appear as “links.[region].defend.egress.com/”.</li>\n<li>This rewriting allows for additional security checks when the link is clicked.</li>\n<li>Disabling link rewriting will mean that Defend does not modify the links in question. For example, a link to google.com will continue to link to google.com.</li>\n</ul>\n<h3 id='h_01JYPBR8E391REWH9M6E29BANG'>Link Scanning </h3>\n<p>Link scanning functions as follows:</p>\n<ul>\n<li>Disabling or enabling URL rewriting controls what checks we do when a user clicks on a rewritten link.</li>\n<li>If link rewriting is enabled, the link is “followed” to find potential link redirects, and then scans them. This feature allows Defend to do a full suite of checks, including:\n<ul>\n<li>Linguistic and contextual analysis to identify potential risks</li>\n<li>Scanning for threats utilizing techniques such as character obfuscation, suspicious domains, domain age, and potential impersonation</li>\n</ul>\n</li>\n<li>If link rewriting is disabled, the link is not “followed” or accessed by Defend but will still be scanned for potential threats, which include heuristic and blocklist checks.</li>\n</ul>\n<h3 id='h_01JYPBTP50N5TYH1DT4E6C36EW'>Exceptions and Configurations </h3>\n<p>Admins can configure exceptions for specific domains to:</p>\n<ul>\n<li>Disable link rewriting.\n<ul>\n<li>When link rewriting is disabled for a domain, the original URL remains unchanged in the email.</li>\n</ul>\n</li>\n<li>Disable link scanning\n<ul>\n<li>When link scanning is disabled, Defend will not perform its usual security checks on that link.</li>\n</ul>\n</li>\n</ul>\n<h3 id='h_01JYPBZ8N3F13ZP5VKFQY3XGP3'>One-Time Use Links </h3>\n<p>Our link scanning breaks one-time use links, such as activation emails to register for an account. In some cases, users are given an error message stating that the link has already been used when Defend has rewritten a link. We recommend admins add a \"URL Rewriting exception\" entry for domains or services that use one-time links, which can be done in the Defend console.</p>\n<h2 id='h_01JEPGAC5FJ8JBWQTS2MAKR3DT'>What does Defend look for in attachments?</h2>\n<p>Defend does not rewrite the links inside attachments. We look at many components of the attachment to ascertain if the file is malicious. Defend will complete the following actions:</p>\n<ul>\n<li>Scan the attachments for links.</li>\n<li>Scan where those links go and if they're held on any blocklists.</li>\n<li>Scan the link text for any coercive language.</li>\n<li>Scan the URL itself for malicious information.</li>\n<li>Scan the file name and file type for sensitive information or social engineering. </li>\n<li>Look for obfuscation of the file extension.</li>\n<li>Scan for JavaScript.</li>\n<li>Compare with known malware hashes.</li>\n<li>Use Bit-defender for AV scanning.</li>\n</ul>\n<h2 id='h_01JEPGAC5F1EC1ZDBB1Y1B2BYR'>URL Rewriting Exception List</h2>\n<p>An exception list entry can be created to avoid links being scanned or rewritten for a particular domain. This feature can also be activated to work on older URLs. If a link is deemed harmful and the continue button is disabled, admins can add the links to the rewriting exceptions. When the user then tries to navigate to the link, Defend will send them to the end destination.</p>\n<h2 id='h_01JEPGAC5G2YG2KFREE1YDYPCK'>URL Decoding</h2>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/egress/url_decoding.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/egress/url_decoding.png' alt='URL Decode subtab'> </a></p>\n<p>A rewritten link can be decoded in the Defend console. Admins can then click on the decoded URL to navigate to the referenced site. The ability to rewrite URLs must be enabled in the console.</p>\n<h2 id='h_01JEPGAC5G3VQE80MWKHEZ0REM'>Rewritten Link Expiry</h2>\n<p>Any link Defend rewrites will continue to work indefinitely, even if the organization is no longer a Defend customer.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/35666055286931-Defend-Link-Scanning-Overview",
    "images": [
      {
        "url": "https://helpimg.s3.us-east-1.amazonaws.com/egress/url_decoding.png",
        "alt": "This image displays a specific utility panel, set against a dark blue background, focused on manipulating security-rewritten URLs.\n\n**UI Elements and Context:**\n\n1.  **Tab Navigation:** Two tabs are visible at the top: **URL Rewriting** (inactive state) and **URL Decode** (active state, indicated by an underline and highlight). The current view is the URL Decode utility.\n2.  **Function Title & Help:** The function is titled \"Remove the url rewriter from links,\" followed immediately by a gray information or help icon (question mark `?`).\n3.  **Input Field:** A large, dark input field is present, framed by a continuous white border. The placeholder text within the field is **\"Decode Rewritten URL Links\"**.\n4.  **Instructional Text:** Below the input field is instructional guidance specifying input criteria: **\"Please enter a valid Egress Defend rewritten link, it will start with links.us1.defend.egress.com\"**. This confirms the utility is designed for decoding links generated by the Egress Defend platform.",
        "position": 1,
        "context": "nd them to the end destination.\nURL Decoding"
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "defend",
        "overview",
        "scanning"
      ],
      "image_count": 1
    }
  }
}