{
  "article": {
    "id": 360037392654,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360037392654.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360037392654.html",
    "author_id": 10164786027,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 23,
    "vote_count": 35,
    "section_id": 26429831617683,
    "created_at": "2019-10-24T17:39:25Z",
    "updated_at": "2025-08-20T18:42:49Z",
    "name": "Security Awareness Proficiency Assessment (SAPA) Overview",
    "title": "Security Awareness Proficiency Assessment (SAPA) Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-05-09T20:24:17Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "training",
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>You can assign a Security Awareness Proficiency Assessment to your users to assess their security awareness knowledge. The assessment results provide you with an overview of your organization's strengths and weaknesses. You can use this information to create targeted phishing and training campaigns that fit your users' needs.</p>\n<p>We developed the assessment questions from four research studies. To ensure the quality of these questions, we've performed both external and internal validations. For more information about how we developed these questions, please see our <a href='https://www.knowbe4.com/hubfs/KnowBe4-Security-Awareness-Proficiency-Assessment-SAPA-Technical-Document_EN-US.pdf' target='_self'>KnowBe4 Security Awareness Proficiency Assessment</a> technical document.</p>\n<p>In this article, you'll learn how to use SAPA and review your organization's assessment results. For specific information about how to use organizational assessments effectively, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360024195754.html' target='_self'>How to Use Organizational Assessments</a> article.</p>\n<h2 id='h_01H911336ZCKR8G5FFC3Q9BMD0'>Best Practices for Implementation</h2>\n<p>We recommend that you assign your first assessment after your first phishing test, but before your first training campaign. You can use the scores from your first assessment as a baseline to see how your organization's strengths and weaknesses change over time.</p>\n<p>After your first assessment, you should continue to assess your users at least once per year, but no more than twice per year. We recommend that you give your users time to learn from their new training assignments before you assign another assessment.</p>\n<h2 id='h_01H911336ZFW8D28KFE1RH792R'>Assigning Organizational Assessments</h2>\n<p>To assign an organizational assessment, add the assessment through the ModStore by searching for assessments and clicking the <strong>+ Add to Library</strong> button. Then, you can create a training campaign with the assessment as the selected content by following the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 console and navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>Click <strong>+ Create Training Campaign</strong>.</li>\n<li>From the <strong>Content</strong> drop-down menu, select the assessment you'd like to assign. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Training/Campaigns/CreateTrainingCampaign/EN/CampaignAssessments.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Training/Campaigns/CreateTrainingCampaign/EN/CampaignAssessments.png' alt=' '></a>\n</li>\n<li>Fill out all required fields for the campaign. For more information on how to create a new campaign, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/204948207.html' target='_self'>Creating and Managing Training Campaigns</a> article.</li>\n<li>Click <strong>Create Campaign</strong>.</li>\n</ol>\n<h2 id='h_01H911336ZPN89ECNCV7RQDTWT'>Completing Assessments in the Learner Experience</h2>\n<p>To complete an assessment, your users will log in to their Learner Experience (LX) and click the <strong>Training</strong> tab. Then, they'll locate the assessment that they've been assigned and click <strong>Start Assessment</strong>. The assessment will open, and your user will be given the choice to <strong>Start Assessment</strong> now or <strong>Come Back Later</strong>.</p>\n<p>As explained to the user in the opening text, the assessment takes approximately ten minutes to complete and must be completed in one session. They won't be able to stop in the middle of the assessment and return to it later. Any unanswered questions will be marked as incorrect.</p>\n<p>If the user does not have time to take the assessment immediately, we recommend they click <strong>Come Back Later</strong> when they have time to take the full assessment.</p>\n<p>Each assessment includes three questions per knowledge area for a total of 21 questions. These questions are randomly selected from a larger pool of questions. We randomly select questions from the pool of questions to ensure that each user’s assessment is unique and that users cannot easily share answers with their coworkers. Sharing answers can result in inaccurate reporting. Users must answer all questions to complete the assessment.</p>\n<h2 id='h_01H911336Z6SR6Y4MK6HHGNSXP'>Monitoring Your SAPA Campaign</h2>\n<p>After you assign an assessment to your users, you can view your users' progress. To view your users' progress, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 account and navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>On the <strong>Campaigns</strong> subtab, click the name of the campaign where the assessment was assigned.</li>\n<li>On the <strong>Campaign Overview</strong> page, locate the assessment.</li>\n<li>Click<strong> User Progress</strong> under the assessment title.</li>\n</ol>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Training/Campaigns/CampaignOverview/EN/UserProgressButton.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Training/Campaigns/CampaignOverview/EN/UserProgressButton.png' alt=' ' width='659' height='257'></a></div>\n<p>On the <strong>User Progress</strong> page, you can see information about your users' progress including their assessment scores, their assessment status, and how much time they've spent on the assessment. See below for more information about the <strong>User Progress</strong> page:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Training/Campaigns/CampaignOverview/UserProgress/Users/EN/UserProgressTableAnnotated.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Training/Campaigns/CampaignOverview/UserProgress/Users/EN/UserProgressTableAnnotated.png' alt=' '></a></div>\n<ol role='list' type='a'>\n<li>\n<strong>Generate CSV</strong>: Click this button to download a CSV file of the information displayed in the table below.</li>\n<li>\n<strong>Score</strong>: Displays the user's assessment score.</li>\n<li>\n<strong>Actions</strong>: Click this drop-down menu to select the action you'd like to perform on the selected user or users. Options include:\n<ul role='list'>\n<li>\n<strong>Send Notification</strong>: Send a manual notification to the user about their assessment.</li>\n<li>\n<strong>Mark as Completed</strong>: Manually mark the user's assessment as complete.</li>\n<li>\n<strong>Reset Progress</strong>: Allow the user to restart the assessment.</li>\n<li>\n<strong>Remove Users</strong>: Remove the user from the assessment.</li>\n</ul>\n</li>\n</ol>\n<p>For more information about managing your users' progress, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360053311074.html' target='_self'>User Training Progress</a> article.</p>\n<h2 id='h_01H911336ZS9MBXJ9SACQRVNFZ'>SAPA Results</h2>\n<p>Once your users have completed their assessment, you can review the results of the assessment campaign. On the<strong> Assessment Results</strong> page, you can view your organization’s average assessment score for all users. To view your organization's results, follow the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 account and navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>On the <strong>Campaigns</strong> subtab, click the name of the campaign in which the assessment was assigned.</li>\n<li>On the <strong>Campaign Overview</strong> page, find the assessment and click <strong>Assessment Results</strong> under the assessment's title. </li>\n</ol>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Training/Campaigns/CampaignOverview/AssessmentResults/EN/SAPAAssessmentResults.gif'><img src='https://helpimg.s3.amazonaws.com/KMSAT/Training/Campaigns/CampaignOverview/AssessmentResults/EN/SAPAAssessmentResults.gif' alt=' ' width='644' height='415'></a></div>\n<p>The first graph on this page shows the average assessment score for all your users. The second graph shows the average assessment score for each knowledge area.</p>\n<p>The seven knowledge areas are:</p>\n<ul role='list'>\n<li>Email Security</li>\n<li>Incident Reporting</li>\n<li>Internet Use</li>\n<li>Mobile Devices</li>\n<li>Passwords &amp; Authentication</li>\n<li>Human Firewall</li>\n<li>Social Media</li>\n</ul>\n<p>You can find an explanation of each knowledge area below the graphs.</p>\n<p>Clicking on the name of a knowledge area directs you to related content in the ModStore. You can then use these content suggestions to assign content to your users to improve their understanding of specific knowledge areas. For example, if your users have a low score in the Mobile Devices knowledge area, they may need more training content about how to stay safe on mobile devices.</p>\n<p>If you have a Platinum or Diamond subscription, you can use Smart Groups to automatically enroll users into training campaigns based on their assessment results. For more information about automated campaigns, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/8355412499859.html'>Smart Groups: SAPA Automation Guide</a>.</p>\n<div class='callout-success'>\n<div class='callout__content'>\n<strong>Tip:</strong>On your Dashboard, review the <strong>Security Awareness Proficiency Assessment (SAPA)</strong> tile to compare your organization's SAPA score to others in your industry. See our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360000309628.html'>Industry Benchmarking</a> article for more information.</div>\n</div>\n<h2 id='h_01H911336Z4NBY30YJEK27PZNH'>SAPA Reports</h2>\n<div class='callout-info'>\n<div class='callout__content'>\n<strong>Note:</strong>The Security Awareness Proficiency Assessment Report will only include users who have scored on the assessment.</div>\n</div>\n<p>In addition to the <strong>Assessment Results</strong> summary available on the <strong>Campaign Overview</strong> page, more SAPA reports are available under the <strong>Reports</strong> tab.</p>\n<p>To find your <strong>Security Awareness Proficiency Assessment Reports</strong>, log in to your KnowBe4 account and navigate to <strong>Reports </strong>&gt;<strong> Security Awareness Proficiency Assessment Reports</strong>.</p>\n<p>For more information about the types of reports available, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360007952894.html' target='_self'>Reporting Guide</a>.</p>",
    "user_segment_ids": []
  }
}