{
  "article": {
    "id": 360009588974,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360009588974.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360009588974.html",
    "author_id": 403968826754,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 8,
    "vote_sum": 9,
    "vote_count": 13,
    "section_id": 26412507656851,
    "created_at": "2018-09-24T20:39:14Z",
    "updated_at": "2025-11-19T19:01:05Z",
    "name": "User Profile Guide",
    "title": "User Profile Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-07T21:04:07Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "out of office",
      "user profile",
      "user details",
      "edit user settings",
      "User Management",
      "localized",
      "answerbot",
      "answerbot_kmsat",
      "answerbot_ksat",
      "ooo"
    ],
    "body": "<p>All users added to your KSAT console have a personal profile that displays their performance on Phishing Security Tests, their training completion, and their Risk Score and Phish-prone Percentage. User information, such as email address and job title, is also found here and can be manually modified as needed.</p>\n<p>After you add users to the console, they will be displayed in the user list. To view this list, navigate to the <strong>Users</strong> subtab of the <strong>Users</strong> tab. Select any user's name or email address to access their profile.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/UserProfileTabs.png'><img src='https://helpimg.s3.amazonaws.com/user_profile/UserProfileTabs.png' alt=' '></a></p>\n<h2 id='iv_h_01GSB513TA8Y47Y85VF03MY8SW'>User Dashboard Subtab</h2>\n<p>After selecting a user in the user list, you’ll be taken to their <strong>User Dashboard</strong>. This subtab shows the user’s phishing results, training assignments, and Risk Score. You’ll also see the <a href='#h_01HZS78SM6PB2YP6T1THMJWVDG'>Impersonate User</a> button, which allows you to view the user’s KnowBe4 experience and take action on behalf of a user. For more information, see the <a href='#h_01HZS78SM6PB2YP6T1THMJWVDG'>Impersonate User</a> section of this article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/UserDashboardAnnotated.png'> <img src='https://helpimg.s3.amazonaws.com/user_profile/UserDashboardAnnotated.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>Name and Groups:</strong> This area shows the user’s name and the number of groups they are in. To see a list of these groups, select <strong>Groups</strong>.</li>\n<li>\n<strong>Phishing Results</strong>: This section shows the user’s Phish-prone Percentage, how many simulated phishing emails they received, how many phishing tests they failed, and how many simulated phishing emails they reported.\n<ul>\n<li>Select the <strong>Phish Failures by Type</strong> button to view a graph of this user's different types of failures.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/DashPhishByType.png'><img src='https://helpimg.s3.amazonaws.com/user_profile/DashPhishByType.png' alt=' '></a></p>\n</li>\n</ul>\n</li>\n<li>\n<strong>Training Assignments</strong>: This section shows the user’s training completion percentage, as well as the number of assignments currently in progress, completed, and not started.\n<ul>\n<li>Select the <strong>View Training Details</strong> button to view a graph of the user's current campaigns. This graph can be filtered by status.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/DashTrainingGraph.png'><img src='https://helpimg.s3.amazonaws.com/user_profile/DashTrainingGraph.png' alt=' '></a></p>\n</li>\n</ul>\n</li>\n<li>\n<strong>Impersonate User</strong>: This button allows you to view the user’s KnowBe4 session. When the button is selected, you will be able to see what that user sees when they log in to their KnowBe4 console or <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360051484394.html'>Learner Dashboard</a>. Additionally, you can perform actions as a user while impersonating them. For further information, see the <a href='#h_01HZS78SM6PB2YP6T1THMJWVDG'>Impersonate User</a> section of this article.</li>\n<li>\n<strong>Risk</strong>: This section shows the user’s Risk Score, risk factors, and a line chart of the user’s risk history. For more information on user risks, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/30048977242259.html'>SmartRisk Agent™ and Risk Score Guide.</a>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/DashRiskHistory.png'><img src='https://helpimg.s3.amazonaws.com/user_profile/DashRiskHistory.png' alt=' '></a></p>\n</li>\n</ol>\n<h2 id='iv_01H8F001XA5DJWSGKCKMYSKNC3'>Phishing Subtab</h2>\n<p>The <strong>Phishing</strong> subtab displays the user’s <strong>Personal Phish-prone Percentage</strong>. Their Phish-prone Percentage is based on the number of phishing test failures divided by the number of phishing emails delivered. See the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115010178267.html'>Failures and Phish-prone Percentages</a> article for more information on the Phish-prone Percentage.</p>\n<p>This subtab also lists each simulated phishing email that the user has interacted with. This includes interactions such as selecting a link, opening an attachment, and reporting the email through the Phish Alert Button (PAB). Hover over a checkmark to view the timestamp for that interaction.</p>\n<p>Select<strong> Download CSV</strong> to generate a CSV file with this phishing information, which you can download from the <strong>Download Center</strong> subtab. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4403282239891.html'>Download Center Overview</a>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/user_profile/phishing_subtab.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/user_profile/phishing_subtab.png' alt=''> </a></p>\n<p>To view the phishing template the user interacted with, select the<strong> eye</strong> icon to preview the email.</p>\n<h2 id='iv_01H8F001XAH41NGZEMQS8DF6HH'>Training Subtab</h2>\n<p>The <strong>Training</strong> subtab displays all campaigns that the user has been enrolled in. For each campaign, you’ll see the date the user was enrolled, whether they have started their training, how long they have worked on their training, the amount of time left before the due date, their score, the completion status, and any available AIDA Knowledge Refreshers.</p>\n<p>Select <strong>Download CSV</strong> to create a CSV file with this training information.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/user_profile/training_subtab.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/user_profile/training_subtab.png' alt=''> </a></p>\n<p>If you would like to download a completion certificate for any of these training assignments, select the <strong>trophy</strong> icon in the completion status of that assignment.</p>\n<h2 id='iv_01H8F001XA03EMED3JD2PX5A5Y'>User Timeline Subtab</h2>\n<p>The <strong>User Timeline</strong> subtab shows a complete history of the user's phishing tests, related emails, and the training console itself.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/UserTimeline.png'><img src='https://helpimg.s3.amazonaws.com/user_profile/UserTimeline.png' alt=' '></a></p>\n<p>Use the drop-down menus at the top of the page to filter your results by event type, source, or date range.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/user_profile/user_timeline_dashboard.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/user_profile/user_timeline_dashboard.png' alt=''> </a></p>\n<p>In the <strong>Event Type</strong> drop-down menu, you can select one or more event types, such as <strong>Passed Phishing</strong> or <strong>Started Course</strong>. To remove a selected event type from the filter, select the <strong>X</strong> icon next to the name of the event type.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/EventRemoveFilter.gif'><img src='https://helpimg.s3.amazonaws.com/user_profile/EventRemoveFilter.gif' alt=' '></a></p>\n<p>In the <strong>Source</strong> drop-down menu, you can select one or more source types, such as SecurityCoach.</p>\n<p>In the <strong>Date Range</strong> drop-down menu, you can select from common time frames such as <strong>Last Quarter</strong> or <strong>Year to Date</strong>. You can also select <strong>Custom Date Range </strong>to choose a specific start and end date.</p>\n<p>The user timeline records all of the events below.</p>\n<table>\n<caption>KSAT Event Types</caption>\n<thead>\n<tr>\n<th scope='col'>KSAT Event Types</th>\n<th scope='col'>Event</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>General user events</td>\n<td>\n<ul>\n<li>The user was created.</li>\n<li>The user logged in.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Phishing test-related events</td>\n<td>\n<ul>\n<li>The user received an email.</li>\n<li>The user bounced an email.</li>\n<li>The user clicked a link.\n<ul>\n<li>Only the first click will be recorded here.</li>\n</ul>\n</li>\n<li>The user opened an attachment.</li>\n<li>The user entered data on a landing page.</li>\n<li>The user enabled a macro.</li>\n<li>The user replied to an email.</li>\n<li>The user passed a phishing test.</li>\n<li>The user reported an email using the PAB.</li>\n<li>The user reported an email without using the PAB.</li>\n<li>The user reported an email as spam.</li>\n<li>The user scanned a QR code.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Training-related events</td>\n<td>\n<ul>\n<li>The user was added to a training campaign.</li>\n<li>The user was removed from a training campaign.</li>\n<li>The user was enrolled in a course.</li>\n<li>The user started a course.</li>\n<li>The user completed a course.</li>\n<li>The user was removed from a course.</li>\n<li>The user was enrolled in an assessment.</li>\n<li>The user started an assessment.</li>\n<li>The user completed an assessment.</li>\n<li>The user was removed from an assessment.</li>\n<li>The user was enrolled in a policy.</li>\n<li>The user started a policy.</li>\n<li>The user completed a policy.</li>\n<li>The user was removed from a policy.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Other</td>\n<td>\n<ul>\n<li>A click or other failure type was removed from phishing test results.</li>\n<li>The user's email was found in a security breach. This information is considered during SmartRisk Agent risk calculations.</li>\n</ul>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Data breach involvement events may display with dates that occurred before your user was added to the console. This is because the User Timeline uses the date that a data breach was reported. For example, a user who was added to the console in 2018 may have been found to be part of a data breach that was reported in 2012.</div>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<table>\n<caption>Custom Event Types</caption>\n<thead>\n<tr>\n<th scope='col'>Custom Event Types</th>\n<th scope='col'>Event</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>User-created events</td>\n<td>\n<p>A list of all custom event types created through the <strong>User Event API</strong> will populate under the <strong>User Events</strong> section of the <strong>Event Type</strong> drop-down menu.</p>\n<p>See our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360024863474.html'>User Event API Overview</a> article for more information.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<table>\n<caption>Platinum and Diamond-Level Subscription Event Types</caption>\n<thead>\n<tr>\n<th scope='col'>Platinum and Diamond-Level Subscription Event Types</th>\n<th scope='col'>Event</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Admin events</td>\n<td>\n<ul>\n<li>The admin created a callback phishing campaign.</li>\n<li>The admin entered data into a callback phishing campaign.</li>\n<li>The admin completed an admin action.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>PasswordIQ events</td>\n<td>\n<ul>\n<li>The user was detected for a vulnerability.</li>\n<li>The user was not detected for a vulnerability.</li>\n<li>The user's detection status changed.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>SecurityCoach events</td>\n<td>\n<ul>\n<li>User behavior was detected.</li>\n<li>A real-time coaching notification was sent.</li>\n<li>A real-time coaching notification failed to send and resulted in an error.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<th scope='col'>SecurityCoach Event Types</th>\n<th scope='col'>Event</th>\n</tr>\n<tr>\n<td>Admin events</td>\n<td>\n<ul>\n<li>Risky activity was detected.</li>\n<li>A real-time coaching SecurityTip was sent.</li>\n<li>A real-time coaching SecurityTip failed to send and resulted in an error.</li>\n</ul>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>SecurityTip previews will display the target user’s language that was used during delivery.</div>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id='iv_01H8F001XAZGGJWHQ8TS30Y5VF'>User Information Subtab</h2>\n<p>The <strong>User Information</strong> subtab lists user attributes, such as <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360060622513.html'>user languages</a>, job title, user account details, and number of sign-ins. From this page, you can also enable features such as multi-factor authentication (MFA).</p>\n<h3 id='iv_01H8F001XACF14BZA26B898NNE'>Modifying User Information</h3>\n<p>There are three ways you can modify a user's information. These methods are listed below, with the most recommended method listed first:</p>\n<ol>\n<li>Automatically sync your user list through user provisioning.\n<ul>\n<li>As a best practice, we recommend modifying your user details with your identity provider when you are using user provisioning and allowing the next sync to update your user's information.</li>\n<li>When using user provisioning to sync user information, most settings will be uneditable through the other methods.</li>\n<li>See our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/228373888.html'>Active Directory Integration (ADI) Configuration Guide</a> or our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360052380374.html'>SCIM Configuration Guide</a> for more information.</li>\n</ul>\n</li>\n<li>Import a prepared CSV file.\n<ul>\n<li>Navigate to <strong>Users</strong> &gt; <strong>Import Users</strong>. Then, select the <strong>CSV Import</strong> button. Once you select this button, you can import a CSV file containing your users' email addresses along with any additional information you'd like to include about your users.</li>\n<li>Be sure to follow the formatting steps in our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/204873347.html'>Import Users with a CSV File</a> article when adding user fields and details to your CSV file.</li>\n</ul>\n</li>\n<li>Manually edit a user’s profile from the <strong>User Information</strong> subtab.</li>\n</ol>\n<h3 id='iv_01H8F001XAG1D465NJA4DZZE5E'>User Account Details</h3>\n<p>For more information about the different areas and fields in the <strong>User Information</strong> subtab, see the annotated screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/useraccountdetails_specifics2.png'><img src='https://helpimg.s3.amazonaws.com/user_profile/useraccountdetails_specifics2.png' alt=' '></a></p>\n<ol>\n<li>\n<strong>User Account Details</strong>: This section shows basic account history and login data, such as how many times the user has signed in, when their confirmation email was sent, and the last IP address they used to sign in.</li>\n<li>\n<strong>User Type:</strong> You can use this option to select the type of user this profile represents. For more information about importing users, see the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/204873347.html'>Import Users with a CSV File</a> article.</li>\n<li>\n<strong>Phishing Language:</strong> You can use this option to send Phishing Security Tests in a specific language.</li>\n<li>\n<strong>Training Language:</strong> You can use this option to change the Learner Experience’s user language.</li>\n<li>\n<strong>Out of Office End:</strong> You can use this option to pause training notifications for a user while they are out of the office until the selected date. Notifications sent to managers and admins about this user will also be paused. This field has been renamed from <strong>Out of Office Until</strong>.</li>\n<li>\n<strong>PhishER:</strong> You have the option to enable or disable a user’s access to PhishER. By default, PhishER will be disabled for users and enabled for admins. As an admin, you have the option to disable and re-enable your own PhishER access. If PhishER is enabled, a <strong>Go to PhishER</strong> drop-down menu option will be available by selecting your email address in the top-right corner of the KSAT console.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishER/phishER_acctSettings.png'><img src='https://helpimg.s3.amazonaws.com/PhishER/phishER_acctSettings.png' alt=' '></a></p>\n</li>\n<li>\n<p><strong>Multi-factor Authentication</strong>: You have the option to enable multi-factor authentication (MFA) for your users as an added layer of security. We strongly recommend that you enable MFA for any users with elevated security roles or admin access. For more information about MFA, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/225681448.html'>Enable Two-Factor or Multi-Factor Authentication on Your Account</a> article.</p>\n</li>\n</ol>\n<h3 id='h_01HZS78SM6PB2YP6T1THMJWVDG'>Impersonate User</h3>\n<p>The <strong>Impersonate User</strong> button allows you to view a user’s KnowBe4 experience. This feature is useful if you would like to see what that user sees when they log in to KnowBe4. This feature can be useful when configuring <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115015389767.html'>Security Role</a> permissions for a user or in other scenarios where you may need visibility into your users’ experience.</p>\n<p>You can also perform actions as a user while impersonating them. Any action taken while impersonating a user will be applied to their account. For example, if you impersonate a user and start their training, the training will show as <strong>In Progress</strong> for that user the next time they log in. If you complete their training, it will show as <strong>Completed</strong> for them the next time they log in to KnowBe4.</p>\n<p>This feature can only be used to impersonate users who have previously logged in to KnowBe4. Users who have admin privileges in your KSAT console cannot be impersonated. Additionally, any time a user is impersonated will show as an event in the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/23542330166163.html'>audit log</a>.</p>\n<ol>\n<li>After navigating to a user’s <strong>User Dashboard</strong> subtab, you’ll see the <strong>Impersonate User</strong> button in the top-right corner.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/ImpersonateUserButton.png'> <img src='https://helpimg.s3.amazonaws.com/user_profile/ImpersonateUserButton.png' alt=''> </a></p>\n</li>\n<li>Once the button is selected, you'll receive a confirmation prompt.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/ImpersonateAreYouSure.png'> <img src='https://helpimg.s3.amazonaws.com/user_profile/ImpersonateAreYouSure.png' alt=''> </a></p>\n</li>\n<li>Selecting <strong>Confirm</strong> will allow you to impersonate the user. While impersonating the user, you’ll have the ability to view what the user sees when they are logged in to KnowBe4, and you can also perform actions as that user. For example, when impersonating one of your users, you can view their Learner Dashboard and see the training they have been assigned.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/ImpersonateUserLoginExperience.png'> <img src='https://helpimg.s3.amazonaws.com/user_profile/ImpersonateUserLoginExperience.png' alt=''> </a></p>\n<p>Additionally, if you are configuring a <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115015389767.html'>Security Role</a> for a user, you can impersonate them to see what levels of access they have been given for their <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/204218028.html'>KnowBe4 Dashboard</a>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/UserImpersonateSecurityRole.png'> <img src='https://helpimg.s3.amazonaws.com/user_profile/UserImpersonateSecurityRole.png' alt=''> </a></p>\n</li>\n<li>When you have finished impersonating the user, select <strong>Click here</strong> in the top-right corner to return to your KSAT console.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/user_profile/ClickHereImpersonateButton.png'> <img src='https://helpimg.s3.amazonaws.com/user_profile/ClickHereImpersonateButton.png' alt=''> </a></p>\n</li>\n</ol>",
    "user_segment_ids": []
  }
}