{
  "article": {
    "id": 360038559574,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360038559574.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360038559574.html",
    "author_id": 1450288687,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 5,
    "vote_sum": 0,
    "vote_count": 4,
    "section_id": 26429650317203,
    "created_at": "2019-11-15T22:57:53Z",
    "updated_at": "2024-04-18T23:30:04Z",
    "name": "Template for After Your First Training Campaign",
    "title": "Template for After Your First Training Campaign",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-04-18T23:30:04Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p>Here is a sample email you can send to users after they complete training. We recommend that you modify it to fit your organization's culture and requirements.</p>\n\n<p>Hi all,</p>\n<p>Cybercrime is getting more serious by the month. Hackers are getting smarter about tricking people into clicking on fraudulent links or opening up malicious attachments in emails.</p>\n<p>It can happen to you personally on your own computer and email as well. As you know, our company has decided that it is very important that everyone gets comprehensive security awareness training, which you have recently completed. We need to defend our organization against cybercrime, and security is everyone’s job.</p>\n<p>Now that you have completed your initial training, we will continue to train you by regularly sending out simulated phishing tests so you can practice the skills you learned as part of your training. Be on the look out for these in your inbox and check each email for Social Engineering Red Flags.</p>\n<p>Remember to check all seven areas of the emails you receive:</p>\n<ol role='list'>\n<li>The “From:” line</li>\n<li>The “To:” line</li>\n<li>The “Date:” line</li>\n<li>The “Subject:” line</li>\n<li>Attachments</li>\n<li>Hyperlinks</li>\n<li>Content of the email</li>\n</ol>\n<p>You are the last line of defense to keep our organization safe! Thanks for your cooperation.</p>\n",
    "user_segment_ids": []
  }
}