{
  "article": {
    "id": 360014088973,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360014088973.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360014088973.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 4,
    "vote_sum": 91,
    "vote_count": 101,
    "section_id": 27889964583699,
    "created_at": "2018-12-14T22:41:35Z",
    "updated_at": "2025-11-25T18:20:04Z",
    "name": "PhishER Change Log",
    "title": "PhishER Change Log",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-11-25T18:20:04Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "release notes",
      "change log",
      "changelog",
      "phisher",
      "phish ER",
      "answerbot",
      "answerbot_phisher"
    ],
    "body": "<p>Use this article to stay up-to-date with changes to KnowBe4's PhishER platform.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>Changes to PhishER may include new, updated, deprecated, or removed features. KnowBe4 reserves the right to terminate access to, use of, and support of features that are included as part of the Subscription Services, which is common with SaaS services as they are constantly changing and improving. This allows us to adapt to the evolving cybersecurity industry so we can provide current, high-quality services.</div>\n</div>\n<p>See the table below for a list of updates, with the latest updates displayed at the top.</p>\n<div class='js-tabs'>\n<div title='2025 Changes'>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>November 2025</td>\n<td>\n<ul>\n<li>November 24, 2025 - We’re excited to announce the release of our new navigation menu, enhanced login page, and updated KnowBe4 logo! These updates will be rolled out by region, on the following schedule:<br>Nov 24, 2025: DE <br>Nov 25, 2025: UK <br>Nov 26, 2025: CA<br>For additional information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/46612807962771.html'>Login Page and Navigation Menu Overview</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2025</td>\n<td>\n<ul>\n<li>October 20, 2025 - We've released the YARA Rule Generator for PhishER Plus! This feature simplifies rule creation by automatically generating YARA rule syntax based on your description. For more information, visit the Creating Rules Using the YARA Rule Generator section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'>Create and Manage PhishER Rules</a> article. This feature will be gradually released to all PhishER Plus accounts.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 05, 2025</td>\n<td>\n<ul>\n<li>We've updated the <strong>Enable Hidden Quarantine Folder</strong> feature! Now, when a new PhishER account is created, the Hidden Quarantine Folder will be toggled on by default when PhishRIP is enabled. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 15, 2025</td>\n<td>\n<ul>\n<li>We've added a new PhishRIP feature for Microsoft 365: the <strong>Enable Hidden Quarantine Folder</strong> check box. When enabled, this feature automatically moves future quarantined messages to a hidden folder in Outlook, enhancing security by helping users avoid accessing potentially malicious content. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 28, 2025</td>\n<td>\n<ul>\n<li>We've released user communication via the Discussion Panel! This feature enables external communication between PhishER admins and users who report emails using the Phish Alert Button (PAB). From the <strong>Message Details</strong> page of your <strong>Inbox</strong>, you can now have conversations with users who report messages with the PAB. The <strong>Discussion</strong> subtab displays the full conversation and allows you to send an external message from the PhishER console when the user responds. For more information, see our <strong>Viewing the Actions and Discussion</strong> section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/13169303385619.html'>PhishER Inbox Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 7, 2025</td>\n<td>\n<ul>\n<li>We've launched the KnowBe4 Academy! Now, you can learn how to use and integrate KnowBe4's products successfully. The following modules are now available:\n<ul>\n<li>PhishER 101</li>\n<li>KSAT 101</li>\n<li>Free Tools 101</li>\n<li>KnowBe4 101</li>\n</ul>\n</li>\n<li>For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/37153516648851.html'>KnowBe4 Academy Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 3, 2025</td>\n<td>\n<ul>\n<li>We've added the ability to tag messages automatically based on the reporting email address! In the <strong>Reporting Emails</strong> subtab of your PhishER Settings, you can create a custom tag for each email address. When emails are reported to your PhishER Inbox, PhishER will automatically assign the tag for the specific email address. For more information, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/16567660822163.html'>PhishER Settings: Account</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 12, 2025</td>\n<td>\n<ul>\n<li>We've added the <strong>Specify Reporters</strong> option to the <strong>Actions Details</strong> page! This option allows you to set up an action that triggers when specific users report emails. For more information, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/13195730767635.html'>Create and Manage PhishER Actions</a> article.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2024 Changes'>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>December 19, 2024</td>\n<td>\n<ul>\n<li>We've added the <strong>PhishML Confidence</strong> option to the <strong>Actions Details</strong> page! This option allows you to set a threshold of PhishML confidence values that will trigger your action. For more information, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/13195730767635.html'>Create and Manage PhishER Actions</a> article. This feature will be gradually released to all accounts.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>December 10, 2024</td>\n<td>\n<ul>\n<li>We've released PhishML Insights for PhishER Plus! From the <strong>Message Details</strong> page of your <strong>Inbox</strong>, you can run PhishML Insights to learn more about PhishML's analysis of messages. This feature provides details about how PhishML determined if a message is clean, spam, or a threat. For more information, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/35149214884627.html'>PhishML Insights Guide</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 26, 2024</td>\n<td>\n<ul>\n<li>We've released an XM Cyber Security Control Monitoring (SCM) integration to the PhishER console. This integration provides you with insights into the configuration and activation of security controls. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/35803780239123.html'>Integrating XM Cyber's SCM with PhishER</a> article in our Knowledge Base.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>November 12, 2024</td>\n<td>\n<ul>\n<li>We've released Global PhishRIP for PhishER Plus! This feature uses crowd-sourced, verified information about PhishRIP queries to automatically find and remove email threats from inboxes associated with your Microsoft 365 or Google Workspace mail server.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 24, 2024</td>\n<td>\n<ul>\n<li>We've improved PhishML's ability to analyze and classify the language used in the content of reported emails. This improvement will be delivered to your PhishER console automatically.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 19, 2024</td>\n<td>\n<ul>\n<li>We've released the ability to delete users in your PhishER console! After you revoke a user's PhishER permissions from the <strong>Users</strong> subtab of your PhishER Settings, you can use the <strong>Delete User</strong> option in the <strong>Actions</strong> column to delete the user from the console.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 18, 2024</td>\n<td>\n<ul>\n<li>We've added a FortiSOAR integration to the PhishER console. This integration allows you to pull emails into PhishER to add and update tags, comments, and dispositions. For more information, see the <a href='https://docs.fortinet.com/document/fortisoar/1.0.1/knowbe4-phisher/943/knowbe4-phisher-v1-0-1' target='_blank' rel='noopener'>PhishER integration documentation </a>from FortiSOAR.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 10, 2024</td>\n<td>\n<ul>\n<li>We have released the <strong>Downloads</strong> subtab and <strong>Alerts</strong> for your PhishER console! Reports and large files that you generate in your console are now listed in the <strong>Downloads</strong> subtab of your PhishER Settings. When a newly generated file is ready to download, you will receive an alert from the <strong>Alert</strong> subtab of the user icon at the bottom of the navigation bar. For more information, read our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/16567660822163.html'>PhishER Settings: Account</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 12, 2024</td>\n<td>\n<ul>\n<li>We've added an Onyxia integration to the KnowBe4 console. This integration allows you to send information from PhishER to Onyxia to get strategic cybersecurity program recommendations. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/32669402365971.html'>Integrate Onxyia with Your PhishER Console</a> article</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2024</td>\n<td>\n<ul>\n<li>We've released Threat Intel for PhishER Plus! KnowBe4's Threat Intel integration is powered by Webroot BrightCloud Security Services. This integration allows PhishER to automatically scan and analyze URLs using Webroot's threat intelligence database. For more information, read our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/27765887530131.html'>Integrate Threat Intel with Your PhishER Platform</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2024</td>\n<td>\n<ul>\n<li>We've added the QR Code Decoder! This feature operates in the background of your platform to automatically scan for QR codes in reported emails. When the QR Code Decoder detects a QR code in the body of a message, it extracts the URL embedded in the QR code and assigns a tag to the message. For more information, read the QR Code Decoder Tags section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'>Create and Manage PhishER Rules</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2024</td>\n<td>\n<ul>\n<li>We've added the <strong>User Mailboxes Selection</strong> setting for PhishRIP queries! From the <strong>Mail Servers</strong> subtab of your PhishER <strong>Settings</strong>, you can update your mail server instances to create lists of email domains or regular expressions. PhishRIP queries will only search in the mailboxes of users who have a matching domain or regex string from your created lists. For more information, read our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/16569063307411.html'>PhishER Settings: Integrations</a> article.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2023 Changes'>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>November 2023</td>\n<td>\n<ul>\n<li>We've added new system rules! From the <strong>Rules</strong> tab in your platform, KnowBe4 now provides four additional system rules to help you manage messages in your <strong>Inbox</strong>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2023</td>\n<td>\n<ul>\n<li>We've added a CrowdStrike Falcon Sandbox integration to PhishER Plus! This integration allows you to send data to your CrowdStrike Falcon platform to safely analyze attachments and URLs from reported emails in a protected sandbox environment. For more information, read our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/18853966211219.html'>How to Integrate CrowdStrike with Your PhishER Platform</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2023</td>\n<td>\n<ul>\n<li>We've added system actions for new PhishER users! From the <strong>Actions</strong> tab in your platform, KnowBe4 now provides several actions to help you manage the messages in your <strong>Inbox</strong>. These actions can be enabled and used with minimal configuration, allowing you to start reviewing reported emails immediately.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2023</td>\n<td>\n<ul>\n<li>We have released PhishER Plus! This new subscription includes the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/15906868504211.html'>Global Blocklist</a> and <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/17305995205523.html'>Global PhishRIP</a> features. You can use these features to strengthen your organization's email filters and prevent active phishing attacks by combining crowd-sourced information with existing features in your platform. To learn more, see our <a href='https://www.knowbe4.com/products/phisher-plus'>PhishER Plus</a> product page.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2023</td>\n<td>\n<ul>\n<li>We've added the <strong>Audit Log</strong> feature for your <strong>PhishER Blocklist</strong>! From the <strong>Blocklist</strong> tab in your platform, you can click the <strong>Audit Log</strong> subtab to view information about when entries are created, deleted, and synced with mail servers. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/12913849104147.html'>How to Use the PhishER Blocklist</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2023</td>\n<td>\n<ul>\n<li>We've released the new <strong>PhishER Blocklist</strong> feature! The blocklist synchronizes with your Microsoft 365 mail server to automatically filter malicious and spam emails from your users' inboxes. From the <strong>Blocklist</strong> tab, you can create and manage a unique list of blocklist entries for your organization. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/12913849104147.html'>How to Use the PhishER Blocklist</a> article. We've also added a <strong>Mail Servers</strong> tab, which allows you to connect and manage your mail servers. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2022 Changes'>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>December 2022</td>\n<td>\n<ul>\n<li>We've added the option for reporting email addresses to only receive manually-reported emails. If you enable this option, PhishER will recognize emails with EML attachments as manually-reported emails. You can find the <strong>Forwarded Only</strong> setting in the <strong>Reporting Emails</strong> sub-tab of your PhishER <strong>Settings</strong>. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2022</td>\n<td>\n<ul>\n<li>We've added the new Resource Center feature to your platform. From the Resource Center, you can view a full list of product guides and release notes, search our Knowledge Base, and create support tickets. For more information, see the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/6272817218707.html'>Using the Resource Center</a> section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/6272817218707.html'>How to Use the Product Guide Feature</a> article.</li>\n<li>We've released the new product guide feature. Product guides walk you through specific features to help you get the most out of your platform. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/6272817218707.html'>How to Use the Product Guide Feature</a> article.</li>\n<li>We've added global variables to allow you to update multiple rules at once if the rules use the same strings. In the <strong>Rules</strong> section of your platform, you can create global variables from the <strong>Global Variables</strong> tab. You can use either the Basic Editor or Advanced Editor to create rules containing global variables. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013116053.html'>How to Write YARA Rules</a> article and <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>PhishER Product Manual</a>.</li>\n<li>You can now set a password to protect the files and attachments that you download from reported messages in PhishER. To set a password, enable the <strong>Password Protect Downloads</strong> setting in the <strong>Preferences</strong> tab of your PhishER <strong>Settings</strong>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2022</td>\n<td>\n<ul>\n<li>In the PhishRIP section of your platform, we've added the option to filter messages by the PhishFLIP status. For general information about PhishRIP, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2022</td>\n<td>\n<ul>\n<li>We've released our new Basic Editor feature for rules. This feature guides you through creating a custom rule in PhishER. Rules are logical expressions used to disposition emails forwarded to your PhishER inbox. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'>How Do I Create a Rule and Action in PhishER?</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2022</td>\n<td>\n<ul>\n<li>We've updated our PhishRIP feature to support more than one instance of Microsoft 365 and Google Workspace. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n<li>We've improved the <strong>User Comments and Email Disposition</strong> feature for the Hybrid PAB. Now, this feature adds tags and user discussions to your platform. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4410882366611.html'>Adding User Comments and Email Disposition to the Phish Alert Button</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2022</td>\n<td>\n<ul>\n<li>We've added the option to send notifications to your users based on your different rooms in PhishER. You can send these notifications to multiple users over a specific timeframe. You can customize notifications to only alert users when a room has more or less than the desired number of emails. For more information, see the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>Notifications</a> section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2021 Changes'>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>October 2021</td>\n<td>\n<ul>\n<li>We've updated our YARA Rule version to now support YARA version 4.1.2. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013116053.html'>How to Write YARA Rules</a> article and <a href='https://yara.readthedocs.io/en/stable/'>YARA's documentation</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2021</td>\n<td>\n<ul>\n<li>We've released an improvement to our PhishRIP queries.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2021</td>\n<td>\n<ul>\n<li>We've updated our Custom DKIM feature to now allow you to add your own custom signing domains to your platform. For more information, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4403660264339.html'>How to Enable and Customize DKIM Signatures in PhishER</a> article.</li>\n<li>We've released our new PhishER APIs to allow you to evaluate all of the suspicious emails that make it through to your users' inboxes. For more information, see our <a href='https://developer.knowbe4.com/'>KnowBe4 API Reference Guide</a> and our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4404258222099.html'>KnowBe4 PhishER API</a> article.</li>\n<li>We've released Custom DKIM signatures for PhishER. Admins can now use allowed domains as signing domains for PhishER. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n<li>You can now use PhishFlip without having to have PhishRIP enabled. In order to access the PhishFlip feature, you must have full PhishRIP Security Role access. See our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/1500005846941.html'>PhishFlip</a> and our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> articles for more information.</li>\n<li>You can now retry your failed PhishRIP Queries. You can use the <strong>Retry</strong> button to run the query again without creating a new query. See our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP</a> article for more information.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2021</td>\n<td>\n<ul>\n<li>We've added a new filtering drop-down menu in the <strong>Domains and URLs</strong> section and the <strong>Attachment</strong> section of the Message Details. You can use these filters to only view the domains, URLs, or attachments that you're interested in. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/1500005846941.html'>PhishER Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>May 2021</td>\n<td>\n<ul>\n<li>We've released our new PhishFlip feature. This feature allows you to create KSAT phishing templates from the user-reported emails that were sent to PhishER. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/1500005846941.html'>PhishFlip</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2021</td>\n<td>\n<ul>\n<li>We've added the option to create webhooks for your platform. Webhooks allow you to provide other applications with real-time information. You will be able to receive a callback based on an <strong>Action</strong> that is attached to a message. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2021</td>\n<td>\n<ul>\n<li>We've removed the character limit when you view a raw message in the <strong>Message Details</strong>.</li>\n<li>We've updated the <strong>Message Details</strong> section of your <strong>Inbox</strong> to allow for PhishRIP messages with similar subjects and senders to be grouped by <strong>AttackID</strong> when clicking the<strong> View Queries</strong> button. For more information on this new feature, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>January 2021</td>\n<td>\n<ul>\n<li>We've added widgets to your <strong>Dashboard</strong>. You can add and remove different charts to see the information that is important to your organization and to customize your Dashboard. For more information on the new Dashboard features, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>PhishER Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2020 Changes'>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>December 2020</td>\n<td>\n<ul>\n<li>Your PhishER platform now allows you to create Security Roles for the PhishER platform. This allows you to add users from your KnowBe4 Security Awareness platform and grant them Limited or Full access to different areas of PhishER including Rooms, Inbox, Rules, Actions, PhishRIP, and Settings. You also have the ability to create Tag Limitations for the various Security Roles that you create. For more information, please visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>October 2020</td>\n<td>\n<ul>\n<li>Your PhishER platform can now be integrated with KnowBe4 Security Awareness Console. You can now send PhishER Events and Actions to the user timeline and create Smart Groups based on the information that you gather from your users through this integration. For more information, please visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n<li>Your VirusTotal integration with your PhishER platform now allows you to include domains that you would like to ignore when completing a VirusTotal scan. For more information, please visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n<li>The Reports section of your PhishER platform now offers a new bar graph that shows the most common Attachments, Reporters, Senders, Domains and URLs, and Tags.</li>\n<li>The Rooms section of your PhishER platform now offers the ability to go to a filtered Inbox, Dashboard, or Report based on your Saved Queries or the System Generated filters.</li>\n<li>Your PhishER platform now allows you to connect the PhishRIP feature with your Google Workspace instance. For more information, please visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>PhishER Settings</a> article.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>September 2020</td>\n<td>\n<ul>\n<li>When you sign out of your PhishER platform, you will also be signed out of your KnowBe4 console.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>August 2020</td>\n<td>\n<ul>\n<li>Your PhishER platform now allows for to pick which columns you would like to see included on the Reports page. For more information on this new feature, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>PhishER Product Manual</a>.</li>\n<li>Your PhishER platform now includes a new Search bar. You can use the Search bar to find a dashboard or executive report for a specific search or campaign. For more information on the new Dashboard features, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>PhishER Product Manual</a>.</li>\n<li>Your PhishER platform Dashboard now gives you the ability to click on any of the following fields and taken to an automatically filtered inbox: <strong>Reported Messages, Automatically Resolved, Manually Resolved, Unresolved, Category, and Priorities</strong>. For more information on the new Dashboard features, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>PhishER Product Manual</a>.</li>\n<li>Your PhishER platform now allows for empty searches to be performed in Rooms as long as there is a particular field specified for the empty search.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>July 2020</td>\n<td>\n<ul>\n<li>A count for the number of Attachments and Domains and URLs that exist in the message was added to the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Preview</a> tab of the Message Details screen.</li>\n<li>Your PhishER platform now includes the ability to customize the <strong>Body</strong> field in the Find Similar Messages window. You can create a new PhishRIP query by selecting the Body and modifying the text field. For more information on Customized Criteria, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP</a> documentation.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2020</td>\n<td>\n<ul>\n<li>Your PhishER platform now includes Customized Criteria. You can create a new PhishRIP query by selecting one of the following fields and modifying the text: <strong>Subject, Sender, Recipient, and Attachment</strong>. For more information on Customized Criteria, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP</a> documentation.</li>\n<li>The Actions section of your PhishER platform now offers the option of including Find Similar Messages in your Action. If the Find Similar Messages option is enabled, you can select the criteria that you would like the Action to create a new PhishRIP Query for when the Action is triggered. For more information on how to use the Find Similar Message section when creating an Action, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'> How Do I Create a Rule and Action in PhishER</a> documentation.</li>\n<li>The Actions and Discussion sidebar of the Message Details page now include information on the number of PhishRIP queries that were initiated and the date of the last query that was initiated by the selected message. To learn more about the new information included under the PhishRIP section of the Actions and Discussion sidebar, visit our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>PhishER Product Manual</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2020</td>\n<td>\n<ul>\n<li>Your PhishER platform now includes <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360045742834.html'>PhishRIP</a>, an email quarantine feature that allows your organization to search for user-reported emails across all of the mailboxes tied to your Microsoft 365 instance. Using PhishRIP, you can prevent active phishing attacks by removing potential email threats from the inbox of your users. Visit <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>here</a> to learn how to enable PhishRIP in your PhishER platform.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2019 Changes'>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>August 2019</td>\n<td>\n<ul>\n<li>Your PhishER platform now includes PhishML, a machine-learning module that analyzes all messages forwarded to your PhishER inbox. Visit <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>here</a> to learn how PhishML provides you with information that can make your prioritization process easier, faster, and more accurate.</li>\n<li>A <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Tags report</a> was added to the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Reports</a> section of PhishER. Check out this report to view a list of your most common tags.</li>\n<li>Two columns were added to the PhishER <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>inbox</a>: <strong>Current Disposition Date</strong> and <strong>First Disposition Date</strong>.</li>\n<li>The PhishER <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360019467573.html'>Email Template Editor</a> now includes a <strong>Source</strong> code option for HTML customization.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>June 2019</td>\n<td>\n<ul>\n<li>Modify your Dashboard view to display a custom date range of data using the PhishER date picker. Visit <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>here</a> for more information.</li>\n<li>New placeholders were added to the <strong>Email Template Editor</strong>. Check out our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360019467573.html'>Email Template Placeholders</a> table for all of the details.</li>\n<li>The option to enable <strong>VirusTotal Automatic Scanning</strong> is now available. Click <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>here</a> to learn more about your automatic scanning settings.</li>\n<li>If you select messages in your PhishER inbox, a <strong>Run</strong> drop-down will now appear. This drop-down presents two sections: <strong>Replay</strong> and <strong>Actions</strong>. If you want to run all rules or all rules and actions against selected messages, choose an option from the Replay section. If you want to run an action against selected messages, choose an action from the Actions section. Visit <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>here</a> for more information about this recursive drop-down!</li>\n<li>A <strong>Download CSV</strong> option was added to the PhishER <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Inbox</a> and <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Reports</a> page.</li>\n<li>An <strong>Email</strong> section was added to the <strong>Run</strong> drop-down in your PhishER inbox. When a message is selected, this new section allows you the option to send a custom email. For more information about this feature, visit <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>here</a>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>April 2019</td>\n<td>\n<ul>\n<li>When creating an <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'>action</a>, you can now choose the <strong>Delete matching messages</strong> option. If this option is selected, all matching messages will be permanently deleted from your PhishER inbox when the action is triggered or run.</li>\n<li>Preview how a YARA<a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'>rule</a> would affect messages in your PhishER inbox by using the <strong>Preview Rule</strong> option. Visit <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'>here</a> for more information about this feature.</li>\n<li>If your PhishER platform is integrated with VirusTotal, you can now run a VirusTotal scan on attachments and URLs from the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Message Details</a> screen.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>March 2019</td>\n<td>\n<ul>\n<li>An <strong>Email Templates</strong> section was added to the PhishER <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>Settings</a> page. This setting allows you to attach custom email templates to your PhishER <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'>actions</a>.</li>\n<li>Track the history of a message from the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Message Details</a> section of your PhishER <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Inbox</a>. Message history will list all of the events that changed or modified a message.</li>\n<li>A <strong>QuickActions</strong> bar was added to the PhishER Inbox. Add your most frequently used <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013025854.html'>actions</a> to the QuickActions bar for quick accessibility.</li>\n<li>You can now manage admin and user access to PhishER by enabling or disabling PhishER under an individual's <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360009588974.html'>User Profile</a> settings in the KnowBe4 console.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>February 2019</td>\n<td>\n<ul>\n<li>A <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>Data Retention</a> section was added to the PhishER <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013919314.html'>Settings</a> page for custom configuration.</li>\n<li>Bulk tagging can be done from the PhishER <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360010802673.html'>Inbox</a>. This means that multiple tags can be added to multiple selected messages at the same time.</li>\n<li>All tags, attachment names, and email addresses are clickable filters. Clicking on one of these items will display a filtered view of your PhishER inbox.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n<div title='2018 Changes'>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Release Date</th>\n<th scope='col'>Description</th>\n</tr>\n<tr>\n<td>December 2018</td>\n<td>\n<ul>\n<li>Bookmark this page to learn about PhishER updates.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n</div>",
    "user_segment_ids": []
  }
}