{
  "article": {
    "id": 360013570174,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013570174.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360013570174.html",
    "author_id": 21027160967,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 9,
    "vote_count": 9,
    "section_id": 360002796033,
    "created_at": "2018-12-12T23:17:59Z",
    "updated_at": "2025-03-11T18:32:57Z",
    "name": "Password Exposure Test (PET) Product Manual",
    "title": "Password Exposure Test (PET) Product Manual",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T18:32:57Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "pet",
      "password exposure test",
      "PET",
      "Password Exposure",
      "Password Exposure Tool",
      "Lead Generator",
      "answerbot"
    ],
    "body": "<p>The Password Exposure Test (PET) is a free tool that analyzes the passwords of the accounts in your Active Directory (AD) for numerous types of password vulnerabilities. Using this test will increase your organization's awareness by letting you know if you're susceptible to a password-related attack.</p>\n<p>The PET results will display which user accounts failed the test, and what vulnerability or vulnerabilities they failed with. This information can empower you to enhance your internal security measures by training your users about password safety, enhancing your password complexity rules, or taking other actions to bolster your cybersecurity posture.</p>\n<h2 id='iv_01H8ETA5ASXJYSSQAW7B89PPCH'>How Does the PET Work?</h2>\n<p>The PET analyzes the following AD information in order to check for weak and vulnerable passwords:</p>\n<ul role='list'>\n<li>Your AD password table (containing hashed passwords)</li>\n<li>The encryption algorithm of your AD password table</li>\n<li>The primary domain found in your AD tree</li>\n</ul>\n<p>The PET also uses your business email domain to assess the amount of data that is publicly available about your organization.</p>\n<p>It is important to note that this tool will never display or report the actual passwords of any user accounts in your AD. Passwords within AD are in a hashed format and will not be visible at any point. The test results will simply identify the user accounts that fail the test so you can decide how to remedy that.</p>\n<p>Additionally, the data pulled from AD is encrypted. The information obtained during the test is saved in local memory, not to a disk. Your domains are the only data transmitted to us from your AD at any point during the test.</p>\n<h2 id='iv_01H8ETA5AS07CMRBJ523YTNDXM'>System Requirements/Prerequisites</h2>\n<p><strong>System Requirements</strong></p>\n<p>To run the PET, the system you use must have the following:</p>\n<ul role='list'>\n<li>Windows 10 or later (32 or 64-bit), Windows Server 2016 or later</li>\n<li>Active Directory (AD), running on Windows Server 2008 R2 or later</li>\n<li>Ability to access the domain controller (DC)</li>\n<li>Internet access</li>\n<li>.NET Framework 4.7.2 (will be installed if needed)</li>\n<li>At least two processors</li>\n<li>At least 2GB of RAM</li>\n<li>At least 1GB of hard disk drive (HDD) space available on your system drive</li>\n<li>User Account Control (UAC) enabled</li>\n</ul>\n<p>You should also run this test on a system <strong>other</strong> than your DC as the scanning process can temporarily generate significant network traffic and CPU usage.</p>\n<p><strong>Prerequisites</strong></p>\n<p>For installation, you will need the following information:</p>\n<ol role='list'>\n<li>A license key, emailed to you when you sign up for PET</li>\n<li>Domain name of your AD (For example: MyDomain.com or MyDomain.local)</li>\n<li>Name of your Domain Controller (DC)</li>\n<li>Credentials to connect to your AD.</li>\n</ol>\n<div class='callout-warning'>\n<div class='callout__content'>\n<strong>Important:</strong> The credentials you use to connect to Active Directory with the PET <strong>must</strong> have<strong>“Replicating Directory Changes” </strong><em>and</em><strong> “Replicating Directory Changes All” permissions</strong> for the test to run successfully. These permissions allow you to obtain a copy of your password table for analysis. For information on quickly adding required permissions to an account in AD, see our <a href='https://support.microsoft.com/en-us/help/303972/how-to-grant-the-replicating-directory-changes-permission-for-the-microsoft-metadirectory-services-adma-service-account' target='_blank' rel='noopener noreferrer'>How to Grant \"Replicating Directory Changes\" Permissions</a> article. For additional notes on these permissions, see the list below.\n<ul role='list'>\n<li>A domain admin<strong> </strong><em>does not</em> have permission by default to access this information, so using the tool with a domain admin account will not necessarily allow you to run the test successfully.</li>\n<li>We strongly recommend creating a <em>new</em> <em>account</em> in AD with these permissions for the purpose of running this test. Once the test is complete, you should delete this new account in accordance with the principle of least privilege.</li>\n<li>\n<em>Why create a new account?</em> Creating a new account will make it easier to determine when this test took place and which account accessed the information, should you need to look for that information in the future. It also makes it easier to remove those permissions: once the test is done, simply delete the newly-added user account.</li>\n</ul>\n</div>\n</div>\n<h2 id='iv_01H8ETA5ASGCTQGBQ4C9YNX79R'>Installation and Setup</h2>\n<p>Once you have a system that meets the <a href='#Requirements'>requirements and prerequisites</a>, follow the steps below to complete the install.</p>\n<ol role='list'>\n<li>Sign up for your free test by navigating to <a href='https://www.knowbe4.com/password-exposure-test' target='_blank' rel='noopener'>https://www.knowbe4.com/password-exposure-test</a>. Upon signing up, we'll email you a unique license key, which you'll need to enter prior to running the test.</li>\n<li>Download and run the installer file for the PET. Review and agree to the License Agreement and then click <strong>Install</strong>. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/SoftwareAgreement.png'><img src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/SoftwareAgreement.png' alt=' '></a>\n</li>\n<li>Click <strong>Yes</strong> if prompted to allow the program to make changes. <a data-fancybox='single' data-src='https://s3.amazonaws.com/helpimg/PET/PETAllowChanges.png'><img src='https://s3.amazonaws.com/helpimg/PET/PETAllowChanges.png' alt=' '></a>\n</li>\n<li>The installation will begin, click <strong>Launch</strong> once the installation is complete.Click <strong>Yes</strong> if prompted to allow the program to make changes.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/Launch.png'><img src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/Launch.png' alt=' '></a>\n</li>\n<li>Enter your unique License Key, which was sent to the email address you provided when signing up. Click <strong>OK</strong>.  <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/LicenseKey.png'><img src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/LicenseKey.png' alt=' '></a>\n</li>\n<li>Enter the following credentials, as shown in the image below.\n<ul role='list'>\n<li>\n<strong>(a) The Domain name (DNS)</strong> of your Active Directory (For example, mydomain.com or mydomain.local)</li>\n<li>\n<strong>(b)</strong> The computer name of your <strong>Domain Controller (DC)</strong> (For example, DC1)</li>\n<li>\n<strong>(c)</strong> The <strong>Username</strong> and <strong>Password</strong> for the account you created which has \"Replicating Directory Changes\" and “Replicating Directory Changes All” permissions</li>\n</ul>\nAfter entering the above information, click <strong>Start Test</strong> when you are ready to begin your test. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/WelcomeScreen.png'><img src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/WelcomeScreen.png' alt=' '></a>\n</li>\n</ol>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> The PET has additional settings you can access by clicking the gear icon in the top-right corner of the window. In <strong>General</strong> settings, you can choose to include two optional vulnerabilities in your scan: <strong>AES Encryption No Set</strong> or <strong>Password Never Expires</strong>. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/GeneralSettings.png'><img src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/GeneralSettings.png' alt=' '></a>\n</div>\n</div>\n<p>The test will analyze your organization's AD accounts and your results will be displayed on-screen as soon as the test is complete. This process usually only takes a moment to complete but may take longer depending on your AD and workstation performance.</p>\n<h2 id='iv_01H8ETA5ASD0ZBGSP1XF6CFRW8'>Analyzing Your Results</h2>\n<p>Your PET results display the total number of AD accounts checked and specify the number of accounts that are considered vulnerable or not vulnerable. </p>\n<p>Each of your AD accounts will be listed in the results table and a checkmark will indicate the specific vulnerability or vulnerabilities found on that particular account. You can also search for a specific account by entering characters into the search box. </p>\n<p>The test also performs a data exposure assessment and calculates an <strong>Exposure Level</strong> <strong>percentage</strong> and <strong>Risk Distribution</strong> <strong>pie chart</strong> for your organization.</p>\n<p>Refer to the details below to learn more about the different types of results available in your PET.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/ResultsAnnotated.png'><img src='https://helpimg.s3.amazonaws.com/Free+Tools/Password+Exposure+Test+(PET)/EN/ResultsAnnotated.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Vulnerable Accounts:</strong> Lists the total number of accounts that were assessed and found to have vulnerabilities.</li>\n<li>\n<strong>Not Vulnerable:</strong> The number of accounts that were assessed and determined to not have vulnerabilities.</li>\n<li>\n<strong>All Accounts:</strong> The total number of accounts assessed during your test.</li>\n<li>\n<strong>Found Vulnerabilities pie chart:</strong> Compares all of the password vulnerabilities found in your AD and indicates which vulnerabilities are most prevalent in your organization.</li>\n<li>\n<strong>Exposure Level:</strong><span> The percentage of your employees that were found to have publicly exposed data. Any account meeting at least one of the following failure types (found in the PET results table) contributes toward this percentage: </span><strong>Sensitive Info Exposed</strong><span>, </span><strong>Password Info Exposed</strong><span>, or </span><strong>Breached Password</strong><span>.</span>For more information on these failure types, please see the <a href='#01H8ETA5ASJSDZ67950EPXG5AD'>Additional Results</a><span> section below.</span>\n</li>\n<li>\n<strong>Risk Distribution pie chart:</strong> A visual representation of the severity of the data that is publicly-available about your organization. Hover over the pie chart to identify the two segments or ranks of data exposure results, outlined below:\n<ul role='list'>\n<li>\n<strong>High Risk:</strong> Results were found in publicly-available breach data, which could contain sensitive personal information about your employees. This information can be used to create a sophisticated social engineering attack against individuals or an organization. </li>\n<li>\n<strong>Very High Risk:</strong> Results were found in publicly-available breach data, where passwords were leaked during the breach. These password breaches included cleartext passwords or password hashes.</li>\n</ul>\n</li>\n<li>\n<strong>Rerun Test: </strong>You can click this button to rerun the PET.</li>\n<li>\n<strong>Search: </strong>Use this search bar to find specific accounts in your results.</li>\n<li>\n<strong>Export to Excel </strong>or<strong> Export to PDF: </strong>Use these options to export your PET results.</li>\n<li>\n<strong>Checkmark icon:</strong> A checkmark icon indicates the type of vulnerability found on the account.</li>\n<li>\n<strong>Failure Types/Vulnerabilities Found:</strong><span> You can click each of the failure types in the panel on the left-hand side to filter the results to only show the accounts having that vulnerability. See the next section for details on these failure types.</span>\n</li>\n</ol>\n<h3 id='iv_01H8ETA5ASFXKZ1904YGDT01B2'>Failure Types/Vulnerabilities Found</h3>\n<p>The PET analyzes your data to look for 12 different failure types that can leave your organization vulnerable to an attack. The following table explains each of the primary PET vulnerabilities included in your results. </p>\n<ol role='list'>\n<li>\n<strong>Weak Password: </strong>This failure indicates that the affected account's password matched one of those listed in our Weak Password dictionary. These passwords are either very common, easy to guess, or have been made available to attackers because of past data breaches.</li>\n<li>\n<strong>Breached Password: </strong>This failure indicated that at the time of a data breach, the affected account's password matches a password that was associated with an email address at your domain. Your AD accounts are checked against a database of breached data that contains over one billion leaked passwords.</li>\n<li>\n<strong>Password Info Exposed: </strong>This failure indicates that the affected account has been found in publicly available breaches that contain either cleartext passwords or password hashes. The results for this failure type are found in the fourteenth column in the results table.</li>\n<li>\n<strong>Shared Password:</strong> This failure indicates that the affected account shares a password with at least one other account.</li>\n<li>\n<strong>Empty Password:</strong> This failure includes accounts that do not have a set password.</li>\n<li>\n<strong>Clear Text Password:</strong> This failure includes passwords that are stored in clear text in an Active Directory. This means the users' AD passwords are stored using reversible encryption.</li>\n<li>\n<strong>Password Not Required:</strong> This failure includes accounts that have the capability of not having a password.</li>\n<li>\n<strong>Password Never Expires:</strong> This failure indicates that the account has its password timeout set to zero. Because of this setting, even if the <strong>Password never expires</strong> check box in the user’s properties is unchecked, their password will never expire. The PET will check password expiration settings in your organization’s domain policies, fine-grained password policies, and user properties.</li>\n<li>\n<strong>LM Hash Password:</strong> This failure indicates that the affected account uses a Local Area Network (LAN) manager hash, which is an antiquated method. These passwords are vulnerable to brute force attacks and can be cracked in seconds.</li>\n<li>\n<strong>AES Encryption Not Set:</strong> This failure indicates that the account doesn’t use Advanced Encryption Standard (AES) to encrypt the user’s password. AES encrypts passwords with a 128-bit or 256-bit key. So, passwords that use AES encryption are less vulnerable to attacks.</li>\n<li>\n<strong>DES-Only Encryption:</strong> This failure indicates that affected accounts were set up using the retired Data Encryption Standard (DES) mechanism. This could be a result of old software that doesn’t know how to react to AES.</li>\n<li>\n<strong>Missing Pre-Authentication:</strong> This failure indicates that affected accounts have an important security mechanism turned off. Without these security mechanisms, the accounts may be at risk of brute force attacks. These attacks can occur offline and are difficult to detect. The security mechanism, when enabled, creates an encrypted authentication request so that attempts to authenticate to the account are logged.</li>\n</ol>\n<h3 id='iv_01H8ETA5ASJSDZ67950EPXG5AD'>Additional Results</h3>\n<p>Your PET results will display information on additional results beyond just the failure types. These additional details and failure types can help to determine which of your AD accounts are the most vulnerable, and therefore in need of the most immediate attention. See the list below for details.</p>\n<ul role='list'>\n<li>\n<strong>Domain:</strong> Signifies which Domain is used in the corresponding AD account.</li>\n<li>\n<strong>Sensitive Info Exposed:</strong> The affected accounts were found to have some of their identity information publicly visible, leaving them susceptible to phishing attacks.</li>\n<li>\n<strong>Social Info Exposed:</strong> The affected account was found to have a public social media presence.</li>\n<li>\n<strong>Password Last Modified:</strong> The date the password was last changed for the corresponding AD account.</li>\n<li>\n<strong>Breach Entry Timestamp:</strong> The approximate date that the affected account was last involved in a breach.Please see <a href='#01H8ETA5AS4DWTHJBD0HCCJKCS'>below</a> for additional information about where we obtain our breach data.</li>\n<li>\n<strong>Breach Info:</strong> Describes the type of breach the account was involved in (i.e., how the breach occurred, and what type of sensitive data was leaked as a result (if this information is available)). Please see <a href='#01H8ETA5AS4DWTHJBD0HCCJKCS'>below</a> for additional information about where we obtain our breach data.</li>\n</ul>\n<h2 id='iv_01H8ETA5AS4DWTHJBD0HCCJKCS'>Frequently Asked Questions (FAQs)</h2>\n<ul role='list'>\n<li>\n<strong>I had several users fail the test. What do I do now?</strong>First and foremost, have the users with vulnerable accounts change their passwords immediately.Secondly, train your users on proper password practices with security awareness training and remind them often. It is important for them to know that hackers can crack a password within seconds with the right tools in hand.KnowBe4 offers several courses covering proper password practices, which can be used to train your users.For many of the vulnerabilities, you’ll also want to enforce stricter password requirements in your organization. We strongly recommend increasing your password complexity requirements and setting a rule to ensure passwords expire on a regular basis. While we cannot advise you on the specifics of how to remedy all of the password vulnerabilities in your organization, we can point you in the direction of some great resources that can help.\n<ul role='list'>\n<li>TechNet: <strong><a href='https://technet.microsoft.com/en-us/library/dd277399.aspx' target='_blank' rel='noopener'>Configuring Password Policies</a></strong>\n</li>\n<li>TechNet: <strong><a href='https://technet.microsoft.com/en-us/library/ff741764.aspx' target='_blank' rel='noopener'>Best Practices for Enforcing Password Policies</a></strong> </li>\n<li>Microsoft: <strong><a href='https://www.microsoft.com/en-us/research/publication/password-guidance/' target='_blank' rel='noopener noreferrer'>Password Guidance</a></strong> (Downloadable PDF)</li>\n</ul>\n</li>\n<li>\n<strong>Can I see what the weak and breached passwords are? </strong>No. The passwords are hashed and cannot be displayed.</li>\n<li>\n<strong>Can I run this test if I'm using Azure AD? </strong>No. This tool will only work with a local AD.</li>\n<li>\n<strong>Can I run this test multiple times?</strong>Absolutely. If you want to run the test again, click <strong>Rerun Test</strong> below the Risk Distribution pie chart. Be sure to download a PDF or Excel sheet of your current results before running a new test.</li>\n<li>\n<strong>What is the Weak Passwords dictionary and where can I find it?</strong>The Weak Passwords dictionary contains over 11 million weak and compromised passwords from past data breaches. Hackers use similar dictionaries to attempt to crack your organization's passwords.To find the Weak Passwords dictionary, navigate to the Password Exposure Test installation folder by following this path: “C:\\ProgramFiles (x86)\\KnowBe4\\Password Exposure Test”. Then, open the data.bin file to view the Weak Passwords dictionary.</li>\n<li>\n<strong>Where do you get your breach data from? Can I see it?</strong>The breached data shown in the PET is obtained through researching publicly-available breach information. For privacy and security purposes, the PET database is proprietary information. Additionally, KnowBe4 partners with Spycloud.com to search past breaches. Spycloud is a well-respected online resource which specializes in allowing users to search for their email address to see if their information has been made available in past data breaches.</li>\n<li>\n<strong>My anti-virus flagged this as dangerous. Is it?</strong>No, it is not dangerous. The PET’s behavior could mimic that of a password-cracking tool used by hackers, which is why your antivirus may have flagged it as potentially dangerous.</li>\n<li>\n<strong>Are any log files generated during the test?</strong>Yes. A log file is created when you run the PET. The file can be found under C:\\ProgramData\\KnowBe4\\Password Exposure Test\\DebugLogs.</li>\n<li>\n<strong>I received an error message and my test did not run. What do I do?</strong>If you received an error and could not complete the test, check the chart below for common error messages and their causes.</li>\n</ul>\n<p>&lt;tr\"&gt;Test was unable to run due to invalid user name and/or password. Please check your credentials and try the test again.We were unable to connect to your AD using the credentials you provided. Make sure your user name and password are correct and try to run the test again.&lt;/tr\"&gt;</p>\n<table>\n<tbody>\n<tr>\n<td><strong>Error Message</strong></td>\n<td><strong>Issue</strong></td>\n</tr>\n<tr>\n<td>The Active Directory account you are attempting to run the test with does not have Replicating Directory Changes Permissions.</td>\n<td>The account you are using for the test does not have the proper permissions. Make sure you've created an account with <strong>Replicating Directory Changes</strong> and <strong>Replicating Directory Changes - All Permissions</strong>. For more information, visit the <a href='#Requirements'>System Requirements</a> section of this article.</td>\n</tr>\n<tr>\n<td>Server is unavailable. Please check your Domain DNS Name and try the test again.</td>\n<td>This means your Domain DNS name is incorrect, or incorrectly formatted. Make sure you use the format of domain.com or domain.local and attempt to run the test again.</td>\n</tr>\n<tr>\n<td>Server is unavailable. Please check your Domain Controller and try the test again.</td>\n<td>This means your Domain Controller IP is incorrect, or incorrectly formatted. Double check the IP and attempt to run the test again.</td>\n</tr>\n<tr>\n<td>The license validation failed.</td>\n<td>This is likely to mean one of two things:a) either the license key you are using is invalid, or b) you are attempting to validate the license key through a proxy and it is failing as a result of that. If the error is due to a proxy, simply allow connections to the following domains in your proxy settings to allow the validation of your license key to occur:https://auth.knowbe4.com/*https://bpt.knowbe4.com/*https://eecpro.knowbe4.com/*</td>\n</tr>\n<tr>\n<td>Test completed with errors. The username or password is incorrect</td>\n<td>We were unable to connect to your AD using the credentials you provided. Make sure your username and password are correct and try to run the test again.</td>\n</tr>\n</tbody>\n</table>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360013570174-Password-Exposure-Test-PET-Product-Manual"
  }
}