{
  "article": {
    "id": 360033951614,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360033951614.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360033951614.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 5,
    "vote_sum": 1,
    "vote_count": 3,
    "section_id": 360000156668,
    "created_at": "2019-08-15T21:01:59Z",
    "updated_at": "2025-09-30T13:37:54Z",
    "name": "Security Awareness Training Console Reporting Overview",
    "title": "Security Awareness Training Console Reporting Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-24T15:28:11Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "Console Feature",
      "answerbot",
      "answerbot_ksat"
    ],
    "body": "<p>KnowBe4’s Security Awareness Training (KSAT) console offers a wide range of reports that give insight into the effectiveness of your security awareness training program. Each available report in your console can be generated as either a CSV file or a PDF file, depending on the type of report.</p>\n<h2 id='h_01HASWKVVT6S2J9AYH2FY6HYJT'>Dashboard</h2>\n<p>The <strong>Dashboard</strong> tab of your console contains widgets for your organization’s Risk Score and phishing reports. These reports provide general information about your organization’s Phish-prone Percentage during the phishing campaign and your users’ actions during the campaigns. You can hover over the points in the graph to see more details on specific phishing campaigns, how many users each test was sent to, and your users’ actions.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/Dashboard_PhishingReports.png'><img src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/Dashboard_PhishingReports.png' alt=' ' width='659' height='293'></a></p>\n<p>The <strong>Dashboard</strong> tab also contains a <strong>Phish Alert Button</strong> widget where you can generate a CSV report about the emails that your users report using the Phish Alert Button (PAB). This report includes information on the number of simulated and non-simulated emails that have been reported using the PAB, and it includes the number of times the PAB was installed and uninstalled. For more information, visit our <a href='https://support.knowbe4.com/hc/en-us/articles/204218028-Dashboard'>Dashboard Overview</a>.</p>\n<p>To generate your PAB report from the widget, click the <strong>Generate CSV</strong> button at the bottom-right corner.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/PhishAlertButtonWidgetGenerateCSV.png'> <img src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/PhishAlertButtonWidgetGenerateCSV.png' alt=' '> </a></p>\n<h2 id='h_01HASWKVVVTYYYCZ0F6HTVV663'>Phishing</h2>\n<p>The <strong>Phishing</strong> tab &gt; <strong>Campaigns</strong> subtab contains useful reports to see when users completed an action on a phishing test. Clicking the phishing campaign name in the <strong>Campaigns</strong> subtab will lead you to the campaign’s page.</p>\n<ul>\n<li>If the phishing campaign is one-time, you can view the campaign’s report data by clicking on the <strong>Users</strong> subtab.</li>\n<li>If the phishing campaign is recurring, you can view report data from a single phishing campaign in the series by navigating to <strong>Phishing Security Tests</strong>, clicking on the Phishing Security Test (PST) name, and then clicking on the <strong>Users</strong> subtab.</li>\n</ul>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/PhishingCampaigns_Timestamps.png'><img src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/PhishingCampaigns_Timestamps.png' alt=' '></a></p>\n<p>Timestamps are available for the following actions:</p>\n<ul>\n<li>Delivered</li>\n<li>Opened</li>\n<li>Clicked</li>\n<li>QR Code Scanned</li>\n<li>Replied</li>\n<li>Attachment Opened</li>\n<li>Macro Enabled</li>\n<li>Data Entered</li>\n<li>Reported</li>\n<li>Bounced</li>\n</ul>\n<p>If you would like your account admin to receive an email report at the end of your PSTs, select the <strong>Send an email report to account admins after each phishing test</strong> check box when creating a new campaign.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/security_awareness_training_console_reporting_overview.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/security_awareness_training_console_reporting_overview.png' alt='' width='528' height='160'> </a></p>\n<p>The <strong>Phishing</strong> tab &gt; <strong>Reports</strong> subtab also contains reports that are useful for totaling user actions on multiple campaigns. For example, you can use these reports to determine how many times each user clicked on a simulated phishing link.</p>\n<p>Your report can be filtered by specific date range, specific campaigns, PhishFlip campaigns, and campaigns sent to certain users. You can also compare results by groups for phishing failures and phishing emails reported.</p>\n<p>Once you have set the filters that you want to include in your report, click the <strong>Submit </strong>button to generate your new report. You can generate a CSV file of the table data using the <strong>Generate CSV</strong> button, or you can print the table data and graph using the <strong>Print Report</strong> button. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/215781208-Monitoring-and-Reviewing-Overall-Phishing-Reports'>Monitor and Review Overall Phishing Reports</a> article.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/PhishingReportsSubtab.png'> <img src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/PhishingReportsSubtab.png' alt=''> </a></p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>A selection must be made in the <strong>Compare</strong> drop-down menu before the <strong>Group Comparisons by</strong> drop-down menu displays.</div>\n</div>\n<h2 id='h_01HASWKVVVSFRNA03JXB9WTC5F'>Training</h2>\n<p>The <strong>Training</strong> tab &gt; <strong>Campaigns</strong> subtab contains reports for specific training campaigns. Clicking the training campaign name in the <strong>Campaigns</strong> subtab will lead you to the campaign’s page. You can view the training campaign’s report data by clicking the <strong>Users</strong> subtab.</p>\n<p>The report from the <strong>Users</strong> subtab will have the following information:</p>\n<ul>\n<li>\n<strong>All Users:</strong> The total number of users.</li>\n<li>\n<strong>Incomplete:</strong> The number of users that have not completed their training.</li>\n<li>\n<strong>Not Started:</strong> The number of users that have not started their training.</li>\n<li>\n<strong>In Progress:</strong> The number of users that have a training course in progress.</li>\n<li>\n<strong>Completed:</strong> The number of users that have completed their training.</li>\n<li>\n<strong>Past Due:</strong> The number of users that have past due training.</li>\n</ul>\n<p>You can generate a CSV file version of the report by clicking the <strong>Generate CSV</strong> button at the bottom of the table.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/TrainingCampaignsUsersReport.png'> <img src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/TrainingCampaignsUsersReport.png' alt=''> </a></p>\n<p>The <strong>Training</strong> tab &gt; <strong>Reports</strong> subtab contains the <strong>Sign-up Reports</strong> section, which includes a report for a list of users who have logged in at least once and a report for a list of users who have never logged in. Both reports can be generated as a CSV file.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/SignupReports.png'> <img src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/SignupReports.png' alt='' width='338' height='289'> </a></p>\n<p>In the <strong>Reports</strong> subtab, you can generate reports in the <strong>Content Reports</strong> section based on specific courses offered in the console. These reports can be filtered to include all users or specific groups, and they can have a certain start or end date. You also have the option of including archived users.</p>\n<p>The reports generated in the <strong>Content Reports</strong> section can provide the following information about your users:</p>\n<ul>\n<li>\n<strong>Users Who Started the Selected Content: </strong>This report pulls a list of users who have started the selected content within the given date range.</li>\n<li>\n<strong>Users Who Have Not Started the Selected Content: </strong>This report pulls a list of users who were assigned the content within the given date range but have not yet started that content.</li>\n<li>\n<strong>Users Who Have Not Completed the Selected Content: </strong>This report pulls a list of users who started their content within the given date range but have not yet completed that content.</li>\n<li>\n<strong>Users Who Have Not Started the Selected Content or Are in Progress: </strong>This report pulls a list of users who were assigned the selected content within the given date range but have not started or finished that content.</li>\n<li>\n<strong>Users Who Have Completed the Selected Content: </strong>This report pulls a list of users who completed the selected content within the given date range.</li>\n<li>\n<strong>Users Who Acknowledged Course-Attached Policies: </strong>This report pulls a list of users who acknowledged their course-attached policies within the given date range.</li>\n<li>\n<strong>Users Who Did Not Acknowledge Their Course-Attached Policies: </strong>This report pulls a list of users who were assigned the selected content within the given date range but have not acknowledged their course-attached policies.</li>\n</ul>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/Training_Reports.png'><img src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/Training_Reports.png' alt=' '></a></p>\n<p>If you are looking for highly detailed information for a large number of campaigns, we recommend using our API feature. This feature will allow you to export all of the information in the console to an external platform, and that raw data can be combined in any way you wish. For more information on our API feature, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115016090908-Reporting-API-Overview'>Reporting API Overview</a>.</p>\n<h2 id='h_01HASWKVVV2NXBG33FX88ZG431'>Reporting</h2>\n<p>The<strong> Reports</strong> tab contains useful reports for capturing actionable metrics. These reports are useful for sharing with executives or stakeholders to show progress with your security awareness training.</p>\n<p>This tab allows you to see reports based on the following categories:</p>\n<ul>\n<li>\n<strong>Training Activity Reports</strong>: These reports can help you analyze the completion status of the courses your users have been assigned to ensure that you are building a human firewall.</li>\n<li>\n<strong>Group and User Report Cards</strong>: These report cards can help you determine your group’s Risk Score, Phish-prone Percentage, top five clicked emails, and other helpful data about your group.</li>\n<li>\n<strong>Phishing Activity Reports</strong>: These reports can help you analyze your organization’s phishing activity by Phishing Security Tests (PSTs). You can also change the report type to group phishing activity by user.</li>\n<li>\n<strong>Risk Score Reports</strong>: These reports can help you determine how likely users, user groups, or locations are to fall for attacks.</li>\n<li>\n<strong>Phish-prone Percentage</strong> <strong>Reports</strong>: These reports can help you determine your user groups’ susceptibility to phishing attacks based on their Phish-prone Percentages.</li>\n<li>\n<strong>Training Status by Campaign</strong>: This report allows you to review whether each of your users has started training and how much time they spend on it.</li>\n<li>\n<strong>Failure Types Report</strong>: This report can help you discover the social engineering attack vectors your users are most susceptible to.</li>\n<li>\n<strong>Training Status Overview Reports</strong>: These reports can help you review the number of courses users are enrolled in and their current status, organized by campaign, course, or group.</li>\n<li>\n<strong>Phish-failure Percentage</strong> <strong>Reports</strong>: These reports can help you determine the likelihood of your user groups failing a phishing attack based on their Phish-failure Percentages.</li>\n<li>\n<strong>Phishing Results by User Count</strong>: This report allows you to discover how phish-prone your users and user groups are on a scale of 0 percent to 100 percent.</li>\n<li>\n<strong>Email Templates Sent</strong> <strong>Reports</strong>: These reports can help you identify what phishing email templates have been sent to your users and how they typically act when they receive that particular template. You can also learn how many phishing tests your users have received.</li>\n<li>\n<strong>Failures by Phishing Template Report</strong>: This report can help you find out how many failures each of your phishing test templates has received and what these failures are.</li>\n<li>\n<strong>Security Awareness Proficiency Assessment Reports</strong>: These reports allow you to see the results of your organization's <a href='https://support.knowbe4.com/hc/en-us/articles/360037392654'>Security Awareness Proficiency Assessment (SAPA)</a>.</li>\n<li>\n<strong>Unphished and Untrained User Reports</strong>: These reports allow you to find out if your users are actively participating in their training program or what users may still need to be phished or enrolled in training.</li>\n<li>\n<strong>User Count and Login Reports</strong>: These reports allow you to find out how many active users you have in the KSAT console and review the number of users who have been added or removed.</li>\n<li>\n<strong>Security Culture Survey Reports</strong>: These reports allow you to see the results of your organization's <a href='https://support.knowbe4.com/hc/en-us/articles/360037393134'>Security Culture Survey (SCS)</a>.</li>\n<li>\n<strong>Training Hours Report</strong>: This report allows you to see how many hours your users spend on training.</li>\n<li>\n<strong>Training Comparison Reports</strong>: These reports can help you to find out if your training is lowering your Phish-prone Percentage and Risk Score.</li>\n<li>\n<strong>Detection Rules Activity Reports</strong>: These reports can help you analyze your organization’s detection rules activity in SecuirtyCoach.</li>\n<li>\n<strong>Real-Time Coaching Activity Reports</strong>: These reports can help you analyze your organization’s real-time coaching activity in SecurityCoach.</li>\n<li>\n<strong>Learner Platform Reports</strong>: These reports can help you analyze your organization’s percentage of training by platform.</li>\n<li>\n<strong>Training Content Survey</strong>: This report allows you to view your users’ training survey results to determine which training content is most effective. This data can also help you select training content for your campaigns.</li>\n</ul>\n<p>These reports can be generated as PDF files or CSV files. For more detailed information on all of the available reports in the <strong>Reports</strong> tab, read our <a href='https://support.knowbe4.com/hc/en-us/articles/360007952894-Advanced-Reporting-Guide#TYPES'>Reporting Guide</a>.</p>\n<p>If additional details are needed, such as individual user performance on campaigns, we recommend using one of the other types of reports mentioned in this article.</p>\n<h2 id='h_01HASWKVVVD833W84KMPYF3F3X'>Smart Groups</h2>\n<p>If you have a Platinum or Diamond subscription, you can create additional customized reports via our <a href='https://support.knowbe4.com/hc/en-us/articles/8354913796115'>Smart Groups</a> feature. These reports will include information about your users, such as their Phish-prone Percentage and Risk Score.</p>\n<p>For example, a CSV file can be downloaded that displays which users meet the following Smart Group criteria:<br>\"The user must have been created in the last 1 month\" or \"The user must not have been created prior to the last 12 months\".</p>\n<p>Smart Group reports can be created using specific criteria. These specific criteria can be filtered down further to include customized information about your organization's security awareness training. Examples of search criteria are listed below:</p>\n<ul>\n<li>User Field</li>\n<li>Custom Event</li>\n<li>User Date</li>\n<li>Phish Event</li>\n<li>PhishFlip Event</li>\n<li>Breach Event</li>\n<li>Training</li>\n<li>After Training</li>\n<li>Organizational Assessments</li>\n<li>PasswordIQ Event</li>\n<li>PasswordIQ State</li>\n<li>SecurityCoach Detection Rules</li>\n<li>SecurityCoach Real-Time Coaching</li>\n</ul>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/Smart+Groups.png'><img src='https://helpimg.s3.amazonaws.com/advancedreporting/GenReportingGuide/Smart+Groups.png' alt=' '></a></p>\n<p>More detailed information can be found in our <a href='https://support.knowbe4.com/hc/en-us/articles/8293053887251'>Smart Groups Quickstart Guide</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/8355418347667'>Smart Groups Phishing Automation Guide</a> article.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360033951614-Security-Awareness-Training-Console-Reporting-Overview"
  }
}