{
  "article": {
    "id": 360001464847,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360001464847.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360001464847.html",
    "author_id": 21027160967,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 3,
    "vote_count": 3,
    "section_id": 360000156808,
    "created_at": "2018-06-04T21:49:32Z",
    "updated_at": "2025-03-11T18:32:08Z",
    "name": "Frequently Asked Questions (FAQ) for KCM GRC",
    "title": "Frequently Asked Questions (FAQ) for KCM GRC",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T18:32:08Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "faq",
      "KCM",
      "knowbe4 compliance manager",
      "user count",
      "compliance manager",
      "KCM faq",
      "Scope",
      "Task",
      "Control",
      "Compliance",
      "kcm users",
      "Template",
      "KCM Template",
      "KCM General",
      "file size limitations",
      "answerbot_kcmgrc"
    ],
    "body": "<p>In this article, you can find frequently asked questions about the KCM GRC <strong>Compliance Management</strong> module and general questions about KCM GRC. If this article doesn't include the question that you're looking for, please submit a ticket to our <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener noreferrer'>support team</a>. </p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>If you're looking for a question that is specific to the Risk Management, Vendor Risk Management, or Policy Management module, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4414652114451' target='_self'>Risk Management Module Frequently Asked Questions (FAQ)</a>, <a href='https://support.knowbe4.com/hc/en-us/articles/4414553246483' target='_self'>Vendor Risk Management Frequently Asked Questions (FAQ)</a>, or <a href='https://support.knowbe4.com/hc/en-us/articles/4414667883923' target='_self'>Policy Management Module Frequently Asked Questions (FAQ)</a> articles. </div>\n</div>\n<p><a name='GENERAL'></a></p>\n<h2 id='h_01HQKJQRAGDRCCMCQ60AY47MP6'>General Questions</h2>\n<p>For general information about your KCM GRC platform, see the questions below:</p>\n<p><a href='#ExistingProcesses'>1. Can I incorporate my existing compliance efforts and processes into KCM GRC?</a></p>\n<p><a href='#Modules'>2. What modules are available in the KCM GRC console and what do they do?</a></p>\n<p><a href='#usercount'>3. How do I determine whether a user is counted against my KCM GRC user count license?</a></p>\n<p><a href='#DisableSupport'>4. How can I enable or disable support access to my account?</a></p>\n<p><a href='#RequestNew'>5. How do I request a new feature, template, or improvement?</a></p>\n<p><a href='#Timezone'>6. Can I change the timezone in my account?</a></p>\n<p><a href='#CompanyLogo'>7. If I add my organization's logo under my Account Settings, where will it appear?</a></p>\n<p><a name='ExistingProcesses'></a></p>\n<p><strong>1. Question:</strong> Can I incorporate my existing compliance efforts and processes into KCM GRC?</p>\n<p><strong>Answer:</strong> Yes. KCM GRC allows you to use CSV files to upload your existing processes. For example, you can <a href='https://support.knowbe4.com/hc/en-us/articles/360045245034#IMPORT_BULK' target='_self'>import compliance requirements</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/360049579594#BULK' target='_self'>import controls</a> that your organization already has in place. After you import these items into KCM GRC, you can map the controls to one or more requirements in your <a href='https://support.knowbe4.com/hc/en-us/articles/115016129608-KCM-GRC-Glossary-of-Compliance-Terms#Scopes' target='_self'>scopes</a>.</p>\n<p><a name='Modules'></a></p>\n<p><strong>2. Question: </strong>What modules are available in the KCM GRC console and what do they do?</p>\n<p><strong>Answer:</strong> The following modules are available in the KCM GRC console. You may not have access to all of these modules, depending on your subscription level. Contact your Customer Success Manager if you'd like to add an additional module to your account.</p>\n<ul role='list'>\n<li>\n<strong>Compliance</strong> <strong>Management</strong> <strong>Module</strong> - Compliance is a module included with your KCM GRC subscription. It allows you to manage compliance initiatives and audits by assigning control tasks, creating auditor reports, and storing evidence. For more information on getting started with your compliance module, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360046400313' target='_self'>Getting Started with the Compliance Management Module</a> article.  </li>\n<li>\n<strong>Policy Management</strong> <strong>Module</strong> - Policy Management is a module included with your KCM GRC subscription. It allows you to manage, distribute, and track acknowledgments of your organization's required policies. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360000727248' target='_self'>Policy Management Module Guide</a>.  </li>\n<li>\n<strong>Risk Management</strong> <strong>Module </strong>- Risk Management is a module that can be added to your KCM GRC subscription. It allows you to manage risk by conducting risk assessments and establishing and implementing mitigation efforts. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360010819154' target='_self'>Risk Management Module Guide</a>.  </li>\n<li>\n<strong>Vendor Risk Management</strong> <strong>Module </strong>- Vendor Risk Management is a module that can be added to your KCM GRC subscription. The VRM module lets you centralize your third-party risk management processes by prequalifying risk, assessing your vendors, and conducting remediation efforts in your platform. You can even set a frequency for how often your vendors are assessed, to continually monitor the associated risk. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021083194-Vendor-Risk-Management-Module-Introduction-Guide' target='_self'>Vendor Risk Management Module Guide</a>. </li>\n</ul>\n<p><a name='usercount'></a></p>\n<p><strong>3. Question:</strong> How do I determine whether a user is included in the user count for my KCM GRC subscription?</p>\n<p><strong>Answer:</strong> The following <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148-KCM-GRC-User-Roles' target='_self'>user roles</a> are included in your user count:</p>\n<ul role='list'>\n<li>Account Administrator</li>\n<li>Contributor</li>\n<li>Scope Administrator</li>\n<li>Policy Administrator</li>\n<li>Campaign Administrator</li>\n<li>Risk Administrator</li>\n<li>Vendor Administrator.</li>\n</ul>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> If a user is assigned to more than one of the user roles listed above, they will only count against your user count one time.</div>\n</div>\n<p>The following user roles are not included in your user count:</p>\n<ul role='list'>\n<li>Auditor</li>\n<li>Vendor User</li>\n<li>Policy Management end users</li>\n</ul>\n<p><a name='DisableSupport'></a></p>\n<p><strong>4. Question: </strong>How can I enable or disable KnowBe4 support's access to my account?</p>\n<p><strong>Answer:</strong> By default, KnowBe4 support can access your account to assist you with difficulties that you experience. However, you can disable this feature on or off from your Account Settings. For instructions, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115016049347' target='_blank' rel='noopener noreferrer'>How to Manage Your KCM GRC Account Settings</a> article. </p>\n<p><a name='RequestNew'></a></p>\n<p><strong>5. Question: </strong>How do I request a new feature, template, or improvement?</p>\n<p><strong>Answer: </strong>We recommend contacting your Customer Success Manager, contacting the <a href='https://support.knowbe4.com/hc/en-us/requests/new'>KnowBe4 support team</a>, or posting on our KCM GRC Community Board for <a href='https://support.knowbe4.com/hc/en-us/community/topics/360000005248-Compliance-Manager-Feature-Requests'>Feature Requests</a>. Often, we base our development on customer feedback and requests, so we appreciate your input.</p>\n<p><a name='Timezone'></a></p>\n<p><strong>6. Question</strong>: Can I change the time zone in my account?</p>\n<p><strong>Answer: </strong>Yes, you can change your time zone in your account. The time zone that is selected in your account settings will affect your policy management campaigns. All other dates and times in your account are based on the Universal Coordinated Time (UTC). To learn how to change the time zone in your account settings, see the <a href='https://support.knowbe4.com/hc/en-us/articles/115016049347#Edit_Account' target='_self'>Account Settings</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/115016049347' target='_self'>How to Manage Your KCM GRC Account Settings</a> article. </p>\n<p><a name='CompanyLogo'></a></p>\n<p><strong>7. Question:</strong> If I add my organization's logo under my Account Settings, where will it appear?</p>\n<p><strong>Answer:</strong> The logo will display at the top-left corner of your platform and in any emails that are generated from your KCM GRC platform. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/115016049347#Edit_Account' target='_self'>Account Settings</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/115016049347' target='_self'>How to Manage Your KCM GRC Account Settings</a> article.</p>\n<p><a name='USER_ROLES'></a></p>\n<h2 id='h_01HQKJQRAG00TC6RST25HD8BA3'>User Roles</h2>\n<p>To learn about working with user roles in your KCM GRC platform, see the questions below:</p>\n<p><a href='#UserRoles'>1. What are the differences between the various user roles in KCM GRC?</a></p>\n<p><a href='#ScopeManagers'>2. Can Scope Administrators create controls?</a></p>\n<p><a href='#ContributortoScope'>3. How do I add additional scope permissions for my users with the Contributor user role?</a></p>\n<p><a href='#AdminPermissions'>4. How do I remove Account Administrator permissions from a user?</a></p>\n<p><a href='#TransferResponsibility'>5. A KCM GRC user left our organization. How do I transfer the user's responsibilities?</a></p>\n<p><a name='UserRoles'></a></p>\n<p><strong>1. Question:</strong> What are the differences between the various user roles in KCM GRC?</p>\n<p><strong>Answer:</strong> The KCM GRC platform has user roles for our <a href='#PolicyManagement' target='_self'>four different modules</a>. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148-KCM-User-Types' target='_blank' rel='noopener noreferrer'>User Roles Guide</a>.</p>\n<p><a name='ScopeManagers'></a></p>\n<p><strong>2. Question: </strong>Can Scope Administrators create controls?</p>\n<p><strong>Answer: </strong>Yes, Scope Administrators can create controls for the requirements that are included in their allowed scopes. You can add or remove access to scopes from the <strong>Allowed Scopes</strong> field of the Scope Administrator's user profile. To learn how to add or remove a user's allowed scopes, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833-KCM-GRC-Working-with-Users' target='_self'>Updating User Account Details</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833' target='_self'>How to Create and Manage KCM GRC User Accounts</a> article. </p>\n<p><span>To create a control, Scope Administrators can navigate to a scope and then open the requirement that they want to create a control for. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360049579594-KCM-GRC-Creating-and-Importing-Controls#INDIVIDUAL' target='_self'>Creating Controls Individually</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360049579594' target='_self'>How to Create Controls for Scoped Requirements</a> article. </span></p>\n<p><a name='ContributortoScope'></a></p>\n<p><strong>3. Question: </strong>How do I add additional permissions for my users with the Contributor user role?</p>\n<p><strong>Answer: </strong>To learn how to add additional user roles, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833-KCM-GRC-Working-with-Users#MANAGING' target='_blank' rel='noopener noreferrer'>Managing Users</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833' target='_blank' rel='noopener noreferrer'>How to Create and Manage KCM GRC User Accounts</a> article.</p>\n<p>For more information about user roles, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115015826148-KCM-GRC-User-Roles' target='_self'>User Roles Guide</a>.</p>\n<p><a name='AdminPermissions'></a></p>\n<p><strong>4. Question: </strong>How do I remove Account Administrator permissions from a user?</p>\n<p><strong>Answer: </strong>If you are an Account Administrator, you can remove the Account Administrator's user role. However, Account Administrators cannot demote their own user roles. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833#USERDETAILS' target='_self'>Updating User Account Details</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833' target='_self'>How to Create and Manage KCM GRC User Accounts</a> article.</p>\n<p><a name='TransferResponsibility'></a></p>\n<p><strong>5. Question:</strong> A KCM GRC user left our organization. How do I transfer the user's responsibilities?</p>\n<p><strong>Answer:</strong> For information bout transferring responsibilities, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833-KCM-GRC-Working-with-Users#DISABLING' target='_blank' rel='noopener noreferrer'>Disabling Users and Transferring Responsibilities</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360019709833-KCM-GRC-Working-with-Users' target='_blank' rel='noopener noreferrer'>How to Create and Manage KCM GRC User Accounts</a> article.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> This action will transfer the controls, tasks, task schedules, and vendors that the user was responsible for. If the user created policy campaigns, you will need to assign the campaigns to a new campaign owner.</div>\n</div>\n<p><a name='SCOPES_TEMPLATES'></a></p>\n<h2 id='h_01HQKJQRAGKZ4M2D5WBXC3GC7E'>Templates and Scopes</h2>\n<p>To learn about templates and scopes in your KCM GRC platform, see the questions below. This section includes also includes questions about requirements. </p>\n<p><a name='TemplateandScope'></a></p>\n<p><strong>1. Question:</strong> What is the difference between a template and a scope? </p>\n<p><strong>Answer:</strong> A template is a framework, or collection, of requirements that relate to one another. A scope is a set of requirements that relate to one another and describe the boundaries of a project or audit framework. We recommend that you create a scope by converting a template to a scope. </p>\n<p>For more information about templates and scopes, see the articles listed below:  </p>\n<ul role='list'>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/115016129608-KCM-GRC-Glossary-of-Compliance-Terms' target='_self' rel='noopener'>Glossary of Compliance Terms</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360046400313' target='_self'>Compliance Management Module Guide</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360045245034' target='_self'>How to Create Custom Templates for Scopes</a></li>\n<li><a href='https://support.knowbe4.com/hc/en-us/articles/360046703714' target='_self'>How to Convert a Template to a Scope</a></li>\n</ul>\n<p><a name='TemplateTypes'></a></p>\n<p><strong>2. Question: </strong>What types of templates can I use in my KCM GRC platform?</p>\n<p><strong>Answer:</strong> KCM GRC has four types of templates that you can use in your platform. To learn how to use each template, see the list below:</p>\n<ul role='list'>\n<li>\n<strong>Custom Templates</strong>: You can use custom templates in the Compliance Management module to select requirements that you will work toward under a scope. Custom templates are most useful if your organization has unique compliance objectives that our managed templates do not cover. For information about creating custom templates, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360045245034' target='_self'>How to Create Custom Templates for Scopes</a> article. </li>\n<li>\n<strong>Managed Templates</strong>: You can use a managed template in the Compliance Management module to convert the template into a scope. Managed templates already include requirements, so they are a simple alternative to creating a custom template. After you convert a managed template to. a scope, you can create or map additional requirements, or you can unmap requirements that do not apply to your organization. For information about the managed templates that we offer, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360022753993-KCM-GRC-Managed-Templates' target='_self'>Managed Templates</a> article. </li>\n<li>\n<strong>Policy Templates</strong>: You can use policy templates in the Policy Management module to document your organization's policies. Your KCM GRC account offers ten policy templates that you can download and customize for your organization. For information about customizing policy templates and the policy templates that we offer, see our <a href='https://support.knowbe4.com/hc/en-us/articles/1500006135402-KCM-GRC-Policy-Templates' target='_self'>Policy Templates</a> article. </li>\n<li>\n<strong>Risk Templates</strong>: You can use risk templates to add risks from our master risk repository to your <strong>Risk Register</strong>. Risk templates have pre-populated names and descriptions, and you can customize details such as the risk status, likelihood, and impact. Risks that you import to or create from your <strong>Risk Register</strong> also appear in the <strong>Risk Templates </strong>area of your platform. For more information about risk templates, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360010296394-KCM-GRC-Risk-Management-Risk-Templates' target='_self'>Risk Templates</a> article. </li>\n<li>\n<strong>Questionnaire Templates</strong>: You can use questionnaire templates in the Vendor Risk Management module to create questionnaires that you will send to your vendors. KCM GRC offers questionnaire templates for the Standardized Information Gathering (SIG) questionnaire and the Consensus Assessment Initiative Questionnaire (CAIQ). For more information about questionnaire templates, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360021582594' target='_self'>Creating and Configuring Questionnaires</a> article. </li>\n</ul>\n<p><a name='ConvertScopes'></a></p>\n<p><strong>3. Question: </strong>I’ve converted my template to a scope. What should I do next?</p>\n<p><strong>Answer: </strong>Now that you have converted your template to a scope, the next step is to complete a scope self-assessment for the scoped requirements. The scope self-assessment can help you see how much progress your organization has made in meeting the requirements for the scope. This information can help you determine which requirements you can quickly create controls for in your platform and which requirements your organization will need to work on.  </p>\n<p>For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360036241614' target='_self'>How to Complete a Scope Self-Assessment</a> article.</p>\n<p><a name='AddReqstoScope'></a></p>\n<p><strong>4. Question: </strong>How do I map requirements to my scope?</p>\n<p><strong>Answer:</strong> To learn how to map existing requirements to a scope, see the <a href='https://support.knowbe4.com/hc/en-us/articles/4405055443091#MAPPING' target='_self'>Mapping Requirements to Scopes</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/4405055443091' target='_self'>How to Add and Remove Scoped Requirements</a> article. To learn how to create requirements for a scope, see the <a href='https://support.knowbe4.com/hc/en-us/articles/4405055443091#CREATING' target='_self'>Creating Requirements for Scopes</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/4405055443091' target='_self'>How to Add and Remove Scoped Requirements</a> article.</p>\n<p><a name='DefaultID'></a></p>\n<p><strong>5. Question: </strong>When uploading or creating a new requirement, what is the default ID Separator?</p>\n<p><strong>Answer: </strong>When you add new requirements to your platform, you can set the type of character to use between the numbers or letters that make up your <strong>Requirement ID</strong><em>. </em>This character is known as the<strong> ID Separator</strong>. The <strong>Requirement ID</strong> is a combination of the requirement's <strong>Primary ID</strong> and <strong>Sub ID</strong>. The <strong>ID Separator</strong> will display between the <strong>Primary ID</strong> and <strong>Sub ID</strong>.</p>\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> The <strong>Requirement ID</strong> determines the order that your requirements will display in templates and scopes. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360045245034' target='_self'>How to Create Custom Templates for Scopes</a> article.</div>\n</div>\n<p>To set the ID separator character, you will select one of the following options from the <strong>ID Separator</strong> drop-down menu:</p>\n<ul role='list'>\n<li><strong>Space Separated ( )</strong></li>\n<li><strong>Comma Separated (,)</strong></li>\n<li><strong>Dash Separated (-)</strong></li>\n<li><strong>Dot Separated (.)</strong></li>\n</ul>\n<p>If you do not select a seperator from this drop-down menu, the default separator will be used. If your <strong>Primary ID</strong> and <strong>Sub IDs</strong> only contain numbers, the default separator will be a period. If your <strong>Primary ID</strong> and <strong>Sub IDs</strong> contain numbers and letters, the default separator will be a space.</p>\n<p><a name='ExportScope'></a></p>\n<p><strong>6. Question:</strong> Can I download a report of my scope with control, task, and evidence details? </p>\n<p><strong>Answer:</strong> Yes. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360055471473' target='_blank' rel='noopener noreferrer'>How to Export Scope Information</a> article.</p>\n<p><a name='RemoveScopes'></a></p>\n<p><strong>7. Question: </strong>How do I completely remove all scopes and controls in our account? </p>\n<p><strong>Answer: </strong>To remove controls and scopes from your account, follow the steps listed below:</p>\n<p>First, delete your controls by following the steps below:</p>\n<ol role='list'>\n<li>From your navigation panel, select the <strong>Controls</strong> tab. </li>\n<li>Select a control name to open a control. \n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong>When deleting multiple controls, we recommend right-clicking the control name and opening the control in a new tab or window, instead.</div>\n</div>\n</li>\n<li>Click the <strong>Delete </strong>button at the top of the page. Once prompted, click <strong>Delete</strong>.</li>\n<li>Repeat these steps as needed.</li>\n</ol>\n<p>Next, delete your scopes by following the steps below:</p>\n<ol role='list'>\n<li>From your navigation panel, navigate to <strong>Compliance</strong> &gt; <strong>Scopes</strong>. </li>\n<li>In the <strong>Actions</strong> column of the <strong>View All Scopes</strong> page, click the trash can icon next to the scope that you would like to delete. When you click this button, a pop-up window will open to confirm whether you would like to delete the selected controls. </li>\n<li>In the pop-up window that opens, enter <strong>DELETE</strong> into the field to confirm the deletion.</li>\n<li>Click the <strong>Delete</strong> button.</li>\n<li>Repeat these steps as needed.</li>\n</ol>\n<p>You can also archive your controls and scopes, which would allow you to retain information while still hiding the controls and scopes from your account. To archive the controls in scopes instead, click the <strong>Archive</strong> button or icon, instead of the <strong>Delete </strong>button or icon.</p>\n<p><a name='CONTROLS_TASKS'></a></p>\n<h2 id='h_01HQKJQRAGK1EJNXZJPYAH27YW'>Controls and Tasks</h2>\n<p>To learn about working with controls and tasks in your KCM GRC platform, see the questions below: </p>\n<p><a href='#ControlandTask'>1. What is the difference between a control and a task?</a></p>\n<p><a href='#Control_Health'>2. What is Control Health?</a></p>\n<p><a href='#AssignTask'>3. How do I create and assign a task schedule?</a></p>\n<p><a href='#TaskRemind'>4. What is the KCM GRC task reminder email schedule?</a></p>\n<p><a href='#TaskPastDueFail'>5. When is a control task considered \"Past Due\" or \"Failed\"?</a></p>\n<p><a href='#PullReport'>6. How can I see a list of which tasks are not 100% compliant?</a></p>\n<p><a href='#Archive_Delete'>7. What is the difference between archiving and deleting a control?</a><a name='ControlHealth'></a></p>\n<p><a name='ControlandTask'></a></p>\n<p><strong>1. Question:</strong> What is the difference between a control and a task? </p>\n<p><strong>Answer: </strong>A control is an action or procedure that you are taking to ensure that you are meeting the associated requirement or requirements.You assign a task schedule to a control. The task schedule determines how often your organization must provide evidence to prove that you're meeting the control. By meeting a control, you are proving that your organization is either partially or fully satisfying the requirement or requirements that are mapped to the control.To learn more, see our definitions of <a href='https://support.knowbe4.com/hc/en-us/articles/115016129608-KCM-GRC-Glossary-of-Compliance-Terms#Controls' target='_self'>Controls</a> and <a href='https://support.knowbe4.com/hc/en-us/articles/115016129608-KCM-GRC-Glossary-of-Compliance-Terms#Tasks' target='_self'>Tasks</a> in our <a href='https://support.knowbe4.com/hc/en-us/articles/115016129608-KCM-GRC-Glossary-of-Compliance-Terms' target='_self'>Glossary of Compliance Terms</a>. Additionally, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360050048234-KCM-GRC-Working-With-Task-Schedules-for-Controls' target='_self'>How to Work with Tasks and Task Schedules for Controls</a> article. </p>\n<p><a name='Control_Health'></a></p>\n<p><strong>2. Question</strong>: What is Control Health?</p>\n<p><strong>Answer</strong>: Control Health is the percentage of a control's scheduled tasks that are complete. To learn how Control Health is calculated, see the Control Health definition in the <a href='https://support.knowbe4.com/hc/en-us/articles/115016129608#CONTROLS' target='_self'>Controls</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/115016129608' target='_self'>Glossary of Compliance Terms</a>.</p>\n<p><a name='AssignTask'></a></p>\n<p><strong>3. Question:</strong> How do I create and assign a task schedule?</p>\n<p><strong>Answer:</strong> To learn how to create and assign task schedules, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360050048234' target='_self'>How to Work with Tasks and Task Schedules for Controls</a> article.</p>\n<p><a name='TaskRemind'></a></p>\n<p><strong>4. Question: </strong>What is the KCM GRC task reminder email schedule?</p>\n<p><strong>Answer: </strong>When you've assigned a user to a task, the console will automatically send reminder notifications to the <strong>User Assigned</strong> before the task evidence is due. To learn more about the task reminder emails, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360052578153-KCM-GRC-Email-Notifications-and-the-Email-Digest#CONTROL-NOTIFICATIONS' target='_self'>Control Task Notifications</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360052578153-KCM-GRC-Email-Notifications-and-the-Email-Digest' target='_self'>Email Notifications and the Email Digest</a> article. </p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> If a user is set to receive multiple notifications in one day, these notifications are combined into one email digest with the subject line: \"KCM GRC Email Digest\". For example, if a user is assigned to multiple tasks that are due on the same day, they will receive one email which will include reminders for each of the tasks that are due that day.</div>\n</div>\n<p><a name='TaskPastDueFail'></a></p>\n<p><strong>5. Question:</strong> When is a control task considered <strong>Past Due</strong> or <strong>Failed</strong>?</p>\n<p><strong>Answer:</strong> You can create and assign various <a href='https://support.knowbe4.com/hc/en-us/articles/360050048234-KCM-GRC-Working-With-Task-Schedules-for-Controls#DifferentTypesOfTasks' target='_self'>types of tasks</a> to ensure that you are maintaining your organization's compliance controls. For both one-time tasks and task schedules, if the assigned user does not mark a task as complete before the task's due date, the following will occur:</p>\n<ul role='list'>\n<li>One day past the due date, the task's status will change to <strong>Past Due</strong>.</li>\n<li>Seven days past the due date, the task's status will change to <strong>Failed</strong>.</li>\n</ul>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong> By default, tasks will remain in the <strong>Past Due</strong> status for seven days. If you would like to change the length of time that tasks are <strong>Past Due</strong> before they change to <strong>Failed</strong>, you can modify the <strong>Task Fail Interval</strong> setting under your <strong>Account Settings</strong> area. To learn more, see our <a href='https://support.knowbe4.com/hc/en-us/articles/115016049347' target='_self'>How to Manage Your KCM GRC Account Settings</a> article.</div>\n</div>\n<p>For more information about creating one-time tasks and task schedules, see our <a href='https://support.knowbe4.com/hc/en-us/articles/360050048234' target='_self'>How to Work with Tasks and Task Schedules for Controls</a>.</p>\n<p><a name='PullReport'></a></p>\n<p><strong>6. Question: </strong>How can I see a list of which tasks are not 100% compliant? </p>\n<p><strong>Answer: </strong>Tasks that are not compliant are tasks that are not in the <strong>Satisfied </strong>status. To view a list of tasks that are not in this status, see the steps below:</p>\n<ol role='list'>\n<li>Navigate to the <strong>Tasks</strong> page by selecting <strong>Tasks</strong> from the navigation panel.</li>\n<li>From the <strong>Status</strong> column, click the drop-down menu and select the following statuses:\n<ul role='list'>\n<li><strong>Active</strong></li>\n<li><strong>Failed</strong></li>\n<li><strong>Past Due</strong></li>\n</ul>\n</li>\n<li>The page will show all incomplete tasks that are either coming due or have passed their due date.\n<div class='callout-tip'>\n<div class='callout__content'>\n<strong>Tip:</strong> If you would also like to view a list of the tasks that are complete but are still waiting for approval from a manager, click the drop-down menu from the <strong>Approval Stage</strong> column and select <strong>Awaiting Approval</strong>.</div>\n</div>\n</li>\n</ol>\n<p><a name='Archive_Delete'></a></p>\n<p><strong>7. Question:</strong> What is the difference between archiving and deleting a control? </p>\n<p><strong>Answer:</strong> If you would like to keep a record of the control evidence or if you believe it could be used again with a different requirement, you should archive the control instead of deleting the control. If you archive the control, the control task schedules will be deleted from the <strong>Task Schedules</strong> tab. However, if you unarchive the control, the control tasks, evidence, control documents, requirement mappings, risk mappings, and the control's health score will still be associated with the control. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/4405773349395' target='_self'>Archiving Items Guide</a>.</p>\n<p>If the control was created by accident or if it is not sufficient for any further compliance efforts, you can permanently delete it. For more information, see the <a href='https://support.knowbe4.com/hc/en-us/articles/360045177593#DELETE' target='_self'>Deleting Controls in Bulk</a> section of our <a href='https://support.knowbe4.com/hc/en-us/articles/360045177593' target='_self'>How to Use Controls in Your KCM GRC Platform</a> article.</p>\n<div class='callout-warning'>\n<div class='callout__content'>\n<strong>Important:</strong> Deleting controls is a permanent, irreversible action. </div>\n</div>\n<p><a name='EVIDENCE'></a></p>\n<h2 id='h_01HQKJQRAHVQXMTNK7P11DM04E'>Evidence and Files</h2>\n<p>For information about submitting evidence and files in your KCM GRC platform, see the questions below:</p>\n<p><a href='#FileUploads'>1. Do control task evidence files need to meet any specific requirements?</a></p>\n<p><a href='#EvidenceandPolicies'>2. How will my control evidence and other files be stored when uploaded to KCM GRC?</a></p>\n<p><a href='#Links'>3. Is there a character limit for links that are submitted as evidence?</a></p>\n<p><a href='#Evidence_Link'>4. What types of evidence can I link when I submit evidence for tasks?</a></p>\n<p><a href='#MIMETypes'>5. What MIME types (media types) are allowed to be uploaded as control documents or evidence?</a></p>\n<p><a href='#PREVIEW'>6. Why can't I preview evidence in Microsoft Edge?</a></p>\n<p><a href='#JIRA_FILE' target='_self'>7. What if the evidence uploaded to Jira issues doesn't meet KCM GRC's file requirements?</a></p>\n<p><a name='FileUploads'></a></p>\n<p><strong>1. Question:</strong> Do control task evidence files need to meet any specific requirements?</p>\n<p><strong>Answer:</strong> Evidence files for control tasks need to meet the requirements listed below:</p>\n<ul role='list'>\n<li>\n<strong>File Size:</strong> Minimum of 1B, maximum of 50MB</li>\n<li>\n<strong>File Name:</strong> Maximum of 250 characters (including the file extension)</li>\n<li>\n<strong>Accepted File Types:</strong> .png, .jpg, .jpeg, .gif, .bmp, .tif, .tiff, .pdf, .txt, .rtf, .eml, .msg, .csv, .doc, .docx, .xls, .xlsx, .ppt, .pptx, .zip, .gzip, .7z, .gz, .tar, .tgz, and .nrl</li>\n</ul>\n<p><a name='EvidenceandPolicies'></a></p>\n<p><strong>2. Question:</strong> How will my control evidence and other files be stored when uploaded to KCM GRC?</p>\n<p><strong>Answer:</strong> For files that are uploaded to your account, KCM GRC uses Amazon S3 for storage. Therefore, KCM GRC leverages AWS for data encryption in transit (TLS) and at rest (AES-GCM 256). For more information about the security of KnowBe4's products, see the <a href='https://www.knowbe4.com/security' target='_self'>KnowBe4 Security page</a>. </p>\n<p><a name='Links'></a></p>\n<p><strong>3. Question:</strong> Is there a character limit for links that are submitted as evidence?</p>\n<p><strong>Answer:</strong> If you submit a link as evidence for a control task, the <strong>Link</strong> field has a maximum character limit of 2000 characters.</p>\n<p><a name='Evidence_Link'></a></p>\n<p><strong>4. Question</strong>: What types of evidence can I link when I submit evidence for tasks?</p>\n<p><strong>Answer</strong>: You can submit any links as long as the links include one of the protocols listed below:</p>\n<ul role='list'>\n<li>https://</li>\n<li>http://</li>\n<li>ftp://</li>\n<li>sftp://</li>\n<li>file:\\\\\\</li>\n<li>file://</li>\n</ul>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>If you submit links to local files, you will not be able to open the links by clicking the file name or <strong>link</strong> icon. Instead, you will need to right-click the file name and copy the link address. Then, open a new window in your browser and paste the link into the address bar.If you submit links to Jira issues, you must have access to Jira in order to open the links and view the evidence.</div>\n</div>\n<p><a name='MIMETypes'></a></p>\n<p><strong>5. Question: </strong>What MIME types (media types) are allowed to be uploaded as control documents or evidence?</p>\n<p><strong>Answer: </strong>Only the following MIME types are allowed:</p>\n<ul role='list'>\n<li>application/msword</li>\n<li>application/cdfv2-encrypted</li>\n<li>application/cdfv2-unknwon</li>\n<li>application/gip</li>\n<li>application/octet-stream</li>\n<li>application/rtf</li>\n<li>application/tar</li>\n<li>application/tar+gzip</li>\n<li>application/vnd.mms-excel</li>\n<li>application/vnd.ms-outlook</li>\n<li>application/vnd.ms-powerpoint </li>\n<li>application/vnd.msoutlook</li>\n<li>application/vnd.openxmlformats-officedocument.spreasdheetml.sheet</li>\n<li>application/vnd.openxmlformats-officedocument.wordpressingml.document</li>\n<li>application/x-7z-compresssed</li>\n<li>application/x-gzip</li>\n<li>application/x-zip-compressed</li>\n<li>application/zip</li>\n<li>application/vnd.openxmlformats-officedocument.presentationml.presentation</li>\n<li>applicaton/pdf</li>\n<li>image/bmp</li>\n<li>image/gif</li>\n<li>image/jpeg</li>\n<li>image/png</li>\n<li>image/tiff</li>\n<li>image/x-bmp</li>\n<li>image/x-ms-bmp</li>\n<li>image/x-tiff</li>\n<li>image/x-windows-bmp</li>\n<li>message/rfc822</li>\n<li>text/csv</li>\n<li>text/html</li>\n<li>text/plain</li>\n<li>text/rtf</li>\n</ul>\n<p>For more information on MIME types, see the <a href='https://en.wikipedia.org/wiki/Media_type' target='_self'>Wikipedia entry on Media Types</a>.</p>\n<p><a name='PREVIEW'></a></p>\n<p><strong>6. Question: </strong>Why can't I preview evidence in Microsoft Edge?</p>\n<p><strong>Answer:</strong> First, we recommend that you check your pop-up settings. Pop-ups will need to be enabled before you can preview evidence in your browser. </p>\n<p>If the file is trying to open in Microsoft Office instead of the browser, you will need to disable the Microsoft Office setting in Microsoft Edge. To disable this setting, navigate to your Microsoft Edge browser settings, and select the <strong>Download </strong>tab. Then, click the <strong>Open Office files in the browser</strong> toggle to disable this setting. </p>\n<p><a name='JIRA_FILE'></a></p>\n<p><strong>7. Question:</strong> What if the evidence uploaded to Jira issues doesn't meet KCM GRC's file requirements?</p>\n<p><strong>Answer: </strong>If this evidence doesn't meet our <a href='#FileUploads' target='_self'>file requirements</a>, a note will be added to the <strong>Notes</strong> widget of the <strong>View Task</strong> page. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KCM/Jira+Integration/Jira+integration_file+evidence+not+supported.png'><img src='https://helpimg.s3.amazonaws.com/KCM/Jira+Integration/Jira+integration_file+evidence+not+supported.png' alt='File evidence not supported'></a></p>\n<p>A link to the associated Jira issue will also be added to the <strong>Supporting Evidence </strong>section of the page, instead of the evidence file. To view this evidence, you'll need to navigate to the Jira issue.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360001464847-Frequently-Asked-Questions-FAQ-for-KCM-GRC"
  }
}