{
  "article": {
    "id": 360041405954,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360041405954.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360041405954.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 6,
    "section_id": 360000156928,
    "created_at": "2020-01-15T21:14:52Z",
    "updated_at": "2025-03-11T17:25:14Z",
    "name": "FAQ: RanSim ",
    "title": "FAQ: RanSim ",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:25:14Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "Lead Generator",
      "answerbot"
    ],
    "body": "<p>In this article, you’ll find frequently asked questions (FAQs) about our RanSim tool.</p>\n<p>For general information about RanSim, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/229040167.html' target='_self'>RanSim Product Manual</a>.</p>\n<h2 id='iv_h_01HSE9CE972QDZK9J7YJ2J7KQ3'>General Information</h2>\n<ol>\n<li>Does RanSim simulate the behavior of real ransomware attacks? What are some examples of real ransomware with similar behavior?\n<p>Yes, RanSim simulates real ransomware behavior, with minor differences. For example, the encryption keys and algorithms that we use in RanSim are different from the encryption keys and algorithms used in real ransomware.</p>\n<p>For more information about RanSim’s ransomware scenarios and false positive scenarios, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/229040167.html' target='_self'>RanSim Product Manual</a>.</p>\n</li>\n<li>Does RanSim collect any information about my computer?\n<p>The only information RanSim collects is the number of files on your local disks that contain extensions that may be vulnerable to real ransomware attacks.</p>\n</li>\n<li>On the <strong>KnowBe4 RanSim</strong> results window, what does the <strong>Executed</strong> label mean? How is this label different from the <strong>Vulnerable</strong> or <strong>Not Vulnerable</strong> labels?\n<p>The <strong>Executed</strong> label indicates false positive scenarios that were not blocked by your endpoint protection software. If your endpoint protection software is working properly, the <strong>Executed</strong> label will display next to both of the false positive scenarios.</p>\n<p>The <strong>Vulnerable</strong> and <strong>Not Vulnerable</strong> labels indicate the results of the ransomware scenarios instead of the false positive scenarios. The <strong>Vulnerable</strong> label will display next to any ransomware scenario that failed the RanSim test and could be vulnerable to a real ransomware attack. The <strong>Not Vulnerable</strong> label will display next to any ransomware scenario that did not fail the RanSim test and should be safe from a real ransomware attack.</p>\n</li>\n<li>Can I use RanSim to test my own files? For example, can I test my own documents or photos?\n<p>Yes, you can test your own files after your first RanSim scan.</p>\n<p>To test your own files, follow the steps below:</p>\n<ol role='list'>\n<li>At the top-right corner of the <strong>KnowBe4 RanSim</strong> window, click <strong>click here</strong> in the <strong>Optionally, click here to copy your own test files to the test files folder.</strong> section.  <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/ransim/RanSim_clickhere.png'><img src='https://helpimg.s3.amazonaws.com/ransim/RanSim_clickhere.png' alt=' ' width='309' height='265'></a>\n</li>\n<li>When prompted, select the files you would like to copy to the <strong>%systemdrive%\\KB4\\Newsim|DataDir\\TestFiles</strong> folder.</li>\n</ol>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>You can add up to 50 files. The file size limit for each file is 10 MB.</div>\n</div>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong>Ensure that you are making copies of these files rather than moving them. If you uninstall RanSim in the future, all files in the <strong>%systemdrive%\\KB4\\Newsim|DataDir\\TestFiles</strong> folder will be deleted.</div>\n</div>\n<p>After you copy the files and add them to the test folder, you can run additional RanSim scans on those files.</p>\n</li>\n<li>When I use RanSim, will any network connections be created? If so, what are these network connections used for?\n<p>There is one RanSim ransomware scenario that attempts to open an HTTP connection to 127.0.0.1, port 23054 to send a message containing the encryption key.</p>\n</li>\n</ol>\n<h2 id='iv_h_01HSE9CE97ZKFKWETHS3BW3TP3'>Antivirus Software</h2>\n<ol>\n<li>My antivirus software flagged my <strong>SimulatorSetup.exe</strong>, <strong>MainStarter.exe</strong>, <strong>Collector.exe</strong>, or <strong>SimulatorSetup.exe</strong> file as malicious. What should I do?\n<p>These files do not contain dangerous code and should be allowed to run. You can consider them false positives. However, they will not display in your false positives results. For more information about these files, see the list below:</p>\n<ul role='list'>\n<li>\n<strong>SimulatorSetup.exe:</strong> This file installs RanSim.</li>\n<li>\n<strong>Ranstart.exe:</strong> This file is the RanSim interface.</li>\n<li>\n<strong>MainStarter.exe:</strong> This file prepares the test environment and launches the RanSim scenarios.</li>\n<li>\n<strong>Collector.exe:</strong> This file collects results from each simulation.</li>\n</ul>\n<p>If the files are flagged as malicious, certain antivirus software may provide you with a warning. If you receive a warning, you can let the file run, quarantine it, or block it. Other antivirus software may automatically block and quarantine the file. For more information, see the list below:</p>\n<ul role='list'>\n<li>If your <strong>MainStarter.exe</strong> file or <strong>Collector.exe</strong> file are quarantined before the first RanSim scan, RanSim will attempt to recreate these files when the scan starts. If the files are quarantined again, you will be informed that at least one of the files are missing and advised to ensure they are allowed to run on your computer.</li>\n<li>If your <strong>MainStarter.exe</strong><span> file or </span><strong>Collector.exe</strong><span> file are quarantined during a RanSim scan, the scan will be canceled. RanSim will try to recreate the files and you will be advised to scan again. If the files are blocked again, RanSim will not attempt to recreate the files. Instead, you will be asked to ensure the files are allowed to run and then restart RanSim to scan again.</span>\n</li>\n</ul>\n</li>\n<li>My antivirus software did not flag the <strong>MainStarter.exe</strong> file or the <strong>SimulatorSetup.exe</strong> file as malicious. However, during a RanSim scan, my antivirus software flagged one or more of the test files as malicious. What should I do?\n<p>This behavior is intended. If your antivirus software flags test files as dangerous or malicious, that means your antivirus software is working properly. If your antivirus software blocks or quarantines the test files during a RanSim scan, your antivirus software may successfully block or quarantine ransomware during a real attack.</p>\n</li>\n<li>What happens if my antivirus software flags my RanSim installation file as malicious?\n<p>Most antivirus software that we have tested do not flag the RanSim installation file as malicious. However, if the file is flagged, you should add the file to the whitelist for your antivirus software. Then, you can attempt to install RanSim again.</p>\n</li>\n<li>Windows Security flagged my <strong>ransim.zip</strong> file as malicious and will not allow me to open the file. What should I do?</li>\n</ol>\n<p>To open this file, you can add an exclusion to your Windows Security settings. For more information, see Microsoft's <a href='https://support.microsoft.com/en-us/windows/add-an-exclusion-to-windows-security-811816c0-4dfd-af4a-47e4-c301afe13b26#ID0EBF=Windows_11' target='_blank' rel='noopener'>Add an exclusion to Windows Security</a> article.</p>\n<h2 id='iv_h_01HSE9CE9718YQ0W3J8VMBDFYC'>RanSim Files</h2>\n<ol>\n<li>When I install RanSim, where will my RanSim files be located?\n<p>All files will be located in the installation folder, <strong>c:\\KB4\\Newsim</strong> or <strong>%systemdrive%\\KB4\\Newsim</strong>.</p>\n<p>If you uninstall RanSim, the installation folder will be removed from your computer.</p>\n</li>\n<li>What subfolders will be located in my <strong>\\KB4\\Newsim</strong> installation folder?\n<p>To learn about the subfolders that will be located in your<strong> \\KB4\\Newsim</strong> installation folder, see the table below:</p>\n<table>\n<thead>\n<tr>\n<th scope='col'>Subfolder Name</th>\n<th scope='col'>Subfolder Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\\Newsim\\DataDir</td>\n<td>This subfolder represents the simulated environment created by RanSim.</td>\n</tr>\n<tr>\n<td>\\Newsim\\DataDir\\TestFiles</td>\n<td>This subfolder contains the test files for the RanSim simulations.</td>\n</tr>\n<tr>\n<td>\\Newsim\\DataDir\\MainTests\\xx</td>\n<td>\n<p>Each RanSim scenario has a subfolder with related test files. The subfolder for each scenario is assigned a number.</p>\n<p>For more information about RanSim scenarios, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/229040167.html' target='_self'>RanSim Product Manual</a>.</p>\n</td>\n</tr>\n<tr>\n<td>\\Rassim\\DataDir\\Tests\\xx-Tests</td>\n<td>\n<p>Each RanSim scenario has a subfolder that contains copies of the test files from the scenario’s <strong>\\Newsim\\DataDir\\MainTests\\xx</strong> test files.</p>\n<p>For more information about RanSim scenarios, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/229040167.html' target='_self'>RanSim Product Manual</a>.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>What file extension is used for the RanSim scenarios?\n<p>The RanSim scenarios use a .cxp file extension.</p>\n</li>\n<li>What registry keys are created, and where are they located in my registry? If I uninstall RanSim, will these registry keys be removed?\n<p>In addition to any entries managed by the <strong>msinstaller</strong>, RanSim will create the <strong>HKEY_CURRENT_USER\\SOFTWARE\\KnowBe4 Ran Simulator</strong> registry key. If you uninstall RanSim, this registry key will be removed.</p>\n</li>\n<li>Are any log files generated when I use RanSim? If so, will any entries be added to the Windows Event Log?\n<p>In the RanSim logs directory, there are a few CSV files that contain internal information. However, RanSim does add any entries to the Windows Event Log.</p>\n</li>\n</ol>",
    "user_segment_ids": []
  }
}