{
  "article": {
    "id": 360037393134,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360037393134.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360037393134.html",
    "author_id": 368027116814,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 3,
    "vote_sum": 14,
    "vote_count": 18,
    "section_id": 26429831617683,
    "created_at": "2019-10-24T17:49:13Z",
    "updated_at": "2025-09-29T14:38:46Z",
    "name": "Security Culture Survey (SCS) Overview",
    "title": "Security Culture Survey (SCS) Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-19T19:09:28Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "training",
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>You can assign a Security Culture Survey (SCS) organizational assessment to your users to assess your organization's security culture. Security culture is defined as the ideas, customs, and social behaviors that impact your organization’s security.</p>\n<p>Your survey results will provide you with an overview of the seven dimensions that make up your security culture and an overall security culture score for your organization. You can use this information to establish a baseline for your security culture, to determine the changes you need to make to your security protocols, and to measure how your security culture evolves over time.</p>\n<p>To develop the questions in this survey, we used a scientific research approach. For more information about how these questions were created and why we use the seven dimensions, see our <a href='https://helpimg.s3.amazonaws.com/KMSAT/assessments/KB4_SecurityCultureSurvey.pdf' target='_blank' rel='noopener'>KnowBe4 Security Culture Survey</a> technical document.</p>\n<p>In this article, you'll learn how to use the SCS and how to review your organization’s survey results. For more information about how to use organizational assessments effectively, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360024195754.html'>How to Use Organizational Assessments</a> article.</p>\n<h2 id='h_01HS1TK8JQF5ZAD3A1PGWXP4CH'>Best Practices</h2>\n<p>We recommend that you assign the Security Culture Survey to your users after their first 90 days of employment. We recommend that you wait at least 90 days to ensure that your users have adjusted to your organization's security culture. After the first survey, you should continue to assess your users once per year. If you assess your users once per year, you will be able to see how your organization's security culture changes over time.</p>\n<h2 id='h_01HS1TK8JQWRQRVEE68825ZB77'>Assigning Organizational Assessments</h2>\n<p>To assign an organizational assessment, add the assessment through the ModStore by searching for assessments and clicking the <strong>+ Add to Library</strong> button. Then, you can create a training campaign with the assessment as the selected content by following the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 console and navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>Click <strong>+ Create Training Campaign</strong>.</li>\n<li>From the <strong>Content</strong> drop-down menu, select the assessment you'd like to assign.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/assessments/add_assessment.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/assessments/add_assessment.png' alt=' '></a></p>\n</li>\n<li>Fill out all required fields for the campaign. For more information on how to create a new campaign, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/204948207.html'>Creating and Managing Training Campaigns</a> article.</li>\n<li>Click <strong>Create Campaign</strong>.</li>\n</ol>\n<h2 id='h_01HS1TK8JQTN26YW3MSP1KW187'>Completing the Security Culture Survey in the Learner Experience</h2>\n<p>To complete the Security Culture Survey, your users will log in to their Learner Experience (LX) and click the <strong>Training</strong> tab. Then, they'll locate the Security Culture Survey and click <strong>Start</strong>.</p>\n<p>After they click Start, your users have the option to either start the survey or complete the survey later. If the user clicks <strong>Take Survey Now</strong>, they must answer all 32 questions to complete the survey. If the user does not have time to take the survey immediately, we recommend they click <strong>Come Back Later</strong> when they have time to take the full survey.</p>\n<p>After your users complete the survey, they will be directed to a thank-you page.</p>\n<p>On this thank you page, your users will also have the opportunity to submit anonymous feedback. This feedback can be downloaded from the <strong>Assessment Results</strong> tab of the campaign. For more information about downloading user feedback, see the <a href='#h_01HS1TK8JRMDDRVGV4P4R2HX2R'>Survey Culture Survey Results</a> section below.</p>\n<h2 id='h_01HS1TK8JRCEY9D6S6XVDG3G96'>Monitoring Your Security Culture Survey Campaign</h2>\n<p>After you assign the Security Culture Survey to your users, you can view your users' progress. To view your users' progress, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 account and navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>On the <strong>Campaigns</strong> subtab, click the name of the campaign in which the survey was assigned.</li>\n<li>On the <strong>Campaign Overview</strong> page, find the survey and click <strong>User Progress</strong> under the survey title.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Assessments/SCS_UserProgressButton.png'><img src='https://helpimg.s3.amazonaws.com/Assessments/SCS_UserProgressButton.png' alt=' '></a></p>\n</li>\n</ol>\n<p>From the <strong>Users</strong> page, you can see information about your users' progress, including when they were enrolled in the survey campaign, if they've started the survey, and how much time they've spent on the survey. See below for more information about the <strong>Users</strong> page:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Assessments/SCS+Test.png'><img src='https://helpimg.s3.amazonaws.com/Assessments/SCS+Test.png' alt=' '></a></p>\n<ol>\n<li>\n<strong>Download CSV</strong>: Click this button to download a CSV file of the information displayed in the table below.</li>\n<li>\n<strong>Actions</strong>: Click this drop-down menu to select the action you'd like to perform on the selected user or users. Options include:\n<ul>\n<li>\n<strong>Send Notification</strong>: Send a manual notification to the user about their survey.</li>\n<li>\n<strong>Mark as Completed</strong>: Manually mark the user's survey as complete.</li>\n<li>\n<strong>Reset Progress</strong>: Allow the user to restart the survey.</li>\n</ul>\n</li>\n<li>\n<strong>Enrollment Date</strong>: Displays the date when the user was enrolled in the survey campaign.</li>\n<li>\n<strong>Content Started</strong>: Displays a check mark if the user started their survey.</li>\n<li>\n<strong>Time Spent</strong>: Shows how much time the user spent taking the survey.</li>\n<li>\n<strong>Time Remaining</strong>: Shows how much time the user has remaining to take the survey before the due date.</li>\n</ol>\n<p>For more information about managing your users' progress, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360053311074.html'>User Training Progress</a> article.</p>\n<h2 id='h_01HS1TK8JRMDDRVGV4P4R2HX2R'>Security Culture Survey Results</h2>\n<p>After your users take their Security Culture Survey, you will be able to see the survey results. To view your organization's survey results, follow the steps below:</p>\n<ol>\n<li>Log in to your KnowBe4 account and navigate to <strong>Training</strong> &gt; <strong>Campaigns</strong>.</li>\n<li>On the <strong>Campaigns</strong> subtab, click the name of the campaign in which the survey was assigned.</li>\n<li>On the <strong>Campaign Overview</strong> page, find the survey and click <strong>Assessment Results</strong> under the survey’s title.</li>\n</ol>\n<p>On the<strong> Assessment Results</strong> page, you can view your Security Culture Score. This score is the average score for your organization’s Security Culture Survey results. Under this score, you can also view the Security Culture Index. This index shows you if your organization’s security culture score is considered Excellent, Good, Moderate, Mediocre, or Poor.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> Your Security Culture Score includes users who are enrolled in the Security Culture Survey, but have not completed the survey. These incomplete surveys will lower your organization’s Security Culture Score. For best results, encourage your users to complete the survey as soon as they can.</div>\n</div>\n<p>On the <strong>Assessment Results</strong> page, you can also view the Results by Dimension graph. This graph shows your organization’s Security Culture Survey results by dimension. The seven dimensions are listed below:</p>\n<ul>\n<li>Cognition</li>\n<li>Behavior</li>\n<li>Responsibility</li>\n<li>Compliance</li>\n<li>Attitudes</li>\n<li>Communication</li>\n<li>Norms</li>\n</ul>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/assessments/cultureresults.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/assessments/cultureresults.png' alt=' '></a></p>\n<p>In the <strong>Security Culture Dimensions</strong> section at the bottom of the page, you can learn more about each dimension. These dimensions are presented in the order of your organization’s highest-scoring to lowest-scoring dimension. To learn more about a specific dimension, click the plus (<strong>+</strong>) button next to the dimension name. For more information about these dimensions and what you can do to change your score for each dimension, see our <a href='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/assessments/CLTRe-TheSevenDimensionsSecurityCulture-Research-Paper2.pdf' target='_blank' rel='noopener'>The seven dimensions of security culture</a> document. For more information about the Security Culture Index, see our <a href='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/assessments/Security-Culture-Survey-Index-Explainer-CLTRe_EN-US.pdf' target='_blank' rel='noopener'>The Security Culture Index</a> document.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong> In the dimension description, you can also learn tips for improving your security culture score for that dimension. To find the tip, look for the lightbulb icon in the dimension description.</div>\n</div>\n<p>Beneath the <strong>Results by Dimensions</strong> radar graph, you have the option to click the <strong>Download User Feedback</strong> button. You can click this button to export a CSV file of any feedback your users provided at the end of their survey.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong> On your <strong>Dashboard</strong>, review the <strong>Security Culture Survey</strong> widget to compare your organization's SCS score to others in your industry. See our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360000309628.html'>Industry Benchmarking</a> article for more information.</div>\n</div>\n<h2 id='h_01J17P7ADDAXD2AMDNMVEP3E74'>2025 SCS Update</h2>\n<p>While the Security Culture Survey was originally released in 2020, we released a revised version in 2025 that includes improvements to the questions for the specific dimensions.</p>\n<p>Based on feedback and research, KnowBe4 has updated all included questions and answers for clarity and relevance. Specifically, the survey responses were updated to be more semantically appropriate, timely, and improved for content validity.</p>\n<p>For this version of the Security Culture Survey, we ensured that each assessment a user receives includes three to six questions per individual dimension, each covering a different aspect of a particular dimension. We evaluated the quality of our items following a rigorous scientific method, using customer data from various industries and cultures worldwide.</p>\n<p>For more information about the Security Culture Survey update, please see our <a href='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/assessments/KB4_SecurityCultureSurvey2.pdf' target='_blank' rel='noopener noreferrer'>Security Culture Survey (SCS) Version 2</a> technical document.</p>",
    "user_segment_ids": []
  }
}