{
  "article": {
    "id": 360052712314,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360052712314.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360052712314.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 4,
    "vote_sum": 3,
    "vote_count": 3,
    "section_id": 27814553697939,
    "created_at": "2020-08-25T16:27:42Z",
    "updated_at": "2024-04-18T23:28:39Z",
    "name": "FAQ: Adding Languages to the Phish Alert Button (PAB)",
    "title": "FAQ: Adding Languages to the Phish Alert Button (PAB)",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-04-18T23:28:39Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "phish alert button",
      "answerbot"
    ],
    "body": "<p>Below are some commonly-asked questions about KnowBe4's Language Aware feature for the Phish Alert Button. If you don't see the answer you need, <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener noreferrer'>submit a ticket to our support team</a>.</p>\n\n<h2 id='h_01HVS4W7BNAA5P3JTN7DSY0A4W'>Can I add new languages if I am using the Phish Alert Button for Exchange, Outlook, or Google Suite?</h2>\n<p>Currently, only the Hybrid PAB (with Microsoft 365) and Gmail Add-on PAB support adding multiple Language settings. If you are using the Exchange, Outlook, or Google Suite versions of PAB, you will only be able to use the default language shown on the Account Settings page. </p>\n\n<h2 id='h_01HVS4XHG1DMHDGWEG9559WGET'>When do I need to update my manifest file?</h2>\n<p>You will need to update your manifest file when you add or remove supported language locales or when you have changed your default language. You do not need to change your manifest file if you have only changed the text in the Confirmation Messages boxes or the PAB icon.</p>\n\n<h2 id='h_01HVS4XWDFSZ7GZ2BC8CRNX04Z'>Can I customize my manifest file and add unsupported languages?</h2>\n<p>Yes! You can customize the manifest and add unsupported languages. However, adding these languages might only change the text used in the manifest file. This does not guarantee that some texts will be affected by changes to your manifest file.</p>\n\n<h2 id='h_01HVS4Y1870Y9CQ95A7F4FVSV4'>My error messages are still showing in English. Why are they not displaying in my default language?</h2>\n<p>Unfortunately, not all error messages in the Phish Alert Button are displayed in the PAB configured, and supported, locale. Only our common error messages, such as <strong>No Headers</strong> and <strong>No Emails to Forward to,</strong> have been translated. Unexpected error messages will be displayed in the locale of the browser or mail client being used. For example, if your browser or mail client is in Japanese but the PAB defaults to English, these error messages will be translated by your browser or mail client.</p>\n\n<h2 id='h_01HVS4Y8JRM3FB4XV5Q8EABMZ6'>Why are there certain languages that have different variations?</h2>\n<p>There are different regions that use different variations of a certain language. Devices are usually set to a certain default language and region. With the Language Aware feature, the priority for languages are as follows:</p>\n<ol role='list'>\n<li>If the language and region used in Outlook was added in during PAB configuration, that language will be displayed.</li>\n<li>If the language and region used in Outlook are not found or added during PAB configuration, the closest language to the root language will be displayed.</li>\n<li>If the language and region and the root language used in Outlook were not found or added during PAB configuration, the selected default language will be displayed.</li>\n</ol>\n<p>The root language is determined by the predetermined default variation of the selected language. For example, the root language for French would be the variation of French that comes from France.</p>\n\n<h2 id='h_01HVS4YH0YZNV8B0P4DYF1QKXQ'>Can I have all of my users use the same language?</h2>\n<p>Yes! Our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360053756533.html' target='_self'>Adding Languages to the Phish Alert Button Guide</a> lists the instructions on how you can set a language as the default language. The default language will be used when neither the language and region and the base language used in your users' Outlook were found or added during the PAB configuration.</p>\n\n<h2 id='h_01HVS4YQ4PRWNR5MMPN71GM8JR'>Is there a limit to the number of languages that I can add to the Phish Alert Button?</h2>\n<p>There is no limit to the number of languages that can be added to during the PAB configuration.</p>\n\n",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360052712314-FAQ-Adding-Languages-to-the-Phish-Alert-Button-PAB"
  }
}