{
  "article": {
    "id": 360036273333,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360036273333.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360036273333.html",
    "author_id": 360322304667,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 2,
    "vote_count": 4,
    "section_id": 26428433532179,
    "created_at": "2019-09-24T12:33:22Z",
    "updated_at": "2025-03-11T17:23:46Z",
    "name": "Landing Page Category Glossary",
    "title": "Landing Page Category Glossary",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:23:46Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "glossary",
      "landing page",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>The below glossary will provide a description of what types of landing pages are in each landing page template category.</p>\n\n<h2 id='h_01HVPCPA1B437ER8F39FH1Y18Z'>Browser Language Detecting</h2>\n<p>When using our standard <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013207193.html' target='_self'>Localized Landing Pages</a>, the user must select their preferred language from a drop-down menu. Browser Language Detecting landing pages look at the user's default language in their browser. Then, the landing page is automatically displayed in the same language.</p>\n<p>Browser Language Detecting landing pages do not include the language drop-down menu that our standard localized landing pages have. Also, if the user’s browser language is not one of our supported languages, then the landing page will display in English (United States).</p>\n<div class='callout-note'><div class='callout__content'>\n<strong>Note:</strong> For best results, please be sure that your browser has been updated to the latest version.</div></div>\n\n<h2 id='h_01HVPCPF37AG05XQKNBZTJAKQT'>Data Breach Phishing</h2>\n<p>This category includes landing pages of organizations involved in a large-scale data breach incident. Each page will test your users to see if they are prone to entering sensitive information. If a user does enter data, then a failure for this action will be recorded in the system.</p>\n<p>This category is intended to be used in conjunction with our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115011714968.html'>Data Breach phishing templates,</a> but they can be used in any type of phishing campaign.</p>\n\n<h2 id='h_01HVPCPJV8K7JM7MAQ7N37GDJX'>Error Pages</h2>\n<p>This category includes common error messages or pages a user may receive when entering incorrect login credentials or visiting a web page that is down.</p>\n\n<h2 id='h_01HVPCPR76TQ3A02JSK561X77H'>Generic</h2>\n<p>This category contains a mixture of landing pages that range from rules to stay safe online to a CAPTCHA robot. Typically, these are informative landing pages that do not include videos or forms.</p>\n\n<h2 id='h_01HVPCPWXWKCZY8SEM5E8GV58B'>Hack Attacks (Use With Caution)</h2>\n<p>This category includes landing pages that mimic classic and newer ransomware attacks. These landing pages may cause users to panic and react unfavorably. So, we recommend this category be used with extreme caution.</p>\n\n<h2 id='h_01HVPCQ04YR1GJGPX7AHMK4KH5'>Holiday/Seasonal</h2>\n<p>This category contains landing pages relevant to popular holidays happening throughout the year.<strong> </strong></p>\n\n<h2 id='h_01HVPCQ3WRJWAJQWNDPG5GAF7Z'>Phishing For Sensitive Information</h2>\n<p>This category contains landing pages that ask your users to enter sensitive information into a form. If a user does enter data, then a failure for this action will be recorded in the system. Visit the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/204446387.html' target='_self'>How to Use Data Entry Landing Pages</a> article for more information about data entry landing pages.</p>\n\n<h2 id='h_01HVPCQ6VDVX36YKAWA1JF8XY4'>Point of Failure Courses</h2>\n<p>This landing page category includes nano-modules that walk your users through a cybersecurity training exercise.</p>\n\n<h2 id='h_01HVPCQB17QP9K1TFYD38RDDJ6'>Point of Failure Video Training</h2>\n<p>This landing page category includes videos that focus on various topics specific to cybersecurity training.</p>\n\n<h2 id='h_01HVPCQH644XWGXKN5X1KPRKN1'>Role-Based</h2>\n<p>This category focuses on five different roles in an organization (Executive/CEO, Finance, Sales, Human Resources, and IT). Each landing page explains why a specific role is a target, potential attacks, and helpful tips to stay safe online.</p>\n\n<h2 id='h_01HVPCQNTXV62NT6M7HW9KHPSG'>SEI (Platinum/Diamond Only)</h2>\n<p>This category contains landing pages that show your users exactly what <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115001904547.html' target='_self'>Social Engineering Indicators</a>, or red flags, they overlooked when they clicked on a simulated phishing email.</p>\n",
    "user_segment_ids": []
  }
}