{
  "article": {
    "id": 360008865254,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360008865254.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360008865254.html",
    "author_id": 21027160967,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 8,
    "vote_count": 10,
    "section_id": 360002057853,
    "created_at": "2018-09-06T13:27:08Z",
    "updated_at": "2025-08-07T15:56:55Z",
    "name": "Domain Doppelgänger Product Manual",
    "title": "Domain Doppelgänger Product Manual",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-05-02T16:57:24Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "doppelganger",
      "Doppelgӓnger",
      "Domain Doppelgӓnger",
      "domain look-alike",
      "evil twin",
      "Domain Doppelganger",
      "Domain Doppeldanger",
      "domain tool",
      "look alike",
      "domain look alike",
      "doppel",
      "dopple",
      "ganger",
      "Lead Generator",
      "answerbot"
    ],
    "body": "<p>Domain Doppelgӓnger is KnowBe4’s web-based tool that performs searches specific to your organization’s domain and collects data on any potentially harmful domains that the bad guys have registered with malicious intent. Since look-alike domains are a potential attack vector for phishing and other social engineering attacks, you can use this tool to monitor for potentially harmful domains that can spoof your website, email addresses, product, or organization name.</p>\n<p>You can sign up for the Domain Doppelgänger analysis <a href='https://www.knowbe4.com/domain-doppelganger' target='_blank' rel='noopener'>here</a>.</p>\n<h2 id='h_01HSE8SDYPF83QXAVP995EVWMV'>Get Started</h2>\n<p>Be sure to fill out the form with your work email address. The domain in this email address will be used for the Domain Doppelgӓnger analysis and the report results will be delivered to this email address.</p>\n<p>If your organization owns multiple domains and/or subsidiaries that you want to run the Domain Doppelgӓnger assessment for, you'll need to submit additional forms using valid and active email addresses at the additional domains.</p>\n<p>After submitting the form, you will receive an email containing your Domain Doppelgӓnger analysis results. The email will contain a PDF report with a summary of the data gathered about your look-alike domains. To fully evaluate the look-alike domains, you'll want to visit the link included in this email.</p>\n<h2 id='h_01HSE8SDYPAWG76S9KQP22G8MP'>Analyze Your Results</h2>\n<p>The Domain Doppelgӓnger analysis searches for all available and purchased domains that are visually similar to your organization's domain, and therefore, fit the criteria of one of our Doppelgӓnger domain <strong>Types</strong>:</p>\n<ul role='list'>\n<li>Hyphenation</li>\n<li>Repetition</li>\n<li>Replacement</li>\n<li>Omission</li>\n<li>Transposition</li>\n<li>Bitsquatting</li>\n<li>Insertion</li>\n<li>Homoglyph</li>\n<li>Vowel-swap</li>\n<li>Addition</li>\n<li>Subdomain</li>\n</ul>\n<h3 id='h_01HSE8SDYPA9JNP40YYY6DVQGK'>Result Categories</h3>\n<p>Both the PDF summary and the detailed Domain Doppelgӓnger analysis results include the number of look-alike domains that fall into one or more of the four categories explained below. From the detailed Domain Doppelgӓnger results, you can click on any of these categories to display the results meeting that category's criteria.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_01.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_01.png' alt='Registered Domains, Private Domains, Mail Servers Available, and Web Servers Available'></a></p>\n\n<p><strong>Registered Domains:</strong> This category represents the number of domain results that have been purchased and registered through a domain name registrar. This number includes both public and privately registered domains.If these domains were not registered for your organization, there's a possibility they were purchased with the intent to spoof your organization as a starting point for a phishing attack. </p>\n<p><strong>Private Domains:</strong> This category represents the number of domain results that have been purchased and registered privately through a domain name registrar. If these privately registered domains were not purchased by your organization, there's a possibility they were purchased with malicious intent. In these scenarios, privately registered domains are typically more difficult to have taken down. </p>\n<p><strong>Mail Servers Available:</strong> The domains included in this category have the ability to send and receive emails. This is determined by the existence of MX records in the Domain Name System (DNS) records (you can find more information on MX Records in the <a href='#h_01HSE8SDYPEG0S5Z95F12CYH07'>table</a> below).If these domains are not owned by your organization, you should consider the threat of phishing attacks from these similar-looking domains.</p>\n<p><strong>Web Servers Available:</strong> Domains included in this category have a web host, meaning a live site may exist at this web address. This is determined by the existence of NS (Name Server) records in the DNS records (you can find more information on NS Records in the <a href='#h_01HSE8SDYPEG0S5Z95F12CYH07'>table</a> below).If these domains are not owned by your organization, we recommend reviewing the information hosted on these sites using a protected, sandbox environment to ensure that your clients or employees are not being fooled by an imposter website.</p>\n<h3 id='h_01HSE8SDYPEG0S5Z95F12CYH07'>Result Details</h3>\n<p>The detailed Domain Doppelgӓnger results contain data applicable to your domain's look-alikes. See below for an example of the detailed analysis results and an explanation of each column within the data table. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_02.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_02.png' alt='Domain Doppelgänger: Detailed Results Table'></a></p>\n\n<table>\n<tbody>\n<tr>\n<td class=''>Column Title</td>\n<td class=''>Description</td>\n</tr>\n<tr>\n<td>\n <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_03.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_03.png' alt='Private Domain Icon'></a>\n</td>\n<td>The results that include this icon are privately registered domains.Most domain registrars offer private registration to protect the domain owner's privacy and to avoid unwanted solicitation. </td>\n</tr>\n<tr>\n<td>Type</td>\n<td>\n<p>Each look-alike domain will have one of the following Doppelgӓnger <strong>Types</strong> associated with it. The original domain will be signified with <strong>Original*</strong>:</p>\n<ul role='list'>\n<li>\n<strong>Hyphenation:</strong> A hyphen (or additional hyphen) is added to the actual domain.\n<ul role='list'>\n<li>A familiar-looking domain with an added hyphen could fool an uneducated user during a phishing attack.</li>\n</ul>\n</li>\n<li>\n<strong>Repetition:</strong> A single vowel or consonant from the actual domain is repeated consecutively.\n<ul role='list'>\n<li>Hackers often buy such domains for cybersquatting, or more specifically, for typosquatting purposes. An uneducated user could overlook this double letter during a phishing attack, or anyone could accidentally \"typo\" their way to a malicious website.</li>\n</ul>\n</li>\n<li>\n<strong>Replacement:</strong> A single vowel, consonant, or number from your domain is replaced with a different letter.</li>\n<li>\n<strong>Omission: </strong>A single vowel or consonant from your domain is omitted or excluded.</li>\n<li>\n<strong>Transposition: </strong>Two letters or numbers from your domain are switched in placement, and all other characters are in the appropriate position.</li>\n<li>\n<strong>Bitsquatting:</strong> These domains use character replacements based on characters that are one \"bit\" (i.e., 0 or 1) apart when the domain is translated into the binary language used by computers.\n<ul role='list'>\n<li>This attack method consists of buying domains that are likely to be a result of a random memory error, causing a computer to make a binary \"typo\" during the DNS lookup.</li>\n<li>For example, <em>KnowBe4</em> in binary is:0100<span class='wysiwyg-color-red'>1</span>011 01101110 01101111 01110111 01000010 01100101 00110100while <em>CnowBe4</em> in binary is: 0100<span class='wysiwyg-color-red'>0</span>011 01101110 01101111 01110111 01000010 01100101 00110100These examples are only one bit apart in binary language. Therefore, a hacker may buy <em>Cnowbe4.com </em>for the potential of a bitsquatting attack.</li>\n</ul>\n</li>\n<li>\n<strong>Insertion:</strong> An additional number or letter is added somewhere within your domain.</li>\n<li>\n<strong>Vowel-swap: </strong>A vowel existing in your domain is replaced with a different vowel.</li>\n<li>\n<strong>Addition: </strong>An additional letter is added to the end of your domain name. </li>\n<li>\n<strong>Subdomain: </strong>Your domain is broken by a period, creating an entirely new domain.\n<ul role='list'>\n<li>To the inattentive or untrained eye, this could appear to be a subdomain of your real domain. </li>\n</ul>\n</li>\n<li>\n<strong>Homoglyph: </strong>Using foreign characters to spell seemingly recognizable domains. Punycode is the system used to convert characters that can't be written in ASCII (American Standard Code for Information Interchange) into an ASCII encoding.\n<ul role='list'>\n<li>These foreign characters can look very similar to letters in the English alphabet. When hovering over a URL, some browsers do not display these foreign characters as their English equivalent; therefore, further masking these unfamiliar characters.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Domain</td>\n<td>A domain name is your address and identity on the Internet. Domain names are associated with and identify one or more IP addresses. They're used in URLs to identify and access web pages. </td>\n</tr>\n<tr>\n<td>IP</td>\n<td>The IPv4 address associated with the domain (if applicable).The IPv4 address is determined from the A record (Address record) included in the domain's DNS (Domain Name System) records.IP addresses are unique numerical identifiers assigned to every device connected to the Internet which are used to communicate with other devices. Web servers and mail servers are examples of devices that have an IP address. </td>\n</tr>\n<tr>\n<td>IPv6</td>\n<td>The IPv6 address associated with the domain (if applicable).The IPv6 address is determined from the AAAA record (quad-A record) included in the domain's DNS records. IPv6 is the successor to Internet Protocol Version 4 (IPv4). Some domains will have IPv4 and IPv6 addresses.</td>\n</tr>\n<tr>\n<td>NS Record</td>\n<td>The name server (NS) for the domain (if applicable). The name server is determined from the NS record included in the domain's DNS records.Name servers are typically provided by the domain's web host, and they provide the ability to access web pages by domain name URLs, rather than having to type an IP address.The results including NS records have web servers available. </td>\n</tr>\n<tr>\n<td>MX Record</td>\n<td>The mail exchanger (MX) server for the domain (if applicable).Mail exchanger records (MX records) tell the Internet which mail servers accept incoming email for the domain, and where that email should be routed.The results including MX records have mail servers available.</td>\n</tr>\n<tr>\n<td>WHOIS Link</td>\n<td>Use this link to navigate directly to the ICANN (Internet Corporation for Assigned Names and Numbers) WHOIS website to see the full \"WHOIS data\" for the domain owner. ICANN searches databases of domain registrars worldwide to provide public access to data on registered domain names.If a domain is privately registered, the WHOIS information will show information for a proxy company acting on the domain owner's behalf.</td>\n</tr>\n<tr>\n<td>Rank</td>\n<td>Each result that is a registered domain (private or public) will have a ranking assigned to it. The ranking is based on how many details were gathered about the domain. See the details below for the individual \"result detail\" points attributed to the ranking.\n<ul role='list'>\n<li>Private Registration: +10 points</li>\n<li>NS Record (Web Server): +10 points</li>\n<li>MX Record (Mail Server): +10 points</li>\n<li>IPv4 or IPv6 Address: +10 points\n<ul role='list'>\n<li>Each additional IP Address: +1 point</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id='h_01HSE8SDYPBB5X4SFEEA4A3YCV'>Result Reports</h3>\n<p>You can use sorting, search terms, and search filters to display the desired data in the Domain Doppelgӓnger results table. See below for more information. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_04.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_04.png' alt='Search filters, search terms, sort columns, expand results'></a></p>\n\n<ol role='list'>\n<li>\n<strong>Search Filters:</strong> You can apply any of these search filters when you submit a term in the search bar. For example, if you want to see all of the look-alike domains that are categorized as Bitsquatting, type \"Bitsquatting\" into the search bar and check the <strong>Type</strong> search filter.</li>\n<li>\n<strong>Search Bar:</strong> Use the search bar to enter any term you'd like to reflect in the results. For example, if you know your organization does not use \"DNS Made Easy\" for any DNS services, you may want to search the term \"dnsmadeeasy\" and check the <strong>NS Record</strong> search filter to display the domains having NS Records with this company, in order to further investigate.If you want to create a new search, clear the search bar to reset your search.</li>\n<li>\n<strong>Sort Arrows:</strong> Use the arrows in the column headers to re-sort that column as well as the entire data table.</li>\n<li>\n<strong>Expand Data Arrow:</strong> If a row includes an expand arrow, there is more information available for one or more of the following data columns: IPv4, IPv6, NS Record, or MX Record. You'll see the additional information once you've expanded the data row.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_05.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_05.png' alt='5. Download CSV button 6. Delete Analysis'></a>\n</li>\n<li>\n<strong>Download CSV:</strong> You'll find this button at the bottom of the page, below the data table. You can download a CSV report of all results, or any display of data that you've generated using the search bar and search filters. The CSV report will always reflect the data currently shown in the results table. </li>\n<li>\n<strong>Delete Analysis:</strong> If you want to delete your analysis results, you'll use this button at the bottom of the results page.</li>\n</ol>\n<h2 id='h_01HSE8SDYPRZ6AXSP6755PZDFM'>User Assessment</h2>\n<p>Once you've reviewed your Domain Doppelgӓnger results, you'll want to test your end users' awareness of the dangers of look-alike domains. Follow the steps below to set up your user assessment.</p>\n<ol role='list'>\n<li>From the Domain Doppelgӓnger results page, click the <strong>Test your users</strong> button, located at the top right of the page.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_06.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_06.png' alt='Test your users button' width='221' height='68'></a>\n</li>\n<li>Review the domains highlighted in green, located on the left side of the page. These domains were pre-selected for your user assessment, but can be modified as needed.By default, the selected results are the highest-ranked Doppelgӓnger domains. For an accurate user assessment, ensure these domains are not owned by your organization.Click on any row of domain data to select or deselect this domain for use in your user assessment. You must select nine Doppelgӓnger domains to use in the assessment before you can proceed.Using the search bar and search filters, you can search for any specific domain, Doppelgӓnger <strong>Type</strong><span>, or Doppelgӓnger </span><strong>Rank</strong><span> from this list of results.</span>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_07.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_07.png' alt='A list of the domains selected for the User Assessment'></a>\n</li>\n<li>As you select and deselect the domains, you'll see the assessment's answer options automatically change in the <strong>Assessment Preview</strong>, shown on the right side of the screen. By default, <strong>Show user assessment results after completion</strong> will be checked, as shown below. Leave this enabled if you'd like your users to see how they performed on the assessment.\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_08.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_08.png' alt='User Assessment Preview' width='537' height='517'></a>\n</li>\n<li>Once you've selected the domains you'd like to include, click the <strong>Get Assessment Link</strong> button at the top right of the page.</li>\n<li>Distribute the assessment link to your end users. We've provided an example email you can use to distribute the assessment and request that your users complete it. You'll find this email at the bottom of this article, <a href='#How_can_I_inform_my_users_about_the_domain_assessment'>here</a>.</li>\n</ol>\n<h3 id='h_01HSE8SDYPCAA9H84WJ265DWG4'>Analyzing the User Assessment</h3>\n<p>All user assessment results are anonymous. You can review the user assessment results in real time by clicking the <strong>View Assessment Results</strong> button from the assessment confirmation page.If you've closed this browser page, you'll be able to access your user assessment results from the link in the \"Your Domain Doppelgänger results are ready\" email you initially received. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_09.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_09.png' alt='View Assessment Results' width='529' height='290'></a></p>\n\n<p>Once you've given your employees time to complete the assessment, use this page to view the assessment results.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_10.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_10.png' alt='Assessment Overview' width='548' height='166'></a></p>\n<ol role='list' start='3'>\n<li>Here you can see the total number of assessments that have been completed from the link you've distributed.</li>\n<li>If you need to resend the assessment link or send it to additional users, you'll find the link here.</li>\n<li>The <strong>Overall Assessment Results</strong> provides an overview of the number and percentage of users who passed or failed the assessment as a whole. Users must answer all three questions correctly to pass the assessment. Assessments with one or more incorrect answers will count as a failed assessment. </li>\n<li>The <strong>Overall Questions Results</strong> provides the number and percentage of correct and incorrect responses across all users and all assessment questions. </li>\n</ol>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_11.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_11.png' alt='Assessment Question Overview' width='213' height='125'></a></p>\n<p>Each individual question will also show a bar graph representing the percentage of users who answered the question correctly vs. incorrectly. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_12.png'><img src='https://helpimg.s3.amazonaws.com/DomainDoppelganger/DomainDoppelganger_12.png' alt='Assessment Question Overview' width='192' height='54'></a></p>\n\n<p>If you'd like to reset or recreate your user assessment, use the <strong>Reset Assessment</strong> button in the bottom right corner of the Assessment Results page.</p>\n<h2 id='h_01HSE8SDYP5YN5GH5FRCVS7GAD'>How can I inform my users about the domain assessment?</h2>\n<p>Below you'll find a customizable email that you can send to your users to distribute the Domain Assessment. The email provides an overview of why it's important to know the difference between safe and unsafe links and requests that the users complete the quiz. Be sure to modify the sample by adding your organization's name and your unique assessment link.</p>\n<p class='wysiwyg-indent4'><em>Cybersecurity attacks are on the rise and <span class='wysiwyg-color-red'>[[Company Name]]</span> is determined to stay vigilant and defend our organization against hackers and social engineering attempts.</em></p>\n<p class='wysiwyg-indent4'><em>One major attack method that hackers are using lately is to buy similar-looking website domains so they can launch phishing attacks or gather sensitive information. As one of our employees, you must learn the difference between safe and unsafe links to avoid falling for this kind of attack.</em></p>\n<p class='wysiwyg-indent4'><em>Please take the quiz below to ensure that you can help guard our organization against social engineering attacks. Your quiz results are completely anonymous.</em><em><strong>Copy and paste this link into your browser to take the quiz:</strong> <span class='wysiwyg-color-red'>[[your link here]]</span></em></p>\n<p class='wysiwyg-indent4'><em>Thank you for helping us build a strong \"human firewall\" in our organization.</em></p>\n<h2 id='h_01HSE8SDYP182RFR46VYXSBKZY'>What can I do with this information?</h2>\n<p>Domain Doppelgӓnger empowers you with the necessary understanding of the risks that may be associated with look-alike domains. This information can help you protect your organization from phishing attacks and help you prevent potential damage to your organization's reputation. </p>\n<p><strong>Do your research.</strong> Understand the Doppelgӓnger <strong>Types</strong> and the risks associated with each. Find the domains that have web servers and use a protected, sandbox environment to review what information is hosted on these sites. If you suspect malicious activity or fraudulent intent, reach out to the web hosting company and/or domain name registrar to report the website. You can find this information by looking at the domain's Whois record, linked to each Domain Doppelgӓnger result.</p>\n<p><strong>Train your users.</strong> Depending on how your users answered the domain assessment questions, they'll be provided with explanations of why their answers were correct or incorrect, but this information must be reinforced. You'll find the \"Detecting Domain Doppelgӓngers\" PDF file on the user assessment overview page, share these helpful tips with your users. You also should immediately enroll your users in security awareness training and phishing campaigns to ensure they have the skills they need to become a strong human firewall for your organization.</p>\n<h2 id='h_01HSE8SDYPACPXH5T33Q6XZZH4'>Frequently Asked Questions (FAQs)</h2>\n<h4 id='h_01HVW3T904PKDS02HGBRMMB3EF'>1. I haven't received my Domain Doppelgӓnger analysis results, what should I do?</h4>\n<p>If you've submitted your request for the Domain Doppelgӓnger and haven't received it after approximately 2 hours, please check your spam filter. If you cannot find your analysis results there, contact our Support team <a href='https://support.knowbe4.com/hc/en-us/requests/new' target='_blank' rel='noopener'>here</a>. </p>\n<h4 id='h_01HVW3TDFYG5GYFX677T2PB2R5'>2. What Top-Level Domains (TLDs), such as .com, .org., .net, etc., are included in the Domain Doppelgӓnger analysis?</h4>\n<p>The Doppelgӓnger analysis searches for look-alike domains with the same top-level domain as your own.If feasible for your organization, it would be ideal to own your organization's name in all of the \"open\" TLDs. See <a href='http://www.newworldencyclopedia.org/entry/List_of_Internet_top-level_domains' target='_blank' rel='noopener'>this (external) page</a> for more information on the \"open\" top-level domains.</p>\n<h4 id='h_01HVW3THKS3JC2J3VDA5D21DZN'>3. I received homoglyph domains in my analysis results. How can I identify the domain names that would need to be registered to own my \"homoglyph\" look-alike domains?</h4>\n<p>You can use online sources such as <a class='external-link' href='https://www.punycoder.com/' rel='nofollow'>https://www.punycoder.com/</a>, to decode the homoglyph domains' Punycode.</p>\n<h4 id='h_01HVW3TYE0GYJPCKQ9HTKE99WR'>4. I have a .edu (or other limited) domain. Why didn't I receive any Domain Doppelgӓnger results?</h4>\n<p>Certain top-level domains (TLDs) such as .edu, .int, .gov, and .mil, are limited to specific types of institutions, organizations, or government sectors. Legitimacy must be verified before owning these web addresses–making look-alike domains much less likely to exist.</p>\n<h4 id='h_01HVW3SAEYZWNC0FNQFCV49V5X'>5. Can I modify the questions in the Domain Doppelgӓnger user assessment?</h4>\n<p>The user assessment questions and answers are designed for end users with basic to moderate cybersecurity knowledge, for the purpose of enhancing awareness of look-alike domains. If your users' assessment performance is not what you expected, we strongly suggest enrolling them into security awareness training and simulated phishing tests to improve the strength of your human firewall. We can help! If you're not already a customer, contact <a href='mailto:sales@knowbe4.com'>sales@knowbe4.com</a> if you'd like more information. </p>\n",
    "user_segment_ids": []
  }
}