{
  "article": {
    "id": 360001216148,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360001216148.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360001216148.html",
    "author_id": 360322304667,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 4,
    "vote_sum": 3,
    "vote_count": 5,
    "section_id": 8594827685267,
    "created_at": "2018-05-03T20:18:21Z",
    "updated_at": "2024-06-21T19:27:02Z",
    "name": "Partner and Multi-Account: Enable Two-Factor or Multi-factor Authentication on My Account",
    "title": "Partner and Multi-Account: Enable Two-Factor or Multi-factor Authentication on My Account",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-05-16T00:22:53Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "partner",
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<div class='callout-success'>\n<div class='callout__content'>\n<strong>Tip:</strong> The article below will explain the process for enabling multi-factor authentication for MSP or Reseller accounts. If you're not an MSP or Reseller, please visit our <a href='https://support.knowbe4.com/hc/en-us/articles/225681448'>How Do I Enable Two-Factor or Multi-Factor Authentication on My Account?</a> article to enable authentication for standard accounts.</div>\n</div>\n<p>Enabling multi-factor authentication (MFA) or two-factor authentication (2FA) on your MSP or Reseller account will require an additional identity verification step at the time you log in. Once configured and enabled for an account, our system will require the use of an authentication code generated by an authenticator application each time you log in to your account. Reseller account owners and admins can set this up for themselves. As an alternative, reseller account owners may set this up for each reseller admin. Admins can also enable MFA for admins or all users. For more information, see our <a href='https://support.knowbe4.com/hc/en-us/articles/12731036715411-KnowBe4-Console-Account-Settings-User-Management'>KSAT Account Settings: User Management</a> article.</p>\n<div class='callout-info'>\n<div class='callout__content'>\n<strong>Note:</strong>This feature is not applicable if you are using a single sign-on (SSO) login method. Your SSO application will authenticate instead.</div>\n</div>\n<h2 id='h_01HC362AZPFN9SG3HK76V97ET1'><strong> How to Enable MFA for Yourself</strong></h2>\n<p>To enable MFA for yourself, follow the steps below:</p>\n<ol role='list'>\n<li>Ensure you have downloaded an Authenticator application on your smartphone. Possible apps include Google Authenticator, Authy, and LastPass, among others.</li>\n<li>To enable two-factor authentication in your account, simply click on your email address in the top-right of the screen, then click on <strong>Profile</strong>.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_01.png'><img src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_01.png' alt=' '></a>\n</li>\n<li>On the pop-up window that follows, you will see a barcode. You have two options to set up 2FA:\n<ul role='list'>\n<li>Scan that barcode with your authenticator application.</li>\n<li>Manually enter the unique code provided beneath the barcode.</li>\n</ul>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_02_edit.png'><img class='' src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_02_edit.png' alt=' '></a>\n</li>\n<li>Once you’ve completed Step 3, click the <strong>MFA Enabled</strong> check box at the bottom of your <strong>Profile </strong>page. Then, click on the <strong>Update Profile</strong> button.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_03.png'><img class='' src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_03.png' alt=' '></a>\n</li>\n</ol>\n<p>Now, you'll be prompted to enter an authentication code from your authenticator application on your smartphone each time you log in to your account.</p>\n<h2 id='h_01HC364MDNN4JHDFCM7NNZKY0N'><strong>How to Enable MFA for Your Other Admins</strong></h2>\n<p>To enable MFA for your other admins, follow the steps below:</p>\n<ol role='list'>\n<li>Ensure your reseller admin has downloaded an authenticator application on their smartphone. Possible apps include Google Authenticator, Authy, and LastPass, among others.</li>\n<li>To enable 2FA in your reseller admin’s account, click on the <strong>Admins</strong> tab and find the admin you would like to enable 2FA for.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_04.png'><img class='' src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_04.png' alt=' '></a>\n</li>\n<li>Under the <strong>MFA</strong> column, select the <strong>Disabled </strong>toggle.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_05.png'><img class='' src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_05.png' alt=' '></a>\n</li>\n<li>Once MFA is enabled, you must click on the link located under the <strong>Link to QR</strong> column. This link will open a pop-up window with a QR code on it. The QR code displays the admin's email address.<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_06.png'><img class='' src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_06.png' alt=' '></a>\n</li>\n<li>On the pop-up window, the admin will have two options to set up 2FA:\n<ul role='list'>\n<li>Have the admin scan that barcode with their authenticator application.</li>\n<li>Have them manually enter the unique secret key provided beneath the barcode.</li>\n</ul>\n<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_07_edit.png'><img class='' src='https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_07_edit.png' alt=' '></a>\n</li>\n</ol>\n<div class='callout-warning'>\n<div class='callout__content'>\n<strong>Important:</strong> You cannot set up two-factor authentication at a global level. Each user must set it up individually, or you can set it up for each user.</div>\n</div>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/360001216148-Partner-and-Multi-Account-Enable-Two-Factor-or-Multi-factor-Authentication-on-My-Account",
    "images": [
      {
        "url": "https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_01.png",
        "alt": "This image captures an expanded account context menu (dropdown) overlaying a generalized interface.\n\n**Context and Header:**\nThe menu is displayed below an interface element labeled `youremail@yourdomain.com` with a standard dropdown arrow. The menu header section repeats the email address (`youremail@yourdomain.com`) and includes a prominent orange, pill-shaped tag labeled **Reseller**.\n\n**Actionable Menu Options (List):**\nThe menu lists two primary actions, separated by a horizontal divider:\n\n1.  **Profile:** This option is prefixed with a wrench/spanner icon, indicating configuration or settings access. This element is visually emphasized by a red circular annotation.\n2.  **Sign out:** This option is prefixed with a right-facing arrow icon (an exit symbol).\n\nAn orange horizontal rule is visible across the top of the interface, partially above the dropdown menu.",
        "position": 1,
        "context": "on your email address in the top-right of the screen, then click on Profile."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_02_edit.png",
        "alt": "This image depicts a user interface screen detailing the initialization process for Multi-Factor Authentication (MFA).\n\n**UI Elements and Context:**\n\n1.  **Barcode Placeholder:** A square graphic, heavily pixelated and rendered in grayscale, occupies the top left, representing the location for a scannable QR or barcode used for enrollment.\n2.  **Heading:** The instructional section is introduced by the bold header, \"Before Enabling MFA:\".\n3.  **Instructional Text (Setup):** The text provides sequential steps for linking a device:\n    *   It instructs the user to \"Scan this barcode\" or use a manual entry method.\n    *   The manual entry key is displayed as a redacted alphanumeric string: \"your secret key is [redacted].\"\n4.  **Verification Text (TOTP Check):** The next paragraph describes the validation phase: \"You should see [redacted numerical code] on your device.\" This redacted element represents the time-based one-time password (TOTP) displayed for comparison. The user is prompted to \"Refresh this page to see an updated code.\"\n5.  **Final Prompt:** The process concludes with the requirement: \"Make sure the codes match on your device and here on the page.\"\n\nThe overall context is a security configuration panel requiring synchronization between a physical device and the displayed enrollment information.",
        "position": 2,
        "context": "ation.\nManually enter the unique code provided beneath the barcode."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_03.png",
        "alt": "The image displays a portion of a profile or settings configuration user interface.\n\n1.  **Configuration Setting:** The top element is a checked checkbox labeled **\"MFA Enabled\"** (Multi-Factor Authentication).\n2.  **File Input Label:** Below the checkbox is the field label **\"Company Logo,\"** followed immediately by a grayed-out help or tooltip icon (question mark).\n3.  **File Input Control:** This control consists of a button labeled **\"Choose File\"** and the adjacent status text **\"No file chosen,\"** indicating that no file has been selected for upload.\n4.  **Action Button:** The bottom element is a prominent, dark blue primary action button labeled **\"Update Profile.\"**",
        "position": 3,
        "context": "Then, click on the Update Profile button."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_04.png",
        "alt": "This image displays the header navigation bar for the **KnowBe4** application interface.\n\n**Branding:**\n*   **Logo:** The logo on the left reads \"KnowBe4\" in orange and white, with the tagline \"Human error. Conquered.\" beneath it in small gray text.\n\n**Navigation Menu (Primary Links):**\nA horizontal navigation menu is displayed, listing seven dark gray text links:\n1.  Dashboard\n2.  Accounts (Currently selected, indicated by a short, solid blue underline)\n3.  Email Templates\n4.  Landing Pages\n5.  Partners\n6.  Admins (Highlighted with a thick orange border, suggesting an alternative active state or focus element)\n7.  Reports",
        "position": 4,
        "context": "click on the Admins tab and find the admin you would like to enable 2FA for."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_05.png",
        "alt": "The image displays a data table listing five user records, typically found within an administrative or user management interface.\n\n**UI Structure:**\nThe table contains five columns:\n1. **Email:** Contains the placeholder address `youremail@yourdomain.com`.\n2. **First Name:** Contains the placeholder text `First`.\n3. **Last Name:** Contains the placeholder text `Last`.\n4. **MFA (Multi-Factor Authentication):** This column is highlighted in yellow. For all listed entries, the status is consistently displayed as a blue link labeled `Disabled`, preceded by a small icon resembling an eye or toggle, indicating the feature is inactive.\n5. **Link to QR:** Contains unique alphanumeric strings (e.g., `4ub6b5lydzfmyn6l`), displayed as blue hyperlinks. These links are contextually associated with initiating the MFA setup process by generating a corresponding QR code.\n\n**Context:**\nThe data indicates that none of the listed accounts have Multi-Factor Authentication configured or enabled, and a direct link is available for each record to begin the QR code-based enrollment process for MFA.",
        "position": 5,
        "context": "Under the MFA column, select the Disabled toggle."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_06.png",
        "alt": "The image displays five rows of tabular data, likely representing a user list or account management interface.\n\n**Column Headers (Left to Right):**\n1.  **Email**\n2.  **First Name**\n3.  **Last Name**\n4.  **MFA** (Multi-Factor Authentication)\n5.  **Link to QR**\n\n**Row Content and UI Elements:**\n*   **Email, First Name, Last Name:** All entries across the five visible rows contain generic placeholder text: `youremail@yourdomain.com`, `First`, and `Last`.\n*   **MFA:** Each row displays the status `Disabled` in blue text, preceded by a small circular icon, indicating that Multi-Factor Authentication is inactive for these accounts.\n*   **Link to QR:** This column is visually highlighted with a yellow border. It contains unique alphanumeric strings (e.g., `4ub6b5lydzfmyn6l`) rendered as blue hyperlinks. These links are presumed identifiers for retrieving or generating a corresponding QR code.",
        "position": 6,
        "context": "The QR code displays the admin's email address."
      },
      {
        "url": "https://helpimg.s3.amazonaws.com/reseller/MFA/MSP-Reseller_MFA_07_edit.png",
        "alt": "The image displays a user interface page detailing the setup process for Multi-Factor Authentication (MFA).\n\n**UI Elements and Context:**\n\n1.  **Identifier:** The top of the screen shows the placeholder user identifier: `youremail@yourdomain.com`.\n2.  **MFA Provisioning Element:** A square, grayscale, pixelated image (representing a QR code or setup barcode) is displayed.\n3.  **Header:** The instructional section begins with the bold title: **Before Enabling MFA:**\n4.  **Instructions (Secret Key):** Text advises the user to \"Scan this barcode for your two factor authentication.\" A manual fallback option is provided, stating, \"If you manually enter the information, your secret key is [redacted long alphanumeric string].\"\n5.  **Verification:** A dynamic verification step is described: \"You should see [redacted numeric code] on your device. Refresh this page to see an updated code.\" The redacted code serves as an initial verification code placeholder.\n6.  **Final Prompt:** The final instruction requires validation: \"Make sure the codes match on your device and here on the page.\"\n\nThe overall context is the enrollment and initial verification of a Time-based One-Time Password (TOTP) factor.",
        "position": 7,
        "context": "Have them manually enter the unique secret key provided beneath the barcode."
      }
    ],
    "metadata": {
      "category": "",
      "section": "",
      "topics": [
        "account",
        "authentication",
        "enable",
        "factor",
        "multi",
        "partner",
        "two"
      ],
      "image_count": 7
    }
  }
}