{
  "article": {
    "id": 360013722293,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013722293.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360013722293.html",
    "author_id": 403968826754,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": -2,
    "vote_count": 4,
    "section_id": 8594903708179,
    "created_at": "2018-12-13T19:05:36Z",
    "updated_at": "2024-05-30T18:53:50Z",
    "name": "Partner and Multi-Account: Viewing Your Accounts",
    "title": "Partner and Multi-Account: Viewing Your Accounts",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-05-16T00:26:30Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "reseller",
      "partner",
      "management",
      "mgmt",
      "account management",
      "managed",
      "accounts",
      "localized",
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>The <strong>Accounts</strong> tab offers the ability to review all of your existing accounts in one place. Here you can see the number of seats, number of users, Phish-prone Percentages, and other information about your accounts at a glance. From this page, you can also view the account's detail page or open these accounts in the admin view.</p>\n<p>To view your managed accounts, open your Account Management console. Then, click on the <strong>Accounts</strong> tab. You can search for individual accounts by organization name, allowed domains, or specific email addresses.</p>\n<p>For more information about this tab, see the below screenshot and list:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/ManagingAccounts/Managed+Accounts+List+Lettered.png'><img src='https://helpimg.s3.amazonaws.com/reseller/ManagingAccounts/Managed+Accounts+List+Lettered.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Organization</strong>: This column displays the organization name for the account. You can click the name to view the account details page. The account details page contains the account, subscription, and organization information for each individual account that you manage. Here, you can choose to view the account as an admin. <a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/ManagingAccounts/NonOLS_Admins.png'><img src='https://helpimg.s3.amazonaws.com/reseller/ManagingAccounts/NonOLS_Admins.png' alt=' ' width='635' height='344'></a>\n</li>\n<li>\n<strong>View as Admin</strong>: Alternatively, you can click the <strong>arrow</strong> icon to open the account's dashboard in the admin view.</li>\n<li>\n<strong>Billing Type</strong>: This column displays the type of account, which includes Free, Trial, Paid, Diamond, or Platinum. Trial accounts are highlighted in orange and free accounts are highlighted in yellow.</li>\n<li>\n<strong>End Date</strong>: This column is hidden by default. It displays the date the subscription ends. For trial accounts, it shows the trial expiration date.</li>\n<li>\n<strong>Courses</strong>: This column is hidden by default. It displays the number of courses added to an account.</li>\n<li>\n<strong>Phish-prone %</strong>: This number displays the phish-prone percentage of the most recent phishing campaign.</li>\n<li>\n<strong>% Users Phished</strong>: This column displays the percentage of users who have been phished. This is calculated by dividing the number of users phished by the number of total users on the account. This data is refreshed daily.</li>\n<li>\n<strong>% Users Trained</strong>: This column displays the percentage of users who have completed a training module. This is calculated by dividing the number of users who have completed a training module by the number of total users on the account. This percentage is refreshed daily, but you can manually refresh the data from the <strong>Actions</strong> drop-down menu by clicking <strong>Refresh Percentages</strong>.</li>\n<li>\n<strong>Actions</strong>: Click the <strong>arrow</strong> icon to reveal a drop-down menu. Here you can instantly refresh the percentages for the managed account by selecting <strong>Refresh Percentages</strong>.</li>\n<li>\n<strong>Download CSV</strong>: Click this button to download a CSV file of the currently displayed data.</li>\n<li>\n<strong>Status</strong>: Use this filter to view managed KSAT accounts based on their account status.</li>\n<li>\n<strong>Billing Type</strong>: Use this drop-down menu to filter by billing type.</li>\n<li>\n<strong>Partner</strong>: Use this filter to view managed KSAT accounts based on the nested partner level. From the <strong>Partner</strong> drop-down menu, you can select <strong>Top-Level Partners</strong>, <strong>Child Partners</strong>, <strong>Grandchild Partners</strong>, or <strong>All Partners</strong>. This filter will only be displayed for partners that are parents of child or grandchild partner accounts.</li>\n<li>\n<strong>Show/Hide Columns</strong>: Click the <strong>gear</strong> icon to select which columns are displayed on the table. Your changes will be applied automatically.</li>\n</ol>\n<p>When you are viewing an account as an admin, you can return to your management console by selecting <strong>Click here</strong> on the right side of the banner. You can hide the banner by clicking the email in the top-right corner and clicking <strong>Hide Account Mgmt Banner</strong>.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/reseller/hidebanner.png'><img src='https://helpimg.s3.amazonaws.com/reseller/hidebanner.png' alt=' '></a></p>",
    "user_segment_ids": []
  }
}