{
  "article": {
    "id": 39515659778579,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/39515659778579.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/39515659778579.html",
    "author_id": 31899104510995,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 39401799293075,
    "created_at": "2025-03-18T21:31:10Z",
    "updated_at": "2025-08-08T08:54:08Z",
    "name": "Prevent - Shared Mailbox Support",
    "title": "Prevent - Shared Mailbox Support",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-08-05T19:03:32Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot_prevent"
    ],
    "body": "\n<p>Prevent has released improved functionality to allow on-send advice when sending from shared mailboxes.</p>\n<h2 id='h_01JQ6VWANNGSHWKFVEB0PMFN65'>Overview</h2>\n<p>Previously, Prevent could only provide real-time advice to single mailboxes. When users sent emails from a shared mailbox, the emails were sent to the gateway for analysis, and users received a bounce back containing any suitable advice. This process is now changing, and our shared mailbox client support will allow a consistent Prevent experience for users regardless of whether they are sending from their own or a shared mailbox.</p>\n<p>To ensure your organization has more Prevent coverage and a consistent user experience, users sending from a shared mailbox will receive real-time Prevent advice. This feature includes sending emails on behalf of other users when the Microsoft Outlook Add-in is installed.</p>\n<p>When an email is sent from a shared mailbox, and the user triggers Prevent advice, we will continue to capture and display that event in the Prevent dashboard. Prevent admins will be able to search and view those emails sent from a shared mailbox as they would a regular email sent with Prevent advice.</p>\n<h2 id='h_01JQ6VWANN57554TZG15YBF881'>Requirements</h2>\n<p>This feature is available to customers who:</p>\n<ul>\n<li>Use Microsoft 365</li>\n<li>Have ingested data into Prevent</li>\n</ul>\n<p>These requirements allow advice for shared mailboxes to function while maintaining users' data security.</p>\n<p>This feature is automatically available to those who meet these requirements, and no action is needed.</p>",
    "user_segment_ids": []
  }
}