{
  "article": {
    "id": 4402653504147,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4402653504147.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4402653504147.html",
    "author_id": 1507801285842,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 4,
    "vote_sum": 1,
    "vote_count": 1,
    "section_id": 26429650317203,
    "created_at": "2021-06-22T14:43:18Z",
    "updated_at": "2024-04-18T23:28:29Z",
    "name": "Optimize MP4 Video Files for Custom Content",
    "title": "Optimize MP4 Video Files for Custom Content",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-04-18T23:28:29Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>When you upload custom content using the MP4 video format to your console, we recommend that you optimize the video for web streaming. Video optimization improves video performance and playback speed and ensures that you are meeting the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360019644394.html' target='_self'>compatibility requirements</a> for uploaded content.</p>\n\n<h2 id='h_01HS1SVZZ2VT3ZAERFS0NRRD2Q'>Video Optimizer Overview</h2>\n<p>When you use the video optimizer, the videos become more compatible with KnowBe4’s Learner Experience (LX). The video optimizer re-encodes MP4 video files with an H.264 codex, which is the standard format for online videos, and optimizes the video so that it can be streamed instantly. For example, if a video buffers slowly or stalls, video optimization can help it play smoothly with better quality.</p>\n\n\n<h2 id='h_01HS1SVZZ2QC3AS43JQV1QMNZE'>Video Optimizer Compatibility</h2>\n<p>MP4 video files that meet the guidelines below are most compatible with the KnowBe4 video optimizer:</p>\n<ul role='list'>\n<li>The MP4 video file is not a video of a screen capture.</li>\n<li>The MP4 video file is not a video of a PowerPoint presentation.</li>\n<li>The MP4 video file does not use specialized encoding or specialized compression standards.</li>\n</ul>\n<p>If you optimize videos that do not meet the guidelines above, it is possible that the video optimizer will not perform as intended. For example, if you optimize a video of a screen capture, you may receive an error message during the optimization process or it may optimize successfully, but it may perform poorly after the optimization process.</p>\n\n\n<h2 id='h_01HS1SVZZ2G8F885RQD9YQZG0Z'>How to Use the Video Optimizer</h2>\n<p>Video optimization happens during the automatic verification process. Before you can optimize a video, create new content under the <strong>Uploaded Content</strong> tab, and upload an MP4 video as a language file. For detailed instructions, please see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/360019644394.html' target='_self'>Uploading Custom Content to Your KnowBe4 Platform</a> article. Then, follow the steps below:</p>\n<ol role='list'>\n<li>In the <strong>Manually Review File</strong> box, click the <strong>Optimize Video</strong> link.</li>\n<li>In the <strong>Video Optimization</strong> box, click the <strong>Start</strong> button.</li>\n<li>Wait for the video optimization process to complete. This process may take an hour or more depending on the size of the video.</li>\n</ol>\n\n",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/4402653504147-Optimize-MP4-Video-Files-for-Custom-Content"
  }
}