{
  "article": {
    "id": 4403282239891,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4403282239891.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4403282239891.html",
    "author_id": 1501549449361,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 3,
    "vote_sum": 22,
    "vote_count": 10,
    "section_id": 360000156668,
    "created_at": "2021-07-06T20:18:58Z",
    "updated_at": "2025-03-11T17:40:02Z",
    "name": "Download Center Overview",
    "title": "Download Center Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:40:02Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot",
      "answerbot_kmsat"
    ],
    "body": "<p>The<strong> Download Center</strong> contains all of the PDF and CSV files that you've downloaded from the <strong>Reports</strong> tab. This feature also allows you to keep track of all reports that are generated and downloaded in your organization.</p>\n<p>In the top-right corner of your console, a notification bell will display when a report that you generated is ready to be downloaded. This bell will show timestamps for all generated reports when clicked on and will notify you if a new report has been generated while you are logged in. The reports that appear in this menu can also be downloaded at any time.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>Reports downloaded as a CSV file are not localized and will not display in the language set for your account. PDF reports in the Download Center are generated in the language selected by the original creator. If you need a PDF report in a different language, you’ll need to regenerate the report.</div>\n</div>\n<p>To learn how to use the <strong>Download Center</strong>, see the details below.</p>\n<p>You can access the <strong>Download Center </strong>by following the steps below:</p>\n<ol role='list'>\n<li>Log in to your KnowBe4 account.</li>\n<li>In the KSAT console, click the <strong>Reports</strong> tab.</li>\n<li>Select the <strong>Download Center</strong> tab.</li>\n</ol>\n<p>Once you've accessed the <strong>Download Center</strong>, there are several columns that display information about your downloads. For more information, see the screenshot and list below:<a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/advancedreporting/DownloadCenter_01.png'><img src='https://helpimg.s3.amazonaws.com/advancedreporting/DownloadCenter_01.png' alt=' '></a></p>\n<ol role='list' type='a'>\n<li>\n<strong>Report</strong>: Shows which category the report belonged to and includes an icon that represents whether the report is in CSV or PDF format.</li>\n<li>\n<strong>Type</strong>: The specific type of report.</li>\n<li>\n<strong>Groups</strong>: The total number of groups included in the report. If groups were not used in the report, “N/A” will be displayed.</li>\n<li>\n<strong>Generated on</strong>: The date that the report was generated.</li>\n<li>\n<strong>Status</strong>: Shows the report’s download status. The status can be Generating, Completed, Retrying, or Failed.</li>\n<li>\n<strong>Download</strong>: Click this icon to download the report. The green checkmark indicates whether the report was downloaded previously. Hover over the checkmark to see a timestamp of when the report was last downloaded.</li>\n<li>\n<strong>Details</strong>: When clicking on the report row, additional details for the selected report are displayed. Information such as the date range of the report and specific group names can be found here.</li>\n<li>\n<strong>Search bar</strong>: If you are looking for reports with specific groups or specific reports, you can search for them by using this field.</li>\n</ol>\n<p>All reports found in the <strong>Download Center</strong> will only be available for 90 days after they were originally created. After 90 days, the reports will be removed from the <strong>Download Center</strong>.</p>\n<div class='callout-remember'>\n<div class='callout__content'>\n<strong>Important:</strong> CSV files with more than 10,000 rows may take several hours to generate.</div>\n</div>",
    "user_segment_ids": []
  }
}