{
  "article": {
    "id": 4404258222099,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4404258222099.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4404258222099.html",
    "author_id": 383255683393,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 8,
    "vote_count": 10,
    "section_id": 360000154767,
    "created_at": "2021-07-26T13:57:18Z",
    "updated_at": "2025-05-27T14:59:30Z",
    "name": "KnowBe4 Graph API Overview",
    "title": "KnowBe4 Graph API Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-31T18:26:34Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot",
      "localizing",
      "answerbot_phisher",
      "answerbot_ksat",
      "apis"
    ],
    "body": "<h2 id='h_01J7NQMDP0Q06A577EZDS69XF5'>KSAT Graph APIs</h2>\n<p>KnowBe4's KSAT APIs, available to Diamond-level customers, allow you to authenticate your KnowBe4 account when you make API calls or requests with KSAT.</p>\n<p>To use the API feature for KSAT, you'll need to create a product API token from the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/226457887.html'>Account Settings</a> page in your KSAT console. You can create a <strong>Read</strong> <strong>Only </strong>access token or a <strong>Read/Write</strong> access token. This API token will allow you to connect your KSAT console to other tools and platforms. Then, KSAT will use the API token to authenticate your KnowBe4 account when making an API call or request. By default, data will be returned in JSON file format. For more information about creating an API token, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/10495383627155.html'>Product API Overview</a> article.</p>\n<p>By using KnowBe4's API, you agree to our <a href='https://developer.knowbe4.com/graphql/ksat/page/Terms-of-Use'>Terms of Use</a>.</p>\n<p>For general information about the KnowBe4 Graph API for KSAT, visit our <a href='https://developer.knowbe4.com/graphql/ksat/page/Introduction'>API documentation</a>.</p>\n<h2 id='h_01JQPQ417NQ4J8V4NF8V0J533G'>PasswordIQ Graph APIs</h2>\n<p>KnowBe4's PasswordIQ APIs, available to all PasswordIQ customers, allow you to authenticate your KnowBe4 account when you make API calls or requests with PasswordIQ.<br>To use the API feature for PasswordIQ, you'll need to create a product API token from the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/226457887.html'>Account Settings</a> page in your KSAT console. You can create a <strong>Read Only</strong> access token or a <strong>Read/Write</strong> access token. This API token will allow you to connect your PasswordIQ account to other tools and platforms. Then, PasswordIQ will use the API token to authenticate your KnowBe4 account when making an API call or request. By default, data will be returned in JSON file format. For more information about creating an API token, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/10495383627155.html'>Product API Overview</a> article.</p>\n<p>By using KnowBe4's API, you agree to our <a href='https://developer.knowbe4.com/graphql/passwordiq/page/Terms-of-Use'>Terms of Use</a>.</p>\n<p>For general information about the KnowBe4 Graph API for PasswordIQ, visit our <a href='https://developer.knowbe4.com/graphql/passwordiq/page/Introduction'>API documentation</a>.</p>\n<h2 id='h_01J7NQMXTRFCDZ8MPBCT3R7EZT'>PhishER Graph APIs</h2>\n<p>KnowBe4's PhishER APIs allow you to authenticate your KnowBe4 account when you make API calls or requests with PhishER.</p>\n<p>To use the API feature for PhishER, you'll need to create a product API token from the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/226457887.html' target='_self'>Account Settings</a> page in your KSAT console. This API token will allow you to connect your PhishER platform with other tools and platforms, such as your KSAT console. Then, PhishER will use the API token to authenticate your KnowBe4 account when making an API call or request. By default, data will be returned in JSON file format. For more information about creating an API token, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/10495383627155.html'>Product API Overview</a> article.</p>\n<p>By using KnowBe4's API, you agree to our <a href='https://developer.knowbe4.com/#terms' target='_blank' rel='noopener'>Terms of Use</a>.</p>\n<p>For general information about the KnowBe4 Graph API for PhishER, visit our <a href='https://developer.knowbe4.com/graphql/phisher' target='_blank' rel='noopener noreferrer'>API documentation</a>.</p>\n<h2 id='h_01JQPQ72FGFK0QCZANJS9YCH01'>SecurityCoach Graph APIs</h2>\n<p>KnowBe4's SecurityCoach APIs, available to all SecurityCoach customers, allow you to authenticate your KnowBe4 account when you make API calls or requests with SecurityCoach.<br>To use the API feature for SecurityCoach, you'll need to create a product API token from the Account Settings page in your KSAT console. You can create a <strong>Read Only</strong> access token or a <strong>Read/Write</strong> access token. This API token will allow you to connect your SecurityCoach account to other tools and platforms. Then, SecurityCoach will use the API token to authenticate your KnowBe4 account when making an API call or request. By default, data will be returned in JSON file format. For more information about creating an API token, see our Product API Overview article.</p>\n<p>By using KnowBe4's API, you agree to our <a href='https://developer.knowbe4.com/graphql/securitycoach/page/Terms-of-Use'>Terms of Use</a>.</p>\n<p>For general information about the KnowBe4 Graph API for SecurityCoach, visit our <a href='https://developer.knowbe4.com/graphql/securitycoach'>API documentation</a>.</p>",
    "user_segment_ids": []
  }
}