{
  "article": {
    "id": 4406004172435,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4406004172435.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4406004172435.html",
    "author_id": 1507801285842,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 17,
    "vote_count": 17,
    "section_id": 4415492283667,
    "created_at": "2021-08-27T15:55:59Z",
    "updated_at": "2025-10-14T02:17:05Z",
    "name": "PasswordIQ Product Manual",
    "title": "PasswordIQ Product Manual",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-10-10T20:01:05Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "answerbot",
      "localizing",
      "answerbot_kmsat"
    ],
    "body": "<p>Available to Diamond-level subscriptions, KnowBe4's PasswordIQ allows you to monitor your users' password vulnerabilities. The PasswordIQ client scans for vulnerabilities in your Active Directory (AD)'s password-related settings and compares your users' passwords to breached and weak passwords from various lists and databases. Then, the client communicates with KSAT to display your scan results on your dashboard.</p>\n<p>To enable PasswordIQ, navigate to <strong>Account Integrations</strong> &gt; <strong>PasswordIQ</strong> in your <strong>Account Settings</strong>. Then, select the <strong>Enable PasswordIQ</strong> check box.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>To use PasswordIQ, you'll need the on-premises version of AD. PasswordIQ is incompatible with Microsoft Entra ID.</div>\n</div>\n<p>See the sections below to learn how to install the client, run scans, and view your results.</p>\n<p><strong>Important:</strong>PasswordIQ will never display or report your users' passwords. In AD, all passwords are encrypted and stored in a hashed format, so the unhashed versions of passwords are inaccessible to PasswordIQ and KnowBe4.</p>\n<h2 id='h_01HA0HJ1N04P6X0XA86735V492'>Requirements</h2>\n<p>To install the PasswordIQ client, you'll need to meet the requirements listed below:</p>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong> We recommend that you install the client on a different computer than the computer you use as your domain controller. The scan process may generate high network traffic and computer processing unit (CPU) usage. For best results, install the client on a virtual machine or server that can run continuously.</div>\n</div>\n<ul>\n<li>You have access to a computer that meets the requirements:\n<ul>\n<li>The computer's operating system is Windows 10 or later with 32-bit or 64-bit, or Windows Server 2016 or later.</li>\n<li>The computer uses a version of .NET Framework with 4.7.2 or later.<br>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> If your computer doesn’t have this framework, the Setup Wizard will install version 4.7.2 for you</div>\n</div>\n</li>\n<li>\n<p>The computer has at least four GB of RAM.</p>\n</li>\n<li>\n<p>The computer's system drive has at least one GB of available hard disk drive (HDD) space.</p>\n</li>\n<li>\n<p>User Account Control (UAC) is enabled in the computer's UAC settings.</p>\n</li>\n</ul>\n</li>\n<li>You have access to an on-premises AD that runs on Windows Server 2008 R2 or a later version.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> If you have multiple AD domains, you'll need to install a different instance of the client for each domain.</div>\n</div>\n</li>\n<li>You have access to an AD domain administrator or an AD account that can be elevated as an administrator. This account must have <strong>Replicating Directory Changes</strong> and <strong>Replicating Directory Changes All</strong> permissions. For more information, see Microsoft's<a href='https://learn.microsoft.com/en-us/troubleshoot/windows-server/windows-security/grant-replicating-directory-changes-permission-adma-service' target='_blank' rel='noopener'> Replicating Directory Changes permission</a> article.</li>\n<li>You're a KSAT admin or have a security role with <strong>Read</strong>/<strong>Write</strong> access to PasswordIQ.</li>\n</ul>\n<h2 id='h_01HA0HJ1N0B73QBHSJVCG4SWDT'>Vulnerabilities</h2>\n<p>The PasswordIQ client scans each user for 11 vulnerabilities and reports the vulnerabilities that it finds to KSAT. Additionally, our Risk Score Report uses these vulnerabilities as risk factors when calculating your Risk Score. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/30048977242259.html'>Smart Risk Agent™ and Risk Score Guide</a></p>\n<p>For more information about these vulnerabilities, see the table below:</p>\n<table style='table-layout: auto;'>\n<tbody>\n<tr>\n<th scope='col'>Vulnerability</th>\n<th scope='col'>Description</th>\n<th scope='col'>Risk Score Severity Level</th>\n</tr>\n<tr>\n<td>Weak Password</td>\n<td>The password matches a password from one of our weak password lists, so it's common or easy to guess. A cybercriminal may be more likely to guess the password and access the user's account.</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Shared Password</td>\n<td>The password matches at least one other user's password in your AD. The password is likely common or simple, so a cybercriminal may be more likely to access the user's account.</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Clear Text Password</td>\n<td>The password is stored with reversible encryption in your AD. The password can be decrypted, so a cybercriminal may be more likely to access the user's account.</td>\n<td>High</td>\n</tr>\n<tr>\n<td>Empty Password</td>\n<td>The password doesn't contain any characters, so the user logs in to the account by leaving the password field blank. Anyone can access the user's account, including cybercriminals.</td>\n<td>High</td>\n</tr>\n<tr>\n<td>DES-Only Encryption</td>\n<td>The account uses the Data Encryption Standard (DES) to encrypt the user's password. DES is an outdated encryption method because it encrypts the password with only a 56-bit key, while newer encryption methods use longer keys that are more secure. A cybercriminal may be more likely to guess the password and access the user's account.</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Breached Password</td>\n<td>The password was exposed in a data breach that is connected to your AD account. The user is actively using a password that is accessible to cybercriminals.</td>\n<td>High</td>\n</tr>\n<tr>\n<td>Password Not Required</td>\n<td>The account doesn't require a user to enter a password when they log in. Anyone can log in to the account, including cybercriminals.</td>\n<td>High</td>\n</tr>\n<tr>\n<td>Password Never Expires</td>\n<td>The account has its password timeout set to zero. Because of this setting, even if the <strong>Password never expires</strong> check box in the user’s properties is unchecked, their password will never expire. PasswordIQ will check password expiration settings in your organization’s domain policies, fine-grained password policies, and user properties. Passwords that aren’t changed often have a higher chance of being guessed by cybercriminals.</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>LM-Hash Password</td>\n<td>The account uses a LAN Manager (LM) hash. An LM hash converts the password to all uppercase letters, limits the password to 14 characters, and splits the 14 characters into two groups of seven characters. This process weakens the password, so cybercriminals are more likely to crack it.</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>AES Encryption</td>\n<td>The account doesn't use Advanced Encryption Standard (AES) to encrypt the user's password. AES encrypts passwords with a 128-bit or 256-bit key. So, passwords that use AES encryption are less vulnerable to attacks.</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Missing Pre-Authentication</td>\n<td>The account doesn't require pre-authentication, so the account may be unprotected from password-guessing attacks. Pre-authentication encrypts a timestamp of the log-in request by using a key that is based on the user's password. This process protects against password-guessing attacks because it records each attempt to log in to the account.</td>\n<td>Medium</td>\n</tr>\n</tbody>\n</table>\n<p>To learn how you can resolve these vulnerabilities, see the <a href='#h_01HA0HJ1N03Z4QRCRZDEJ3PBCA'>Resolving Your Vulnerabilities</a> section below.</p>\n<h2 id='h_01HA0HJ1N0KA1D4QSA0AAT2SKT'>Copying Your API Token</h2>\n<p>To connect the PasswordIQ client to your KSAT console, you'll need your <strong>Product API Token</strong>.</p>\n<p>To create and copy your API token, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT account.</li>\n<li>Navigate to the <strong>PasswordIQ</strong> tab.</li>\n<li>Click <strong>PasswordIQ Client Setup</strong>.</li>\n<li>In the<strong>Token Name</strong> field, enter a name for your token.</li>\n<li>Select an <strong>Expiration Date</strong> for the token.</li>\n<li>Select a <strong>User</strong>.</li>\n<li>Click <strong>Create Token</strong>.</li>\n<li>In the Product API Token pop-up window that opens, click the PasswordIQ API token to copy the token. You’ll need this token to complete this setup in the <a href='#h_01HA0HJ1N036S125KMEH4QF3NF'>Installing the Client</a> section below.\n<div class='callout-warning'>\n<div>\n<strong>Important:</strong> After you close this window, you will not be able to view this token again.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/API/ProductAPI/EN/ProductAPIPopupWindow.png'> <img src='https://helpimg.s3.amazonaws.com/KMSAT/Account_Settings/Account-Integrations/API/ProductAPI/EN/ProductAPIPopupWindow.png' alt=''> </a></p>\n</li>\n<li>Click <strong>OK</strong>.</li>\n</ol>\n<h2 id='h_01HA0HJ1N036S125KMEH4QF3NF'>Installing the Client</h2>\n<p>Before you install the PasswordIQ client, verify that your computer meets the requirements in the <a href='#h_01HA0HJ1N04P6X0XA86735V492'>Requirements</a> section above. Then, copy your API token by following the instructions in the <a href='#h_01HA0HJ1N0KA1D4QSA0AAT2SKT'>Copying Your API Token</a> section above.</p>\n<p>To install the client, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT account.</li>\n<li>Navigate to the <strong>PasswordIQ</strong> tab.</li>\n<li>In step 2 of the <strong>Welcome to PasswordIQ</strong> instructions, click the <strong>PasswordIQ client</strong> link.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PasswordIQ_Client+download+link.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PasswordIQ_Client+download+link.png' alt='Download Client'></a></p>\n</li>\n<li>Click the <strong>Yes</strong> button in the pop-up window.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PIQ_Windows+Pop-Up.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PIQ_Windows+Pop-Up.png' alt='Windows Pop-Up PNG'></a></p>\n</li>\n<li>Click the <strong>Next</strong> button.</li>\n<li>After you read the Software License Agreement, click the <strong>Accept</strong> button to accept the terms and conditions.</li>\n<li>If your computer uses a proxy server to access the internet, select the <strong>Use a Proxy Server</strong> check box and fill out the fields. For more information, see the screenshot and list below. If your computer doesn't use a proxy server to access the internet, skip this step.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PasswordIQ_Proxy+Server.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PasswordIQ_Proxy+Server.png' alt='Proxy Server Information'></a></p>\n<ol>\n<li>\n<strong>IP Address or Name</strong>: Enter the proxy server's IP address or name. You can find this information in your computer's proxy server settings, which are under <strong>Network &amp; Internet</strong> &gt;<strong> Proxy</strong>.</li>\n<li>\n<strong>Port Number:</strong> Enter the proxy server's port number. You can find this information in your computer's proxy server settings, which are under <strong>Network &amp; Internet</strong> &gt; <strong>Proxy</strong>.</li>\n</ol>\n</li>\n<li>Click the <strong>Next</strong> button.</li>\n<li>In the <strong>Application Programming Interface (API) Token </strong> field, paste the API token that you copied in the <a href='#h_01HA0HJ1N0KA1D4QSA0AAT2SKT'>Copying Your API Token</a> section above.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/PasswordIQ_Client+API+Token+Screen.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/PasswordIQ_Client+API+Token+Screen.png' alt='API Token Screen'></a></p>\n</li>\n<li>Click the <strong>Next</strong> button.</li>\n<li>In the <strong>Username</strong> and <strong>Password </strong>fields, enter the login credentials of an AD service account that meets the <a href='#h_01HA0HJ1N04P6X0XA86735V492'>required permissions</a>. The client will use this service account to run all scheduled scans.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> If this account isn't assigned the <strong>Log on as a service</strong> permission, the client will assign this permission to the account automatically.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/PIQ/PasswordIQ_WindowsServiceAccount.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/KMSAT/PIQ/PasswordIQ_WindowsServiceAccount.png'></a></p>\n</li>\n<li>Click the <strong>Next</strong> button to complete the installation.</li>\n</ol>\n<h2 id='h_01HA0HJ1N0GBBQWP5BGXBYG8RX'>Running Scans</h2>\n<p>After you install the PasswordIQ client, you can start scanning your AD for vulnerabilities. You'll need to run your first scan from your client. After your first scan, you can run scans and create a scan schedule from your dashboard. For more information, see the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4411080243731.html'>Running Scans</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4411080243731.html'>How to Use your PasswordIQ Dashboard</a> article.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> To protect your password-related information, the data that PasswordIQ gathers during scans is never stored permanently in your computer's hard drive. This data is only stored temporarily in your computer's random-access memory (RAM).</div>\n</div>\n<p>To run your first scan, follow the steps below:</p>\n<ol>\n<li>Open the PasswordIQ client.</li>\n<li>In the <strong>Quick Scan</strong> section, click the <strong>Scan Now</strong> button.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> PIQ has additional settings you can access by clicking the gear icon in the top-right corner of the window. In <strong>Advanced </strong>settings, you can choose to include two optional vulnerabilities in your scan: <strong>AES Encryption No Set</strong> or <strong>Password Never Expires</strong>.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PasswordIQ_Client+Scan+Now+button.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PasswordIQ_Client+Scan+Now+button.png' alt='Scan Now Button'></a></p>\n</li>\n<li>After the scan completes successfully, click the <strong>View Dashboard</strong> button to view your scan results in KSAT.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PasswordIQ_Client+View+Dashboard+button.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/PIQ/Product+Manual/PasswordIQ_Client+View+Dashboard+button.png' alt='View Dashboard Button'></a></p>\n</li>\n</ol>\n<h2 id='h_01HA0HJ1N0TTKE7F23925NJNK5'>Settings</h2>\n<p>In your PasswordIQ client, you can customize your settings by clicking on the <strong>settings</strong> icon at the top-right corner of the client. In the modal that opens, you can see two tabs: <strong>General</strong> and <strong>Advanced</strong>. For more information about these tabs, see the subsections below.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/Free+Tools/PasswordIQ+(PIQ)/AdvancedSettings.png'><img src='https://helpimg.s3.amazonaws.com/Free+Tools/PasswordIQ+(PIQ)/AdvancedSettings.png' alt=' '></a></p>\n<h3 id='h_01HA0HJ1N0KWZN08YCESKVHS8V'>General</h3>\n<p>On the <strong>General</strong> tab, you can edit two sections: <strong>API Token</strong> and <strong>Proxy Server</strong>. These sections include settings that you set up when you started the PIQ client for the first time.</p>\n<p>In the <strong>API Token</strong> field, you can change the API token you entered from your KSAT console. To save your changes, click <strong>Validate API Token</strong>.</p>\n<p>In the <strong>Proxy Server</strong> field, you can change the proxy server that your computer uses to connect to the internet. Select the <strong>Use a Proxy Server</strong> check box if it’s disabled, and enter the name or IP address you want to use. In the <strong>Port Number</strong> field, enter the port number for your proxy server. To save your changes, click <strong>Validate Proxy Settings</strong>.</p>\n<h3 id='h_01HA0HJ1N08Y4M6TG6W5ATXA5P'>Advanced</h3>\n<p>On the <strong>Advanced</strong> tab, you can edit two sections: <strong>Custom Domain Controller</strong> and <strong>Custom Organizational Units</strong>.In the <strong>Custom Domain Controller</strong> section, you can choose any domain controller you want PasswordIQ to scan by entering the computer name or IP address in the <strong>Custom Domain Controller</strong> field.</p>\n<p>In the <strong>Custom Organizational Units</strong> section, you can select one or more Organizational Units for PasswordIQ to scan from the drop-down menu.</p>\n<h2 id='h_01HA0HJ1N0045GD1VXQ7Q3Y1ZX'>Viewing Your Results</h2>\n<p>Because you can only view limited results from the PasswordIQ client, we recommend that you use your KSAT account to view and analyze your results. To navigate to your dashboard, navigate to the <strong>PasswordIQ</strong> tab of your KSAT console.</p>\n<p>To view your scan results, you can either use the default dashboard or create custom dashboards. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4411080243731.html'>How to Use Your PasswordIQ Dashboard</a> article.</p>\n<h2 id='h_01HA0HJ1N0ARTKSSW52BAEPEVP'>Using Smart Groups for Detected Users</h2>\n<p>You can use Smart Groups to enroll the users who were detected for vulnerabilities in phishing or training campaigns. For example, you could use the <strong>PasswordIQ Event</strong> criteria to enroll users with weak passwords in the <strong>Creating Strong Passwords- Security Awareness Training</strong> training module.</p>\n<p>For more information about Smart Groups, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/8354913796115.html'>Smart Groups Overview</a>.</p>\n<h2 id='h_01HA0HJ1N03Z4QRCRZDEJ3PBCA'>Resolving Your Vulnerabilities</h2>\n<p>After you view your results, you can work with your users to resolve their password vulnerabilities. For more information, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/4413383900435.html'>How to Resolve Your Password Vulnerabilities</a> article.</p>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/4406004172435-PasswordIQ-Product-Manual"
  }
}