{
  "article": {
    "id": 4406329507475,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4406329507475.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4406329507475.html",
    "author_id": 360978864968,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 12,
    "vote_count": 16,
    "section_id": 360011640414,
    "created_at": "2021-09-02T19:40:30Z",
    "updated_at": "2025-06-30T09:59:34Z",
    "name": "Security Frequently Asked Questions (FAQs)",
    "title": "Security Frequently Asked Questions (FAQs)",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-06T17:14:46Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized"
    ],
    "body": "<p><span style='color: #333333; background-color: #ffffff;'>1. How do we prevent customers from accessing other customers' data?</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>We leverage logical database separation to ensure customer privacy and confidentiality in our multi-tenant architecture. These strict privacy controls exist in our application code to ensure data privacy and prevent one customer from accessing another customer's data. This is done using unique account identifiers which attribute each user to a specific account. We have many unit and integration tests in place to ensure these privacy controls work as intended. We run these tests every time our codebase is updated. Even one single test failure will prevent new code from being shipped to production.</span></p>\n<h2 id='h_01JNP7651DF0N6G8HCH32YKQB6'> </h2>\n<p><span style='color: #333333; background-color: #ffffff;'>2. How often do we conduct backups?</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'> Our backup and recovery infrastructure is hosted and utilizes the combination of Amazon Simple Storage Service (Amazon S3) and Amazon Relational Database Service (Amazon RDS), which provides resizable database capacity with scalable and efficient data storage infrastructure. The Amazon RDS service is set to back up the production database every day, maintains 35 days of backups, and stores the encrypted database backups in a high-availability data storage location. The Amazon RDS service also allows for a point-in-time restoration of the database for any point in time going back two weeks. Old copies of backups are deleted in accordance with our </span><a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/1500008107581.html'><span class='wysiwyg-underline' style='color: #d54e0e; background-color: #ffffff;'>data retention schedule</span></a><span style='color: #333333; background-color: #ffffff;'>.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'> </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>3. What is KnowBe4's RPO (Recovery Point Objective) and RTO (Recovery Time Objective)?    </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Our RPO is a few minutes to hours but will be no later than 72 hours. Our RTO is 72 hours. </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'> </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>4. What is KnowBe4's change control/management procedure? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>We have implemented a formal change management process that allows staff to request, manage, approve, and control changes that modify services or systems within our environments. The change control process is designed to enforce key development controls each time a change is made to the software, including development and emergency changes. The change management process begins with the identification of what needs to be changed; recording and classification of the change; and continues with the review, approval, test, and staging for implementation of the change. Once implementation has been completed, measured, and reported, the change process is complete.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>    </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>5. Is production data used in your test environment? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Production data is not copied to test environments. We have a daily process that anonymizes our entire production database. This process is overseen by our data privacy and infosec teams. This anonymized database includes anonymized customer account details, such as a customer's address, domain, company name, personal data, and other confidential information. This anonymized database is used for testing as necessary. We refresh this database daily so that when account data is deleted or purged, the account data is also purged from the anonymized database.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>    </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>6. How is KnowBe4 employee access managed and monitored? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>KnowBe4 follows the principle of least privilege and role-based access for its employees. All employee access is logged and monitored.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>    </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>7. What kind of data is collected or processed by Knowbe4?</span></p>\n<div>\n<table style='width: 100%;'>\n<colgroup>\n<col>\n<col>\n</colgroup>\n<tbody>\n<tr>\n<td><span style='color: #333333; background-color: #ffffff;'>KSAT</span></td>\n<td>\n<p><strong><span style='color: #333333; background-color: #ffffff;'>Data Collected Directly From Customer:</span></strong><span style='color: #333333; background-color: #ffffff;'> First Name, Last Name, Manager First Name, Manager Last Name, Business Phone Number, Business Email Address, Mobile Phone Number, Employee Title, Employee Department, IP Address, Browser Information</span></p>\n<p><strong><span style='color: #333333; background-color: #ffffff;'> </span></strong></p>\n<p><strong><span style='color: #333333; background-color: #ffffff;'>Generated Information: </span></strong><span style='color: #333333; background-color: #ffffff;'>Phishing Campaign Results and Metrics, Security Awareness Training Results, Risk Score</span></p>\n</td>\n</tr>\n<tr>\n<td><span style='color: #333333; background-color: #ffffff;'>PhishER</span></td>\n<td><span style='color: #333333; background-color: #ffffff;'>Email information submitted by customer</span></td>\n</tr>\n<tr>\n<td><span style='color: #333333; background-color: #ffffff;'>KCM GRC</span></td>\n<td><span style='color: #333333; background-color: #ffffff;'>Email address, browser information, strictly necessary cookie information, and information customers upload into the console (audit reports, compliance reports, etc.)</span></td>\n</tr>\n</tbody>\n</table>\n</div>\n<p><span style='color: #333333; background-color: #ffffff;'> </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>8. Where can I find a list of your sub-processors? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>A list of our sub-processors can be found </span><a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/1500007523981.html'><span class='wysiwyg-underline' style='color: #d54e0e; background-color: #ffffff;'>here</span></a><span style='color: #333333; background-color: #ffffff;'>.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'> </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>9. How does KnowBe4 ensure the availability of its product? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Our systems run in the cloud and do not run their own routers, load balancers, DNS servers, or virtual systems. Except for a few data sub-processors, services, and data, data is hosted primarily in Amazon AWS data centers. For US-based customers and customers wanting to keep their data residing in the US, we have systems in AWS data centers located in the US region in North Virginia. For customers based in the EU/EEA (including UK and Switzerland), we have systems located in AWS data centers that store production data in DC Dublin, Ireland with a failover in DC Frankfurt. However, a few data sub-processors will process a limited subset of data in the United States. A full accounting of data processing locations can be found in our sub-processor listing.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Our systems are built taking both business continuity and disaster recovery into consideration. Our IT infrastructure, including systems and databases, is spread across multiple Amazon AWS data centers (availability zones) for both the EU and US regions for continuity purposes. Systems are within our own virtual private cloud (VPC) with network access control lists (ACLs) to prevent unauthorized requests from gaining access to the internal network.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>We use the AWS Fargate platform as a service. AWS Fargate is a serverless computer engine for Amazon Elastic Container Service (Amazon ECS) that allows KnowBe4 to run containers without having to provision, configure, and scale clusters of virtual machines (VMs). AWS Fargate manages the underlying infrastructure and clusters. It also automatically scales the application based on demand. AWS Fargate eliminates the need to scale, monitor, patch, and secure EC2 instances.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Data communication between our backend systems and our customers' backend systems is encrypted, which protects data in transit. Data is held in an encrypted Amazon Relational Database Service (Amazon RDS), which provides for availability and data durability. Storage is provided by encrypted Amazon Simple Storage Service (S3) buckets dedicated to KnowBe4. Encryption is enabled to protect data at rest.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'> </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>10. How does KnowBe4 ensure the confidentiality of our data? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Our internal network is protected from public internet traffic via stateful inspection firewalls provided by Amazon AWS. A security group acts as a firewall and controls the traffic allowed into a group of instances. For each security group, custom rules are added that govern the allowed inbound traffic to instances in the group. All other inbound traffic is denied.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Encrypted communication is utilized to protect remote internet sessions to our applications and internal network. Encryption is used to ensure the privacy and integrity of the data being passed over the public network.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>All data is transmitted over secure channels. This includes access to the Service Provider Training console website, information sent to third parties for processing, and logging. Data that is sent between the web server and the database is done within a virtual private cloud within AWS.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Data sent between our applications and our customers' applications is forced through at minimum HTTPS TLS 1.2 (it will default to the highest level of TLS available) connection using modern ciphers. The database instance is encrypted with the AES256 encryption standard.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'> </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>11. What's your data retention policy? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>You can find our data retention policy </span><a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/1500008107581.html'><span class='wysiwyg-underline' style='color: #d54e0e; background-color: #ffffff;'>here</span></a><span style='color: #333333; background-color: #ffffff;'>.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'> </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>12. Will KnowBe4 sign a Business Associate Addendum as described in HIPAA regulations? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>Business associate addendums are required for organizations that process PHI on behalf of a covered entity. Our </span><span style='color: #333333; background-color: #ffffff;'>BAA is available at </span><a href='https://www.knowbe4.com/business-associate-agreement#definitions'><span class='wysiwyg-underline' style='color: #1155cc; background-color: #ffffff;'>https://www.knowbe4.com/business-associate-agreement</span></a><span class='wysiwyg-underline' style='color: #1155cc; background-color: #ffffff;'> </span><span style='background-color: #ffffff;'>and forms part of our Terms of Service or other separately signed agreement, such as a Master Services Agreement (“MSA”), in place between Customers and KnowBe4 covering Customer’s use of KnowBe4’s Services (“Agreement”), where applicable.</span></p>\n<p><span style='color: #333333; background-color: #ffffff;'> </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>12. Is KnowBe4 HIPAA certified? </span></p>\n<p><span style='color: #333333; background-color: #ffffff;'>No and currently no HIPAA currently exists for cloud service providers. Regardless of HIPAA applicability, KnowBe4 aligns its information security program with FedRAMP, NIST 800-53, and ISO 27001 requirements.</span></p>\n<h2 id='h_01JNP7651EG7E9F8A77Z7CKB5M'> </h2>\n<p><span style='color: #333333; background-color: #ffffff;'>13. How are customers able to verify the location their data is stored/what the location of their console is?</span><span style='color: #333333; background-color: #ffffff;'><br></span><span style='color: #333333; background-color: #ffffff;'><br></span><span style='color: #333333; background-color: #ffffff;'>After logging into their console, customers are able to view the URL and verify where their console is stored across KnowBe4’s AWS location offerings. The table below provides information on the console URL and corresponding AWS storage location:</span></p>\n<h2 id='h_01JNP7651E0XSDHX4WGTX6WK5F'> </h2>\n<div>\n<table style='width: 100%;'>\n<colgroup>\n<col>\n<col>\n</colgroup>\n<tbody>\n<tr>\n<td><strong>URL starts with</strong></td>\n<td><strong>Storage location</strong></td>\n</tr>\n<tr>\n<td>training.knowbe4.com</td>\n<td>United States (AWS US-East-1)</td>\n</tr>\n<tr>\n<td>eu.knowbe4.com</td>\n<td>Europe (AWS EU-West-1)</td>\n</tr>\n<tr>\n<td>uk.knowbe4.com</td>\n<td>United Kingdom (AWS EU-West-2)</td>\n</tr>\n<tr>\n<td>de.knowbe4.com</td>\n<td>Germany (AWS EU-Central-1)</td>\n</tr>\n<tr>\n<td>ca.knowbe4.com</td>\n<td>Canada (AWS Central)</td>\n</tr>\n</tbody>\n</table>\n</div>\n<h2 id='h_01HVRSKGYKKNPTSS0B26TEEBY9'>\n<br><br>\n</h2>",
    "user_segment_ids": []
  }
}