{
  "article": {
    "id": 4410161863955,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4410161863955.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/4410161863955.html",
    "author_id": 403968826754,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 9,
    "vote_count": 17,
    "section_id": 26428384978451,
    "created_at": "2021-11-09T18:15:53Z",
    "updated_at": "2025-10-08T21:32:05Z",
    "name": "Phishing Templates Advanced Features Guide",
    "title": "Phishing Templates Advanced Features Guide",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-10-01T13:30:53Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "MAPS",
      "PHISHING TEST",
      "account settings",
      "acknowledge a policy",
      "Template",
      "PhishER",
      "How to Create an Action in PhishER",
      "SCORM files",
      "PhishML",
      "Learner Dashboard",
      "access account",
      "Security Coach",
      "#localize"
    ],
    "body": "<p>In your KSAT console, you can find the <strong>Phishing Templates </strong>subtab under the <strong>Phishing </strong>tab. This subtab allows you to search through our selection of system templates to meet your organization’s needs. To learn more about this subtab, see the sections below. You can also exclude system templates from your phishing campaigns, manage templates, create new templates, and manage template topics.</p>\n<h2 id='h_01J44MREKYW5KA96B7E3TJEV4G'>How to Opt in to Advanced Features</h2>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>All accounts will be migrated to phishing templates advanced features in 2025. New accounts created after January 2025 will be automatically migrated. For more information and answers to questions that may not be covered in this article, please see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/45009014447251.html'>FAQ: Phishing Templates Advanced Features</a> article.</div>\n</div>\n<p>By default, advanced features for the <strong>Phishing Templates</strong> subtab are disabled. To use the advanced features, click the <strong>Opt In</strong> button.</p>\n<p>When you opt in to the advanced features, the <strong>Legacy Email Templates</strong> subtab of the <strong>Phishing</strong> tab will no longer display in your console. You'll be able to use the<strong> Phishing Templates</strong> subtab to search for your templates instead.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplatesTab.png'> <img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplatesTab.png'></a></p>\n<p>For a list of more changes that occur when you opt in, see the list below.</p>\n<ul>\n<li>Phishing campaign <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115011714968.html'>categories</a> will be migrated to topics. This migration may take up to one hour.</li>\n<li>Custom phishing templates will transfer over when you opt in to advanced features.</li>\n<li>Our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115010414108.html'>Security Hints and Tips</a> and <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/226314167.html'>Scam of the Week</a> newsletters will be located in the <strong>Users</strong> &gt; <strong>Messages</strong> section.</li>\n<li>Existing phishing campaigns, Scam of the Week campaigns, and Security Hints and Tips campaigns will continue to run and can be edited.\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Phishing Campaigns using Scam of the Week and Security Hints and Tips from the legacy email templates subtab will need to be added in the <strong>Users </strong>&gt; <strong>Messages</strong> section.</div>\n</div>\n</li>\n<li>Phishing campaigns using system templates will automatically be localized. If you have users with multiple languages on your account, <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360060622513.html'>user phishing languages must be set</a>.\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Because not all system templates are available in all user phishing languages, you must set the default phishing language for the account in Account Settings. Be advised that a phishing campaign will not be created if no templates are available in a user’s language.</div>\n</div>\n</li>\n<li>If you have a partner account and opt in at the partner level, all your managed accounts will be opted in to the new user experience.\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>For managed accounts to receive managed phishing campaigns, both the managed and the partner accounts must be opted in to advanced features.</div>\n</div>\n</li>\n<li>\n<a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/228001628.html'>Hidden system templates or categories</a> will become <a href='#h_01J44NY0RCNT9DX147DBB84X2C'>excluded system templates or topics.</a>\n</li>\n</ul>\n<h2 id='h_01HS1N5KB4BHY2TY86YVVMF9PK'>System Templates</h2>\n<p>In the <strong>System Templates </strong>section of the <strong>Phishing Templates </strong>subtab, you can search through system templates by using filters and clone templates to use in your phishing campaigns.</p>\n<h3 id='h_01JRDNK9CYRD36M196HAS4YQ6Q'>System Template Origins</h3>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/AdvancedPhishingFeatures_SystemTemplateOrigin.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/AdvancedPhishingFeatures_SystemTemplateOrigin.png' alt=''> </a></p>\n<ul>\n<li>\n<strong>Community</strong>: These phishing templates have been submitted to our System Templates by other KnowBe4 admins.</li>\n<li>\n<strong>KnowBe4</strong>: These templates include original and innovative phishing methods created by the KnowBe4 team.</li>\n<li>\n<strong>Reported Phish</strong>: Our users reported these phishing templates using our Phish Alert Button (PAB). Admins can use these trending phishing emails to phish their users by using the Reported Phishes of the Week topic, which is updated weekly. We remove any malicious links and identifying information from the original phishing emails before adding them to our template library.</li>\n<li>\n<strong>Real Scam</strong>: These phishing emails are based on actual scams that the KnowBe4 templates team has researched in security news and blogs. We have recreated them for admins to use when phishing their users.</li>\n</ul>\n<h3 id='h_01HS1N5KB4DAWN62E46XFG5PEA'>Searching for System Templates</h3>\n<p>To learn how you can search for templates on the <strong>Phishing Templates </strong> subtab, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingTemplates_Settings.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingTemplates_Settings.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>System Topics:</strong> Use this sidebar menu to view and select from system topics.</li>\n<li>\n<strong>Show Excluded Topics:</strong> Use this toggle to only show topics you have excluded from use.</li>\n<li>\n<strong>Languages:</strong> Use this filter to find localized templates for the selected languages.</li>\n<li>\n<strong>Difficulty:</strong> Use this filter to find templates with the selected difficulty ratings. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/218333717.html'>Template Difficulty Ratings Overview</a> article.</li>\n<li>\n<strong>Search:</strong> Use this filter to find templates with a specific keyword in the title.</li>\n<li>\n<strong>Additional Filters:</strong> Select this drop-down menu to view additional filter options.</li>\n<li>\n<strong>Attack Vectors:</strong> Use this filter to find templates with specific attack vectors, such as attachments with links.</li>\n<li>\n<strong>Template Features:</strong> Use this filter to find templates with specific features, such as data entry templates.</li>\n<li>\n<strong>Placeholders:</strong> Use this filter to find templates that contain specific placeholders, such as the Company Name placeholder.</li>\n<li>\n<strong>Red Flags:</strong> Use this filter to find templates that contain specific red flags, such as the Aggressive Content red flag.</li>\n</ol>\n<h3 id='h_01HS1N5KB4P3SZGB7DNRQ3C75M'>Viewing Your Search Results</h3>\n<p>After you finish selecting your filters, you will see a list of templates that meet your criteria in the results table. Here, you can view information about the template, including the template’s name, category, language, difficulty rating, when it was last updated, and origin. You can also clone templates, preview templates, and clear your filters.</p>\n<p>For more information, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/SearchResults.png'><img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/SearchResults.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Clear Filters</strong>: You can click this link to remove all of your selected filters and reset the template list.</li>\n<li>\n<strong>Preview</strong>: You can click this icon to preview the template.</li>\n<li>\n<strong>Exclude:</strong> Use this toggle to exclude individual templates. For more information, see the <a href='#h_01J44NY0RCNT9DX147DBB84X2C'>Excluding Templates from Campaigns</a> section below.</li>\n</ol>\n<h3 id='h_01HS1N5KB4TMNN2EJYQ2RN40DR'>Cloning Templates for Use</h3>\n<p>On the <strong>Phishing Templates </strong> subtab, you can clone a template to use in your phishing campaigns. When you clone a template, it will automatically be saved to the <strong>My Templates</strong> section of the <strong>Phishing Templates </strong>subtab.</p>\n<p>To clone a template for use, follow the steps below:</p>\n<ol type='a'>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to <strong>Phishing </strong>&gt;<strong> Phishing Templates </strong>.</li>\n<li>Select the check box next to the template or templates you want to clone. Then, click <strong>Clone Selected Templates</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneTemplateWindow.png'><img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneTemplateWindow.png' alt=' '></a></p>\n</li>\n<li>The <strong>Clone Selected Templates</strong> pop-up will open. Select a language and topic for the templates.</li>\n<li>Once you've made your selections, click <strong>Clone</strong> at the bottom of the pop-up window.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneSelectedTemplates.png'><img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/CloneSelectedTemplates.png' alt=' '></a></p>\n</li>\n<li>These templates will now appear in the <strong>My Templates</strong> section.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplates-MyTemplates.png'> <img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/PhishingTemplates-MyTemplates.png'></a></p>\n</li>\n</ol>\n<div class='callout callout-note'>\n<div>\n<strong>Note:</strong> If you would like to copy a custom template, you'll need to copy the source code and paste it in a new template using the <strong>Source</strong> button.</div>\n</div>\n<h3 id='h_01J44NY0RCNT9DX147DBB84X2C'>Excluding Templates from Campaigns</h3>\n<p>In the <strong>System Templates</strong> section, you can exclude templates from being used in phishing campaigns. For example, if you would like to create a phishing campaign that uses <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/1500003848062.html'>automated template selection</a> to select templates from the <strong>Social Networking</strong> topic, you could use this feature to exclude a template that is in that topic.</p>\n<p>There are two methods for excluding templates. To exclude an individual template, click the <strong>Exclude Template</strong> toggle in the <strong>Actions</strong> column.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/PhishingTemplates/ExcludeTemplateToggle.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/PhishingTemplates/ExcludeTemplateToggle.png' alt=''> </a></p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> Hiding topics does not remove them from the list but highlights them in gray.</div>\n</div>\n<p>To exclude multiple templates, click the <strong>Templates Exclusions</strong> link in the top-right corner of the page, which will take you to the <strong>Template Exclusions</strong> page. On this page, you can use the filters to exclude templates that meet your selected criteria. For more information, see the screenshot and list below:</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong> Translated versions of these templates will also be excluded from phishing campaigns.</div>\n</div>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/TemplateExclusions.png'> <img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/TemplateExclusions.png'></a></p>\n<ol type='a'>\n<li>\n<strong>Topics:</strong> You can use this filter to exclude templates that cover specific topics. You can also use the <strong>Show Excluded Topics</strong> toggle to show<strong> Excluded Topics</strong> in the list. For a full list of topics, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/115011714968.html'>Phishing Template Category Glossary</a>.</li>\n<li>\n<strong>Attack Vectors:</strong> You can use this filter to exclude templates that include specific attack vectors.</li>\n<li>\n<strong>Template Features:</strong> You can use this filter to exclude templates with specific features.</li>\n<li>\n<strong>Placeholders:</strong> You can use this filter to exclude templates that contain specific placeholders.</li>\n<li>\n<strong>Only Show Individual Exclusions:</strong> You can use this toggle to only show individual template exclusions.</li>\n<li>\n<strong>Exclusion Type:</strong> This column shows the exclusion type for each template. The <strong>hidden eye</strong> <strong>icon</strong> represents individual exclusions and the <strong>filter</strong> <strong>icon</strong> represents criteria exclusions.</li>\n</ol>\n<h2 id='h_01J44P508PM8NHFDB4SYAJ4QYN'>My Templates</h2>\n<p>In the <strong>My Templates</strong> section of the <strong>Phishing Templates</strong> subtab, you can search through your templates and manage your template topics.</p>\n<div class='callout-note'>\n<div>\n<strong>Important: </strong>We also offer the option to generate AI phishing templates based on your specifications. For more information, see the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/30990080170771.html'>AIDA Template Generation Guide</a>.</div>\n</div>\n<h3 id='h_01J44PC6PDBTHQ2CYZF9J4EBGE'>Searching for Your Templates</h3>\n<p>In the <strong>My Templates</strong> section, you can use filters to navigate and search for your templates. For more information about these filters, see the screenshot and list below.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTemplates.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTemplates.png' alt=''> </a></p>\n<ol>\n<li>\n<p><strong>My Topics:</strong> Use this sidebar menu to view and select from custom topics.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>You can select multiple topics at the same time. Click a topic row to select and highlight it. To deselect a topic, click the topic row again, and the highlight will be removed.</div>\n</div>\n</li>\n<li>\n<p><strong>+ Add:</strong> Use this button to create and add new topics to the <strong>My Topics</strong> sidebar menu.</p>\n</li>\n<li>\n<p><strong>Languages:</strong> Use this filter to find localized templates for the selected languages.</p>\n</li>\n<li>\n<p><strong>Difficulty:</strong> Use this filter to find templates that have the selected difficulty ratings. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/218333717.html'>Template Difficulty Ratings Overview</a> article.</p>\n</li>\n<li>\n<p><strong>Search:</strong> Use this filter to find templates with a specific keyword in the title.</p>\n</li>\n</ol>\n<h3 id='h_01J44PEQSTD3RGTACYXE007HYZ'>Viewing Your Search Results</h3>\n<p>Once your filters are selected, the results table will display templates that match your selected filter criteria. For more information about the results table, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/ResultsTable.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/ResultsTable.png' alt=''> </a></p>\n<ol type='a'>\n<li>\n<strong>Template Name:</strong> This column displays the name of the template.</li>\n<li>\n<strong>Updated:</strong> This column displays when the template was last updated.</li>\n<li>\n<strong>Language:</strong> This column displays the localized language used in the template.</li>\n<li>\n<strong>Difficulty:</strong> This column displays the assigned difficulty rating of the template.</li>\n<li>\n<strong>Topics:</strong> This column displays the assigned template topics.</li>\n<li>\n<strong>Preview:</strong> Click the eye icon to preview the template.</li>\n<li>\n<strong>Import:</strong> Click this button to open the <strong>Import Templates</strong> pop-up window and import custom templates.</li>\n<li>\n<strong>Clear Filters:</strong> Click this button to remove all the selected filters and reset the template list.</li>\n</ol>\n<h3 id='h_01J44T4CJEBB9FJNPRK2P13XGW'>Managing Your Template Topics</h3>\n<p>The <strong>My Templates</strong> section can also be used to add, edit, and remove template topics. Add a topic to your templates to easily find and select the types of templates you want to add to your phishing campaigns.</p>\n<div class='callout-remember'>\n<div>\n<strong>Important:</strong>Before adding a template to a topic, you'll need to create at least one topic.</div>\n</div>\n<h4 id='h_01JPQFV19267J1RJEW8YTW80VN'>Adding a Topic</h4>\n<p>To add a topic, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to <strong>Phishing</strong> &gt; <strong>Phishing Templates</strong>.</li>\n<li>Click <strong>+ Add</strong> next to <strong>My Topics</strong>.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/Add.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/Add.png' alt=''> </a></p>\n</li>\n<li>In the text field, enter a name for the topic.</li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<p>Once you add topics, you can edit or remove any topic by hovering over the chosen topic in the sidebar menu and clicking the <strong>pencil</strong> or <strong>trash can</strong> icon.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopicsSidebar.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopicsSidebar.png' alt=''> </a></p>\n<h4 id='h_01JPQG7SP678TVS26JM0SCWDR7'>Adding a Template to a Topic</h4>\n<p>To add templates to topics, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to <strong>Phishing</strong> &gt; <strong>Phishing Templates</strong>.</li>\n<li>Select <strong>My Templates</strong>.</li>\n<li>Navigate to your desired template in the results table.</li>\n<li>Select the check box next to the template you would like to add to a topic.</li>\n<li>From the <strong>Select Topic</strong> drop-down menu, select the topic that you would like to add the template to.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/PhishingTemplates/SelectTopicDropDownMenu.png'> <img src='https://helpimg.s3.amazonaws.com/PhishingTemplates/SelectTopicDropDownMenu.png' alt=''> </a></p>\n</li>\n<li>Click <strong>Add</strong>.</li>\n</ol>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>You can add templates to more than one topic.</div>\n</div>\n<h4 id='h_01JPQN8H35V2HWPRM4KG65MRT9'>Removing a Template from a Topic</h4>\n<p>To remove templates from topics, follow the steps below:</p>\n<ol>\n<li>Log in to your KSAT console.</li>\n<li>Navigate to <strong>Phishing</strong> &gt; <strong>Phishing Templates</strong>.</li>\n<li>Select <strong>My Templates</strong>.</li>\n<li>Navigate to your desired template in the results table.</li>\n<li>Select the check box next to the template.</li>\n<li>From the <strong>Select Topic</strong> drop-down menu, select the topic that you would like to remove the template from.\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopics_SelectTopics.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/Phishing/PhishingTemplates/MyTopics_SelectTopics.png' alt=''> </a></p>\n</li>\n<li>Click <strong>Remove</strong> to remove the template from the topic.</li>\n</ol>\n<h2 id='h_01J44TCSQA7BNVWMAK4DR28CEC'>Creating Phishing Campaigns with Template Topics</h2>\n<p>When you create phishing campaigns, you'll have access to the <strong>New Phishing Campaign</strong> page with a <strong>Template Topics</strong> drop-down menu. This drop-down menu allows you to select topics for your phishing templates.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_TempTopics.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_TempTopics.png' alt=''> </a></p>\n<p>In the <strong>Template Selection</strong> drop-down menu, you can select how your users will receive their emails. You can select a specific template or use one of our Automated Template Selections: <strong>AIDA Selected</strong>, <strong>Full Random</strong>, or <strong>Random</strong>. If you select a specific template, the <strong>Specific Template</strong> drop-down menu will appear. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/1500003848062.html'>Automated Template Selection Overview</a> article.</p>\n<p>In the <strong>Available Templates</strong> drop-down menu, you can view the list of phishing templates that will be sent to your users. From this list, you can view the <strong>Template Name</strong>, <strong>Topics</strong>, and <strong>Languages</strong>. You can also preview the template.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_AvailableTemplates2.png'> <img src='https://helpimg.s3.us-east-1.amazonaws.com/phishing+campaigns/PhishingAdvFeatures_AvailableTemplates2.png' alt=''> </a></p>",
    "user_segment_ids": []
  }
}