{
  "article": {
    "id": 6654432814355,
    "url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/6654432814355.json",
    "html_url": "https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/6654432814355.html",
    "author_id": 403968826754,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 15,
    "vote_count": 15,
    "section_id": 26940101886739,
    "created_at": "2022-06-01T19:49:25Z",
    "updated_at": "2025-09-29T14:37:42Z",
    "name": "SecurityCoach Product Manual",
    "title": "SecurityCoach Product Manual",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-09-18T20:34:25Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "localized",
      "answerbot",
      "securitycoach",
      "security coach",
      "answerbot_securitycoach"
    ],
    "body": "<p>SecurityCoach is an add-on product for the KnowBe4 Security Awareness Training (KSAT) console that is available for our Platinum-level and Diamond-level customers to purchase. SecurityCoach can be used to coach your users about their behavior in real time using SecurityTips. You can customize your coaching experience by integrating your vendors, reviewing your detection rules, setting up real-time coaching campaigns, and choosing specific SecurityTip media and notifications to send to your users.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>You can use SecurityTips to warn users about their risky behaviors or to reward users for practicing good security behaviors. For example, if a user successfully reports a simulated phishing test, you can send a SecurityTip to congratulate them for spotting the phishing signs.</div>\n</div>\n<p>Before you can begin monitoring user behavior and coaching your users in real time, you will need to set up SecurityCoach in your KSAT console. To set up SecurityCoach, you must configure your vendor integrations, set up a delivery method for your SecurityTips, review your rule detections, and create a real-time coaching campaign.</p>\n<p>To learn more about setting up SecurityCoach, see the subsections below.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>To view a SecurityCoach product demo, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/360000937648.html'>KnowBe4 Product Demos</a> article.</div>\n</div>\n<h2 id='h_01H9QWK8PTY6EJJTCSDBD16BZ2'>Configuring Security Vendor Integrations</h2>\n<p>First, you'll need to set up your third-party vendor integrations in the <strong>SecurityCoach </strong>&gt; <strong>Setup</strong> tab of your KSAT console. Once you set up a vendor integration, the vendor's data will be available in SecurityCoach. You can use this data to begin monitoring user behaviors.</p>\n<p>For more information about setting up vendor integrations in SecurityCoach, see our <a href='https://support.knowbe4.com/hc/en-us/sections/10969917980435'>Setting Up Integrations</a> article.</p>\n<h2 id='h_01H9QWK8PT214EVB87E4WSKH2M'>Adding a Delivery Method</h2>\n<p>Email is pre-configured as the default delivery method for SecurityCoach. If you coach your users via email, SecurityTips will be sent to their user email address that is set in the <strong>Users</strong> tab of your KSAT console.</p>\n<p><br>SecurityCoach also supports integrations with Google Chat, Microsoft Teams, and Slack. If your organization uses any of these platforms for communication, we recommend configuring one as your primary delivery method, so you can coach your users where they communicate most often.</p>\n<div class='callout-tip'>\n<div>\n<strong>Tip:</strong>If Google Chat, Microsoft Teams, or Slack are set as the primary delivery method, email can be used as a backup delivery method.</div>\n</div>\n<p>For more information on setting up delivery methods, see our <a href='https://support.knowbe4.com/hc/en-us/sections/20416205509011-Configuring-Delivery-Methods'>Configuring Delivery Methods</a> article.</p>\n<h2 id='h_01H9QWK8PT5HHCX6F30SFH3W05'>Mapping Users</h2>\n<p>Mapping your users to identifiers, such as a hostname, helps link user behavior to specific users. User mapping is done automatically for email and web security vendors using the user email addresses set in the <strong>Users</strong> tab of your KSAT console. You may also need to map additional identifiers for your endpoint security vendors. For example, you may need to map users to their hostnames, usernames, or device IDs.</p>\n<p>You can configure mapping rules to automatically map users for you, manually map users by uploading a CSV file, or use a combination of both methods. SecurityCoach also provides mapping recommendations for you to review.</p>\n<p>For more information about mapping users, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7156417916307.html'>Map Users in SecurityCoach</a> article.</p>\n<h2 id='h_01H9QWK8PTHPMWP7FNS5T810AG'>Reviewing Rule Detections</h2>\n<p>SecurityCoach provides system detection rules for each security vendor. Detection rules identify which user behaviors you would like to track using the data provided by your integrated vendors. When you integrate a vendor, these detection rules are enabled automatically, but you can also create custom detection rules for your organization's needs.</p>\n<p>We recommend reviewing your top detection rules and prioritizing the user behaviors you want to target with your real-time coaching campaigns. To review your top detection rules, navigate to the <strong>Reports</strong> subtab of SecurityCoach and click <strong>Report</strong> for the <strong>Detection Rules Report</strong>. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159155080851.html'>SecurityCoach Reporting Overview</a> article.</p>\n<p>To view all your detection rules, navigate to <strong>SecurityCoach</strong> &gt; <strong>Detection Rules</strong>. For more information about detection rules, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159083016723.html'>Detection Rules Guide</a>.</p>\n<h2 id='h_01HZPZAHGZ24V6S6Y9SNRZHCWX'>Creating a Test Mode Campaign</h2>\n<p>To test how your real-time coaching campaigns will perform before you begin coaching your users, you can use our <strong>Test Mode</strong> feature to create a test mode campaign. In a test mode campaign, SecurityCoach detects user behaviors but does not send coaching to your users. You can turn your test mode campaign into a <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159255924371.html'>real-time coaching campaign</a> at any time. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/30053728045459.html'>Working with Test Mode Campaigns</a> article.</p>\n<h2 id='h_01H9QWK8PTTYHKTB4PC9FVQCMF'>Creating a Real-Time Coaching Campaign</h2>\n<p>Finally, we recommend creating a real-time coaching campaign. Real-time coaching campaigns send SecurityTips to users when user behaviors are detected. SecurityTips can be sent through Slack, Microsoft Teams, Google Chat, or email.</p>\n<p>To create a real-time coaching campaign, navigate to the <strong>Real-Time Coaching</strong> subtab of SecurityCoach. For more information, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159255924371.html'>Real-Time Coaching Campaigns Guide</a> article.</p>\n<h2 id='h_01H9QWK8PT1AHNPFDR6H6TRW9E'>SecurityCoach Workflow</h2>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/securitycoach_workflow.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/securitycoach_workflow.png' alt=' '></a></p>\n<p>The SecurityCoach workflow involves both SecurityCoach and the vendors that you have integrated. For more information, see the workflow list below:</p>\n<ol>\n<li>Your integrated vendors monitor user behaviors using email, endpoint, and browser events.</li>\n<li>The vendors share those events with SecurityCoach.</li>\n<li>SecurityCoach processes this information and determines whether the vendor events match the criteria for any of your detection rules.</li>\n<li>If an event matches a detection rule’s criteria, the detection rule is triggered, and the event is added to the responsible user’s events timeline.</li>\n<li>If the detection rule is part of a real-time coaching campaign, the user will also receive a SecurityTip to coach their behavior.</li>\n</ol>\n<p>SecurityCoach events can also influence your users’ and organization's Risk Score. For more information, see the Security Types section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/30048977242259.html'>SmartRisk Agent™ and Risk Score Guide</a>.</p>\n<h2 id='h_01H9QWK8PT0HT2TTBPVVGW4MS8'>Navigating Your SecurityCoach Product</h2>\n<p>The <strong>SecurityCoach</strong> tab of your KSAT console includes six subtabs:</p>\n<ul>\n<li><a href='#h_01H9QWK8PTRQGBKT541WR7FCQE'>Dashboard</a></li>\n<li><a href='#h_01H9QWK8PVRGRDFP4ESSCETZEM'>Real-Time Coaching</a></li>\n<li><a href='#h_01H9QWK8PVCTCXZS5EE1HQ4AQJ'>Detection Rules</a></li>\n<li><a href='#h_01H9QWK8PV4860DPZ47MCRWF8Y'>SecurityTips</a></li>\n<li><a href='#h_01H9QWK8PVWE855F1WA4WT4TMS'>Setup</a></li>\n<li><a href='#h_01H9QWK8PVGRNCQZTVSTN9P6JR'>Reports</a></li>\n</ul>\n<p>You can navigate these subtabs to view your SecurityCoach data, create real-time coaching campaigns, review detection rules, preview SecurityTips, set up configurations, view reports, and more. For more information about each of these subtabs, see the subsections below.</p>\n<h3 id='h_01H9QWK8PTRQGBKT541WR7FCQE'>Dashboard</h3>\n<p>When you navigate to the <strong>SecurityCoach</strong> tab of your KSAT console, the <strong>Dashboard</strong> subtab will display automatically. In this subtab, you can read a quick overview of your SecurityCoach data, including charts and summaries.</p>\n<p>During your initial setup, the dashboard will also display the <strong>SecurityCoach Setup</strong> section. This section guides you through the four steps to start your coaching program. After you create a real-time coaching campaign, this section will be replaced with your real-time coaching data.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/KMSAT/SecurityCoach/Dashboard/EN/SecurityCoachSetupSection.png'><img src='https://helpimg.s3.amazonaws.com/KMSAT/SecurityCoach/Dashboard/EN/SecurityCoachSetupSection.png' alt=' '></a></p>\n<p>For more information about the dashboard, see the screenshot and list below:</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/securitycoach_dashboard.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/securitycoach_dashboard.png' alt=' '></a></p>\n<ol type='a'>\n<li>\n<strong>Last 90 days</strong>: Your dashboard will display data and activity from the last 90 days by default. However, you can change this date range by clicking on the <strong>Last 90 days</strong> drop-down list and selecting a different date range.</li>\n<li>\n<strong>Notifications</strong>: Click the <strong>bell</strong> icon to view your SecurityCoach notifications.</li>\n<li>\n<strong>Real-Time Coaching Summary</strong>: This section displays data for your real-time coaching campaigns.</li>\n<li>\n<strong>SecurityTips Delivered</strong>: This section displays the total number of SecurityTips that have been sent to users.</li>\n<li>\n<strong>Users Coached</strong>: This section displays the percentage of users who received SecurityTips.</li>\n<li>\n<strong>Active Campaigns</strong>: This section displays the total number of active real-time coaching campaigns.</li>\n<li>\n<strong>Vendor Events Summary</strong>: This section displays data for your vendor events.</li>\n<li>\n<strong>Total Events</strong>: This section displays the number of events from your integrated vendors.</li>\n<li>\n<strong>Users with Events</strong>: This section displays the number of users with events.</li>\n<li>\n<strong>Mapped Events</strong>: This section displays the number of events mapped to users. The percentage represents the number of your organization’s events that are mapped.</li>\n<li>\n<strong>Unmapped Events</strong>: This section displays the number of your organization’s events that aren’t mapped to a user. The percentage represents the number of your organization's events that aren’t mapped.</li>\n<li>\n<strong>Top Detection Rules</strong>: This chart displays your 10 most common detections.</li>\n<li>\n<strong>Top Users by Rule Detections</strong>: This section displays the users with the most rule detections.</li>\n</ol>\n<h3 id='h_01H9QWK8PVRGRDFP4ESSCETZEM'>Real-Time Coaching</h3>\n<p>You can create and manage real-time coaching campaigns and test mode campaigns by navigating to <strong>SecurityCoach</strong> &gt; <strong>Real-Time Coaching</strong> subtab. Real-time coaching campaigns can be used to send SecurityTips to coach users when specific user behaviors are detected. SecurityTips can be sent through Slack, Microsoft Teams, Google Chat, or email.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>Your users must be in your KSAT console in order to receive notifications and SecurityTips.</div>\n</div>\n<p>For more information about setting up a real-time coaching campaign, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159255924371.html'>Real-Time Coaching Campaigns Guide</a>.</p>\n<p><br>You can create a test mode campaign to see how your real-time coaching campaign will perform before you begin coaching your users. For more information about setting up a test mode campaign, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/30053728045459.html'>Working with Test Mode Campaigns</a> article.</p>\n<h3 id='h_01H9QWK8PVCTCXZS5EE1HQ4AQJ'>Detection Rules</h3>\n<p>You can create and manage detection rules in <strong>SecurityCoach</strong> &gt; <strong>Detection Rules</strong>. Detection rules identify what user behavior you would like to track from your integrated vendors. These detections will then appear on your users’ timelines. You can also create real-time coaching campaigns to send SecurityTips to users based on these rules.</p>\n<p>For more information about creating and managing detection rules, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159083016723.html'>Detection Rules Guide</a>.</p>\n<h3 id='h_01H9QWK8PV4860DPZ47MCRWF8Y'>SecurityTips</h3>\n<p>The <strong>SecurityTips</strong> subtab displays the SecurityTip graphics and notification templates you can use in your real-time coaching campaigns. SecurityTips can be used to coach your users about their user behaviors and how to improve their security posture.</p>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/securitycoach_catalog_security_tip_examples.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/securitycoach_catalog_security_tip_examples.png' alt=' '></a></p>\n<p>You can use our SecurityTip graphics or upload your own. SecurityTips are localized based on the recipient's training language. For more information about custom graphics, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/19141218523539.html'>Upload Custom SecurityTip Graphics</a> article.</p>\n<p>To learn more about the SecurityTips subtab and how to use it, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/41208808109971.html'>SecurityTips Guide</a>.</p>\n<h3 id='h_01H9QWK8PVWE855F1WA4WT4TMS'>Setup</h3>\n<p>In the <strong>SecurityTips</strong> &gt; <strong>Setup</strong> subtab, you can configure your vendor integrations, map your users, and set up a delivery method for your SecurityTips. The <strong>Setup</strong> subtab includes the three pages listed below:</p>\n<ul>\n<li>\n<strong>Security Vendor Integrations</strong>: On this page, you can view your active vendor integrations, set up new vendor integrations, and fix broken vendor integrations. For more information about vendor integrations, see our <a href='https://support.knowbe4.com/hc/en-us/sections/10969917980435'>Setting Up Integrations</a> articles.</li>\n<li>\n<strong>User Mapping Setup</strong>: On this page, you can map your users, review mapping recommendations, and view reports related to user mapping. For more information about user mapping, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7156417916307.html'>Map Users in SecurityCoach</a> article.</li>\n<li>\n<strong>Delivery Setup</strong>: On this page, you can set up and view your delivery methods for SecurityCoach. For more information about setting up delivery channels, see our <a href='https://support.knowbe4.com/hc/en-us/sections/10969917980435'>Configuring Delivery Methods</a> articles.</li>\n</ul>\n<p><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/security_coach_setup.gif'><img src='https://helpimg.s3.amazonaws.com/security_coach/security_coach_setup.gif' alt=' '></a></p>\n<h3 id='h_01H9QWK8PVGRNCQZTVSTN9P6JR'>Reports</h3>\n<p>The <strong>Reports</strong> subtab includes reports based on your SecurityCoach security risks, detection rules, and real-time coaching campaigns. The reports are listed below:</p>\n<ul>\n<li>Detection Rules Report</li>\n<li>Real-Time Coaching Report</li>\n<li>Real-Time Coaching Activity Reports</li>\n<li>Risk Report for Endpoint Security Vendors</li>\n<li>Risk Report for Email Security Vendors</li>\n<li>Risk Report for Web Security Vendors</li>\n<li>Vendor Events Report</li>\n</ul>\n<p>Every report, except for the <strong>Vendor Events Report</strong>, displays data and activity over the last 90 days by default. You can adjust the report view to reflect a different date range by using the drop-down menu at the top-right corner of the specific report.</p>\n<p>The <strong>Vendor Events Report</strong> displays up to 10,000 of the most recent events that occurred over the last 30 days. You can adjust the date range for this report up to the last 30 days using the <strong>Date Range</strong> drop-down menu.</p>\n<div class='callout-note'>\n<div>\n<strong>Note:</strong>The<strong> Vendor Events Report</strong> shows only events that have been linked to detection rules. To include more events in your report, visit the <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159083016723.html'>Creating a Custom Detection Rule</a> section of our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159083016723.html'>Detection Rules Guide</a> to create and link detection rules to the events.</div>\n</div>\n<p>For more information about SecurityCoach reports, see our <a href='https://Criscras13.github.io/API_testing/api/v2/help_center/en-us/articles/7159155080851.html'>SecurityCoach Reporting Overview</a>.</p>",
    "user_segment_ids": []
  }
}