{
  "article": {
    "id": 7159155080851,
    "url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/7159155080851.json",
    "html_url": "https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/7159155080851.html",
    "author_id": 1915070258405,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 7,
    "vote_count": 7,
    "section_id": 20416447812499,
    "created_at": "2022-06-21T15:05:25Z",
    "updated_at": "2025-03-11T17:55:15Z",
    "name": "SecurityCoach Reporting Overview",
    "title": "SecurityCoach Reporting Overview",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-03-11T17:55:15Z",
    "user_segment_id": null,
    "permission_group_id": 195648,
    "content_tag_ids": [],
    "label_names": [
      "templates",
      "what do i send after baseline",
      "advance reports",
      "localized",
      "template search",
      "securitycoach",
      "Security Coach"
    ],
    "body": "<p>SecurityCoach offers a range of reports that provide insight into your organization’s security risks, detection rules, and real-time coaching campaigns. These reports can help you understand where you may need to improve your security awareness program. You can also use these reports to track trends in your users' risky activity over time.</p>\n<p>To view SecurityCoach reports in your KSAT console, navigate to <strong>SecurityCoach</strong> &gt; <strong>Reports</strong>. To view a <strong>SecurityCoach: Behaviors and Coaching</strong> report, click the<strong> Report</strong> button for the specific report. To view a <strong>Risk Overview for Vendor Type </strong>report, click the name of the report.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>By default, each report displays data and activity from the last 90 days. However, you can adjust the report to reflect a different date range by clicking the drop-down menu at the top-right corner of the report.</div>\n</div>\n<p>In the <strong>SecurityCoach: Behaviors and Coaching</strong> section, you can view an overview of your real-time coaching campaign, an overview of your detection rules, or an overview of your vendor events. To learn more about each report type, see the sections below.</p>\n<h2 id='h_01HGGBF9DEFARP91YJXNSKPEC1'>Real-Time Coaching Report</h2>\n<p>The <strong>Real-Time Coaching Report</strong> provides an overview of your real-time coaching campaigns.</p>\n<p>To learn more about the data in this overview, see below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/real_time_coaching_overview.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/real_time_coaching_overview.png' alt=' '></a></div>\n<ol role='list'>\n<li>\n<strong>Real-Time Coaching Overview</strong>: This section provides information about your real-time coaching campaigns.\n<ol role='list' type='a'>\n<li>\n<strong>Total Users Coached</strong>: This number displays the number of users that received SecurityTips during the selected date range.</li>\n<li>\n<strong>Users Coached Multiple Times</strong>: This number displays the number of users that received more than one SecurityTip during the selected date range.</li>\n<li>\n<strong>New Users Coached</strong>: This number displays the number of users that received a SecurityTip during the selected date range that had never received a SecurityTip before.</li>\n<li>\n<strong>SecurityTips Delivered</strong>: This number displays the total number of SecurityTips delivered to users during the selected date range.</li>\n</ol>\n</li>\n<li>\n<strong>Top Real-Time Coaching Campaigns by SecurityTips Delivered</strong>: This chart displays your real-time coaching campaigns with the most detections of risky activity during the selected date range. This report will include up to ten real-time coaching campaigns.</li>\n<li>\n<strong>Top 10 Coached Groups</strong>: This table displays a list of your Smart Groups that received the most SecurityTips during the selected date range.</li>\n<li>\n<strong>SecurityTips Delivered Over Time</strong>: This graph displays the changes in the number of SecurityTips delivered during the selected date range.</li>\n<li>\n<strong>Top 10 Coached Users</strong>: This table displays a list of your users that received the most SecurityTips during the selected date range. This report will include up to ten users.</li>\n</ol>\n<h2 id='h_01HGGBF9DE48Q7CDF16PK6F518'>Detection Rules Report</h2>\n<p>The <strong>Detection Rules Report</strong> provides an overview of your active detection rules.</p>\n<p>To learn more about the data in this overview, see below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/active_rules_overview.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/active_rules_overview.png' alt=' '></a></div>\n<ol role='list'>\n<li>\n<strong>Detections Rule Overview</strong>: This section provides information about your detection rules.\n<ol role='list' type='a'>\n<li>\n<strong>Total Events</strong>: This number displays the total number of events during the selected date range.</li>\n<li>\n<strong>Rule Detections</strong>: This number displays the number of events that triggered a detection rule during the selected date range.</li>\n<li>\n<strong>Users Involved</strong>: This number displays the number of mapped users that triggered a detection rule during the selected date range.</li>\n<li>\n<strong>Users with Multiple Rule Detections</strong>: This number displays the number of users that triggered two or more detection rules during the selected date range.</li>\n</ol>\n</li>\n<li>\n<strong>Top Detection Rules</strong>: This graph displays the number of users that had detections for your organization’s most detected rules during the selected date range. This graph will show up to ten detection rules.</li>\n<li>\n<strong>Top Users by Rule Detections</strong>: This table displays the number of rule detections that your organization’s riskiest users had during the selected date range. This table will show up to ten users.</li>\n</ol>\n<h2 id='h_01HGGBF9DE1CF6TVYVJBQVPAXJ'>Vendor Events Report</h2>\n<p>The <strong>Vendor Events Report</strong> displays the events from your integrated vendors that are linked to detection rules. You can use this information to ensure that you have real-time coaching campaigns set up for your most common events. To include more events in your report, visit the <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/7159083016723.html'>Creating a Custom Detection Rule</a> section of our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/7159083016723.html'>Detection Rules Guide</a> to create and link detection rules to the events.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>The <strong>Vendor Events Report</strong> includes only events from the last 30 days. If you had more than 10,000 events during that time, only the most recent 10,000 events will display.</div>\n</div>\n<p>To generate the report, select one or more vendors from the <strong>Vendor</strong> drop-down menu at the top-left corner of the report and then click <strong>Show Report</strong>. For more information about additional report filter options, see the screenshot and list below:</p>\n<div><img src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/Reports/VendorEventsReport/Filters_Annotated.png'></div>\n<div>\n<ol class='alpha' role='list'>\n<li>\n<strong>Vendor:</strong> Use this filter to select one or more vendors to display event data for.</li>\n<li>\n<strong>Date Range:</strong> Use this filter to select the date range to display data for.</li>\n<li>\n<strong>Detection Rules Status:</strong> Use this filter to display only events that have associated detection rules, or only events that do not have any associated detection rules.</li>\n<li>\n<strong>User Mapping Status:</strong> Use this filter to display either all events, only events that are mapped to a user, or only events that are not mapped to a user.</li>\n<li>\n<strong>Threat Category:</strong> Use this filter to select one or more vendor threat categories to display data for.<br><br>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>You must choose a vendor using the <strong>Vendor</strong> filter before you can select specific threat categories for that vendor.</div>\n</div>\n</li>\n<li>\n<strong>Threat Severity:</strong> Use this filter to select one or more vendor threat severities to display data for.<br><br>\n<div class='callout-note'>\n<div class='callout_content'>\n<strong>Note:</strong>You must choose a vendor using the <strong>Vendor</strong> filter before you can select specific threat severities for that vendor.</div>\n</div>\n</li>\n<li>\n<strong>Show Report:</strong> Use this button to save your filters and generate the new report data.</li>\n<li>\n<strong>Live View:</strong> Click this toggle to view the latest events detected by your integrated vendors.</li>\n</ol>\n</div>\n<p>Once you generate the report, the <strong>Event Field Summary</strong> displays a count of events for your selected <strong>Event Field</strong>. You can view events by <strong>Vendor</strong>, <strong>Threat Type</strong>, <strong>Threat Category</strong>, <strong>Threat Severity</strong>, or <strong>Event Source</strong>.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/vendor_evens_report_event_field_summary.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/vendor_evens_report_event_field_summary.png' alt=' '></a></div>\n<p>Below the <strong>Event Field Summary</strong>, you can view a table that displays information about each event. Click the <strong>Add or Remove Columns</strong> button to customize which columns display in the table.</p>\n<div><img src='https://helpimg.s3.us-east-1.amazonaws.com/security_coach/Reports/VendorEventsReport/Table_AddorRemoveColumns.png'></div>\n<p>To learn more information about each event, select the <strong>arrow</strong> icon.</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/VendorEvents-ArrowIcon.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/VendorEvents-ArrowIcon.png' alt=' '></a></div>\n<p>In the <strong>Risk Overview for Vendor Type</strong> section, you can view an overview of your organization's events related to endpoint security, email security, or web security. For more information about these reports, see the sections below.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>For a list of vendors by security type, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/12399973696659.html'>Vendor Security Types</a> article.</div>\n<div class='callout__content'></div>\n</div>\n<h2 id='h_01HGGBF9DDTGH8HC1M05E6ZAWQ'>Risk Report for Endpoint Security Vendors</h2>\n<p>The <strong>Risk Report for Endpoint Security Vendors</strong> provides an overview of your organization’s events related to endpoint security.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>This report will only include events from your organization’s integrated vendors. To learn more about integrating endpoint security vendors, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/6654432814355.html' target='_self'>SecurityCoach Product Manual</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/12399973696659.html'>Vendor Security Types</a> article.</div>\n</div>\n<p>To learn more about the data in this report, see below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/endpoint_security_risk_report.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/endpoint_security_risk_report.png' alt=' '></a></div>\n<ol role='list'>\n<li>\n<strong>Endpoint Risk Overview</strong>: This section provides information about your organization’s events related to endpoint security.\n<ol role='list' type='a'>\n<li>\n<strong>Total Users with Events</strong>: This number displays the total number of users with at least one endpoint event.</li>\n<li>\n<strong>Total Events</strong>: This number displays the total number of endpoint events.</li>\n<li>\n<strong>Threat Categories Found</strong>: This number displays the total number of threat categories for your endpoint events.</li>\n<li>\n<strong>Average Number of Threats per User</strong>: This number displays the average number of threat categories per user.</li>\n</ol>\n</li>\n<li>\n<strong>Endpoint Threat Categories</strong>: This chart displays the threat categories for your endpoint events. You can also view the event count and users involved for each threat category.</li>\n<li>\n<strong>Users with Endpoint Events</strong>: This graph displays the number of users that had one endpoint event, more than one endpoint event, and more than five endpoint events.</li>\n<li>\n<strong>Endpoint Events Over Time</strong>: This graph displays the change in the number of endpoint events and the number of users involved during the selected date range.</li>\n<li>\n<strong>Endpoint Threat Distribution</strong>: This chart displays the percentage of endpoint events that a selected percentage of users are responsible for. For example, if you select <strong>5%</strong>, the chart will display the percentage of your organization’s endpoint events that the top five percent of your riskiest users are responsible for.</li>\n<li>\n<strong>Endpoint Threat Severity</strong>: This chart displays the breakdown of threat severities for your endpoint events.</li>\n<li>\n<strong>Endpoint Operating System (OS) Distribution</strong>: This table displays each operating system (OS) that had an endpoint event. You can also view the computer count for each OS.</li>\n</ol>\n<h2 id='h_01HGGBF9DE9RP4KXBHR1ZJWTYM'>Risk Report for Email Security Vendors</h2>\n<p>The <strong>Risk Report for Email Security Vendors</strong> provides an overview of your organization’s events related to email security.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>This report will only include events from your organization’s integrated vendors. To learn more about integrating email security vendors, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/6654432814355.html' target='_self'>SecurityCoach Product Manual</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/12399973696659.html'>Vendor Security Types</a> article.</div>\n</div>\n<p>To learn more about the data in this report, see below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/email_security_risk_report.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/email_security_risk_report.png' alt=' '></a></div>\n<ol role='list'>\n<li>\n<strong>Email Risk Overview</strong>: This section provides information about your organization’s events related to email security.\n<ol role='list' type='a'>\n<li>\n<strong>Total Users with Events</strong>: This number displays the total number of users with at least one email event.</li>\n<li>\n<strong>Total Events</strong>: This number displays the total number of email events.</li>\n<li>\n<strong>Threat Categories Found</strong>: This number displays the total number of threat categories for your email events.</li>\n<li>\n<strong>Average Number of Threats per User</strong>: This number displays the average number of threat categories per user.</li>\n</ol>\n</li>\n<li>\n<strong>Email Threat Categories</strong>: This chart displays the threat categories for your email events. You can also view the event count and users involved for each threat category.</li>\n<li>\n<strong>Users with Email Threat Events</strong>: This graph displays the number of users that had one email event, more than one email event, and more than five email events.</li>\n<li>\n<strong>Email Threat Count</strong>: This graph displays the number of email events during the selected date range.</li>\n<li>\n<strong>Email Threats Distribution</strong>: This chart displays the percentage of email events that a selected percentage of users are responsible for. For example, if you select <strong>5%</strong>, the chart will display the percentage of your organization’s email events that the top five percent of your riskiest users are responsible for.</li>\n</ol>\n<h2 id='h_01HGGBF9DEVGK1JYKZFEF15718'>Risk Report for Web Security Vendors</h2>\n<p>The <strong>Risk Report for Web Security Vendors</strong> provides an overview of your organization’s events related to web security.</p>\n<div class='callout-note'>\n<div class='callout__content'>\n<strong>Note:</strong>This report will only include events from your organization’s integrated vendors. To learn more about integrating web security vendors, see our <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/6654432814355.html' target='_self'>SecurityCoach Product Manual</a> and <a href='https://Criscras13.github.io/KB_Transformer/api/v2/help_center/en-us/articles/12399973696659.html'>Vendor Security Types</a> article.</div>\n</div>\n<p>To learn more about the data in this report, see below:</p>\n<div><a data-fancybox='single' data-src='https://helpimg.s3.amazonaws.com/security_coach/web_security_risk_report.png'><img src='https://helpimg.s3.amazonaws.com/security_coach/web_security_risk_report.png' alt=' '></a></div>\n<ol role='list'>\n<li>\n<strong>Web Risk Overview</strong>: This section provides information about your organization’s events related to web security.\n<ol role='list' type='a'>\n<li>\n<strong>Total Users with Events</strong>: This number displays the total number of users with at least one web event.</li>\n<li>\n<strong>Total Events</strong>: This number displays the total number of web events.</li>\n<li>\n<strong>Threat Categories Found</strong>: This number displays the total number of threat categories for your web events.</li>\n<li>\n<strong>Average Number of Threats per User</strong>: This number displays the average number of threat categories per user.</li>\n</ol>\n</li>\n<li>\n<strong>Web Threat Categories</strong>: This chart displays the threat categories for your web events. You can also view the event count and users involved for each threat category.</li>\n<li>\n<strong>Users with Web Events</strong>: This graph displays the number of users that had one web event, more than one web event, and more than five web events.</li>\n<li>\n<strong>Web Events Over Time</strong>: This graph displays the change in the number of web events and the number of users involved during the selected date range.</li>\n<li>\n<strong>Web Threat Distribution</strong>: This chart displays the percentage of web events that a selected percentage of users are responsible for. For example, if you select <strong>5%</strong>, the chart will display the percentage of your organization’s web events that the top five percent of your riskiest users are responsible for.</li>\n</ol>",
    "user_segment_ids": [],
    "source_url": "https://support.knowbe4.com/hc/en-us/articles/7159155080851-SecurityCoach-Reporting-Overview"
  }
}